<html>
<body background="../../images/fondtexte4.jpg">
<a name="a"></a>
<table>
<tr>
<td>

</td>
<td>
<font color="purple"><font size=5 face="helvetica"><a href="entetelozere.html"target="description"><b>Pr&eacute;sentation de la Loz&egrave;re</a> (48)</font><br>

</td>
</tr>
</table>
<hr>
<br>



<a name="eco"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Economie</font></font><font size=1 face="helvetica"> ( <A HREF="geolozere.html">G&eacute;ographie</font></a><font size=1 face="helvetica"> - <font size=1 face="helvetica"> <A HREF="histoirelozere.html">Histoire</font></a> <font size=1 face="helvetica"> - Produits locaux</font><font size=1 face="helvetica"> - Enfants du pays)</font></a></STRONG><BR>
</font>
<br>
La Loz&egrave;re est l'un des d&eacute;partements de France &agrave; faible &eacute;conomie :<br>
 Agriculture difficile, essentiellement caract&eacute;ris&eacute;e par l'&eacute;levage et l'exploitation des for&ecirc;ts gr&acirc;ce &agrave; l'effort de reboisement accompli au 19&egrave;me par Georges Fabre; carri&egrave;res de granit, de calcaire, d'arkose, de basalte. La vocation touristique de la Loz&egrave;re reste son meilleur atout &eacute;conomique, tout en lui permettant de conserver son caract&egrave;re (sites innombrables, territoire pour randonn&eacute;es &eacute;questres et p&eacute;destres, ski de fond, chasse, p&ecirc;che, folklore, gastronomie, produits du terroir, artisanat cr&eacute;ateur, etc...).<br>
<br>
 Les m&eacute;galithes du d&eacute;partement t&eacute;moignent de l'importance de la civilisation pr&eacute;historique. L'&eacute;poque gallo-romaine est repr&eacute;sent&eacute;e par la poterie de Banassac et les fouilles de Javols, l'antique cit&eacute; d'Anderitum puis de Gabalum. L'architecture romane, caract&eacute;ris&eacute;e par des clochers peigne, a laiss&eacute; des sanctuaires ruraux qui diff&eacute;rent selon le mat&eacute;riau utilis&eacute; et s'int&egrave;grent harmonieusement au paysage environnant. Dans le sud du d&eacute;partement, les &eacute;glises sont d'influence languedocienne, voire proven&ccedil;ale. Dans le nord, l'influence auvergnate a donn&eacute; naissance &agrave; de sobres petits &eacute;difices peu orn&eacute;s, surmont&eacute;s d'un clocher octogonal. Dans le G&eacute;vaudan central, les deux influences se sont m&ecirc;l&eacute;es. L'art gothique est bien repr&eacute;sent&eacute; par la cath&eacute;drale de Mende, par les remaniements apport&eacute;s &agrave; d'anciens &eacute;difices (belles croix de cimeti&egrave;re ou de chemin). L'architecture f&eacute;odale ne nous a laiss&eacute; que des ruines grandioses, &eacute;tablies dans des sites de d&eacute;fense ou de surveillance. Les 15&egrave;me et 16&egrave;me, p&eacute;riode d'apog&eacute;e, ont 
produit un grand nombre de ch&acirc;teaux. Le ch&acirc;teau de La Beaume, &agrave; Prinsu&eacute;jols, remani&eacute; au 18&egrave;me, demeure le type parfait de la demeure classique en G&eacute;vaudan. Les cit&eacute;s pittoresques sont nombreuses; le village de la Garde-Gu&eacute;rin a pu conserver intacts les &eacute;l&eacute;ments de son architecture (12&egrave;me et 13&egrave;me si&egrave;cle). De vieux ponts contrastent avec les remarquables ouvrages d'art modernes.<br> 
<br><br>

<A HREF="#a"<font color="#FF0000">haut de page</font> </A>

</body>
</html>

