<html>
<body background="../../images/fondtexte4.jpg">
<a name="a"></a>
<table>
<tr>
<td>

</td>
<td>
<font color="purple"><font size=5 face="helvetica"><a href="entetelozere.html"target="description"><b>Pr&eacute;sentation de la Loz&egrave;re</a> (48)</font><br>

</td>
</tr>
</table>
<hr>
<br>


<a name="geo"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">G&eacute;ographie</font></font><font size=1 face="helvetica"> ( <A HREF="ecolozere.html">Economie</font></a> <font size=1 face="helvetica"> - <A HREF="histoirelozere.html">Histoire</font></a><font size=1 face="helvetica"> - Produits locaux</font><font size=1 face="helvetica"> - Enfants du pays)</font></a></STRONG><BR>
</font>
<br>
 La Loz&egrave;re se compose de plusieurs zones distinctes selon la nature du sol et le relief Au nord et &agrave; l'est, une vaste r&eacute;gion cristalline, form&eacute;e de terrains anciens au relief &eacute;rod&eacute;, est domin&eacute;e par deux cha&icirc;nes de montagnes: la Margeride (au nord), un des plus grands massifs granitiques d'Europe, est une zone de hauts plateaux de p&acirc;turages d&eacute;passant 1 000 m, entaill&eacute;s de vall&eacute;es profondes et culminant au signal de Randon (1 554 m); les C&eacute;vennes (au sud-est) comportent deux massifs granitiques : le mont Loz&egrave;re (1 699 m au pic Finiels) et l'Aigoual (1 565 m), entre lesquels s'&eacute;tend une suite de serres, cr&ecirc;tes schisteuses aigu&euml;s s&eacute;par&eacute;es par des vall&eacute;es encaiss&eacute;es. A l'ouest du d&eacute;partement, les monts d'Aubrac constituent un ensemble volcanique form&eacute; d'&eacute;paisses coul&eacute;es de basalte recouvrant un socle cristallin; le signal de Malhebiau culmine &agrave; 1 471 m. Au sud-ouest, les d&eacute;p&ocirc;ts s&eacute;dimentaires fa&ccedil;onn&eacute;s par l'&eacute;rosion ont donn&eacute; naissance aux causses, hauts plateaux calcaires d&eacute;nud&eacute;s et arides, perc&eacute;s d'avens et de 
grottes. Les rivi&egrave;res y ont taill&eacute; d'imposants canyons, dont la profondeur peut atteindre 500 m. Le r&eacute;seau hydrographique fait de la Loz&egrave;re un ch&acirc;teau d'eau : par le Luech et les Gardon, elle envoie ses eaux au Rh&ocirc;ne, par l'Allier &agrave; la Loire, par le Lot, le Tarn et la Truy&egrave;re &agrave; la Garonne. Le climat rude et continental conna&icirc;t des hivers froids et des &eacute;t&eacute;s chauds; en revanche, la Loz&egrave;re c&eacute;venole est temp&eacute;r&eacute;e par l'influence du climat m&eacute;diterran&eacute;en.<br>


<br><br>

<A HREF="#a"<font color="#FF0000">haut de page</font> </A>

</body>
</html>

