<html>
<body background="../../images/fondtexte4.jpg">
<a name="a"></a>
<table>
<tr>
<td>

</td>
<td>
<font color="purple"><font size=5 face="helvetica"><a href="entetelozere.html"target="description"><b>Pr&eacute;sentation de la Loz&egrave;re</a> (48)</font><br>

</td>
</tr>
</table>
<hr>
<br>



<a name="his"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Histoire</font></font><font size=1 face="helvetica"> ( <A HREF="geolozere.html">G&eacute;ographie</font></a><font size=1 face="helvetica"> - <A HREF="ecolozere.html">Economie</font></a><font size=1 face="helvetica"> - Produits locaux</font><font size=1 face="helvetica"> - Enfants du pays)</font></STRONG><BR>
</font>
<br>
 Les premi&egrave;res traces de peuplement remontent &agrave; l'&eacute;poque n&eacute;olithique, les grottes des causses fournissant &agrave; l'homme des conditions favorables d'existence. Peupl&eacute; par la tribu celte des Gabales, le territoire actuel du d&eacute;partement formait le Pagus Gabalicus, sous l'autorit&eacute; des Arvernes, avant de devenir la Civitas Gabalorum, sous la domination romaine. L'&eacute;vang&eacute;lisation fut marqu&eacute;e par le martyre de saint Privat. Au 4&egrave;me, il est fait mention d'une &eacute;glise des Gabales, et le pays connut un essor monastique aux 5&egrave;me et 6&egrave;me. Sous les M&eacute;rovingiens, on vit se dessiner le comt&eacute; de G&eacute;vaudan, relevant du comt&eacute; de Toulouse jusqu'au 12&egrave;me. A cette &eacute;poque, l'&eacute;v&ecirc;que de Mende prit le titre de comte et le garda jusqu'&agrave; la R&eacute;volution. Jusqu'au 13&egrave;me, le pays fut administr&eacute; par des vicomtes h&eacute;r&eacute;ditaires, v&eacute;ritables suzerains du G&eacute;vaudan. A la suite de la croisade des Albigeois, Louis VIII profita d'un diff&eacute;rend entre le comte de Toulouse, le roi d'Aragon et l'&eacute;v&ecirc;que de Mende, pour s'approprier le G&eacute;vaudan. En 1307, un acte 
de par&eacute;age entre l'&eacute;v&ecirc;que et le roi de France fixa leurs droits respectifs et mit fin aux querelles d'autorit&eacute;. Le pays fut incorpor&eacute; par la suite au Languedoc et souffrit des guerres de Religion aux 16&egrave;me et 17&egrave;me. Le d&eacute;but du 18&egrave;me. fut marqu&eacute; par la guerre des camisards, protestants c&eacute;venols luttant pour leur libert&eacute; religieuse: il fallut une intervention des troupes royales pour en venir &agrave; bout. Au 18&egrave;me, la b&ecirc;te du G&eacute;vaudan, gigantesque loup-cervier, r&eacute;pandit la terreur dans le pays et fut &agrave; l'origine d'un grand nombre de contes et l&eacute;gendes. Au cours de la Seconde Guerre mondiale, les maquisards de la Loz&egrave;re jou&egrave;rent un r&ocirc;le important dans la R&eacute;sistance.<br>
<br><br>

<A HREF="#a"<font color="#FF0000">haut de page</font> </A>

</body>
</html>

