<html>
<body  background="../../fondtexte2.jpg">
<a href="48villesetcodepostaux.html#s"target="description"><font color="brown">Saint-Georges-de-L&eacute;v&eacute;jac</font></a>  
<pre>
<hr>
D&eacute;partement : <a href="lozere.html"Target="texte">Loz&egrave;re </a>      R&eacute;gion : <a href="../languedocroussillon.html"Target="texte">Languedoc-Roussillon</a>



Code Postal : 48 500

  Habitants : 244
 Superficie : 5 626 Ha

    Plus... : 
<hr>

&nbsp; &nbsp; &nbsp; St Georges est un pays d'avens et de dolmens. Le peuplement est tr&egrave;s ancien, il remonte &agrave; la pr&egrave;histoire, comme en t&eacute;moignent les dolmens et les nombreuses grottes habit&eacute;es.
&nbsp; &nbsp; &nbsp; &Agrave; la fin du XIX&egrave;me si&egrave;cle, la caverne pr&eacute;historique de &laquo;Baumes-Chaudes&raquo; dans la falaise situ&eacute;e sous le Point-Sublime sera explor&eacute;e. L&agrave;, le Dr Pruni&egrave;res(1829-1893) trouva pr&egrave;s de 300 squelettes datant de l'&acirc;ge du bronze.
&nbsp; &nbsp; &nbsp; 
 &nbsp; &nbsp; &nbsp; Des Vestiges du n&eacute;olithique ont &eacute;galement &eacute;t&eacute; d&eacute;couverts aux villages de la Calcidouze, de Cassaduc et de CLAPAS CASTEL.
&nbsp;
&nbsp;&nbsp; &nbsp; &nbsp; Plus r&eacute;cemment, on trouve des traces du passage des Sarrazins dans notre r&eacute;gion, avec des fermes construites en style aragonais, comme aux Monziols ou &agrave; Soulages.
&nbsp;
 &nbsp;


St Georges de L&eacute;v&eacute;jac / son Nom :

 &nbsp; &nbsp; &nbsp; Son nom ancien &eacute;tait &laquo; Sanctus Georgins de Lebeyco &raquo; ou &laquo; de Lob&eacute;riaco&raquo; La commune doit son nom au ch&acirc;teau baronial qui se dressait, si nous en croyons des &eacute;crits anciens, entre les ravins de St Hilaire et des Issartels(ravin des Isards ou chamois), sur un massif abrupt dominant la ferme des Baumes-Basses.
&nbsp; &nbsp; &nbsp; Les formes &eacute;lanc&eacute;es de ce ch&acirc;teau en ce site &eacute;lev&eacute; lui valurent l'appellation latine de &laquo; Levis Acus Del Mancio&raquo;.
&nbsp; &nbsp; &nbsp; Son histoire est pratiquement inconnue. On sait seulement que c'&eacute;tait un fief de la puissante maison du Seigneur de S&eacute;verac dont on retrouve de nombreux actes de reconnaissance f&eacute;odale dans les ann&eacute;es 1100 &agrave; 1300. Au XVI&egrave;me si&egrave;cle, ce ch&acirc;teau fut ruin&eacute; au cours des guerres de religion.
&nbsp;


St Georges de L&eacute;v&eacute;jac / Ses origines :

&nbsp; &nbsp; &nbsp; Dans les premiers temps du christianisme, &agrave; l'&eacute;poque Gallo-Romaine, les habitants fortement impr&eacute;gn&eacute;s de paganisme et de superstitions vivaient uniquement de la p&ecirc;che et de la chasse. Ils habitaient les grottes et les cavernes de la vall&eacute;e et des pentes du Tarn.
&nbsp; &nbsp; &nbsp; Le Cirque des Baumes &eacute;tait un centre tr&egrave;s populeux. Au VI&egrave;me si&egrave;cle, St Hilaire, &eacute;v&ecirc;que de Mende, vint &eacute;vang&eacute;liser le pays et fit &eacute;riger un oratoire &agrave; St-Pierre, &agrave; l'emplacement des Baumes, o&ugrave; se trouve actuellement la maison Castan.
&nbsp;
 &nbsp; &nbsp; &nbsp; Au XI&egrave;me si&egrave;cle, l'oratoire de St-Pierre fut remplac&eacute; par une &eacute;glise romane qui desservait non seulement les habitants de la vall&eacute;e mais aussi ceux du plateau jusqu'&agrave; la Pigui&egrave;re (15 km), qui venaient enterrer leurs morts au cimeti&egrave;re de St Pierre. Des tombeaux de pierres dall&eacute;es y ont &eacute;t&eacute; d&eacute;couverts au d&eacute;but du si&egrave;cle dernier.
&nbsp; &nbsp; &nbsp; Un oratoire d&eacute;di&eacute; &agrave; St Georges fut cependant &eacute;tabli sur le Causse, pour les besoins religieux des rares habitants du plateau. Il fut, jusqu'au XIII&egrave;me si&egrave;cle, une simple d&eacute;pendance de l'&eacute;glise de ST-Pierre. Mais peu &agrave; peu les r&ocirc;les s'invers&egrave;rent : les habitants quitt&egrave;rent peu &agrave; peu la vall&eacute;e pour venir vivre sur le plateau o&ugrave; les cultures &eacute;taient plus faciles. De ce fait, l'&eacute;glise de St Georges devint plus importante. Celle de St-Pierre ne fut plus qu'une annexe de St georges, &agrave; laquelle elle fut rattach&eacute;e d&eacute;finitivement aux alentours de l'ann&eacute;e 1700. L'&eacute;glise de St Pierre, oeuvre des b&eacute;n&eacute;dictins du Rozier, fut d&eacute;molie en 1866, pour construire sur son emplacement la maison Castan.
&nbsp;
&nbsp; &nbsp; &nbsp; L'&eacute;glise de St-Georges &eacute;tait prosp&egrave;re. Elle forma un prieur&eacute; simple, faisant partie du patrimoine des moines de La Canourgue. En 1405 elle fut unie au clerg&eacute; de Mende.
&nbsp; &nbsp; &nbsp; Au XIX&egrave;me si&egrave;cle St Georges &eacute;tait un des endroits les plus peupl&eacute;s et les plus prosp&egrave;res du Causse: notamment les villages de Soulages et des Fonts. Soulages poss&eacute;dait sa propre chapelle. Au nord-est de Serres se trouvait l'ancien village de Pousprat, disparu vers 1530.
&nbsp;

<b>F&ecirc;te locale :</b> la St Acasse a lieu au mois d'octobre !

<a name="lacroze"</a>  &nbsp;
&nbsp;
<table>
<tr>
<td>              
<a href="saintgeorgesdelevejacjpg.html"><img src="images/saintgeorgesdelevejac.jpg" alt="Photo de " width="142" height="81" border=0>
</td>
<td>
<b>La Croze :</b><br>
Un village de r&eacute;sidences secondaires,accessible en barque (blotti entre la falaise du Causse M&eacute;jean et le Tarn) et qui ne vit que l'&eacute;t&eacute;...

&nbsp;
&nbsp;
</td>
</tr>
</table>  
</pre>

</body>
</html>