<html>
<body background="../../images/fondtexte2.jpg"  border="0">
<a href="42villesetcodepostaux.html#b"target="description"><font color="brown">Bellegarde-en-forez</font></a>         (Altitude : de 361 &agrave; 606 m)
<pre>
<hr>
D&eacute;partement : <a href="enteteloire.html"Target="description">Loire </a>          R&eacute;gion :  <a href="../enteterhonealpes.html"Target="description">Rh&ocirc;ne-Alpes</a>

Code Postal : 42 210

  Habitants : 1 486 Bellegardois (en 1999) 
 Superficie : 18,91 km2

  Situation : &agrave; 29 Km <a href="saintetienne.html"Target="description">Saint-&eacute;tienne</a> , 63 Km Lyon

    Plus... : sa discoth&egrave;que, son sentier botanique

<hr>
</pre>
<b>Son ch&acirc;teau :</b> (propri&eacute;t&eacute; priv&eacute;)<br>
<br>
Sur une petite porte donnant acc&egrave;s au ch&acirc;teau,on peut lire l'inscription:
" Celui que Dieu garde est en Belle-Garde "<br>
<a name="a"</a>
<table>

<tr>
<td>
<a href="chateau1bellegardejpg.html"><img src="images/chateau1bellegarde.jpg" target="description" alt="" width="150" height="112" border=0</a><br>
</td>

<td>
 Les remparts qui entourait la ville sont d&eacute;truits,mais on peut toujours admirer son ch&acirc;teau surplombant le Val d'Anzieux,il a &eacute;t&eacute; construit en 1173 puis , reconstruit entre 1810 et 1820 (suite au passage de Claude Javogues qui multiplia les attaques contre la noblesse locale et les partisans du roi...)<br>
<td>
<a href="chateau2bellegardejpg.html"><img src="images/chateau2bellegarde.jpg" target="description" alt="" width="123" height="111" border=0</a><br>
</td>
</tr>

<tr>
<td>
<img src="images/javogues.jpg"><br>
</td>
<td>

Claude Javogues (n&eacute; &agrave; Belle-Garde en 1759 &eacute;tait un membre influent de la Convention). <br>
</td>
</tr>
</table>

Le ch&acirc;teau appartenait aux Comtes du Forez puis, apr&egrave;s la mort de renaud du forez,il revient au comt&eacute;.<br>
 1521 Guillaume de Bron seigneur de la ligue l'ach&egrave;te &agrave; Anne de beaujeu et &agrave; son gendre le duc Charles III<br>
 1680 la famille de l'actuel propri&eacute;taire,Monsieur de Sorbier de Pougnadoresse l'ach&egrave;te au comte de Bron.<br>
<a name="c"</a>
<table>
<tr>

<td>
<a href="portebaudinjpg.html"><img src="images/portebaudin.jpg" target="description" alt="Photo de Gilles Mathevet"  width="84" height="112" border=0</a><br>
</td>
<td>
Au XIII&egrave;me si&egrave;cle, la ville de Belle-Garde &eacute;tait fortifi&eacute;, sa garnison &eacute;tait charg&eacute;e de surveiller le d&eacute;fil&eacute; et de faire payer le droit de passage.On peut encore admirer la porte Baudin &agrave; l'est,vestige du p&eacute;age de l'ancienne route de Lyon.<br><br><br><br>
</td>
<br>

<a href="bellegardeenforezjpg.html"><img src="images/bellegardeenforez.jpg" target="description" alt="Photo de la plaine du Forez vue du ch&acirc;teau" width="150" height="112" border=0</a><br>

 </td>
<td>


Au ch&acirc;teau, vue sur la plaine du forez !<br> 
</td>
</tr>

</table>
<br><br>
<b>La chapelle St Pierre de Montmeyn</b> (altitude : 546 m)<br> 
(Montmeyn=medianus=milieu "mystique" en latin)<br>
<br>
<table>
<tr>
<td>
Les hommes du N&eacute;olitique venaient y c&eacute;l&eacute;brer le culte du soleil levant.Puis ces lieux furent christianis&eacute;s pour la d&eacute;votion &agrave; St Pierre<br>
<br>
C'est sans doute &agrave; cause de l'importance du p&egrave;lerinage que le hameau s'est construit, car il n'y avait pas d'eau potable &agrave; cet endroit.Il fut fr&eacute;quent&eacute; pour le b&eacute;tail et les fruits de la terre signe d'un tr&egrave;s ancien culte de la f&eacute;condit&eacute;.<br>
<br>
La chapelle construite ou reconstruite ?... par Renaud de Montrond &agrave; son retour de croisade comporte une table de communion datant de 1615.Pourtant, le vieil autel n'&eacute;tant pas dans l'axe de la nef actuelle, il devait exister avant que l'on construise cette nef. La pierre du vieil autel a &eacute;t&eacute; entam&eacute;e et coiff&eacute;e d'un b&acirc;ti en bois pour que son axe soit en face de la nouvelle nef.<br>
<br>
Certains disent que le f&ucirc;t de colonne qui sert de b&eacute;nitier &agrave; l'ext&eacute;rieur de la chapelle serait une borne militaire d'une voie romaine.<br>
D'autres pensent que se serait plut&ocirc;t le vestige d'un monument gallo-romain, ou d'un petit sanctuaire pa&iuml;en<br>
D'apr&egrave;s le cadastre,la parcelle de la chapelle a une curieuse forme en demi-cercle qui ne correspond &agrave; rien sur le terrain actuellement.Il devait y avoir un cercle de pierres, un " Korn " comme dans tous les lieux n&eacute;olitiques.<br>
<br>
Jusqu'&agrave; la r&eacute;volution , la chapelle n'appartenait ni au dioc&egrave;se, ni au monast&egrave;re, ni &agrave; un particulier,elle semble n'avoir eu aucun propri&eacute;taire.<br>
</td>
<td>
<a href="chapelle1bellegardejpg.html"><img src="images/chapelle1bellegarde.jpg" target="description" alt=""  width="163" height="111" border=0</a><br>


<a href="chapelle2bellegardejpg.html"><img src="images/chapelle2bellegarde.jpg" target="description" alt=""  width="75" height="112" border=0</a><br>
 
</td>
</tr>
</table> 
 
<br><br>


<b>Son sentier botanique</b><br>
<br>
Le sentier botanique de st pierre courre en boucle sur 3 km contournant la colline de la poix.
Les bois h&eacute;bergent de nombreux h&ocirc;tes, martres des pins, li&egrave;vres, lapins, renards, h&eacute;rissons, &eacute;cureuils, sanglier, chevreuils, pic-&eacute;peiche 
pic-vert, pic noir ...<br>

<br><br>


<b>Sa carri&egrave;re</b><br>

<br>
<table>
<tr>
<td>
<a href="carrierebellegardejpg.html"><img src="images/carrierebellegarde.jpg" target="description" alt="" width="163" height="111" border=0</a><br>
</td>
<td>
La carri&egrave;re bellegardoise extrait des pierres depuis 1936.<br>
L'extraction manuelle (&agrave; la masse) laissa place au tirs de mines et au concasseurs.<br>
 1968 un accident d&ucirc; &agrave; un tir de mine d&eacute;truisit une partie des installations et sonna l'arr&ecirc;t des activit&eacute;s.<br>
 1970 Rachat par les familles DELAGE et MONIN qui g&egrave;re encore aujourd'hui la soci&eacute;t&eacute;.<br>
<br>
On y trouve 4 sortes de pierres : le microgranite blanc,la diorite marron, la leptynite gris clair et l'amphibolite gris sombre<br>
</td>
</tr>
</table>
</body>
</html>