<html>
<body background="../images/fondtexte2.jpg">
<a name="a"></a>

<table>
<tr>
<td>

</td>
<td>
<font color="purple"><font size=5 face="helvetica"><a href="entetealsace.html"target="description"><b>Pr&eacute;sentation de l'Alsace</b></a> </font>
</td>
</tr>
</table>

<HR>

<a name="his"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Histoire</font><font size=1 face="helvetica"> ( <A HREF="geoalsace.html">G&eacute;ographie</font></a><font size=1 face="helvetica"> - <A HREF="ecoalsace.html">Economie</font></a><font size=1 face="helvetica"> - Produits locaux</font><font size=1 face="helvetica"> - Enfants du pays)</font></STRONG><BR>
</font>

<br>
- Vers le 5&egrave;me si&egrave;cle avant JC : les celtes venues du Danube civilisent la plaine d Alsace &eacute;difiant l'oppidum du Britzgiberg et le Mur Pa&iuml;en du Mont Sainte Odile.<br>
<br>

- Les S&eacute;quanes remplacent les Celtes, mais menac&eacute;s par les Eduens de Bourgogne, ils font appel aux Su&egrave;ves d Arioviste qui s installent &agrave; leur tour dans la plaine d Alsace.<br>
<br>
- En 58 avant JC : Jules C&eacute;sar se porte au secours de ses alli&eacute;s et bat Arioviste &agrave; la bataille d'Ochsenfeld.<br>
<br>
- Rome prot&egrave;ge la fronti&egrave;re par des camps militaires install&eacute;s le long du Rhin.<br>
<br>

- En 166 : Les invasions des vandales et des Alamans causent la ruine du pays !<br>
<br>
- 352 : les Alamans occupent toute la plaine (ils constitueront le fonds de la population alsacienne).<br>
<br>
- L'Alsace fait partie de l'empire Franc<br>
<br> 
- 843 : Le trait&eacute; de Verdun s&eacute;pare l'Alsace de l'empire de Charlemagne c'est Lothaire Ier qui en h&eacute;ritera.<br>

<br>


- 870 : Apr&egrave;s la mort de Lothaire II, le trait&eacute; de Mersen c&egrave;de l Alsace &agrave; Louis le germanique.<br>
<br>

- 1648 : Au trait&eacute; de M&uuml;nster en 1648 l'empereur germanique abandonne &agrave; la France le Landgraviat de haute et basse Alsace et les dix villes imp&eacute;riales.<br>
<br>
 
- 1798 : L'Alsace s'agrandit par le rattachement de Mulhouse !<br>
<br>
 Le pr&eacute;fet Leray d&eacute;veloppe l'industrie et l'agriculture.<br>
<br>
- 1801 : Le concordat ram&egrave;ne la paix religieuse.<br>
<br><br>

<A HREF="#a"<font color="#FF0000">haut de page</font> </A>

</body>
</html>