@DATABASE opium.newmail.ru:666/26s.htm
@WORDWRAP

@NODE MAIN
@TITLE " Ave Satanas..."
 
   @{" " link "25s.guide/MAIN"}@{"../pau.gif" link "../pau.gif/MAIN"}
Назад    Черная Библия Приложение    @{" " link "27s.guide/MAIN"}@{"../pau0.gif" link "../pau0.gif/MAIN"}
Дальше 

Девять Сатанинских Грехов 


&nbsp;В течении многих лет люди спрашивали представителей Церкви Сатаны: "Хорошо, ваша философия основана на потворстве человеческим инстинктам, но есть ли у вас, как и у других религий, грехи?" Наш ответ неизменно был отрицательным. Но пришло время изменить его. В течении последних двадцати с лишним лет мы постоянно росли и нашли, что более ясные цели и направления должны быть определены не только в отношении того, к чему мы стремимся, но и того, чего мы стараемся избегать, с чем не согласны. Разница между Сатанизмом и другими религиями состоит в том, что другие религии изобретают грехи, которых нельзя избежать, мы же считаем, что при некоторых усилиях люди могут не совершать всего, что рассматривается нами как "грехи". 
   - Глупость. Возглавляет список Сатанинских грехов. Кардинальный грех Сатанизма. Плохо, что глупость не вызывает болевых ощущений. Невежество - одно дело, но наше общество все в большей степени процветает на глупости. Оно полагается на людей, которые соглашаются со всем, что им скажут. Средства массовой информации культивируют глупость в качестве позиции, которая не только приемлема, но и похвальна. Сатанист должен научиться распознавать эти трюки и не позволять себе быть глупым. 
   - Претенциозность. Пустое позерство, наверное, самый раздражающий из всех грехов. Человек, воплощающий его, просто не исповедует основные правила Малой магин. Вместе с глупостью претенциозность движет в настоящее время денежным оборотом. В наши дни все пытаются выглядеть большими шишками, есть ли у них на то основания или нет. 
   - Солипсизм. Может быть весьма опасным для Сатаниста. Перенесение своих реакций, эмоций и чувств на тех, чье развитие не соответствует вашему. Ошибочно ожидать от людей такого же внимания, вежливости и уважения, с каким вы относитесь к ним. Бесполезно, Вместо этого Сатанист должен применять на практике лозунг "Воздай другим то, что воздали тебе они." Это требует усилий и постоянной бдительности, иначе легко поддаться утешительной иллюзии, что все такие же, как вы. Как говорится, некоторые утопии были бы идеальными в стране философов, но к несчастью (или к счастью, с маккнавелианской точки зрения) мы далеки от этого. 
   - Самообман. Этот грех рассмотрен в Сатанинских заповедях, но заслуживает быть повторенным здесь, поскольку также является кардинальным грехом. Мы не должны платить дань навязываемым нам священным коровам, включая роли, которые, как ожидается, мы должны сыграть. Единственно допустимый самообман - осознанный самообман потехи ради. Однако, это уже не самообман! 
   - Стадное соглашательство. С Сатанинской точки зрения очевидно, что нет ничего плохого согласиться с желаниями другого человека, если в итоге от этого выигрываете вы. Но лишь глупцы следуют со стадом, давая обезличенному существу диктовать вам свою волю. Лучше осознанно выбрать себе хозяина, чем быть порабощенным капризами толпы. 
   - Отсутствие широты взглядов. Для Сатаниста оно может привести к весьма болезненным последствиям. Никогда нельзя терять из виду, кем и чем вы являетесь и какую угрозу можете представлять самим своим существованием. Мы творим историю сегодня и сейчас. Всегда держите в голове более широкую историческую и социальную картину. Это очень важно как для Большой, так и для Малой магии. Знайте, что вы работаете на другом уровне, нежели остальной мир. 
   - Забывчивость об ортодоксиях прошлого. Осознайте, что это один из самых успешных способов промывания мозгов людям, которые принимают за "новое" и "неординарное" то, что было известно давным-давно и подано в новой упаковке. От нас ожидают восхищения гением "творца" и забывчивости об оригинале. Это делает нас обществом перера отходов. 
   - Гордость, мешающая работе. Гордость сама по себе - неплохая вещь, но только до тех пределов, когда с мыльной водой не начинают выливать ребенка. Сатанинское правило на этот счет таково: Если это работает на вас, прекрасно. Когда же это перестает работать, когда вы загнаны в угол и единственный выход из ситуации - сказать: "Сожалею, я допустил ошибку, я хотел бы найти компромисс," нужно просто поступить так. 
   - 0тсутствие эстетического начала. Вещественное воплощение уравновешивающего фактора - очень важно для Малой магии и должно развиваться. Очевидно, что на этом трудно постоянно зарабатывать деньги, поэтому обществом потребления такое качество не поддерживается. Однако, оно является важнейшим магическим инструментом и должно применяться для эффективности магии. Эстетическое начало очень субъективное и отражает природу человека, но есть и универсальные категории, которые не следует отрицать. 

&nbsp;Это первая прокламация более чем за десятилетие и провозглашает некоторые важные правила Сатанинской практики. Следует отметить, что эта доктрина никоим образом не заменяет Девять Сатанинских Заповедей или Одиннадцать Сатанинских Правил На Земле, а имеет своей целью продолжить и развить вышеуказанные принципы. 

@{"i"}Антон Шандор ЛаВей
 XXII Аппо Satanas(1987 г. н.э.)@{"ui"} 
 ---

 ---

 ---

 ---

 ---

@endnode
