<html>
<body background="../../images/fondtexte2.jpg"  border="0">
<a href="92villesetcodepostaux.html#n"target="description"><font color="brown">Nanterre</font></a> (Altitude : 32 m) 
<pre>
<hr>
<a href="../../departements.html"Target="description">D&eacute;partement</a> : <a href="entetehautsdeseine.html"Target="description">Hauts-de-Seine</a>                 R&eacute;gion : <a href="../enteteiledefrance.html"Target="description">&Icirc;le de France</a>   
 
Code Postal : 92 000

  Habitants : 86 219 Nanterriens
 Superficie : 1 219 ha

  Situation : &agrave; 13 km Paris 

    Plus... : Th&eacute;&acirc;tre des Amandiers, Ecole de danse de l'Op&eacute;ra de Paris,
              Maison de la musique , conservatoire de musique et de danse,
              m&eacute;diath&egrave;que, biblioth&egrave;ques, cin&eacute;ma
              Universit&eacute; de Paris X, &eacute;cole d'architecture, centre de formation EDF,lyc&eacute;es,
              Association nationale pour la formation professionnelle des adultes (AFPA).

 <hr>                       
</pre>
<b>La Cath&eacute;drale Sainte-Genevi&egrave;ve :</b> (5&egrave;me si&egrave;cle reconstruite du 13&egrave;me au 20&egrave;me si&egrave;cle)<br>
<br><br> 
<b>Le Parc des Anciennes-Mairies :</b> (6 000 m2)<br>
<br>
Situ&eacute; en plein coeur de l'ancien centre de Nanterre, il accueille de nombreuses manifestations tout au long de l'ann&eacute;e (March&eacute; aux Fleurs, Brocante Musicale, F&ecirc;te des Associations...).<br>
<br><br> 
<b>Le Parc Andr&eacute; Malraux :</b> (25 hectares)<br>
<br>
Situ&eacute; aux pieds des Tours Aillaud (&agrave; quelques pas de la Grande Arche) le parc est anim&eacute; &agrave; toute heure de la journ&eacute;e...<br>



Une grande pi&egrave;ce d'eau de 2 hectares accueille les p&ecirc;cheurs et constitue l'un des points forts du Parc. Il regroupe &eacute;galement une collection de rosiers arbustes ou grimpants (+ de 50 vari&eacute;t&eacute;s). Un site d'escalade est &eacute;galement accessible !<br>
<br><br>
<br>
<b>HISTOIRE:</b><br>
<br>
 
Origine du nom :  celtiques « Nemeto-Dor &raquo;, qui sera latinis&eacute; en Nemetodurum puis Nemptodoro le nom sera francis&eacute; en Nantuerre et Nanturra au XII&egrave;m si&egrave;cle.<br>
<br>
N&eacute;olithique : la d&eacute;couverte d'outils de pierre atteste qu'une pr&eacute;sence humaine existait d&eacute;j&agrave; &agrave; cette &eacute;poque sur le site de Nanterre.<br> 
<br>


- 1247 : le roi Louis IX confirme l'affranchissement des serfs de Nanterre (avec l'accord de Thibaud, abb&eacute; de Saint Genevi&egrave;ve). Les affranchis demeurent sujets de l'abbaye et acquittent les redevances et corv&eacute;es ordinaires.<br>
<br>

- 15&egrave;me si&egrave;cle : Le puit miraculeux de sainte Genevi&egrave;ve (qui serait n&eacute;e &agrave; nanterre vers 426) fait l'objet de p&egrave;lerinages importants.<br>
 <br>
 

- Le 4 ao&ucirc;t 1789 : l'abolition des privil&egrave;ges d&eacute;livre les Nanterrois des droits seigneuriaux de l'abbaye.<br>
<br>
- Le 7 f&eacute;vrier 1790 : La premi&egrave;re municipalit&eacute; est &eacute;lue au suffrage censitaire et les biens des moines g&eacute;nov&eacute;fains sont vendus comme bien nationaux.<br>
<br>
- Le 9 thermidors : Arrestation de Robespierre (malgr&eacute; la vaine tentative de soul&egrave;vement des Parisiens par Fran&ccedil;ois Hanriot, g&eacute;n&eacute;ral commandant la Garde nationale de Paris.<br>
<br>
- Fran&ccedil;ois Hanriot (n&eacute; &agrave; Nanterre le 2 d&eacute;cembre 1759) est guillotin&eacute; le 10 thermidor (28 juillet 1794).<br>
 
<br>
- Le 24 ao&ucirc;t 1837 : Inauguration de la premi&egrave;re ligne de chemin de fer pour voyageurs (reliant Paris au Pecq).<br>
<br>
- 1841 : Une autre ligne de chemin de fer (reliant Paris &agrave; Rouen) traverse Nanterre.<br>
<br>

- Pendant la guerre de 1870 : les Nanterriens se r&eacute;fugient &agrave; Paris. Les canons de la forteresse du Mont-Val&eacute;rien &eacute;difi&eacute;e (en 1841) contiennent l'ennemi au-del&agrave; de la Seine. Nanterre est gravement endommag&eacute; par les &eacute;changes de tirs, puis par l'occupation et les r&eacute;quisitions des Prussiens.<br>
 <br>

- 1936-1937 : Les usines de Nanterre sont occup&eacute;es, les grandes gr&egrave;ves aboutissent &agrave; la conqu&ecirc;te d'importantes avanc&eacute;es sociales...<br>
<br> 

- 9 septembre 1939 : La guerre avec l'Allemagne est d&eacute;clar&eacute;e !<br> 
<br>
- Le 15 juin 1940 : Paris est occup&eacute;<br> 
<br>
-1964-1965 : L'universit&eacute; Paris-X s'installe dans ses nouveaux b&acirc;timents. C'est l&agrave; que na&icirc;tra la contestation &eacute;tudiante (rejointe par les revendications ouvri&egrave;res) de mai 1968.<br>
 
<br> 
  
- 1993 : Des fouilles arch&eacute;ologiques permettent de d&eacute;couvrir un ancien village gaulois.<br>
 
 


</body>
</html>

