<html>
<body background="../../images/fondtexte2.jpg"  border="0">
<a href="92villesetcodepostaux.html#n"target="description"><font color="brown">Neuilly-sur-Seine</font></a> (Altitude : 32 m)
<pre>
<hr>
<a href="../../departements.html"Target="description">D&eacute;partement</a> : <a href="entetehautsdeseine.html"Target="description">Hauts-de-Seine</a>                 R&eacute;gion : <a href="../enteteiledefrance.html"Target="description">&Icirc;le de France</a>   
 
Code Postal : 92 200

  Habitants : 60 364 Neuill&eacute;ens
 Superficie : 375 ha 

  Situation : &agrave; 8 km de Paris-Notre-Dame

       Plus :
 <hr>                       
</pre>
  
</body>
</html>

<b>HISTOIRE :</b><br>
<br>
Neuilly tire son origine &eacute;tymologique des mots « lun &raquo; (for&ecirc;t) et « noue &raquo; (plaine mar&eacute;cageuse).Les premi&egrave;res mentions du nom date de 1222 (Portus de Lulliaco) avant de se nommer tour &agrave; tour Lugniacum, Luingni, Nully et Nulliacum...<br>
<br>
1527-1540 : Fran&ccedil;ois Ier fait construire le ch&acirc;teau de Madrid (dans le bois de Boulogne).<br>
<br>
1606 - Henri IV ordonne la construction d'un pont de bois &agrave; p&eacute;age en remplacement du bac jug&eacute; trop dangereux.<br>
<br>
1751 : Construction du ch&acirc;teau de Neuilly par Le comte d'Argenson (secr&eacute;taire d'Etat &agrave; la Guerre de Louis XV).<br>
<br>
1768-1772 : Le pont de bois est remplac&eacute; par un pont de pierre. <br>
<br>
1772 : Le baron de Sainte-James fait construire la Folie Sainte-James par les architectes Chevotet et B&eacute;langer.<br>
<br>
1777 : Le comte d'Artois, futur Charles X, fait construire la Folie Bagatelle par l'architecte B&eacute;langer.<br>
<br>
1780 : L'Eglise Saint-Jean-Baptiste est ouverte.<br>
<br>
1786 : Antoine Parmentier fait ensemencer la plaine des Sablons de pommes de terre.<br>
<br>
27 mars 1794 : Le ch&acirc;teau de Madrid est vendu pour &ecirc;tre d&eacute;moli. Fondation de l'Ecole de Mars (&eacute;cole militaire) dans la plaine des Sablons.<br>
<br>
1815 : La premi&egrave;re f&ecirc;te patronale Saint-Jean-Batipste est cr&eacute;&eacute;e par d&eacute;cret imp&eacute;rial (c'est l'origine de la c&eacute;l&egrave;bre f&ecirc;te &agrave; Neu-Neu qui perdurera jusqu'en 1936).<br>
<br>
1827 &agrave; 1831 : d&eacute;molition et reconstruction de l'Eglise Saint-Jean-Baptiste (apr&egrave;s le passage des sans-culottes)<br>
<br>
1897 : destruction de la mairie qui sera remplac&eacute;e par une Justice de Paix qui abrite aujourd'hui le Centre Culturel Louis de Br&ouml;glie.<br>
<br>
f&eacute;vrier 1848 : Le ch&acirc;teau de Neuilly est pill&eacute; et incendi&eacute; par les insurg&eacute;s. Les vestiges qui subsistent aujourd'hui (boulevard d'Argenson) sont occup&eacute;s par la Congr&eacute;gation des Soeurs Saint-Thomas de Villeneuve.<br>
<br>
1859 : Les quartiers des Ternes et de Villiers sont annex&eacute;s respectivement aux villes de Paris et de Levallois-Perret.<br>
<br>
1882-1886 : Construction de l'actuel H&ocirc;tel de Ville. <br>
<br>
1887-1896 : Construction de l'&eacute;glise Saint-Pierre.<br>
<br>
1897 - Le nom de Neuilly-sur-Seine est d&eacute;finitivement fix&eacute; par d&eacute;cret.<br>
<br>
1912 - Construction du Lyc&eacute;e Pasteur (qui fera office d'h&ocirc;pital militaire pendant la Premi&egrave;re Guerre Mondiale).<br>
<br>
27 novembre 1919 : Cl&eacute;menceau et Staboulisky signent le Trait&eacute; de Paix entre la France et la Bulgarie.<br>
<br>
1929 - Le Bois de Boulogne est annex&eacute; &agrave; la ville de Paris.<br>
<br>
1935-1942 - Construction du pont m&eacute;tallique (par l'ing&eacute;nieur des Ponts et Chauss&eacute;es A. L&eacute;vy).<br>
<br>
1940 - Neuilly est occup&eacute;e par les arm&eacute;es hitl&eacute;riennes.<br> 
<br>
25 ao&ucirc;t 1944 : Lib&eacute;ration de Neuilly<br>
<br>
1981 : installation de la statue du Duc d'Orl&eacute;ans (sur la demande d'Achille Peretti, cette statue &agrave; &eacute;t&eacute; ramen&eacute;e d'Alger en 1963).<br>
<br>
1992 - Ouverture du tunnel de l'avenue Charles-de-Gaulle (qui permit l'am&eacute;nagement de jardins en surface).<br>
<br>
