<html>
<body background="../images/fondtexte2.jpg"  text="black">
<title>Paupiettes de sole à la mousse de saumon</title>
 PAUPIETTES DE SOLE A LA MOUSSE DE SAUMON<br>  

<table WIDTH=100% BORDER=0>
<tr>
<td align=center>
  <IMG SRC="images/paupiettesolemousse.jpg" ALT="Paupiettes de sole &agrave; la mousse de saumon" WIDTH="320" HEIGHT="240" BORDER="0">  
</td>
<td align=center>
pour 6 personnes:<br>  

PREPARATION : 30 minutes<br>  
CUISSON : 35 minutes <br>  
<br>  
INGREDIENTS :<br>  
       - 3 belles soles (12 filets)<br>
       - 200g de chair de saumon frais ( un morceau de queue de 500g)<br>
       - 1 &eacute;chalote<br>
       - 8 cl de muscadet<br> 
       - 170g de cr&egrave;me fra&icirc;che<br>
       - 20 cl de fumet de poisson (pr&eacute;par&eacute; &agrave; partir d'un sachet)<br>  
       - 100g de beurre<br>
       - 1 blanc d'oeuf<br>
       - sel, poivre<br>
</td>
</tr>
</table>

<br>


         

   -Pr&eacute;parer le fumet de poisson comme indiqu&eacute; sur le sachet. <br>
   - Enlever les ar&ecirc;tes et la peau du saumon,  puis passer la chair au mixer. Mettre cette mouse au r&eacute;frig&eacute;rateur.
   - 1 heure apr&egrave;s, incorporer un blanc d'oeuf en neige. Puis 120g de cr&egrave;me. Saler, poivrer et remettre au r&eacute;frig&eacute;rateur.<br>
   - Beurrer un plat allant au four et le parsemer d'&eacute;chalote hach&eacute;e. Y ranger les filets de sole en leur donnant la forme
     de paupiettes vide. Garnir l'int&eacute;rieur avec la mousse de saumon puis verser dessus le fumet de poisson tr&egrave;s chaud, commencer l'&eacute;bulition sur le feu, cuire 15 minutes &agrave; four doux (TH 4).<br>
   - Dresser les paupiettes dans un plat et tenir au chaud.<br>
   - Faire r&eacute;duire de moiti&eacute; le jus de cuisson, ajouter 50g de cr&egrave;me et continuer &agrave; r&eacute;duire jusqu'&agrave; l&eacute;ger &eacute;paississement.<br>
   - Ajouter le beurre par morceaux en tournant au fouet.rectifier l'assaisonnement.
   - Napper les paupiettes avec cette sauce et servir.
<br><br> 
Vin : Sancerre blanc<br>

 </body>

</html>
