<html>
<body background="../images/fondtexte2.jpg"  text="black">
<title>VELOUT&Eacute; DE CAROTTES et D'ORANGES</title>
<TABLE WIDTH=100%>



<TR>

<TD VALIGN=TOP ALIGN=CENTER WIDTH=25%>
<br>
INGREDIENTS : <br>
<br><br>
 1 kg de carottes<br>
<br>
 2 pommes de terre moyennes (300 g environ)<br>
<br>

 2 oignons<br>
<br>

 2 gousses d'ail<br>
<br>
 1 cuilli&egrave;re &agrave; soupe de gingembre frais hach&eacute;<br>
<br>
 2 oranges non trait&eacute;es<br>
<br><br>
 4 cuilli&egrave;re &agrave; soupe d'huile d'olive<br>
<br>

 0,5 litre de bouillon de poule<br>
<br>

 20 cl de lait de coco<br>
<br>

 Coriandre cisel&eacute;e<br>
<br>

 Sel et poivre du moulin<br>
<br>



<br>  
 </TD>


<TD VALIGN=TOP>

<BODY BACKGROUND="images/liens.jpg" TEXT="black" >
<CENTER>VELOUT&Eacute; DE CAROTTES et D'ORANGES</CENTER><BR><BR>

<BR>
- Pelez les carottes et les pommes de terre puis lavez-les.<br>
<br>
-  Coupez-les carottes en tr&egrave;s tr&egrave;s petit d&eacute;s tout en laissant les d&eacute;s de pommes de terre un peu plus gros, la carotte est plus longue &agrave; cuire).<br>
<br><br>
- Emincez les oignons et l'ail.<br>
<br><bR>
- Pelez et r&acirc;pez le gingembre.<br>
<br><bR>
- Lavez les 2 oranges puis pr&eacute;levez le zeste d'1 orange.<br>
- Pressez les oranges et r&eacute;servez.<br>
<br>
- Dans une cocotte en fonte ou une sauteuse, faites chauffer 4. cuilli&egrave;res &agrave; soupe d'huile d'olive.<br>
<br>
- Faites revenir sur feu doux les oignons, l'ail et le gingembre pendant 5 minutes.<br>
<br>
- Ajoutez les d&eacute;s de carottes, de pomme de terre et le zeste d'orange puis m&eacute;langez bien.<br>
<br>
- Ajoutez le jus d'orange et le bouillon.<br>
<br>
- Portez &agrave;  &eacute;bullition.<br>
<br>
- Couvrez puis laissez mijoter dans une cocotte jusqu'&agrave; ce que les l&eacute;gumes soient cuits (soit environ 10 minutes (selon la taille de vos d&eacute;s de carottes !).<br>
<br><br>
- Mixez le tout<br>
<br>
- Ajoutez le lait de coco puis rectifiez l'assaisonnement en sel et poivre du moulin.<br>
<br>
- Faites chauffer sur feu doux puis servez avec la coriandre cisel&eacute;e.<br> 
<br><br><br>
<i>vous pouvez &eacute;ventuellement remplacer le lait de coco par de la cr&egrave;me liquide, la soupe sera alors un peu moins parfum&eacute;e, mieux vaux alors, ajouter 1 ou 2 pinc&eacute;e de coriandre en poudre.</i><br>
<br><br>





</TD>
</TR>
</TABLE>



<br>
</body>

</html>


