/* Example35-10 */

TestSymbol = 'Joe Bloggs 99 Somewhere Street 123 4567'
PARSE VAR TestSymbol One' 'Two' 'Three' 'Four' 'Five' 'Six' 'Seven =1 Eight
SAY 'One   =' One
SAY 'Two   =' Two
SAY 'Three =' Three
SAY 'Four  =' Four
SAY 'Five  =' Five
SAY 'Six   =' Six
SAY 'Seven =' Seven
SAY 'Eight =' Eight
