/* Example36-6 */

SAY 'Enter your First Name, your Surname and your Age with a space between each item'
PARSE PULL First Surname Age
SAY 'Hi' First Surname'. You will be 100 in' 100 - Age 'years.'
