/* Example35-12 */

TestSymbol = 'Joe Bloggs 99 Somewhere Street 123 4567'
PARSE VAR TestSymbol =1 Name =12 Address =32 Phone =40
SAY 'Name    =' Name
SAY 'Address =' Address
SAY 'Phone   =' Phone
