/* Example36-2 */

Joe = 'Jenny'
Bloggs = 'Donkey'
Somewhere = 'The'
Street = 'Paddock'

PARSE VALUE Joe Bloggs 99 Somewhere Street 123 4567 WITH =1 Name =12 Address =32 Phone =40
SAY 'Name    =' Name
SAY 'Address =' Address
SAY 'Phone   =' Phone

