/* Example33-8 */

SIGNAL ON SYNTAX

DO FOR X = 1 TO 10
  SAY 'X =' x
END

Syntax:
  SAY 'You have a syntax error!'
  SAY 'It is Error Number' RC 'in line number' SIGL
