/* Example31-3 */

CALL DoIt

NUMERIC FORM ENGINEERING

CALL DoIt

NUMERIC FORM SCIENTIFIC

CALL DoIt

EXIT

DoIt:

SAY 'a'x'Numeric FORM Setting is now   ' FORM()

SAY 'Result of calculation =       ' 99999 ** 999999

RETURN