/* Example36-13 */

PARSE SOURCE First Second Third Fourth Fifth Sixth .

SAY 'First  =' First
SAY 'Second =' Second
SAY 'Third  =' Third
SAY 'Fourth =' Fourth
SAY 'Fifth  =' Fifth
SAY 'Sixth  =' Sixth
