/* Example 36-14 */

PARSE VERSION First Second Third Fourth Fifth Sixth .

SAY 'Program       =' First
SAY 'ARexx Version =' Second
SAY 'Amiga CPU     =' Third
SAY 'Amiga FPU     =' Fourth
SAY 'Video System  =' Fifth
SAY 'Frequency     =' Sixth
