/* Example35-7 */

TestSymbol = 'Joe Bloggs 99 Somewhere Street 123 4567'
PARSE VAR TestSymbol One Two Three Four Five
SAY 'One   =' One
SAY 'Two   =' Two
SAY 'Three =' Three
SAY 'Four  =' Four
SAY 'Five  =' Five
