/* Example37-1 */

CALL SETCLIP('Person.1','Joe Bloggs')
CALL SETCLIP('Person.2','Fred Nurks')
CALL SETCLIP('Phone.1','123 4567')
CALL SETCLIP('Phone.2','456 7890')
