/* Example36-4 */

SAY 'Enter your Name, Address and Phone Number. Press RETURN after each item.'

PARSE PULL Name,Address,Phone
SAY 'Name    =' Name
SAY 'Address =' Address
SAY 'Phone   =' Phone
