@DATABASE opium.newmail.ru:666/23s.htm
@WORDWRAP

@NODE MAIN
@TITLE " Ave Satanas..."
 
   @{" " link "22s.guide/MAIN"}@{"../pau.gif" link "../pau.gif/MAIN"}
Назад    Черная Библия "Книга Левиафана
 (Вода)"    @{" " link "24s.guide/MAIN"}@{"../pau0.gif" link "../pau0.gif/MAIN"}
Дальше 

Заклинание к Сатане 

&nbsp;In nomine Dei nostri Satanas Luciferi exclesi 


&nbsp;Во имя Сатаны, Правителя земли, Царя мира сего, я призываю силы Тьмы поделиться своей Адской мощью со мной! Откройте шире врата Ада и выйдите из пропасти, дабы приветствовать меня как вашего брата (сестру) и друга! Дайте мне милости, о которых прошу! Имя твое я взял как часть себя! Я живу подобно зверям в поле, радуясь плотской жизни! Я благоволю справедливость и проклинаю гниль! Всеми Богами Бездны я заклинаю все, о чем я испрашиваю, произойти! Выйдите же и отзовитесь на ваши имена, сделав явью мои желания! @{"b"}

Услышьте же имена: @{"ub"}

Дьявольские имена@{" " link "me="0"/MAIN"} @{"i"}

Abbadon (Абаддон, Абаддона) 

Adramelech (Адрамелех) 

Ahpuch (Апух) 

Ahriman (Ахриман) 

Amon (Амон) 

Apollyon (Аполлион) 

Asmodeus (Асмодей) 

Astaroth (Астарта) 

Azazel (Азазель) 

Baalberith (Баальберит) 

Balaam (Валаам) 

Baphomet (Бафомет) 

Bast (Баст) 

Beelzebub (Вельзевул) 

Behemoth (Бегемот) 

Beherith (Бегерит) 

Bile (Вил) 

Chemosh (Чемош) 

Cimeries (Кимерис) 

Coyote (Койот) 

Dagon (Дагон) 

Damballa (Дамбалла) 

Demogorgon (Демогоргон) 

Diabulus (Дьявол) 

Dracula (Дракула) 

Emma-O (Эмма-О) 

Euronimus (Евронимус) 

Fenriz (Фенриц) 

Gorgo (Горгона) 

Haborym (Хаборим) 

Hecate (Геката) 

Ishtar (Иштар) 

Kali (Кали) 

Lilith (Лилит) 

Loki (Локи) 

Mammon (Маммон) 

Mania (Мания) 

Mantus (Манту) 

Marduk (Мардук) 

Mastema(Мастема) 

Melek Taus (Мелек Таус) 

Mephistopheles (Мефистофель) 

Metztli (Метцтли) 

Mictian (Миктиан) 

Midgard (Мидгард) 

Milcom (Милком) 

Moloch (Молох) 

Mormo (Мормо) 

Naamah (Наама) 

Nergal (Нергал) 

Nihasa (Нихаза) 

Nija (Нидза) 

O-Yama (О-Яма) 

Pan (Пан) 

Pluto (Плутон) 

Proserpine (Прозерпина) 

Pwcca (Пакка) 

Rimmon (Риммон) 

Sabazios (Шавазий) 

Saitan (Сэйтан) 

Sammael (Саммаэль) 

Samnu (Самну) 

Sedit (Седит) 

Sekhmet (Сехмет) 

Set (Сет) 

Shaitan (Шайтан) 

Shiva (Шива) 

Supay (Супай) 

T'an-mo (Тянь-мо) 

Tchort (Черт) 

Tezcatlipoca (Тецкатлипока) 

Thamuz (Тамуз) 

Thoth (Тот) 

Tunrida (Тунрида) 

Typhon (Тайфун) 

Yaotzin (Яоцин) 

Yen-lo-Wang (Йен-ло-Ванг) @{"ui"}

Сноска: Дьявольские имена приведены здесь в алфавитном порядке только для упрощения. При произнесении имен могут быть названы все имена или ограниченное число наиболее важных и подходящих для конкретного действия. Независимо от того, используются ли все или часть имен они должны быть выведены из жестко организованной формы, в которой они перечислены здесь и расположены в фонетически эффективном порядке. 

Заклинание вожделения@{" " link "me="1"/MAIN"} 

Предстань предо мною, О, великое отродье Бездны и яви свое присутствие. Все мысли устремил я на раскаленный шпиль, что светится вожделением, присущим мгновениям его увеличения, и страстно вырастает в своем набухании. 

Пошли же вестника чувственных наслаждений и облеки непристойные проекты моих темных желаний в форму будущих деяний и поступков. 

С шестой башни Сатаны да пребудет знак, что воссоединится с теми, что пылают внутри и подвигнет плотское тело, возжеланное мною. 

Я собрал все мои символы и готовлю все мои украшения; образ же, творения моего, таится как обезумевший василиск, ожидающий своего освобождения. 

И да станет видение сие реальностью, и, через пищу, доставленную моею жертвой, да предстанут ангелы первого измерения субстанциями третьего. 

Идите же в пустоту ночи (свет дня) и пронзите сей разум, что ответствует мыслями, ведущими к преданию развратом. 

(@{"b"}Мужчина@{"ub"}) 

Мой скипетр пронзает! Пронзающая сила моей злобы да разрушит святилище сей души, коей не достает вожделения; и, как сеется семя, так ее фантазии да закружат сей разум, оцепеняя его до беспомощности сообразно моей воле! Во имя великого бога Пана да предстанут мои тайные мысли в виде движения желанной мною плоти! 

Шемхамфораш! Да здравствует Сатана! 

(@{"b"}Женщина@{"ub"}) 

Мое лоно - в огне! И да пусть нектар, текущий из моей жаждущей расселины, опылит сей спящий мозг, и разум, что не чувствует вожделения, да закружится в безумном пробуждении. И когда мой могучий прилив схлынет, да начнутся новые скитания, и плоть, что я возжелала, да придет ко мне. Во имя великой Шлюхи вавилонской, и Лилит, и Гекаты да будет мое вожделение удовлетворено! 

Шемхамфораш! Да здравствует Сатана! 

Заклинание, используемое для вызывания уничтожения@{" " link "me="2"/MAIN"} 

Смотрите! Могучий глас моего отмщения разрушает безмятежность воздуха и стоит подобный монолитам гнева средь поля корчащихся змиев. Я стал подобен чудовищной машине уничтожения гноящихся кусков тела того (той), кто намеревается меня остановить. 

Я не сожалею о том, что призывы мои оседлали ураганные ветры, умножающие жжение моего яда. И огромные черные скользкие призраки восстанут из солевых копей и изрыгнут гной свой в жалкий мозг его (ее). 

Я призываю посланников рока изрубить с мрачным удовольствием избранную мною жертву. Безмолвна та безгласая птица, что питается мякотью мозга того (той), кто мучил меня; и агония того, чему суждено сбыться, будет неотступно присутствовать в криках боли, с тем только, чтобы послужить сигналами предупреждения тем, кто посмеет затаить на меня злобу. 

О, выйдите во имя Абадонны и уничтожьте того (ту), чье имя я укажу. 

О, великое братство ночи, несущее мое успокоение, выезжающее на жарких ветрах Ада, живущее во храме Дьявола, появись же! Предстань пред тем (той), чей низкий разум движет устами, невнятно насмехающимися над справедливыми и сильными! Вырви этот гогочущий язык и запихни его ему (ей) обратно в глотку, о, Кали! Пронзи его (ее) легкие жалами скорпионов, о, Сехмет! Ввергни суть его в пустоту гнетущую, о, могучий Дагон! 

Я закидываю раздвоенный Адский крюк и на зубьях его покоится безупречно насаженная жертва моей мести! 

Шемхамфораш! Да здравствует Сатана! 

Заклинание сострадания@{" " link "me="3"/MAIN"} 

Исполненный выстраданным гневом и яростью угнетенных, я изливаю глас мой, окутанный грохотом грома, дабы вы услышали его! 

О, великие обитатели ночи, затаившиеся во тьме, о, хранители пути, о, слуги мощного Тота! Появитесь же! Явите нам свою благотворную силу во благо того, кто верует и охвачен мукою. 

Оградите его бастионом вашей защиты, ибо не заслужил он мук сиих и не желает их. 

Пусть тот, кто затаил на него злобу, лишится силы своей и состояния своего. 

Огнем и водою, землею и воздухом поддерживайте его, дабы вновь обрел он то, чего лишился. 

Закалите огнем до мозга костей товарища нашего и друга по Левостороннему Пути. 

Силами Сатаны да вольются в жизнь его вновь удовольствия земные. 

Устраните же, что препятствует течению его жизненных сил, дабы мог вкусить он нектары сладострастия в грядущих вожделениях своих. 

Лишите дара речи противника его, имеющего форму или не имеющего таковой, и пусть товарищ наш выйдет радостным и сильным из постигшего его несчастья. 

Не допустите чтобы неудачи сокращали путь его, ибо он - один из нас и посему следует его лелеять. 

Восстановите его в силе, в удовольствии, в бесконечной власти над постигшими его несчастиями. 

Создайте вокруг и внутри него величественное сияние, что возвестит о появлении его из зыбкого болота, поглотившего его. 

Сие повелеваем мы именем Сатаны, что щедр на милости и чья поддержка решит исход! 

И жить тому, чье имя звучит....... (произносится имя сатаниста, которого постигло несчастье), сосуду, чья плоть подобна земле, жизни вечной, бесконечному миру, доколе правит им Сатана - властелин его! 

Шемхамфораш! Да здравствует Сатана! 


 ---

 ---

 ---

 ---

 ---

@endnode
