<html>
<body background="../../images/fondtexte2.jpg"  border="0">
<a name="a"></a>
<a href="67villesetcodepostaux.html#b"target="description"><font color="brown">Barr</font></a> (Altitude ?)
<pre>
<hr>
D&eacute;partement : <a href="entetebasrhin.html"Target="description">Bas-Rhin</a>      R&eacute;gion : <a href="../entetealsace.html"Target="description">ALSACE</a>

Code Postal : 67 140

  Habitants : 6 053 
 Superficie :

  Situation : &agrave; 30 km <a href="strasbourg.html"target="description">Strasbourg</a>

    Plus... : 
<hr>

</pre>
Un superbe village avec un centre historique remarquable qui poss&egrave;de un grand nombre de maisons &agrave; colombages...<br> 
<br><br>


<b>L'H&ocirc;tel de ville :</b><br>
<br>
De style renaissance, abrite aujourd'hui la mairie !<br>
<bR>
 Il a &eacute;t&eacute; construit en 1640 (sur les ruines d un ch&acirc;teau).<br>
 Dans l'arri&egrave;re cour, on peu voir un tr&egrave;s bel escalier double sur lequel le Bailli de Strasbourg (qui administrait la ville) pr&ecirc;tait serment de bonne gestion... Les notables de la ville montaient alors d'un c&ocirc;t&eacute; de l escalier, pr&ecirc;tait serment &agrave; la ville de Strasbourg avant de redescendre de l'autre c&ocirc;t&eacute;.<br>
<br><br>
  

<b>L'Ancien greffe :</b> (Situ&eacute; &agrave; gauche de l'H&ocirc;tel de Ville)<br>
<br>
 Dont la construction remonte au 17&egrave;me si&egrave;cle, poss&egrave;de un bel oriel d'angle, surmont&eacute; d'un clocheton.<br>
<br><br>


<b>Ancienne boucherie :</b><br>
<br>
 A droite de l H&ocirc;tel de ville, cette maison &eacute;tait la demeure d un ancien boucher. On y voit encore, sculpt&eacute; dans l'oriel un motif &agrave; t&ecirc;te de boeuf.<br>


<br><br>

<b>Auberge Le Brochet :</b><br>
<br>
 Elle existait d&eacute;j&agrave; au d&eacute;but du 16&egrave;me si&egrave;cle. Le rez-de-chauss&eacute;e est en gr&egrave;s, surmont&eacute; de deux &eacute;tages &agrave; colombages.<br>


<br><br>
<b>La rue des Bouchers :</b><br>
<br>
 C'est l&agrave; que l'on trouve l'office du tourisme situ&eacute; au rez-de-chauss&eacute;e d'une tr&egrave;s belle maison &agrave; arcades, surmont&eacute;e de deux &eacute;tages &agrave; colombages. En face, belle maison &agrave; colombages, avec un porche.<br> 

<br><br>

<b> Rue Neuve :</b><br>
<br>
un tr&egrave;s belle ensemble de maisons &agrave; encorbellement.<br>
<br><br>
<b> Rue Brune :</b><br>
<br>
 plusieurs belles maisons dont l'une poss&egrave;de une belle enseigne !<br>
<br><br>

<b> Rue du Coll&egrave;ge :</b><br>
<br> 
Une s&eacute;rie de maisons &agrave; colombages... ainsi que la maison de la famille Degermann (1870), avec un beau balcon en fer forg&eacute;...<br>  
<br><br>
<b>Rue de la Kirneck :</b>(du nom de la petite rivi&egrave;re qui traverse la ville).<br>
<br>
 plusieurs belles maisons.<br>



<br><br>


<b> Le Temple Saint Martin :</b><br>
<br>
 cette &eacute;glise qui domine la ville, poss&egrave;de une tour romane du 12&egrave;me si&egrave;cle. La nef, quant &agrave; elle, est du 19&egrave;me si&egrave;cle.<br>
 A l'int&eacute;rieur, un tr&egrave;s bel orgue Stiehr.<br>



<br><br>

<b>Mus&eacute;e de la Folie-Marco :</b><br>
<br>
C'est l'ancienne demeure du Bailli Louis F&eacute;lix Marco (construite au 18&egrave;me si&egrave;cle) qui c'est ruin&eacute; pour cette maison d'o&ugrave; le nom de Folie Marco !<br>
A l int&eacute;rieur : mobilier bourgeois du 17&egrave;me et 18&egrave;me si&egrave;cle ainsi que des collections de fa&iuml;ences et de porcelaines...<br>



<br><br><br>
<b>HISTOIRE :</b><br>
<br>
- en 788 : La ville &eacute;tait le chef lieu de la Seigneurie de Barr (regroupant plusieurs villages qui seront int&eacute;gr&eacute;s par la suite au Saint Empire Romain Germanique).<br>
<br>
- en 1566 : La seigneurie est vendue &agrave; Strasbourg qui dirige le domaine jusqu'&agrave; la R&eacute;volution !<br>
<br>
- La guerre de Trente Ans ravage la ville de Barr (elle est incendi&eacute;e par les Fran&ccedil;ais)<br>
<br>

 Le site semble avoir &eacute;t&eacute; occup&eacute; d&egrave;s le premier mill&eacute;naire avant J&eacute;sus Christ.<br>
<br><br> 
<br><br><br>
<A HREF="#a"<font color="#FF0000">haut de page</font> </A><br>
<br>
</body>
</html>