<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.03 [de] (WinNT; I) [Netscape]">
   <META NAME="Author" CONTENT="MGF-Design">
   <TITLE>Star Trek - Raumschiff Voyager (3.Staffel)</TITLE>
<!-- Created with AOLpress/2.0 -->
</HEAD>
<BODY BACKGROUND="Bg.gif">
<B><U><FONT SIZE=+2><A HREF="Staffel.htm">61.
Die neue Identit&auml;t (Favorite Sun)</A></FONT></U></B>
<BR>&nbsp;
<BR><FONT SIZE=+1>&nbsp;</FONT>
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=0 COLS=2 WIDTH="100%" >
<TR ALIGN=LEFT VALIGN=CENTER>
<TD ALIGN=LEFT VALIGN=CENTER WIDTH="100" HEIGHT="20"><FONT SIZE=+1>Regie:</FONT></TD>

<TD><FONT SIZE=+1>Marvin Rush</FONT></TD>
</TR>

<TR>
<TD><FONT SIZE=+1>Buch:&nbsp;</FONT></TD>

<TD><FONT SIZE=+1>Lisa Klink</FONT></TD>
</TR>

<TR>
<TD><FONT SIZE=+1>Darsteller:&nbsp;</FONT></TD>

<TD><FONT SIZE=+1>Cari Shayne (Eliann)</FONT></TD>
</TR>

<TR>
<TD></TD>

<TD ALIGN=LEFT VALIGN=CENTER><FONT SIZE=+1>Deborah May (Lyris)</FONT></TD>
</TR>

<TR>
<TD></TD>

<TD><FONT SIZE=+1>Kristanna S. Loken (Malia)</FONT></TD>
</TR>

<TR>
<TD></TD>

<TD><FONT SIZE=+1>Irene Tsu (Kims Mutter)</FONT></TD>
</TR>

<TR>
<TD></TD>

<TD><FONT SIZE=+1>Christopher Carroll (Alben)</FONT></TD>
</TR>
</TABLE>
<FONT SIZE=+1>&nbsp;</FONT>
<BR>
<HR WIDTH="100%">
<BR><FONT SIZE=+1>Unbekannte Raumschiffe tauchen auf, und die Besitzer,
die sich Nessarie nennen, begr&uuml;&szlig;en freundlich die Crew der Voyager.
Aber Harry Kim hat das untr&uuml;gliche Gef&uuml;hl, da&szlig; die Fremden
in Wirklichkeit B&ouml;ses im Sinn haben, und f&auml;ngt entgegen Janeways
ausdr&uuml;cklichen Befehl an zu feuern. Ein wildes Gefecht entbrennt,
in dessen Verlauf B&acute;Elanna schwer verletzt wird. Die Wunden der Klingonin
fl&ouml;ssen Harry ein Schuldgef&uuml;hl wegen seiner instinktiven Handlungsweise
ein, aber Tuvok rehabilitiert ihn, indem er herausfindet, da&szlig; die
Nessarie tats&auml;chlich feindlich gesinnt waren. Die neue Gegend, in
der sich die Voyager befindet, kommt Harry merkw&uuml;rdigerweise bekannt
vor. Zudem weist sein Gesicht pl&ouml;tzlich bizarre Markierungen auf.
Er diktiert dem Schiff mit schlafwandlerischer Sicherheit eine Weg, der
die Voyager zum Planeten der Taresianer bringt - seiner Heimat, wie die
Bewohner behaupten. Gem&auml;&szlig; ihrer Tradition sei das Harry-Embryo,
das sein Vater gezeugt habe, in den K&ouml;rper seiner Erdmutter implantiert
worden, aber seine Taresianische DNA habe ihn nun nach Hause gef&uuml;hrt.</FONT>

<P><B><FONT SIZE=+1><I>Nach einem mysteri&ouml;sen, spannenden Beginn erweist
sich die Handlung als ein noch schw&auml;cheres Remake des ohnehin recht
schw&auml;chlichen </I>PLANET ANGEL ONE <I>aus der Fr&uuml;hzeit der </I>NEXT
GENERATION.<I> Damals war Bill Riker Hahn im Korb, in der abstrus-d&uuml;mmlichen
Neuauflage ist es Harry Kim, der sich neben Kes und Neelix als dritte gew&ouml;hnungsbed&uuml;rftige
Figur herauskristallisiert hat.</I></FONT></B>

<P>
<HR WIDTH="100%">
<BR><A HREF="60.htm"><IMG SRC="sk_li.gif" BORDER=0 HEIGHT=32 WIDTH=32></A><A HREF="Main.htm"><IMG SRC="sk_ob.gif" BORDER=0 HEIGHT=32 WIDTH=32></A><A HREF="62.htm"><IMG SRC="sk_re.gif" BORDER=0 HEIGHT=32 WIDTH=32></A>
</BODY>
</HTML>
