<HTML>

<HEAD>

   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">

   <META NAME="Author" CONTENT="MGF-Design">

   <META NAME="GENERATOR" CONTENT="Mozilla/4.03 [de] (WinNT; I) [Netscape]">

   <TITLE>Star Trek - Raumschiff Voyager - Hintergr&uuml;nde</TITLE>

</HEAD>

<BODY BACKGROUND="Bg.gif">

<B><U><FONT SIZE=+2><A HREF="Main.htm">Ein

langer Weg nach Hause</A></FONT></U></B>

<BR>&nbsp;



<P><FONT SIZE=+1>Der Weltraum, unendliche Weiten: Dies sind die Abenteuer

des Raumschiffs Voyager, das mit seiner aus F&ouml;derationsmitgliedern

und Maquisk&auml;mpfern zusammengesetzten Besatzung unterwegs ist, um den

Weg zur&uuml;ck zur Erde zu finden&nbsp; - jenem Blauen Planeten, von dem

die Voyager-Besatzung mehr als 70.000 Lichtjahre entfernt ist ...</FONT>



<P><FONT SIZE=+1>So oder &auml;hnlich k&ouml;nnte sich das Intro der j&uuml;ngsten

STAR TREK - Ablegerserie Voyager anh&ouml;ren - wenn es eines g&auml;be.

Denn in Paramounts j&uuml;ngster SF-Serie geht es f&uuml;r die wackeren

Raumfahrer der Sternenflotte nicht darum, in unerforschte Welten vorzusto&szlig;en,

sondern einen Weg zu finden, wieder zur&uuml;ck zur Erde zu gelangen denn

selbst bei H&ouml;chstgeschwindigkeit w&uuml;rde die Reise Jahrzehnte dauern

...</FONT>



<P><FONT SIZE=+1>Als die Paramount - Bosse Ende 1993 eine dritte Ablegerserie

des beliebten Universums von Gene Roddenberry in Auftrag gaben, hatten

sie daf&uuml;r berechtigte Gr&uuml;nde: Deep Space Nine , das so vielversprechende

dritte STAR TREK&nbsp; - Projekt, hatte in seiner ersten Season nicht den

gew&uuml;nschten Erfolg gebracht. Zwar war gen&uuml;gend Zuschauerpotential

vorhanden und die Trekker - Welle angeheizt von einer hervorragenden siebten

Staffel der NEXT GENERATION noch immer kr&auml;ftig am Rollen.</FONT>



<P><FONT SIZE=+1>Aber die Fans verlangten lautstark nach einer neuen "Schiff"-Serie,

in der das Element der Bewegung und die Erforschung unbekannter Gefilde

wieder das Zentrum des Geschehens einnehmen sollten. Da eine weitere Season

mit Picard und seiner Crew nicht geplant war, sondern die Raumfahrer der

n&auml;chsten Generation - wie die "klassischen" Helden vor ihnen - auf

die Kinoleinwand wechseln sollten, schien die Zeit f&uuml;r eine vierte

STAR TREK - Fernsehserie gekommen zu sein.</FONT>



<P><FONT SIZE=+1>Michael Piller und Ric Berman, die schon DEEP SPACE NINE

produziert hatten, wurden mit der Konzeption der neuen Serie beauftragt.

Zu Ihnen stie&szlig; Jeri Taylor, die an DS9 als Autorin und ausf&uuml;hrende

Produzentin mitgearbeitet hatte. Das Trio hob ein neues Serienkonzept aus

der Taufe, das zwar - wie allgemein gefordert - wieder die Abenteuer einer

Schiffsbesatzung erz&auml;hlt, jedoch auch einige &Uuml;berraschungen bereith&auml;lt.

Denn den ber&uuml;hmten Stuhl in der Mitte besetzt diesmal - Zur Freude

der Trekkerinnen eine Frau. Und die Mission der Voyager besteht nicht in

der Erforschung unbekannter Regionen des Weltraums, sondern einfach darin,

nach einer Raumkathastrophe, die das Schiff in einen weit entfernten Sektor

der Galaxis geschleudert hat, wieder nach Hause zur&uuml;ckzukehren.</FONT>



<P><FONT SIZE=+1>Fieberhaft wurde das ganze Fr&uuml;hjahr 1994 an Drehb&uuml;chern

gefeilt, wurden Besatzungsmitglieder gecastet, Modelle gebaut, Masken gefertigt

und Spezialeffekte ausget&uuml;ftelt. Mit gro&szlig;em Aufwand an Werbung

und PR hob die neueste Kreation aus dem Hause Paramount schlie&szlig;lich

am 16.Januar 1995 zum Jungfernflug ab. Die U.S.S. Voyager, Kennziffer NCC-74656,

die der neuesten Serie ihren Namen gibt und den Charakteren der Handlung

nicht nur Fortbewegungsmittel, sondern auch Heim und Zuflucht ist.</FONT>



<P><FONT SIZE=+1>Mit diesem edlen, schlanken Schiff, das erstmals auch

in der Lage ist, auf planetaren Oberfl&auml;chen zu landen, tritt die Voyager-Crew

ihre lange Odyssee durch den Weltraum an, und erlebt dabei unvorstellbare

Abenteuer.</FONT>



<P><FONT SIZE=+1>F&uuml;r zus&auml;tzliche Spannung sorgt die Zusammensetzung

der Voyager-Besatzung. Da herrschen n&auml;mlich nicht nur eitel Freude

und Sonnenschein, sondern es gibt durchaus auch Rivalit&auml;ten. Kurz

bevor die Voyager in den entlegenen Delta-Quadranten geschleudert wurde,

war sie n&auml;mlich dabei, ein Schiff des Maquis zu verfolgen, jenes Bundes

von Widerstandsk&auml;mpfern, der schon in der NEXT GENERATION-Episode

176 und der DS9-Doppelfolge 40/41 von sich reden machte und immer wieder

f&uuml;r blutige Zwischenf&auml;lle an der cardassianischen Grenze sorgt.

Gemeinsam verschl&auml;gt es die beiden Schiffe in die weit entfernte Galaxis,

und als das Maquis-Schiff vernichtet wird, bleibt der Voyager-Besatzung

nichts weiter &uuml;brig, als die Rebellen bei sich aufzunehmen. Das Zusammenleben

ist nicht gerade leicht, aber die Crewmitglieder wissen, da&szlig; nur

Zusammenarbeit sie zur&uuml;ck zur Erde bringen wird.So herrscht trotz

immer wieder aufbrechender Gegens&auml;tze an Bord der Voyager weitgehende

Harmonie, von der ersten Episode an f&uuml;hlt man sich an den famili&auml;ren

Kreis der Next Generation erinnert. Statt Poker wird hier Billard gespielt,

ansonsten steht die Br&uuml;ckenbesatzung in &auml;hnlich vertrautem Verh&auml;ltnis.</FONT>



<P><FONT SIZE=+1>Die sympathischen Charaktere, die von Beginn an viel weniger

kantig sind als die Mannen von DS9 (und daf&uuml;r, so wird mancher bem&auml;ngeln,

weniger realistisch wirken), wurden vom Produzententeam mit viel Bedacht

ausgew&auml;hlt und stellen mal wieder eine STAR TREK gem&auml;&szlig;e

Multikulti-Truppe dar. Bemerkenswert sind die Leistungen der offenbar sehr

engagierten Darstellerriege, die ihre Charaktere vom Pilotfilm an mit einer

solchen Selbstverst&auml;ndlichkeit spielt, als h&auml;tte sie nie etwas

anderes getan.</FONT>



<P><FONT SIZE=+1>Neben der Kommandantin des Schiffes, der von Kate Mulgrew

(entgegen allen Unkenrufen) sehr sympathisch verk&ouml;rperten Kathryn

Janeway ist Chakotay (Robert Beltran) zu nennen, seines Zeichens erster

Offizier und ehemaliger Maquis-K&auml;mpfer. Auf der Br&uuml;cke vertreten

sind au&szlig;erdem Lt. Tom Paris (Robert Duncan McNeill), Lt. Harry Kim

(Wang Garrett) und Tuvok (Tim Russ), mit dem zum ersten Mal seit Spock

wieder ein Vulkanier zur st&auml;ndigen Besatzung einer Serie geh&ouml;rt.

Den klassischen Scotty Part besetzt Halbklingonin B&acute;Elanna Torres

(Roxann Biggs Dawson) als Chefingeneurin des Schiffes, die Au&szlig;erirdischen

Kes (Jennifer Lien) und Neelix (Ethan Phillips) sorgen f&uuml;r den n&ouml;tigen

Schu&szlig; Exotik. Der Mediziner an Bord ist diesmal eine Holodeckfigur

(Robert Picardo), die ein wenig wie der Androide Data in Next Generation

sowohl f&uuml;r Humor als auch f&uuml;r Nachdenklichkeit sorgt.</FONT>



<P><FONT SIZE=+1>Ob diese neue Besatzung, deren Abenteuer nun endlich auch

im deutschen Fernsehen zu sehen sind, sich hierzulande die Herzen der Fernsehzuschauer

erobern wird, bleibt abzuwarten. Die Toleranz der Trekkies ist, was neu

Serienkreationen betrifft, bekanntlich nicht gerade gro&szlig;.</FONT>

<BR>&nbsp;

<BR>

<HR WIDTH="100%">

<BR><A HREF="Main.htm"><IMG SRC="sk_ob.gif" BORDER=0 HEIGHT=32 WIDTH=32></A>

</BODY>

</HTML>

