<html>
<body background="../images/fondtexte2.jpg">
<a name="a"></a>

<table>
<tr>
<td>
<IMG SRC="../images/iconcarte.jpg" alt="icon carte" border=0</a>
</td>
<td>
<font color="purple"><font size=5 face="helvetica"><a href="entetebretagne.html"target="description"><b>Pr&eacute;sentation de la r&eacute;gion Bretagne</b></a> </font>
</td>
</tr>
</table>

<HR>

<br><br>


<a name="geo"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">G&eacute;ographie</font><font size=1 face="helvetica"> ( <A HREF="#eco">Economie</font></a><font size=1 face="helvetica"> - <A HREF="#his">Histoire</font></a><font size=1 face="helvetica"> - <A HREF="#pro">Produits locaux</font></a><font size=1 face="helvetica"> - <A HREF="#enf">Enfants du pays</a></font></a><font size=1 face="helvetica"> - <A HREF="#cul">Culture</a>)</font></STRONG><BR>
</font>
<br>
L'Armorique (ancien nom de la Bretagne), terre de dolmens et de menhirs, terre d'histoire et de l&eacute;gendes (la qu&ecirc;te du Graal, Merlin l'enchanteur, Lancelot du Lac, Tristant et Yseult, etc...), r&eacute;gion maritime par excellence, poss&egrave;de un littoral de 2 730 km, ponctu&eacute; de ports et de c&ocirc;tes...<br> 
<br>

Plages sableuses ou cordons de galets, escarpements rocheux ou baies envas&eacute;es, &icirc;les, marais salants, rias, etc...Cette vari&eacute;t&eacute; de milieux (souvent associ&eacute;e au Golfe du Morbihan, au Mont Saint-Michel, &agrave; La Pointe du Raz, &agrave; l'Aber Wrac'h et &agrave; Ouessant) offre une exceptionnelle diversit&eacute; biologique...   

<BR>
<font size=3 face="helvetica">

<br><br>
<a name="eco"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Economie</font><font size=1 face="helvetica"> ( <A HREF="#geo">G&eacute;ographie</font></a><font size=1 face="helvetica"> - <A HREF="#his">Histoire</font></a><font size=1 face="helvetica"> - <A HREF="#pro">Produits locaux</font></a><font size=1 face="helvetica"> - <A HREF="#enf">Enfants du pays</a></font><font size=1 face="helvetica"> - <A HREF="#cul">Culture</a>)</font></STRONG><BR>
</font>
<br>
La bretagne est la premi&egrave;re r&eacute;gion agricole fran&ccedil;aise !<br> 
Cultures c&eacute;r&eacute;ali&egrave;res, ma&iuml;s, colza, artichauds (87% de la production fran&ccedil;aise), choux fleurs (76%),
 &eacute;chalottes (75%), pommes de terre (30%), haricots verts (28%) ...<br>
<br>
Mais c'est aussi : la construction navale &agrave; St Nazaire, l'industrie automobile avec
Citro&euml;n (&agrave; Rennes), &eacute;lectronique (&agrave; Brest), les t&eacute;l&eacute;communications (&agrave; Lannionet) et
les cosm&eacute;tiques (&agrave; La Gacilly).
<br><br>
<a name="his"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Histoire</font><font size=1 face="helvetica"> ( <A HREF="#geo">G&eacute;ographie</font></a><font size=1 face="helvetica"> - <A HREF="#eco">Economie</font></a><font size=1 face="helvetica"> - <A HREF="#pro">Produits locaux</font></a><font size=1 face="helvetica"> - <A HREF="#enf">Enfants du pays</a></font><font size=1 face="helvetica"> - <A HREF="#cul">Culture</a>)</font></STRONG><BR>
</font>

<br>
- 700 000 avant JC : c'est la date du plus ancien site pal&eacute;olithique de Bretagne (d&eacute;couvert en Ille-et-Vilaine, pr&egrave;s de Loh&eacute;ac).<br>  
<br>
- Le N&eacute;olithique : nous &agrave; laiss&eacute; les 3 000 menhirs de Carnac, les fabuleuses dalles grav&eacute;es dans le cairn de Gavrinis (une &icirc;le dans le Golfe du Morbihan) et le cairn de Barnenez pr&egrave;s de Morlaix (long de 70 m, large de 15 &agrave; 20 m et abritant 12 chambres fun&eacute;raires...)<br>
<br>
- 8&egrave;me si&egrave;cle avant JC : Les Celtes arrivent en Armorique (terme venant du celtique Aremori qui signifie "pays du bord de mer"...)<br>
<br>

- 52 Av.JC : Les V&eacute;n&egrave;tes, malgr&eacute; une r&eacute;sistance h&eacute;ro&iuml;que (dans le golfe du Morbihan) ne pourront &eacute;chapper au massacre des l&eacute;gions romaines, o&ugrave; C&eacute;sar  r&eacute;duit femmes et enfants &agrave; l'esclavage !<br>
<br>
 Avant l'arriv&eacute; des Romains,cinq peuples existaient en armorique :
<table border=0>
<tr>
<td valign=top align=right valign=top WIDTH=100>
</td>
<td>
                            - les V&eacute;n&egrave;tes&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;->  capitale Dariritum (Vannes)<br>

                            - les Osismes&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;      -> capitale Vorgium (Carhaix)<br>
                            - les Coriosolites&nbsp; -> capitale Fanum Martis (Corseul)<br>
                            - les Redones&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;     -> capitale Condate (Rennes)&nbsp;<br>
                            - les Namn&egrave;tes&nbsp;&nbsp;&nbsp;&nbsp;     -> capitale Condevicnum (Nantes).<br>
</td>
</tr>
</table>

<br>
- 61 : R&eacute;volte de la reine Boudicca.<br>
<br>
- en 778 : Roland est tu&eacute; &agrave; Roncevaux.<br>
<br>
- 818-822 : Morvan Lez Breiz (Hanche de la Bretagne) tient t&ecirc;te &agrave; Louis le D&eacute;bonnaire.<br>
<br>
- 825-841: Nomino&euml; gouverne la Bretagne au nom de l'Empereur.<br>
<br>
- En 832 : fondation de l'abbaye Saint-Sauveur de Redon.<br>
<br>&nbsp;
- 841 : r&eacute;volte de Nomino&euml;.<br>
<br>
- 845 : Histoire de Ballon. Charles le Chauve est battu par Nomino&euml;.<br>
<br>
- 846 : nouvelle victoire de Nomino&euml;. Charles le Chauve reconna&icirc;t l'ind&eacute;pendance de Bretagne :Nomino&euml;, roi.<br>
<br>
- 7 mars 851 : Nomino&euml; meurt &agrave; Vend&ocirc;me, alors ,qu'ayant conquis le Maine et l'Anjou il marchait en direction de la Seine.<br>
<br>

- 851-857 : r&egrave;gne d'Erispo&euml;. Il est reconnu roi souverain par Charles le Chauve (avant d'&ecirc;tre assassin&eacute; !).<br>
<br>

- En 851 : le trait&eacute; d'Angers donne naissance &agrave; la Bretagne dite historique (Loire-Atlantique comprise).<br>
<br> 
- 863 : trait&eacute; d'Entrammes : Charles le Chauve reconna&icirc;t &agrave; la Bretagne une partie de l'Anjou.<br> 
<br> 
- 868 : trait&eacute; de Compi&egrave;gne : l'Empereur abandonne &agrave; la Bretagne le pays d'Avranche et le Cotentin.<br> 
<br> 
- 868-888 : querelles dynastiques entre les maisons de Nantes et de Rennes.<br> 
<br> 
- 875 : Gurvan repousse les Normands sous Rennes.<br> 
<br> 
- 888 : d&eacute;faite des Normands &agrave; Questembert.<br> 
<br> 
- 888-907 : r&egrave;gne d'Alain 1er le Grand.<br> 
<br> 
- Apr&egrave;s 907 : les Normands ravagent la Bretagne.<br> 
<br> 
- Vers 931 : Jean, abb&eacute; de Land&eacute;vennec, revient de Montreuil-sur-Mer en Bretagne. Il est suivi par Alain Barbe-Torte, qui reprend Nantes.<br> 
<br> 
- 937 : Alain Il Barbe-Torte, duc de Bretagne. Victoire de Kerlouan sur les Normands.<br> 
<br> 
- 1er ao&ucirc;t 939 : victoire de Trans sur les Normands.<br> 
<br> 
- 944 : d&eacute;faite de Dol.<br> 
<br> 
- 952 : mort du duc Alain Il.<br> 
<br> 
- 958-992 : rivalit&eacute; entre les maisons de Nantes et de Rennes. Conan 1er le Tort, comte de Rennes; Ho&euml;l, puis Judica&euml;l &agrave; Nantes.<br> 
<br> 
- 10 &egrave;me si&egrave;cle : implantation du syst&egrave;me f&eacute;odal en Bretagne!<br>
<br>
- 1040-1066 : Conan Il. Les Bretons participent &agrave; la conqu&ecirc;te de l'Angleterre.<br>
<br>
- 1084-1112 : Alain IV Fergent. Guillaume le Conqu&eacute;rant envahit la Bretagne, mais doit s'enfuir (1086).<br>
<br>
- 1148-1156 : querelles de succession entre &Eacute;on de Porho&euml;t, Ho&euml;l et Conan.<br>
<br>
- 1158 : la Bretagne passe aux mains du roi d'Angleterre Henri II Plantagen&ecirc;t.(Conan IV doit abdiquer.)<br>
<br>
- 1166-1182 : domination Anglaise. Henri Il.<br>
<br>
- 1186-1203 : Arthur ler, fils de Geoffroi Il, duc de Bretagne, sous la r&eacute;gence de sa m&egrave;re Constance.<br>
<br>
- Avril 1203 : Arthur 1er fait prisonnier au si&egrave;ge de Mirebeau, alors qu'il combattait Jean sans Terre, son oncle, pour faire valoir ses droits &agrave; la couronne d'Angleterre, est assassin&eacute; dans un cachot de Rouen.<br>
<br>
- 1213-1237 : Pierre 1er Mauclerc, &eacute;poux d'Alix de Thouars, duc de Bretagne, lutte contre ses f&eacute;odaux et contre le clerg&eacute;. Saint Louis envahit la Bretagne, il est battu.<br>
<br>
- 1341-1364 : guerre de succession de Bretagne. Deux pr&eacute;tendants : Jean de Montfort (fils d'Arthur III et demi-fr&egrave;re de Jean III); Charles de Blois (mari de Jeanne de Penthi&egrave;vre, petite-fille d'Arthur III par son p&egrave;re Guy de Penthi&egrave;vre, fr&egrave;re de Jean III).
<br>





<table WIDTH=100% border=0>
<tr>
<td valign=top align=right valign=top WIDTH=100>
<font size=4 face="helvetica">
<b>1343</b>
</td>

<td WIDTH=15 align=center valign=top>
<font size=3 face="helvetica"><b>
 :</b>
</tD>

<td align=left valign=top>
<font size=3 face="helvetica"> 
Jean de Montfort, fait prisonnier, est lib&eacute;r&eacute; peu apr&egrave;s. Pendant sa d&eacute;tention, sa femme, Jeanne la Flamme, d&eacute;fend victorieusement Hennebont contre Charles de Blois. Une arm&eacute;e anglaise vient au secours de Montfort. Une tr&ecirc;ve, sign&eacute;e &agrave; Malestroit pour 3 ans, est rompue peu apr&egrave;s.


<br>
</td>
</tr>


<tr>
<td valign=top align=right>
<font size=3 face="helvetica"><b>
1344</b>
</td>
<td WIDTH=15 align=center valign=top>
<b>:</b>
</td>
<td align=left> 
<font size=3 face="helvetica">
Charles de Blois, &agrave; la t&ecirc;te d'une arm&eacute;e fran&ccedil;aise, prend Quimper.
</td>
</tr>

<tr>
<td valign=top align=right>
<font size=3 face="helvetica"><b>
1345</b></td>
<td WIDTH=15 align=center valign=top>
<b>:</b>
</td>
<td align=left>
<font size=3 face="helvetica"> 
Jean de Montfort d&eacute;barque avec une arm&eacute;e anglaise. Il ne peut reprendre Quimper et meurt peu apr&egrave;s.





<br>
<br>
</td>
</tr>

<tr>
<td valign=top align=right>
<font size=3 face="helvetica"><b>
1346</b>
</td>
<td WIDTH=15 align=center valign=top>
<b>:</b>
</td>
<td align=left>
<font size=3 face="helvetica"> 
Charles de Blois est battu et fait prisonnier &agrave; la Roche-Derrien.



<br>
<br>
</td>
</tr>


<tr>
<td valign=top align=right> 
<font size=3 face="helvetica"><b>
26 mars 1351</b>
</td>
<td WIDTH=15 align=center valign=top>
<b>:</b>
</td>
<td align=left>
<font size=3 face="helvetica"> 
combat des Trente.<br>
</td>
</tr>

<tr>
<td valign=top align=right>
<font size=3 face="helvetica"><b>
1352</b>
</td>
<td WIDTH=15 align=center valign=top>
<b>:</b>
</td>
<td align=left> 
<font size=3 face="helvetica">
victoire des Anglais &agrave; Mauron. Du Guesclin au service de Charles de Blois.<br>
<br>
</td>
</tr>


<tr>
<td valign=top align=right>
<font size=3 face="helvetica"><b>
1363</b>
</td>
<td WIDTH=15 align=center valign=top>
<b>:</b>
</td>
<td align=left> 
<font size=3 face="helvetica">

Jean de Montfort, deuxi&egrave;me du nom, d&eacute;barque en Bretagne avec une arm&eacute;e.


</td>
</tr>



<tr>
<td valign=top align=right>
<font size=3 face="helvetica"><b>
1364</b>
</td>
<td WIDTH=15 align=center valign=top>
<b>:</b>
</td>
<td align=left>
<font size=3 face="helvetica"> 
le 29 septembre Durant la bataille d'Auray, Jean IV de Montfort remporte la victoire sur Charles de Blois (Charles de Blois est tu&eacute;)




<br>
<br>
</td>
</tr>


</table>





- 1365 : le 12 avril, le trait&eacute; de Gu&eacute;rande reconnait Jean IV duc de Bretagne (ce sera la fin d'une guerre civile qui aura dur&eacute;e 23 ans...)<br>
<br>
- 1365-1399 : r&egrave;gne de Jean IV le Conqu&eacute;rant. Sous la pression fran&ccedil;aise, le duc doit s'exiler de 1373 &agrave; 1379 avant de rentrer triomphalement en Bretagne en 1379.<br>

<br>
1399-1442 : r&egrave;gne de Jean V le Sage. Guerre contre les Anglais. Les Bretons, en 1405, envoient une arm&eacute;e de secours &agrave; leurs fr&egrave;res Gallois, en lutte contre les Anglais.<br>
<br>
- 1488 : les Bretons tombent &agrave; Saint Aubin du Cormier devant l'arm&eacute;e royale.<br>
<br>
- 1532 : La Bretagne est officiellement rattach&eacute;e &agrave; la France (par l'&eacute;dit du Plessis-Mac&eacute;)..&nbsp;<br>
<br>
- En 1900 : 75% de la population de Basse-Bretagne parlent breton (Mais l'&eacute;cole n'ouvre pas ses portes &agrave; la langue bretonne...)<br>
<br>&nbsp;
- 1811 : Cette ann&eacute;e l&agrave;, 637 loups furent tu&eacute;s en Bretagne (sans compt&eacute; les loups morts par empoisonnement).<br> 

<br>
- 1885 : Le dernier loup de Bretagne aurait &eacute;t&eacute; abattu vers Le Faou dans le Finist&egrave;re !<br>
<br>

- 1927-1928 : Le premier tour du monde en avion est effectu&eacute; par Le Brix (morbihanais)et Costes.<br>
<br>
- 1942 :&nbsp;Saint-Nazaire qui a &eacute;t&eacute; durant la premi&egrave;re guerre mondiale le point de d&eacute;barquement des forces alli&eacute;es, devient sous la seconde une base sous-marine allemande. Le 27 mars 1942, un commando anglo-canadien surprend l'ennemi tandis que le destroyer "Campbeltown" enfonce la forme-&eacute;cluse. Il neutralise d&eacute;finitivement celle-ci en se faisant sauter. Suite &agrave; cet audacieux coup de force, la ville va devenir un objectif de bombardement allemand et offrira &agrave; la lib&eacute;ration, un spectacle de d&eacute;solation.<br>

<br>
- 1944-1945 :&nbsp; L'occupation nazie qui s'ach&egrave;ve, g&eacute;n&egrave;re en Bretagne des destructions massives, notamment &agrave; Brest, Lorient, Saint-Nazaire, Saint-Malo...<br>

- en 1950 : Une loi est vot&eacute;e permettant d'enseigner le breton.<br>&nbsp;
<br>
- 1951 : Naissance du Comit&eacute; d'Etudes et de Liaison des Int&eacute;r&ecirc;ts Bretons (CELIB) qui annonce le renouveau &eacute;conomique de la Bretagne.<br>
<br>

- 1962 : Le 11 juillet &agrave; Pleumeur-Boudou a &eacute;t&eacute; r&eacute;alis&eacute; la premi&egrave;re liaison de t&eacute;l&eacute;vision par satellite.<br>

<br>
- 1966 : Mise en service de la centrale nucl&eacute;aire des Monts d'Arr&eacute;e (pr&egrave;s de Brennilis) et de l'usine mar&eacute;e motrice de la Rance.<br>
<br>

- 1967 :&nbsp; Le 18 mars, le "Torrey Canyon s'&eacute;choue sur des r&eacute;cifs des Seven Stones (entre les Cornouailles et les &icirc;les Sorlingues au large de l'Angleterre), c'est la 1&egrave;re mar&eacute;e noire sur les c&ocirc;tes bretonnes.<br>
<br>

- 1969 : Cr&eacute;ation du Parc naturel r&eacute;gionale d'Armorique (sur 33 communes et s'&eacute;tendant sur 90000 hectares).<br>

<br>
- 1970 : Cr&eacute;ation du Parc naturel r&eacute;gionale de Bri&egrave;re (sur 18 communes et s'&eacute;tendant sur 40000 hectares dont 15000 de marais).<br>
<br>

- 1975 : les premiers forages p&eacute;troliers sont entrepris en mer d'Iroise .<br>
<br>

- 1978 : Le 16 mars l' "Amoco Cadiz" s'&eacute;choue sur les rochers de Portsall. A la fin ao&ucirc;t,de Brest &agrave; la baie de Saint-Brieuc, 78,363 km de c&ocirc;tes et 200000 hectares de surface marine ont &eacute;t&eacute; gravement pollu&eacute;s.<br>
<br>

- 1980 : 7 mars, le "Tanio" se casse en deux au large de Portsall. L'avant coule en emportant huit marins. L'arri&egrave;re est remorqu&eacute; jusqu'au Havre. 120 km de c&ocirc;tes pollu&eacute;es dans le Finist&egrave;re, 20 dans les c&ocirc;tes d'Armor.<br>


<br><br>
<a name="pro"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Produits locaux</font><font size=1 face="helvetica"> ( <A HREF="#geo">G&eacute;ographie</font></a><font size=1 face="helvetica"> - <A HREF="#eco">Economie</font></a><font size=1 face="helvetica"> - <A HREF="#his">Histoire</font></a><font size=1 face="helvetica"> - <A HREF="#enf">Enfants du pays</a></font></a><font size=1 face="helvetica"> - <A HREF="#cul">Culture</a>)</font></STRONG><BR>
</font>
Hu&icirc;tres de cancale, langoustes, langoustines, le fameux homard breton, l'agneau dit de "pr&eacute; sal&eacute;", les poulets, andouille de Gu&eacute;m&eacute;n&eacute;, les artichauds, les choux fleurs, les chataignes de Redon, les Fraises de Plouastel,tout les poissons de mer ainsi que la truite, le brochet, le saumon...<br>
<br>
-<b> Les plats : </b>Cr&ecirc;pes de froment, galette de sarrasin, far,craquelin, Kouign-amann, Kig ha farz, la cotriade...<br> <br>
- <b>Les fromages :</b> <br>  
<br>
- <b>Les Patisseries et confiseries :</b><br>
<br>
- <b>Les boissons :</b> Le cidre, le chouchen, l'hydromel...<br> <br> 
<br><br>
<a name="enf"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Enfants du pays</font><font size=1 face="helvetica"> ( <A HREF="#geo">G&eacute;ographie</font></a> <font size=1 face="helvetica"> - <A HREF="#eco">Economie</font></a><font size=1 face="helvetica"> - <A HREF="#his">Histoire</font></a><font size=1 face="helvetica"> - <A HREF="#pro">Produits locaux</a></font><font size=1 face="helvetica"> - <A HREF="#cul">Culture</a>)</font></STRONG><BR>
</font>

<br>
Jacques Cartier, Yves-Joseph de Kerguelen de Tremarec, Fran&ccedil;ois-Ren&eacute; de Chateaubriand, Jean loup Chr&eacute;tien, Fulgence Bienven&uuml;e, Patrick Dewaere, Marguerite Boulc'h (dite Fr&eacute;hel), Jean H&eacute;naff, Edouard Leclerc, Olivier de Kersauzon de Pennendreff, Robert Surcouf, Pierre Waldeck-Rousseau, Bernard Hinault, Jean Robic...<br>
<br><br>
<a name="cul"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Culture</font><font size=1 face="helvetica"> ( <A HREF="#geo">G&eacute;ographie</font></a> <font size=1 face="helvetica"> - <A HREF="#eco">Economie</font></a><font size=1 face="helvetica"> - <A HREF="#his">Histoire</font></a><font size=1 face="helvetica"> - <A HREF="#pro">Produits locaux</a></font></a><font size=1 face="helvetica"> - <A HREF="#enf">Enfants du pays</a>)</font></STRONG><BR>
</font>
<br>
 Dans l'ouest de la Bretagne, on parle encore le breton (langue d'origine celtique tout comme le Gallois et le Gaelique...) , mais, dans l'est de la Bretagne, il existe aussi une seconde langue, le Gallo (langue romane apparent&eacute;e au Fran&ccedil;ais) ...<br>
<br><br>
<A HREF="#a"<font color="#FF0000">haut de page</font> </A>

<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>




</body>
</html>

