<html>
<body background="../../images/fondtexte2.jpg">
<a href="04villesetcodepostaux.html#d"target="description"><font color="brown">Digne-les-Bains</font></a>          (Altitude : 608 m.)
<pre>
<hr>
D&eacute;partement :<a href="entetealpehteproven.html"Target="description">Alpes-de-Hte-Provence </a> R&eacute;gion:<a href="../enteteprovenalpecote.html"Target="description">Provence-Alpes-C&ocirc;te-d'Azur</a>

Code Postal : 04 000

  Habitants : 17 680 Dignois (en 1999)
 Superficie :

  Situation : &agrave; 110 Km Aix-en-Provence, 134 Km Cannes, 141 Km Marseille,
              143 Km Avignons, 157 Km Nice, 180 Km Grenoble et
              742 Km Paris

    Plus... :
<hr>
</pre>
<b>La cath&eacute;drale St J&eacute;rome :</b> (1490-1500)<br>
<br><br>
<b>La cath&eacute;drale Notre-Dame du Bourg :</b><br>
<br>
- L'autel de marbre du 5&egrave;me si&egrave;cle<br>
- Les chapiteaux m&eacute;rovingiens (en marbre)<br>
<br><br>
<b>Le jardin botanique des Cordeliers :</b><br>
<br><br>
<b>La maison d'Alexandra David Neel :</b><br>
<br><br>
<b>Le mus&eacute;e de la Seconde Guerre Mondiale :</b> (Situ&eacute; dans un ancien abri construit en 1939)<br>
<br>
Histoire de la guerre, de l'occupation et de la r&eacute;sistance en Haute Provence...<br>   
<br><br>
<b>L'ancien hospice :</b> (16&egrave;me si&egrave;cle)<br>
<br>
- Le mus&eacute;e d&eacute;partemental : Arch&eacute;ologie, histoire naturelle... <br>
<br><br>
<b>Le mus&eacute;e d&eacute;partemental d'art religieux :</b><br>
<br>
 Exposition d'objets du culte catholique provenant de diverses communes du d&eacute;partement.<br>   

<br><br>
<b>Le mus&eacute;e Photographique :</b><br>
  
<br><br>
<b>Le mus&eacute;e Promenade :</b><br>
<br>
 Exposition, biblioth&egrave;que et vid&eacute;oth&egrave;que sur les sciences de la terre de la r&eacute;serve g&eacute;ologique de Haute Provence.<br>   
<br><br>

<b>HISTOIRE :</b><br>
<br>
- 14 avant J.C. : Auguste soumet les Bodiontici ou Brodiontii peuplade dont Dinia (Digne les bains) est la capitale.<br>
<br>
- 1629 : La peste fait 7 000 morts...<br>
<br>
- 1660 : l'&eacute;v&ecirc;que Toussaint de Forbin Janson, qui devait devenir Cardinal et Grand Aum&ocirc;nier de France, inaugura un premier Hospice <br>
<br>
- de 1700 &agrave; 1712 : La Charit&eacute; est &eacute;lev&eacute;e (qui deviendra la caserne Desmichels au 19&egrave;me si&egrave;cle).<bR>
<br>
- 4 mars 1815 : Napol&eacute;on (revenant de l'&icirc;le d'Elbe) fait une halte &agrave; l'h&ocirc;tel du Petit-Paris, transform&eacute; ensuite en Tr&eacute;sorerie G&eacute;n&eacute;rale (actuelle clinique Jouve-Daviot).<br>
<br>
- d&eacute;but du 19&egrave;me si&egrave;cle : cr&eacute;ation de l'Avenue (notre boulevard Gassendi actuel)<br>
<br>
- 1829 : jusqu'cr&eacute;ation de la Grande Fontaine.<bR>
<br>
- 1833, l'ancienne Charit&eacute; permet &agrave; Digne de devenir ville de garnison (jusqu'&agrave; la fin de la premi&egrave;re guerre mondiale).<br>
<br>
- De 1846 &agrave; 1862 : La cath&eacute;drale Saint-J&eacute;r&ocirc;me est agrandie.<br>
<br>
- Avant la guerre de 1914 : le chemin de fer dota la ville de ses deux gares tandis qu'&eacute;taient construits l'Orphelinat Saint-Martin, le petit s&eacute;minaire (actuel Centre d'Action Sociale), le th&eacute;&acirc;tre (actuelle Tr&eacute;sorerie G&eacute;n&eacute;rale), l'Ecole Normale (actuel I.U.F.M.), les Archives, l'ancienne Gendarmerie (l'actuelle D.A.S.), l'H&ocirc;pital. <br>
<br>

- 1982 :ouverture du nouveau pont Beau de Rochas<br>
<br>
</body>
</html>

