<html>
<body background="../images/fondtexte2.jpg">
<a name="a"></a>

<table>
<tr>
<td>
<IMG SRC="../images/iconcarte.jpg" alt="icon carte" border=0</a>
</td>
<td>
<font color="purple"><font size=5 face="helvetica"><a href="enteterhonealpes.html"target="description"><b>Pr&eacute;sentation de la r&eacute;gion Rh&ocirc;ne-Alpes</b></a> </font>
</td>
</tr>
</table>

<HR>

<br><br>


<a name="geo"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">G&eacute;ographie</font><font size=1 face="helvetica"> ( <A HREF="#eco">Economie</font></a><font size=1 face="helvetica"> - <A HREF="#his">Histoire</font></a><font size=1 face="helvetica"> - <A HREF="#pro">Produits locaux</font></a><font size=1 face="helvetica"> - <A HREF="#enf">Enfants du pays</a>)</font></a></STRONG><BR>
</font>

<BR>
<font size=3 face="helvetica">
Par sa superficie, Rh&ocirc;ne-Alpes soutient la comparaison avec la Suisse, la Belgique ou les Pays-Bas !<br>
<br>
Montagnes et vall&eacute;es (vall&eacute;e du Rh&ocirc;ne et de la Sa&ocirc;ne, les vall&eacute;es alpestres de l'Is&egrave;re, de la Maurienne, de la Tarentaise, de l'Arve, la vall&eacute;e du gier...) sont le trait majeur des paysages de Rh&ocirc;ne-Alpes.<br>
- Les Alpes forment un massif montagneux grandiose, massifs des Aravis, des Bauges, de Beaufortain, de Belledonne, de Chablais, de la Chartreuse, de Faucigny, d'Oisans et du Vercors. Au coeur de ces massifs, culmine &agrave; 4.807 m&egrave;tres le plus haut sommet d'Europe : le Mont-Blanc ( 4.807 m)<br>
- &agrave; l'Ouest, la bordure du Massif central et la partie m&eacute;ridionale du Jura.<br>
<br>
Ce paysage de grande ampleur abrite la deuxi&egrave;me r&eacute;gion &eacute;conomique fran&ccedil;aise.<br>
- du Massif Central aux Monts du Lyonnais, en passant par les Monts Forez, la v&eacute;g&eacute;tation se transforme, offrant des paysages aussi divers que de majestueuses for&ecirc;ts, la garrigue ard&eacute;choise ou des champs d'oliviers.<br>
le Sillon Rhodanien encha&icirc;ne vall&eacute;es verdoyantes couvertes de vignes et d'arbres fruitiers, champs de lavande dans la Dr&ocirc;me, et &eacute;tangs.<br>
<br>
Le d&ocirc;me basaltique du Mont-Gerbier-de-Jonc, la source de la Loire. (Ard&egrave;che)<br>
Rh&ocirc;ne-Alpes ne compte pas moins de 32 parcs et r&eacute;serves naturels.<br>
<br><br>
<a name="eco"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Economie</font><font size=1 face="helvetica"> ( <A HREF="#geo">G&eacute;ographie</font></a><font size=1 face="helvetica"> - <A HREF="#his">Histoire</font></a><font size=1 face="helvetica"> - <A HREF="#pro">Produits locaux</font></a><font size=1 face="helvetica"> - <A HREF="#enf">Enfants du pays</a>)</font></STRONG><BR>
</font>
<br>
C'est la 1&egrave;re R&eacute;gion fran&ccedil;aise productrice d'&eacute;nergie !<br>
Rh&ocirc;ne-Alpes est une r&eacute;gion a forte activit&eacute; industrielle : sid&eacute;rurgie, p&eacute;trochimie 
(production d'acier et de fonte), industries alimentaires, textile...<br>
c'est &eacute;galement une r&eacute;gion d'&eacute;levage et localement, de vignobles tels la c&ocirc;te du Beaujolais...<br>
La proximit&eacute; de l'Italie, de la suisse et de l'Allemagne favorise le commerce...<br>

<br>








<br>
 Avec plus de 5.800 kilom&egrave;tres de pistes, Rh&ocirc;ne-Alpes poss&egrave;de aujourd'hui le plus grand domaine skiable &eacute;quip&eacute; du Monde.<br>

(220 stations, 3.700 pistes de ski de descente, 2.300 remont&eacute;es m&eacute;caniques transportant 1,9 millions de skieurs/heure, 4.500 km de pistes de ski de fond)<br>
<br>
Le ski se pratique essentiellement dans les Alpes, mais il se pratique aussi dans le Massif Central (Monts du Forez, le Pilat, sur le plateau ard&eacute;chois) ou dans le Jura Sud.
<br><br>




La r&eacute;gion de Beaujolais doit son nom &agrave; l'ancien Ch&acirc;teau de Beaujeu, b&acirc;ti vers le milieu du IX&egrave;me si&egrave;cle et dont l'importance devint tr&egrave;s grande sous le r&egrave;gne de la premi&egrave;re race de la Maison Beaujeu jusqu'en 1265. L'un des seigneurs, Humbert III, fonda toutefois &agrave; partir de 1110 un nouveau village plus pr&egrave;s de la Sa&ocirc;ne et des grandes voies de communication. Il ne se doutait pas que Villefranche, ainsi cr&eacute;&eacute;e, prendrait petit &agrave; petit la place et l'influence de Beaujeu dans la gestion des affaires du Beaujolais dont elle devint capitale en 1532.<br>
<br>
 Province fran&ccedil;aise jusqu'en 1560, puis bourbonne, le Beaujolais appartint finalement &agrave; la famille d'Orl&eacute;ans &agrave; partir de 1626. En 1793, le Beaujolais fut int&eacute;gr&eacute; d&eacute;finitivement au d&eacute;partement du Rh&ocirc;ne.<br>
<br>
 


 "Le Beaujolais nouveau est arriv&eacute; ". Cette formule c&eacute;l&egrave;bre, nous la devons &agrave; Louis Orizet qui a consacr&eacute; toute sa carri&egrave;re d'ing&eacute;nieur agronome au vin. Il est aussi consid&eacute;r&eacute; comme l'un des meilleurs connaisseurs et d&eacute;gustateurs actuels.


 Le d&eacute;partement du Rh&ocirc;ne rassemble un nombre impressionnant d'hectares de vignes et de nombreux caveaux. Outre le traditionnel Beaujolais dont la r&eacute;putation a franchi les oc&eacute;ans, il existe de nombreux crus tr&egrave;s pris&eacute;s des lyonnais : les C&ocirc;tes r&ocirc;ties et Condrieu, les vins des C&ocirc;teaux du Lyonnais.<br>
 <br>

 Quelques chiffres...<br>
<br>
 60.000 hectares de vignes<br>
 40 grands crus<br>
<br>
  <br>






<br><br>
<a name="his"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Histoire</font><font size=1 face="helvetica"> ( <A HREF="#geo">G&eacute;ographie</font></a><font size=1 face="helvetica"> - <A HREF="#eco">Economie</font></a><font size=1 face="helvetica"> - <A HREF="#pro">Produits locaux</font></a><font size=1 face="helvetica"> - <A HREF="#enf">Enfants du pays</a>)</font></STRONG><BR>
</font>

<br>
Les territoires du Dauphin&eacute; sont tour &agrave; tour aux mains des Ligures, des Celtes et des Romains.<br>
- <b>Av. J.-C. :</b> La rive gauche du Rh&ocirc;ne forme la Viennoise.<br>
- <b>en 480</b> Il fait parti du royaume burgonde, puis subit l'occupation franque.<br>
<br>
- <b>Aux V&egrave;me et X&egrave;me si&egrave;cle</b>, il fait partie successivement de diff&eacute;rents royaumes tels que la Provence-Viennois, Provence bosonienne et Bourgogne-Provence.<br>
-<b> 843</b> : le trait&eacute; de Verdun l'int&eacute;gre &agrave; l'empire germanique.<br>
<br>
- <b>1098</b> : Le Comte d'Albon Guigues VII prend le titre de dauphin. Dauphin est un ancien pr&eacute;nom.<br> 
- <b>de 1029 &agrave; 1162</b> : la famille d'Albon prend la t&ecirc;te du dauphin&eacute;.<br>
- <b>de 1192 &agrave; 1282</b> : la famille La Bourgogne prend la t&ecirc;te du dauphin&eacute;.<br>
- <b>de 1282 &agrave; 1349</b> : la famille La Tour-du-Pin prend la t&ecirc;te du dauphin&eacute;.<br>
<br>
 
 
 Le Dauphin&eacute; n'est pas incorpor&eacute; au domaine royal. Il devient l'apanage traditionnel du fils a&icirc;n&eacute; du roi.<br>
<br>
<b>1355 :</b> Le trait&eacute; de Paris fixe les limites avec la Savoie.<br>
<b>1357 :</b> Le dauphin Charles, futur Charles V, cr&eacute;e les &Eacute;tats provinciaux du Dauphin&eacute;.<br>
Il arbore en Dauphin&eacute; l'aigle imp&eacute;riale des " vicaires ", symbole de la suzerainet&eacute; imp&eacute;riale.<br>
Louis XI ne suiva pas la tradition en ne donnant pas le Dauphin&eacute; &agrave; son fils il pr&eacute;f&eacute;ra en conserver l'administration.<br>
Ses successeurs, tout en garantissant les privil&egrave;ges de la province, en font autant.<br>
<br>
Plusieurs invasions savoyardes vont avoir lieu pendant les guerres de la ligue d'Augsbourg et de la Succession d'Espagne.<br>
<b>1788 :</b> l'assembl&eacute;e de Vizille r&eacute;clame des &eacute;tats g&eacute;n&eacute;raux.<br>
<br><br>
<a name="pro"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Produits locaux</font><font size=1 face="helvetica"> ( <A HREF="#geo">G&eacute;ographie</font></a><font size=1 face="helvetica"> - <A HREF="#eco">Economie</font></a><font size=1 face="helvetica"> - <A HREF="#his">Histoire</font></a><font size=1 face="helvetica"> - <A HREF="#enf">Enfants du pays</a>)</font></a></STRONG><BR>
</font>
<br>
viande de boeuf charolais, truite saumon&eacute;e des Alpes, ch&acirc;taignes de l'Ard&egrave;che, noix de Grenoble, saucisson des C&eacute;vennes, p&ecirc;ches de la vall&eacute;e de l'Eyrieux, pommes de p&eacute;lussin.<br> 
<br>
-<b> Les plats : </b>Ravioles, gratin dauphinois, raclettes, saladier de Clapoton, b&eacute;atilles, t&eacute;tines grill&eacute;es, saucisson aux pistaches ti&egrave;des pommes &agrave; l'huile, andouillette Lyonnaise, gras double, sabodet, tablier de sapeur, la quenelle de brochet gratin&eacute;e au four, la rap&eacute;e, la fondue et la tartiflette savoyardes... <br> <br>
- <b>Les fromages :</b> Le Reblochon, la Fourme d'Ambert, la Fourme de Montbrison, le Saint Marcelin,  le Beaufort, le Vacherin, l'Emmental de savoie, la Tomme de Savoie, la Tomme du Vivarais, le Picodon, le fromage d'abondance, le bleu de Gex, le P&eacute;lardon, le Hauteluce, la brique du Forez...<br>  
<br>
- <b>Les Patisseries et confiseries :</b> Le nougat, les Pognes, les Bugnes, le sarment, le baton de guignol<br>
<br>
- <b>Les boissons :</b> Chateauneuf-du-pape, Beaujolais, c&ocirc;tes du Forez, C&ocirc;tes du Rh&ocirc;ne, Apremont, la Clairette de Die <br> <br> 
<br><br>
<a name="enf"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Enfants du pays</font><font size=1 face="helvetica"> ( <A HREF="#geo">G&eacute;ographie</font></a> <font size=1 face="helvetica"> - <A HREF="#eco">Economie</font></a><font size=1 face="helvetica"> - <A HREF="#his">Histoire</font></a><font size=1 face="helvetica"> - <A HREF="#pro">Produits locaux</a>)</font></STRONG><BR>
</font>
<br>
Muriel Robin, Hector Berlioz, Jean michel Jarre, Bernard Lavillier, Fr&eacute;d&eacute;ric Dard, Charles Exbrayat, Bernard Pivot, Ren&eacute; Barjavel, Henri Fantin-Latour, Antoine de saint Exup&eacute;ry, Stendhal, Pierre terrail de Bayard, Antoine Pinay, Aim&eacute; Jacquet, Alain Prost, les fr&egrave;res Montgolfier, les fr&egrave;res Voisin, Marie-louise Cognacq-Jay, Paul Bocuse, Louis Mandrin, Jacques Martin<br>
<br>
<br>
<a name="p"></a>
<A HREF="#a"<font color="#FF0000">haut de page</font> </A>
<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>
</body>
</html>

