<html>
<body background="../images/fondtexte2.jpg">
<a name="a"></a>

<table>
<tr>
<td>
</td>
<td>
<font color="purple"><font size=5 face="helvetica"><a href="enteterhonealpes.html"target="description"><b>Pr&eacute;sentation de la r&eacute;gion Rh&ocirc;ne-Alpes</b></a> </font>
</td>
</tr>
</table>

<HR>

<br><br>



<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Economie</font><font size=1 face="helvetica"> ( <A HREF="georhonealpes.html">G&eacute;ographie</font></a><font size=1 face="helvetica"> - <A HREF="histoirerhonealpes.html">Histoire</font></a><font size=1 face="helvetica"> - <A HREF="produitrhonealpes.html">Produits locaux</font></a><font size=1 face="helvetica"> - <A HREF="enfantsrhonealpes.html">Enfants du pays</a>)</font></STRONG><BR>
</font>
<br>
C'est la 1&egrave;re R&eacute;gion fran&ccedil;aise productrice d'&eacute;nergie !<br>
Rh&ocirc;ne-Alpes est une r&eacute;gion a forte activit&eacute; industrielle : sid&eacute;rurgie, p&eacute;trochimie 
(production d'acier et de fonte), industries alimentaires, textile...<br>
c'est &eacute;galement une r&eacute;gion d'&eacute;levage et localement, de vignobles tels la c&ocirc;te du Beaujolais...<br>
La proximit&eacute; de l'Italie, de la suisse et de l'Allemagne favorise le commerce...<br>

<br>








<br>
 Avec plus de 5.800 kilom&egrave;tres de pistes, Rh&ocirc;ne-Alpes poss&egrave;de aujourd'hui le plus grand domaine skiable &eacute;quip&eacute; du Monde.<br>

(220 stations, 3.700 pistes de ski de descente, 2.300 remont&eacute;es m&eacute;caniques transportant 1,9 millions de skieurs/heure, 4.500 km de pistes de ski de fond)<br>
<br>
Le ski se pratique essentiellement dans les Alpes, mais il se pratique aussi dans le Massif Central (Monts du Forez, le Pilat, sur le plateau ard&eacute;chois) ou dans le Jura Sud.
<br><br>




La r&eacute;gion de Beaujolais doit son nom &agrave; l'ancien Ch&acirc;teau de Beaujeu, b&acirc;ti vers le milieu du IX&egrave;me si&egrave;cle et dont l'importance devint tr&egrave;s grande sous le r&egrave;gne de la premi&egrave;re race de la Maison Beaujeu jusqu'en 1265. L'un des seigneurs, Humbert III, fonda toutefois &agrave; partir de 1110 un nouveau village plus pr&egrave;s de la Sa&ocirc;ne et des grandes voies de communication. Il ne se doutait pas que Villefranche, ainsi cr&eacute;&eacute;e, prendrait petit &agrave; petit la place et l'influence de Beaujeu dans la gestion des affaires du Beaujolais dont elle devint capitale en 1532.<br>
<br>
 Province fran&ccedil;aise jusqu'en 1560, puis bourbonne, le Beaujolais appartint finalement &agrave; la famille d'Orl&eacute;ans &agrave; partir de 1626. En 1793, le Beaujolais fut int&eacute;gr&eacute; d&eacute;finitivement au d&eacute;partement du Rh&ocirc;ne.<br>
<br>
 


 "Le Beaujolais nouveau est arriv&eacute; ". Cette formule c&eacute;l&egrave;bre, nous la devons &agrave; Louis Orizet qui a consacr&eacute; toute sa carri&egrave;re d'ing&eacute;nieur agronome au vin. Il est aussi consid&eacute;r&eacute; comme l'un des meilleurs connaisseurs et d&eacute;gustateurs actuels.


 Le d&eacute;partement du Rh&ocirc;ne rassemble un nombre impressionnant d'hectares de vignes et de nombreux caveaux. Outre le traditionnel Beaujolais dont la r&eacute;putation a franchi les oc&eacute;ans, il existe de nombreux crus tr&egrave;s pris&eacute;s des lyonnais : les C&ocirc;tes r&ocirc;ties et Condrieu, les vins des C&ocirc;teaux du Lyonnais.<br>
 <br>

 Quelques chiffres...<br>
<br>
 60.000 hectares de vignes<br>
 40 grands crus<br>
<br>
  <br>






<br><br>

<A HREF="#a"<font color="#FF0000">haut de page</font> </A>
<br><br>
</body>
</html>

