<html>
<body background="../images/fondtexte2.jpg">
<a name="a"></a>

<table>
<tr>
<td>

</td>
<td>
<font color="purple"><font size=5 face="helvetica"><a href="enteterhonealpes.html"target="description"><b>Pr&eacute;sentation de la r&eacute;gion Rh&ocirc;ne-Alpes</b></a> </font>
</td>
</tr>
</table>

<HR>

<br><br>



<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">G&eacute;ographie</font><font size=1 face="helvetica"> ( <A HREF="ecorhonealpes.html">Economie</font></a><font size=1 face="helvetica"> - <A HREF="histoirerhonealpes.html">Histoire</font></a><font size=1 face="helvetica"> - <A HREF="produitrhonealpes.html">Produits locaux</font></a><font size=1 face="helvetica"> - <A HREF="enfantsrhonealpes.html">Enfants du pays</a>)</font></a></STRONG><BR>
</font>

<BR>
<font size=3 face="helvetica">
Par sa superficie, Rh&ocirc;ne-Alpes soutient la comparaison avec la Suisse, la Belgique ou les Pays-Bas !<br>
<br>
Montagnes et vall&eacute;es (vall&eacute;e du Rh&ocirc;ne et de la Sa&ocirc;ne, les vall&eacute;es alpestres de l'Is&egrave;re, de la Maurienne, de la Tarentaise, de l'Arve, la vall&eacute;e du gier...) sont le trait majeur des paysages de Rh&ocirc;ne-Alpes.<br>
- Les Alpes forment un massif montagneux grandiose, massifs des Aravis, des Bauges, de Beaufortain, de Belledonne, de Chablais, de la Chartreuse, de Faucigny, d'Oisans et du Vercors. Au coeur de ces massifs, culmine &agrave; 4.807 m&egrave;tres le plus haut sommet d'Europe : le Mont-Blanc ( 4.807 m)<br>
- &agrave; l'Ouest, la bordure du Massif central et la partie m&eacute;ridionale du Jura.<br>
<br>
Ce paysage de grande ampleur abrite la deuxi&egrave;me r&eacute;gion &eacute;conomique fran&ccedil;aise.<br>
- du Massif Central aux Monts du Lyonnais, en passant par les Monts Forez, la v&eacute;g&eacute;tation se transforme, offrant des paysages aussi divers que de majestueuses for&ecirc;ts, la garrigue ard&eacute;choise ou des champs d'oliviers.<br>
le Sillon Rhodanien encha&icirc;ne vall&eacute;es verdoyantes couvertes de vignes et d'arbres fruitiers, champs de lavande dans la Dr&ocirc;me, et &eacute;tangs.<br>
<br>
Le d&ocirc;me basaltique du Mont-Gerbier-de-Jonc, la source de la Loire. (Ard&egrave;che)<br>
Rh&ocirc;ne-Alpes ne compte pas moins de 32 parcs et r&eacute;serves naturels.<br>
<br><br>

<A HREF="#a"<font color="#FF0000">haut de page</font> </A>
<br><br>
</body>
</html>

