<html>
<body background="../images/fondtexte2.jpg">
<a name="a"></a>

<table>
<tr>
<td>
</td>
<td>
<font color="purple"><font size=5 face="helvetica"><a href="enteterhonealpes.html"target="description"><b>Pr&eacute;sentation de la r&eacute;gion Rh&ocirc;ne-Alpes</b></a> </font>
</td>
</tr>
</table>

<HR>

<br><br>



<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Histoire</font><font size=1 face="helvetica"> ( <A HREF="georhonealpes.html">G&eacute;ographie</font></a><font size=1 face="helvetica"> - <A HREF="ecorhonealpes.html">Economie</font></a><font size=1 face="helvetica"> - <A HREF="produitrhonealpes.html">Produits locaux</font></a><font size=1 face="helvetica"> - <A HREF="enfantsrhonealpes.html">Enfants du pays</a>)</font></STRONG><BR>
</font>

<br>
Les territoires du Dauphin&eacute; sont tour &agrave; tour aux mains des Ligures, des Celtes et des Romains.<br>
- <b>Av. J.-C. :</b> La rive gauche du Rh&ocirc;ne forme la Viennoise.<br>
- <b>en 480</b> Il fait parti du royaume burgonde, puis subit l'occupation franque.<br>
<br>
- <b>Aux V&egrave;me et X&egrave;me si&egrave;cle</b>, il fait partie successivement de diff&eacute;rents royaumes tels que la Provence-Viennois, Provence bosonienne et Bourgogne-Provence.<br>
-<b> 843</b> : le trait&eacute; de Verdun l'int&eacute;gre &agrave; l'empire germanique.<br>
<br>
- <b>1098</b> : Le Comte d'Albon Guigues VII prend le titre de dauphin. Dauphin est un ancien pr&eacute;nom.<br> 
- <b>de 1029 &agrave; 1162</b> : la famille d'Albon prend la t&ecirc;te du dauphin&eacute;.<br>
- <b>de 1192 &agrave; 1282</b> : la famille La Bourgogne prend la t&ecirc;te du dauphin&eacute;.<br>
- <b>de 1282 &agrave; 1349</b> : la famille La Tour-du-Pin prend la t&ecirc;te du dauphin&eacute;.<br>
<br>
 
 
 Le Dauphin&eacute; n'est pas incorpor&eacute; au domaine royal. Il devient l'apanage traditionnel du fils a&icirc;n&eacute; du roi.<br>
<br>
<b>1355 :</b> Le trait&eacute; de Paris fixe les limites avec la Savoie.<br>
<b>1357 :</b> Le dauphin Charles, futur Charles V, cr&eacute;e les &Eacute;tats provinciaux du Dauphin&eacute;.<br>
Il arbore en Dauphin&eacute; l'aigle imp&eacute;riale des " vicaires ", symbole de la suzerainet&eacute; imp&eacute;riale.<br>
Louis XI ne suiva pas la tradition en ne donnant pas le Dauphin&eacute; &agrave; son fils il pr&eacute;f&eacute;ra en conserver l'administration.<br>
Ses successeurs, tout en garantissant les privil&egrave;ges de la province, en font autant.<br>
<br>
Plusieurs invasions savoyardes vont avoir lieu pendant les guerres de la ligue d'Augsbourg et de la Succession d'Espagne.<br>
<br>
<b>1788 :</b> l'assembl&eacute;e de Vizille r&eacute;clame des &eacute;tats g&eacute;n&eacute;raux.<br>
<br><br>

<A HREF="#a"<font color="#FF0000">haut de page</font> </A>
<br><br>
</body>
</html>

