<html>
<body background="../../images/fondtexte2.jpg">
<a href="06villesetcodepostaux.html#a"target="description"><font color="brown">Antibes</font></a>   (ancien nom : Antipolis puis Antiboul)     Altitude : 0 m
<pre>
<hr>
D&eacute;partement : <a href="entetealpemariti.html"Target="description">Alpes-Maritimes </a>     R&eacute;gion : <a href="../enteteprovenalpecote.html"Target="description">Provence-Alpes-C&ocirc;te-d'Azur</a>

Code Postal : 06 600

  Habitants : 73 383 Antibois
 Superficie :

  Situation : &agrave; 10 km <a href="cagnessurmer.html"Target="description">Cagnes-sur-Mer</a>, 11 km <a href="cannes.html"Target="description">Cannes</a>, 15 km Grasse, 20 km <a href="nice.html"Target="description">Nice</a>,
              205 km Marseille, 960 km Paris

    Plus... : le festival de Jazz 
<hr>
</pre>
<b>Le Ch&acirc;teau Grimaldi et le Mus&eacute;e Picasso :</b><br>
<br><br>
<b>La Cath&eacute;drale :</b><br>
<br><br>
<b>Le Mus&eacute;e de la Tour</b> (Tour Gilli) :<br>
<br><br>
<b>Le Fort Carr&eacute; :</b><br>
<br><br>
<b>Le Mus&eacute;e d'Histoire et d'Arch&eacute;ologie :</b><br>
<br>
ouvert tous les jours sauf le lundi.<br>
<br><br>
<b>Le Mus&eacute;e Peynet :</b><br>
<br>
ouvert tous les jours sauf lundi et jours f&eacute;ri&eacute;s.<br>
<br><br>
<br>
<a name="cap"</a>
<b>Le Cap d'Antibes :</b><br>
<br>
<table>
<tr>
<td>
<a href="cap_antibesjpg.html"><img src="images/cap_antibes.jpg" alt="Le Cap d'Antibes" width="114" height="85" border=0</a><br> 

</td>
</tr>
</table>
<br><br>
<b>Phare de la Garoupe :</b><br>
<br><br>
<b>La Villa Eilenroc :</b><br>
<br><br>
<b>Le Mus&eacute;e Naval et Napol&eacute;onien :</b><br>
<br>
ouvert tous les jours sauf le samedi apr&egrave;s-midi.<br>
<br><br><br>
<b>HISTOIRE :</b><br>
<br>
Un site exceptionnel connu depuis la plus haute antiquit&eacute; !<br>

- Entre le deuxi&egrave;me et le premier mill&eacute;naire avant J.C. : fondation des villages primitifs par diverses tribus nomades.<br>
<br> 

- vers le 5&egrave;me avant J.C.:  des marins grecs fondent Antipolis (signifiant "la cit&eacute; d'en face"), en face de la Corse.<br>

<br>
 Les environs d'Antibes, et particuli&egrave;rement Le Cap d'Antibes &eacute;taient couverts de for&ecirc;ts de pins maritimes, avec des habitations primaires le long du rivage. La Garoupe &eacute;tait d&eacute;j&agrave; bien connue par les p&ecirc;cheurs qui y tendaient des pi&egrave;ges pour les poissons.<br>
<br>
- Au 2&egrave;me si&egrave;cle avant J.C. : l'ensemble de la r&eacute;gion doit affronter de nombreuses attaques de tribus environnantes (comme les Oxibiens et les Cannois). La r&eacute;gion demanda donc la protection aux romains<br>
<br>
- en 154 avant J.C.: Les romains infligent de s&eacute;v&egrave;res d&eacute;faites aux Oxibiens , la r&eacute;gion devient une province romaine (l'Alpae Maritimae).<br>

 Sous les romains, Antipolis continua de se d&eacute;velopper fortement, devenant la plus grande ville de la r&eacute;gion. La fameuse Voie Aur&eacute;lia traversait la ville, qui &eacute;tait une &eacute;tape majeure pour les romains se rendant en Gaule. Un Roman Castrum rempla&ccedil;a l'Acropolis grecque. La cit&eacute; avait de larges fortifications, des aqueducs, des bains publics, un arc de triomphe, et un temple d&eacute;di&eacute; &agrave; Mercure, dieu romain du Commerce. Les emplacements actuels du Cap d'Antibes et de Juan les Pins faisaient partie de la cit&eacute;.<br>
<br>
- 4&egrave;me si&egrave;cle apr&egrave;s J.C. : l'Empire romain se convertit au Christianisme, les invasions de tribus barbares, les ostrogoths et les wisigoths, reprirent, et la dislocation de l'Empire s'amor&ccedil;a. Une longue p&eacute;riode de d&eacute;vastation pour l'ensemble de la r&eacute;gion commen&ccedil;a.<br>
<br>
- milieu du 5&egrave;me si&egrave;cle : Antipolis devient Antiboul avec la cons&eacute;cration de la cit&eacute; au Christianisme.<br>
les si&egrave;cles qui suivirent, ont vu la r&eacute;gion d&eacute;vast&eacute;e par de nombreuses tribus...<br>
<br>
- 10&egrave;me si&egrave;cle : le 1er Seigneur d'Antibes (Seigneur Rodoart) commen&ccedil;a &agrave; prot&eacute;ger la r&eacute;gion en repoussant les envahisseurs...<br>
 d'imposantes fortifications (les fortifications de l'an 1000) fuent construites.<br>
<br>
- 11&egrave;me et 12&egrave;me si&egrave;cles : Antibes connu un certain renouveau, avant de conna&icirc;tre, l'ins&eacute;curit&eacute;, les guerres et les &eacute;pid&eacute;mies...<br>
<br> 
- fin du 14&egrave;me si&egrave;cle : La paix revient dans toute la r&eacute;gion .<br>
<br>
- Fin du 15&egrave;me si&egrave;cle : mort du Comte de Provence qui prot&eacute;geait et poss&eacute;dait toute le r&eacute;gion, il l&eacute;gua ses terres &agrave; Louis XI, Roi de France.<br>
<br>
- Milieu du 19&egrave;me si&egrave;cle:  Le Cap d'Antibes commen&ccedil;a r&eacute;ellement &agrave; se d&eacute;velopper avec l'arriv&eacute;e de touristes ais&eacute;s qui y b&acirc;tirent de luxueuses demeures.<br>
<br>

- En 1926 : Le ch&acirc;teau d'Antibes est achet&eacute; et transform&eacute; en mus&eacute;e par la municipalit&eacute;. Picasso y s&eacute;journa 6 mois. Il l&eacute;gua toutes ses oeuvres peintes sur place et le ch&acirc;teau d'Antibes devint le Mus&eacute;e Picasso.<br>
<br>
<br><br>
<a name="juan"</a>
<font color="brown">JUAN-LES-PINS :</font><br>
<br>
formant une seule et m&ecirc;me commune avec Antibes, c'est une station qui poss&egrave;de 60 plages de sable fin...<br>
<br><br>
<b>Le Marineland :</b><br>
<br>
<table>
<tr>
<td>
<a href="marinelandjpg.html"><img src="images/marineland.jpg" alt="" width="109" height="81" border=0</a> 
<a href="marineland1jpg.html"><img src="images/marineland1.jpg" alt="" width="109" height="81" border=0</a> 
<a href="marineland2jpg.html"><img src="images/marineland2.jpg" alt="" width="109" height="81" border=0</a> 
<a href="marineland3jpg.html"><img src="images/marineland3.jpg" alt="" width="109" height="81" border=0</a> 

</td>
</tr>
</table>
Le plus grand parc marin d'Europe.<br>
<br>
Ouvert tout les jours du 17/06/06 au 03/09/06 : de 10h00  &agrave; 22h30<br>
<br><br>
<b>Le festival de Jazz :</b> (en juillet).<br>
<br><br>
<b>HISTOIRE :</b><br>
<br>
- En 1880 : le Duc d'Albany (fils de la Reine Victoria) d&eacute;couvre ce qui sera Juan les Pins, une for&ecirc;t de pins bord&eacute;e de plages de sables idylliques.<br>
<br> 
- Dans les ann&eacute;es 20 : Les am&eacute;ricains y apportent un certain style de vie fait de d&eacute;contraction, de bains de soleil &agrave; la plage, et... de Jazz. Le succ&egrave;s est imm&eacute;diat. La jeunesse europ&eacute;enne et les stars am&eacute;ricaines de l'&eacute;poque (Frank Jay Gould, Scott, Jelda Fitzgerald, Douglas Fairbanks...) prennent l'habitude d'aller &agrave; Juan les Pins. <br>
<br>
- Apr&egrave;s la 2&egrave;me guerre mondiale : L'atmosph&egrave;re exub&eacute;rante de Juan reprend !<br> 
<br>
- 1951 : Sidney Bechet s'y maria et ce fut un jour compl&egrave;tement fou o&ugrave; orchestres dans la rue, stars, et journalistes du monde entier se m&ecirc;laient et dansaient. Sidney Bechet y joua m&ecirc;me pour la premi&egrave;re fois l'air Dans les rues d'Antibes (In the streets of Antibes), l'un de ses plus grands morceaux. <br>
<br>
- 1960 : Lancement du Festival de Jazz de Juan les Pins.<br>
<br> 
Tous les grands vinrent : Armstrong, Count Basie, Charles Mingus, Miles Davis, Ella Fitzgerald, Duke Ellington, Sarah Vaughan, Ray Charles....Hancock, Georges Benson, Keith Jarrett, Al Jarreau. 
<br><br>






 


</body>
</html>

