<html>
<body background="../../images/fondtexte2.jpg"  border="0">
<a href="17villesetcodepostaux.html#r"target="description"><font color="brown">Fort Boyard</font></a> (&eacute;difi&eacute; de 1849 &agrave; 1858)   
<pre>
<hr>
<a href="iledaix.html"Target="description">&Icirc;le d'Aix</a>     D&eacute;partement : <a href="entetecharentemariti.html"Target="description">Charente-Maritime </a>      R&eacute;gion : <a href="../entetepoitoucharente.html"Target="description">Poitou-Charentes</a>

      Surface au sol : 2 065 m2

 longueur ext&eacute;rieure : 68 m (int&eacute;rieure : 43 m)
  Largeur ext&eacute;rieure : 31 m (int&eacute;rieure : 12 m)
  Hauteur ext&eacute;rieure : 20 m

    Nombre de pi&egrave;ces : 66 (22 par &eacute;tage)
     
           Situation : En plein Oc&eacute;an Atlantique.
                       &agrave; 2 812 m l'&icirc;le d'Ol&eacute;ron, 3 268 m l'&icirc;le d'Aix.
<hr>
</pre>
<table>
<tr>
<td>
<a href="fortboyardjpg.html"><img src="images/fortboyard.jpg" target="description" alt="" width="109" height="81" border=0</a>
</td>
<td>
<a href="fortboyard1jpg.html"><img src="images/fortboyard1.jpg" target="description" alt="" width="109" height="81" border=0</a>
</td>
<td>
<a href="fortboyard2jpg.html"><img src="images/fortboyard2.jpg" target="description" alt="" width="109" height="81" border=0</a>
</td>
<td>
<a href="fortboyard3jpg.html"><img src="images/fortboyard3.jpg" target="description" alt="" width="109" height="81" border=0</a>
</td>
</tr>
</table>
<br><br>
<b>HISTOIRE :</b><br>
<br>
- 1666 : la construction d'un fort &eacute;tant consid&eacute;r&eacute; comme indispensable, Vauban est charg&eacute; du dossier. Mais, en raison de la trop grande profondeur, il &eacute;crit au roi Louis XIV <i>Sire, il serait plus facile de saisir la lune avec les dents, que de tenter en cet endroit pareille besogne</i>.<br>
<br>
- 1804 : d&eacute;but de cr&eacute;ation d'une &icirc;le artificielle par enrochement !<br>
<br>
- 1806 : un total de quelques 40 000 m3 de pierres compose l'enrochement.<br>
<br>
- 1807 : 20 000 m3 de pierres taillées, coll&eacute;es et reliées par des crampons de fer terminent l'assise.<bR>
<br>
- 1808, une nouvelle temp&ecirc;te ravage cette assise, et le tout s'est enfonc&eacute; de plus d'un m&egrave;tre, sous l'effet du poids.<br>
<br>
- 1809 : les travaux sont stopp&eacute;s !<br>
<br>
- 1837 : des ing&eacute;nieurs se repenchent sur le probl&egrave;me, et constatent que l'enrochement c'est enfonc&eacute; d'un m&egrave;tre suppl&eacute;mentaire...<br>
<br>
- 1843 : les techniques de constructions et les mat&eacute;riaux ont &eacute;volu&eacute;s Les travaux reprennent...<br>
<br>
- 1845 : les travaux d'assise sont termin&eacute;s.<br>
<br>
- 1849-1851 : &eacute;dification du rez-de-chauss&eacute;e.<br>
<br>
- 1854 : le premier &eacute;tage est termin&eacute;.<br>
<br>
- 1856 : les gros oeuvres sont finis.<br>
<br>
- 1857 : la construction se termine. Mais, conçu pour abriter 74 canons et 264 occupants, le fort ne recevra jamais l'armement pr&eacute;vu (les progr&eacute;s technique de l'artillerie rendant d&eacute;j&agrave; le fort inutile...)<br>
<br>

<br>
- fin du 19&egrave;me si&egrave;cle : Il servira de prison.<br>  

<bR>
<bR>










- 1950 : le fort est laiss&eacute; officiellement &agrave l'abandon par l'arm&eacute;e. Mais le fait toutefois classer au catalogue des monuments historiques.<br>
<br>
 
- 1961 : le ministre des arm&eacute;es, vend le fort au domaine pour 7500 frs.<br>
<br>
- 1962 : le fort est mis en vente et un dentiste belge (Eric Aerts) s'en porte acqu&eacute;reur, pour 150 000 frs.<br>
<br>
- 1966 : le fort sort de l'oubli gr&acirc;ce au film de Robert Enrico <i>Les Aventuriers</i> (avec Lino Ventura et Alain Delon) avant de retomber dans l'oubli.<br>
<br>
- 1980 :  une soci&eacute;t&eacute; de production t&eacute;l&eacute;visuelle rachette le fort, et il devient c&eacute;l&egrave;bre gr&acirc;ce au jeu <i>Fort Boyard</i> qui fera le tour du monde.<br>
<br><br>

</body>
</html>