<html>
<body background="../../images/fondtexte2.jpg"  border="0">
<a href="17villesetcodepostaux.html#s"target="description"><font color="brown">Saintes</font></a>    (Altitude : 10 m)
<pre>
<hr>
D&eacute;partement : <a href="entetecharentemariti.html"Target="description">Charente-Maritime </a>      R&eacute;gion : <a href="../entetepoitoucharente.html"Target="description">Poitou-Charentes</a>

Code Postal : 17 100

  Habitants : 27 723 Saintais
 Superficie :

  Situation :

    Plus... :
<hr>
</pre>
<b>Arc de Germanicus :</b> (Construit en 18-19 apr&egrave;s JC)<br>
<table>
<tr>
<td>
<a href="saintesjpg.html"><img src="images/saintes.jpg" target="description" alt="" width="57" height="82" border=0</a>

</td>
<td>
Il f&ucirc;t sauv&eacute; de la d&eacute;molition par Prosper M&eacute;rim&eacute;e et reconstruit en 1843 sur la rive droite de la Charente.<br>
On peut y voir une d&eacute;dicace &agrave; l'Empereur Tib&egrave;re ainsi qu'&agrave; ses neveux Germanicus et Drusus.<br>
 (Sur l'entablement, figure la g&eacute;n&eacute;alogie du donateur santon Ca&iuml;us Julius Rufus).<br>
</td>
</tr>
</table>
<br><br>
<b>Le Mus&eacute;e Arch&eacute;ologique :</b><br>
<br> 
  pr&eacute;sente un riche ensemble de lapidaire, des fragments de mausol&eacute;es et de b&acirc;timents gallo-romains d&eacute;couverts au 19&egrave;me si&egrave;cle.<br>
<br>
 Esplanade Andr&eacute; Malraux (t&eacute;l : +33.(0)5 46 74 20 97)<br>  
<br><br>
<b>Amphith&eacute;&acirc;tre :</b> (Construit au 1er si&egrave;cle)<br> 
<br>  
C'est un ensemble elliptique de 127 m&egrave;tres de long formant un ensemble de gradins pouvant accueillir entre 15 et 20 mille santons.<br> 
<br><br>

<b>Thermes de St Saloine :</b> (seconde moiti&eacute; du 1er si&egrave;cle)<br>  
<br>  
Situ&eacute;e pr&egrave;s du cimeti&egrave;re Saint Vivien.<br>
<br><br>

<b>Haras national :</b><br>  
<br>  
Avenue Jourdan - 17100 Saintes<br>  
 T&eacute;l : +33 (0)5 46 74 35 91<br>  
 Visite tous les jours de 15 h &agrave; 17 h<br>  
<br><br>  

<b>Abbaye-aux-Dames :</b> (fond&eacute;e en 1047 par le duc Geoffroy Martel et son &eacute;pouse Agn&egrave;s de Bourgogne).<br>
<br>

 

Une belle &eacute;glise romane (11&egrave;me et 12&egrave;me si&egrave;cle) comportant une magnifique fa&ccedil;ade sculpt&eacute;e ainsi qu'une exposition permanente sur son histoire.<br>  
<br><br>

<b>Eglise St-Palais :</b><br>
<br> 

Petit sanctuaire m&eacute;di&eacute;val situ&eacute; &agrave; c&ocirc;t&eacute; de l'abbaye-aux-dames.<br>


<br><br>


<b>Eglise Saint-Eutrope :</b> (Construite fin du 11&egrave;me et d&eacute;but 12&egrave;me si&egrave;cle)<br>
<br>

Le sanctuaire est con&ccedil;u comme une superposition de deux &eacute;glises. L'&eacute;glise basse avec ses piliers orn&eacute;s de ch&acirc;piteaux v&eacute;g&eacute;taux supporte le poid de toute l'&eacute;glise haute.<br>
<br>
Au 15&egrave;me si&egrave;cle : On prolongea le choeur de l'&eacute;glise et l'on &eacute;difia une tr&egrave;s belle fl&egrave;che de style flamboyant.<br> 
<br><br>
  





<b>La Cath&eacute;drale St-Pierre :</b><br>
<br> 

 

Et sa coupole romane du croisillon, ses salles canoniales, son clo&icirc;tre (13&egrave;me - 14&egrave;me si&egrave;cle), son clocher, ses murs flamboyants et sa charpente du 17&egrave;me si&egrave;cle...<br>  

<br><br>




<b>Mus&eacute;e de l'Echevinage :</b> (Ancien h&ocirc;tel de ville)<br>
<br> 
 

 avec une fa&ccedil;ade du 18&egrave;me si&egrave;cle , un beffroi de 1587. Des tableaux du 19&egrave;me et 20&egrave;me si&egrave;cles, une collection de porcelaine de S&egrave;vres et des expositions temporaires.<br>
<br>
 29 ter, rue Alsace-Lorraine. (t&eacute;l: +33.(0)5 46 93 52 39)<br> 
<br><br>
  





<b>Mus&eacute;e des Beaux-Arts (Pr&eacute;sidial) :</b> (H&ocirc;tel du d&eacute;but du 17&egrave;me si&egrave;cle)<br>
<br> 
 
Tableaux du 15&egrave;me au 18&egrave;me si&egrave;cle et c&eacute;ramiques Saintongeaises.<br> 
<br> 
 28 rue Victor Hugo. (t&eacute;l : +33.(0)5 46 93 03 94)<br>  
<br><br>
  




<b>Mus&eacute;e Dupuy-Mestreau :</b> (Ancienne demeure saintaise du 18&egrave;me si&egrave;cle)<br>
<br> 
 

Cet h&ocirc;tel a servi de pr&eacute;fecture apr&egrave;s la r&eacute;volution !<br>
Aujourd'hui, on peut y d&eacute;couvrir de nombreuses collections r&eacute;gionales d'oeuvres d'art, d'&eacute;l&eacute;ments de mobilier, de d&eacute;cors, de boiseries et d'objets de la vie quotidienne.<br>
<br>
 4 Rue Monconseil. (t&eacute;l: +33.(0)5 46 93 36 71)<br>
<br><br>
<b>HISTOIRE :</b><br>
<br> 
Le site &eacute;tait occup&eacute; d&egrave;s le n&eacute;olithique...<br>  
Le peuple gaulois des Santons est soumis par Jules C&eacute;sar...<br>
<br>
- Vers 20 av. J. C. : Agrippa (gendre d'Auguste) fera construire une grande route qui reliera Lugdunum (Lyon) &agrave; l'Atlantique et notamment &agrave; Burdigala (Bordeaux).<br>
<br>
- 1er si&egrave;cle : Mediolanum Santonum (capitale des Santons) est la capitale de la vaste province d'Aquitaine.<br>
<br>
- 3&egrave;me si&egrave;cle :  La cit&eacute; perd son influence au profit de Poitiers et de Bordeaux.<br>
<br>
- 844 : la ville est la proie de raids Vikings.<br>
<br>
- De la fin du 12&egrave;me si&egrave;cle jusqu'au 15&egrave;me si&egrave;cle : Luttes incessantes entre Plantagen&ecirc;ts et Cap&eacute;tiens, entre la France et l'Angleterre...<br>
<br>
- 1404 : Saintes devient d&eacute;finitivement fran&ccedil;aise.<br>
<br>
- 1609 : Le gouverneur de Pernes fait &eacute;difier un rempart bastionn&eacute; dot&eacute; d'une puissante citadelle (sur la colline du Capitole).<br> 
<br> 
<br> 

  






</body>
</html>