<HTML>
<HEAD><TITLE>Manuale in linea di Foundation - Sadeness Software &amp; Paul Burkey 1997/1998</TITLE></HEAD>
<BODY BGCOLOR="#000000" LINK="#FF0000" VLINK="#990000" text="#FFFFFF" background="gifs/background.gif">

<TABLE CELLSPACING=5 border=0 width=100%>
<td align=center valign=bottom width=300 colspan=2>
<IMG SRC="gifs/pb.gif" width=110 height=75 ALT="Paul Burkey" align=left>
<IMG SRC="gifs/sad-bar-fade.gif" width=300 height=75 ALT="Sadeness" align=left>
</td>

<TD COLSPAN=1 VALIGN=bottom ALIGN=right>
<IMG SRC="gifs/redline.gif" width=274 height=7 alt="--">

<tr>
<TD VALIGN=top align=center ROWSPAN=6 width=130>
</td>

<tr>
<TD VALIGN=top ALIGN=left COLSPAN=2>

<P>

<center>
<img src="gifs/found-logo.gif" width=350 height=104 alt="Foundation Logo">
</center>

<P>
<EM><font size=+2 color="#FF0000">Descrizione delle unit&agrave;:</FONT></EM>

<P>

Le persone/unit&agrave; sono divise in due gruppi, le unit&agrave; lavorative e le unit&agrave;
da combattimento.

<P>

<EM><font size=+1 color="#FF0000">Il lavoratore</FONT></EM>
<P>
&Egrave; la tua unit&agrave; pi&ugrave; importante. I lavoratori possono essere usati per molti
compiti, come scavare, pescare e coltivare; sono usati per trasportare
risorse da un posto all'altro del territorio; Possono svolgere la maggior
parte dei lavori nel tuo regno, e una volta addestrati possono diventare
unit&agrave; di livello superiore. Una buona presenza di lavoratori nei tuoi edifici
di deposito ti sar&agrave; molto d'aiuto per avere successo nel gioco.
<P>

<EM><font size=+1 color="#FF0000">La donna</FONT></EM>
<P>
Un'altra importante unit&agrave;. Senza le donne il tuo popolo non potrebbe procreare,
e la tua popolazione si estinguerebbe presto. Le donne ti riforniscono di
sangue giovane, ed &egrave; necessario avere una buona presenza di donne per
ottenere una popolazione sana e abbondante. Perch&eacute; la tua gente si riproduca
&egrave; necessario che tu dia loro un po' di privacy; il quartier generale non
&egrave; il posto migliore per metter su famiglia, sebbene sia possibile. I nuovi
arrivati nel mondo di Foundation sono in grado di lavorare allo stesso modo
delle persone pi&ugrave; grandi. Nel mondo di Foundation sei tu che domini i
personaggi invece di lasciarti dominare.

<P><EM><font size=+1 color="#FF0000">Il mago</FONT></EM>
<P>
I maghi sono grandi esperti nell'uso della magia. Per molti anni hanno
sostituito i lavoratori nel campo delle costruzioni e della trasformazione
del territorio. Con una buona riserva di magia possono fornirti tutti
gli edifici che desideri. Devi comunque fornire le risorse necessarie,
ma l'uso della magia ha velocizzato il processo di costruzione e anche di
demolizione degli edifici.

<P><EM><font size=+1 color="#FF0000">Lo scienziato</FONT></EM>
<P>
Senza la scienza non potresti sviluppare la tua tecnologia, e le conoscenze
dei tuoi nemici sorpasserebbero presto le tue. Grazie a una buona squadra di
scienziati potrai avere un flusso di nuove idee che ti manterr&agrave; avanti
rispetto agli oppositori. Gli scienziati sono anche la chiave per scoprire
le cure per i problemi di salute che potrebbero sorgere a causa del
sovraffollamento e della guerra.

<P><EM><font size=+1 color="#FF0000">Il soldato/La guardia</FONT></EM>
<P>
Ogni edificio del tuo territorio ha posto per almeno una guardia. Se hai
una guardia in un edificio, essa ti protegger&agrave; dagli attacchi. Quando la
guardia avr&agrave; svolto il suo dovere per un tempo sufficiente e dimostrato
il suo valore, sar&agrave; promossa al grado di cavaliere.

<P><EM><font size=+1 color="#FF0000">Il cavaliere</FONT></EM>
<P>
Il cavaliere &egrave; un valoroso combattente. &Egrave; forte e coraggioso, ma non
gli piace essere ridotto al rango di una guardia. Sar&agrave; felice
di obbedire ai tuoi ordini sul campo di battaglia, e quando avr&agrave; raggiunto
un alto livello di esperienza sar&agrave; promosso al grado di cavaliere nero.

<P><EM><font size=+1 color="#FF0000">Il cavaliere nero</FONT></EM>
<P>
La pi&ugrave; forte di tutte le unit&agrave; di combattimento. In genere sopravvive fino
alla fine dei suoi giorni, e ha il potere di difendersi dalla maggior
parte degli attacchi. &Egrave; immune alle frecce degli arcieri ed &egrave; raro
che un lavoratore gli si avvicini.

<P>

<CENTER>
<font size=+2 color="#FF0000"><a href="main.html">Menu principale</a></FONT>
</CENTER>

<P>

<tr>
<TD VALIGN=top>
<img src="gifs/trans-gif-160x4.gif" width=160 height=4>
</TD>

<TD VALIGN=top>

</TD>
</TR>

<P>

<tr>
<td colspan=2>
</td>
</tr>

<p>


<tr>
<TD COLSPAN=2>

<P>

<IMG SRC="gifs/redline2.gif" width=274 height=7 alt="--">

<P>

<CENTER>
<FONT SIZE=3>
Foundation &egrave; &#169;1997/1998 Sadeness Software e Paul Burkey. Tutti i diritti sono riservati.<br>
Pubblicazione - Sadeness Software - <A HREF="mailto:rich@sadeness.demon.co.uk">rich@sadeness.demon.co.uk</A><br>
Supporto di Foundation - Paul Burkey <A HREF="mailto:burkey@bigfoot.com">burkey@bigfoot.com</A>
</FONT>
<P align=center>
<font size=-1>Sadeness Software - 13 Russell Terrace - Mundesley - Norfolk - NR11 8LJ - UK</font><br>
Tel/Fax: +44 (0)1263 722169
</CENTER>
</TABLE>
</BODY>
</HTML>
