@DATABASE opium.newmail.ru:666/14_1s.htm
@WORDWRAP

@NODE MAIN
@TITLE " Ave Satanas..."
 
   @{" " link "13s.guide/MAIN"}@{"../pau.gif" link "../pau.gif/MAIN"}
Назад    Черная Библия "Книга Люцифера
 (Воздух)"    @{" " link "15s.guide/MAIN"}@{"../pau0.gif" link "../pau0.gif/MAIN"}
Дальше 

Жизнь после смерти через удовлетворение эго. 

&nbsp;Человек знает, что рано или поздно он умрет. Другие животные при приближении смерти чувствуют ее, но до этого момента животное вряд ли подозревает о своем уходе из мира сего. И, даже, когда смерть рядом, оно не знает, что точно кроется за последней чертой. Часто отмечается, что животное принимает смерть милостиво, без страха н сопротивления. Прекрасная концепция, верная, однако, лишь в тех случаях, когда смерть для животного неизбежна. Когда животное больно или ранено, оно будет бороться за свою жизнь до последней капли силы, оставшейся в нем. Эта неодолимая воля к жизни дала бы человеку, не будь он столь "высоко развит", необходимый боевой дух, в котором он так нуждается для того, чтобы выжить. 

&nbsp;Общеизвестен также тот факт, что множество людей умирает лишь потому, что они сдаются и им уже на все наплевать. Это вполне понятно, если человек болен и на выздоровление у него нет уже никаких шансов. Но часто и это не является истинной причиной смерти. Человек стал ленив. Он научился выбирать легкие пути. Даже самоубийство для многих становится менее отталкивающим, нежели другие грехи. И обвинять в этом следует только религию. Смерть во многих религиях преподносится как великое духовное пробуждение (конечно же, для тех, кто приготовился к загробной жизни). Эта концепция очень привлекательна для тех, чья жизнь не удовлетворяет их, но тому же, кто познал все радости, которые может предложить жизнь, смерть видится неким великим и ужасным катаклизмом, страхом высшей инстанции. Так и должно быть. И именно жажда жизни позволяет плотскому человеку продолжать жизнь после неизбежной смерти его телесной оболочки. 

&nbsp;История показывает, что люди, посвятившие жизнь поискам идеала, были обожествлены за свое мученичество. Набожники и политики очень искусны в составлении своих планов. Преподнося мученика в качестве сияющего примера для всех людей, они пытаются уничтожить реакцию здравого смысла на нелепость самоуничтожения, идущего, к тому же, против животной логики. Для Сатаниста мученичество и неолицетворенный героизм связаны не с подвижничеством натуры, а с ее тупостью. Это, конечно же, не касается ситуаций, в которых затрагивается безопасность любимого человека. Но отдать свою собственную жизнь за нечто не личное, такое, как политическое или религиозное убеждение, есть ничто иное, как высшее проявление мазохизма. 

&nbsp;Жизнь есть величайшая милость, смерть - величайшая немилость. Жизнь для человека, удовлетворенного своим земным существованием, как хорошая вечеринка, а кому же хочется уходить с ХОРОШЕЙ вечеринки? Иначе говоря, если человек доволен собой на этой земле, он не отдаст с готовностью свою жизнь за обещания жизни после смерти, о которой он ровным счетом ничего не знает. 

&nbsp;Восточные мистические верования учат человека воспитывать в себе противление любому сознательному желанию успеха для того, чтобы впоследствии раствориться во "Вселенском Космическом Разуме", дабы избежать всего, что приносит хорошее, здоровое самоудовлетворение или искреннюю гордость за земные достижения! 

&nbsp;Интересно отметить, что районы, в которых процветает этот тип веры, относятся к тем, где материальные блага заработать не так легко. По этой причине доминирующими религиями должны были стать и стали те, которые поощряют своих последователей отречься от материальных ценностей и избегать использования ярлыков, придающих некоторую долю значимости их приобретениям. Таким образом, люди приводятся к мысли о том, что нужно принимать свой жребий таким, какой он есть, неважно, сколь жалким он может оказаться. 

&nbsp;Сатанизм использует множество ярлыков. Если бы вещи не назывались своими именами, очень немногие из нас понимали бы что-либо в жизни и намного меньше придавали бы ей значение; - а значение рождает признание, что, в сущности, значение и есть то, чего все желают, особенно восточные мистики, которые только и пытаются доказать всем, что могут медитировать дольше или испытывать больше лишений, чем их собратья. 

&nbsp;Восточные философии проповедуют разжижение человеческого эго еще до того, как он успеет согрешить. Для Сатаниста непостижимо эго, сознательно выбирающее отрицание самого себя. 

&nbsp;Понятно, что в странах, где подобные приемы используются для добровольного обнищания, философия отрицания эго служит удобной цели, по крайней мере, для власть имущих, не желающих массовых недовольств. Но для тех, кто пользуется любой возможностью для улучшения своего материального положения, выбор этой формы религиозной мысли представляется, без сомнения, просто глупым! 

&nbsp;Мистик Востока твердо верит в реинкарнацию. Для человека, не имеющего практически ничего в жизни, возможность того, что он был царем в прошлой жизни или будет в следующей, весьма привлекательна н многое делает для ублажения его самоуважения. Если в этой жизни нет ничего, в чем человек мог бы выразить свое достоинство, он тешится мыслью о "предстоящих жизнях". Верующему в реинкарнацию никогда не приходит в голову, что если его отец, дед, прадед н т.д. создали "хорошую карму" своей приверженностью к тем же верованиям и этике, что и его собственные, - почему же тогда он живет в лишениях, а не как махараджа? Вера в реинкарнацию предоставляет чудесный мир фантазии, в котором человек может найти подходящий способ для выражения своего эго, утверждая в то же время, что он растворяет его. Это подчеркивается и выбором ролей, которые человек выбирает себе в будущих и прошлых жизнях. 

&nbsp;Верующие в реинкарнацию не всегда выбирают благородных персонажей. Если человек принадлежит к высокоуважаемым и консервативным натурам, он часто отводит себе в прошлой жизни роль живописного бродяги или бандита, удовлетворяя тем самым свое альтер-эго. Или же женщина высокого положения выбирает себе роль куртизанки для охарактеризования своего прошлого обличья. 

&nbsp;Если бы люди были способны сбросить клеймо, выжженное на личном удовлетворении эго, им не было бы нужды играть в игры самообмана, такие как вера в реинкарнацию как способ удовлетворения эго. 

&nbsp;Сатанист верит в полное вознаграждение своего эго. Сатанизм, по сути дела, ЕДИНСТВЕННАЯ религия, отстаивающая улучшение и поощрение эго. Только после того, как эго человека удовлетворено в достаточной степени, он может позволить себе быть добрым и любезным по отношению к другим без потери самоуважения. Обычно, человека с большим эго мы считаем хвастуном; на самом же деле, его хвастовство порождено нуждой удовлетворения эго. 

&nbsp;Набожники удерживали своих последователей в строю, подавляя их эго. Заставляя их чувствовать себя подчиненными, они пытались заставить их осознать внушительность Бога. Сатанизм же поощряет своих поклонников развивать хорошее, сильное эго, дающее им самоуважение, необходимое для насущного существования в этой жизни. Если человек был удовлетворен жизнью в течении своего бытия и боролся до конца за свое земное существование, ничто иное, как его эго, откажется умирать, даже после угасания плоти, содержавшей его, Можно только восхищаться маленькими детьми за их неугасимое желание жизни. Например, малыш отказывается лечь в постель, когда вокруг происходит нечто возбуждающее, и, будучи положенным спать, выбирается из кроватки, чтобы не упустить ничего интересного. Это детское жизнелюбие и позволяет Сатанисту смотреть сквозь занавес мрака и смерти и оставаться привязанным к земле. 

&nbsp;Самопожертвование не одобряется Сатанинской религией. Следовательно, если только смерть не является милостью в виду особых обстоятельств, которые делают завершение жизни желанным освобождением от невыносимого земного существования, самоубийство также не одобряется Сатанизмом. 

&nbsp;Религиозные мученики сами забрали у себя жизнь, но не потому, что она была невыносима, а для содействия религиозной вере. Мы должны предположить тогда, что самоубийство ради церкви не только рассматривается сквозь пальцы, но и одобряется, несмотря на то, что церковные тексты клеймят его позором греха, обожествляя, однако, религиозных мучеников. 

И скорее курьезен тот факт, что тогда, когда самоубийство являло собой милость, оно считалось грешным. 
 ---

 ---

 ---

 ---

 ---

@endnode
