@DATABASE opium.newmail.ru:666/satan.htm
@WORDWRAP

@NODE MAIN
@TITLE " Ave Satanas..."
 @{"cr.gif" link "cr.gif/MAIN"}
   nbsp       nbsp 	
 		    @{"flame.gif" link "flame.gif/MAIN"}			 		 		    Приветствую тебя Странник! 		 		    @{"flame.gif" link "flame.gif/MAIN"}			 		 	 
Входи! Здесь рады гостям. 
Но помни, здесь нет лишних и здесь их не будет никогда... Оставь отягощающее тебя, сбрось эту ношу. Оставь ложный страх, охлади свое сердце - только разум может осознать это, оставь глупые моральные устои - они тебе не нужны...
 И знай верить можно только в правду! Зачем обманывать себя сказками и утешать мифами? 
Как можно не верить в реальную cилу, но преклоняться перед беспомощностью? 
Не позволяй решать за себя, ты должен выбирать сам.
 Хочешь ли ты узнать истину? 
 ---
@{" " link "0s.guide/MAIN"}Да, я силен духом и готов узнать ИСТИНУ! 

@{" " link "http://www.disney.com/MAIN"}Нет, я боюсь! Это страшный грех...
 
 ---

 ---

 ---

 ---

 ---

@endnode
