<html>
<body background="../images/fondtexte4.jpg">
<a name="a"></a>
<table>
<tr>
<td>

</td>
<td>
<font color="purple"><font size=5 face="helvetica"><a href="lareunion.html"target="description"><b>Pr&eacute;sentation de la R&eacute;union</a> (974)</font><br>

</td>
</tr>
</table>
<hr>
<br>


<a name="geo"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">G&eacute;ographie</font></font><font size=1 face="helvetica"> (Economie</font> <font size=1 face="helvetica"> - <a href="histoirereunion.html" target="description">Histoire</a></font><font size=1 face="helvetica"> - Produits locaux</font><font size=1 face="helvetica"> - Enfants du pays - <a href="popureunion.html"target="description">Population</a>)</font></a></STRONG><BR>
</font>
<br>
L'&icirc;le de La R&eacute;union ainsi que les &icirc;les Maurice et Rodrigues forment l'archipel des
 Mascareignes !<br>
<br>
L &icirc;le est bord&eacute;e par 210 kilom&egrave;tres de c&ocirc;tes inhospitali&egrave;res (25 kilom&egrave;tres de plage
 de sable blanc corallien, 14 km de sable noir, le reste est constitu&eacute; de c&ocirc;tes 
inhospitali&egrave;res)...<br>
<br>

La baie de Saint-Paul constitue le seul abri naturel pour la navigation !<br>
<br>


L'&icirc;le est constitu&eacute;e de deux ensembles volcaniques.<br>
-  Dans la partie Nord-Ouest : Le Piton des Neiges (3 069 m&egrave;tres) domine les trois cirques de Cilaos, Salazie et Mafate qui l'enserrent. Ce dernier, o&ugrave; vivent 700 habitants, est inaccessible en voiture. Ils sont le r&eacute;sultat de l effondrement et de l &eacute;rosion des flancs de l ancien volcan.
- Au sud-est : le Piton de la Fournaise (2 631m) est un volcan particuli&egrave;rement actif (de type hawa&iuml;en), qui entre en &eacute;ruption environ trois fois par an.<br>
 La Plaine des Cafres et la Plaine des Palmistes, qui se rejoignent au col de Bellevue, assurent la liaison entre les deux massifs du Piton des Neiges et du Piton de la Fournaise.<br>
<br>
La configuration de l'&icirc;le, soumis &agrave; des pluies tr&egrave;s abondantes pendant la saison humide du climat tropical (entre 2 600 et 4 000 mm dans l'Est de novembre &agrave; avril), a abouti &agrave; la formation d'innombrables "ravines" ou "rivi&egrave;res", qui descendent des sommets en alternant gorges abruptes et secteurs plus calmes, encombr&eacute;s de rochers et parfois agr&eacute;ment&eacute;s de cascades et de "bassins". L'&eacute;rosion &agrave; la R&eacute;union est une des plus fortes constat&eacute;es dans le monde, elle est irr&eacute;versible et structure les paysages et le relief typique de l'&icirc;le.
La c&ocirc;te orientale de l'&icirc;le, dite "c&ocirc;te au vent", tr&egrave;s arros&eacute;e, o&ugrave; plusieurs rivi&egrave;res, comme celles du M&acirc;t, des Marsouins, de l'Est, sont p&eacute;rennes, contraste avec la c&ocirc;te occidentale, "sous le vent", aux terres arides.<br>
<br>
 La v&eacute;g&eacute;tation de La R&eacute;union, qui compte de nombreuses esp&egrave;ces end&eacute;miques, varie en fonction de l'altitude et du climat : for&ecirc;t tropicale ou savane s&egrave;che, plantations de canne &agrave; sucre ou d'arbres fruitiers. Si la for&ecirc;t abrite d'extraordinaires foug&egrave;res arborescentes, elle est &eacute;galement riche en oiseaux multicolores.<br>&nbsp;
<br><br>

<A HREF="#a"<font color="#FF0000">haut de page</font> </A><br>
</body>
</html>