<html>
<body background="../images/fondtexte4.jpg">
<a name="a"></a>
<table>
<tr>
<td>


</td>
<td>
<font color="purple"><font size=5 face="helvetica"><a href="lareunion.html"target="description"><b>Pr&eacute;sentation de la R&eacute;union</a> ()</font><br>

</td>
</tr>
</table>
<hr>

<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Population</font></font><font size=1 face="helvetica"> ( <a href="georeunion.html" target="description">G&eacute;ographie</a> - Economie</font> <font size=1 face="helvetica"> - <a href="histoirereunion.html" target="description">Histoire</a></font><font size=1 face="helvetica"> - Produits locaux</font><font size=1 face="helvetica"> - Enfants du pays)</font></a></STRONG><BR>
</font>


<br>
Trois si&egrave;cles et demi d'histoire ont transform&eacute; l'&icirc;le d&eacute;serte !<br>
 Arriv&eacute;s au fil du temps de tous les horizons, les R&eacute;unionnais ont constitu&eacute; une soci&eacute;t&eacute; m&eacute;tiss&eacute;e, au sein duquel six groupes ethniques peuvent n&eacute;anmoins &ecirc;tre distingu&eacute;s :<br>
<br>
-&nbsp;La population d'origine africaine et malgache, appel&eacute;e commun&eacute;ment cafre (pour l'essentiel issue de la p&eacute;riode esclavagiste) trouve ses origines au Mozambique, en Guin&eacute;e et au S&eacute;n&eacute;gal. Elle est tr&egrave;s fortement m&eacute;tiss&eacute;e avec la souche europ&eacute;enne et repr&eacute;sente 35% de la population total.<br>
-&nbsp;La population blanche, d'origine europ&eacute;enne repr&eacute;sente 25% de la population total. Il convient d'y ajouter environ 5% de m&eacute;tropolitains (les "zoreils") vivant sur l &icirc;le.<br>
-&nbsp;La population d'origine indienne et de religion hindouiste, les "Malabars", est constitu&eacute;e des descendants des travailleurs "engag&eacute;s" arriv&eacute;s, de 1848 &agrave; 1882, par dizaines de milliers de la c&ocirc;te orientale de l'Inde (Coromandel) et de la c&ocirc;te de Malabar. Elle repr&eacute;sente 25% des habitants actuels.<br>
-&nbsp;Les Chinois, ayant quitt&eacute; sensiblement &agrave; la m&ecirc;me &eacute;poque la r&eacute;gion de Canton, se sont dispers&eacute;s dans tout l'oc&eacute;an Indien.&nbsp;Ils sont estim&eacute;s aujourd hui &agrave; 4% du total des R&eacute;unionnais.<br>
-&nbsp;Les Indo-musulmans du Gujerat (Nord de Bombay), venus plus tardivement, &agrave; la fin du 19&egrave;me et au d&eacute;but du 20&egrave;me si&egrave;cle, ont &eacute;galement fait souche. Leurs descendants, les "Zarabs", constituent environ 3% de la population.<br>
-&nbsp;Les originaires de Mayotte et des Comores, mais aussi les descendants des engag&eacute;s d'autres contr&eacute;es du pourtour de l'oc&eacute;an indien, que l'on est all&eacute; chercher au si&egrave;cle dernier, compl&egrave;tent cette palette humaine.<br>
<br><br>
<A HREF="#a"<font color="#FF0000">haut de page</font> </A><br>
</body>
</html>