@DATABASE opium.newmail.ru:666/12s.htm
@WORDWRAP

@NODE MAIN
@TITLE " Ave Satanas..."
 
   @{" " link "11s.guide/MAIN"}@{"../pau.gif" link "../pau.gif/MAIN"}
Назад    Черная Библия "Книга Люцифера
 (Воздух)"    @{" " link "13s.guide/MAIN"}@{"../pau0.gif" link "../pau0.gif/MAIN"}
Дальше 

Не все вампиры сосут кровь. 

&nbsp;Сатанизм представляет ответственность для ответственных, а не участие к духовным вампирам. 

&nbsp;Многие люди, попирающие эту землю, практикуют изящное искусство заставлять других чувствовать ответственность и даже обязательства перед собой безо всяких на то причин. Сатанизм рассматривает этих пиявок в их истинном свете. Духовные вампиры - это индивидуумы, сосущие из других их жизненную энергию. Этот тип людей может быть найден на всех уровнях общества. Они не выполняют никакой роли в нашей жизни и не являются ни объектами любви, ни настоящими друзьями. Однако же мы чувствуем себя обязанными этим духовным вампирам, сами не зная почему. 

&nbsp;Если вы предполагаете, что являетесь жертвой такого человека, то ниже вы найдете несколько простых правил, которые помогут вам принять правильное решение. Если вы знакомы с человеком, которому часто звоните или навещаете, даже если вам не очень хочется этого, но кажется, что будете чувствовать себя виноватым, если не сделаете этого. Или, вы находите, что постоянно делаете одолжения тому, кто не просит их открыто, а намекает? Часто духовный вампир использует обратную психологию, говоря: "О, я не могу просить вас об этом", - а вы, в свою очередь, настаиваете на том, чтобы сделать это. Духовный вампир НИКОГДА не просит ничего от вас. Это выглядело бы слишком нахально. Он просто дает знать вам о своих желаниях тайными путями, что защищает его от обвинений в паразитизме. Он "никогда и не подумал бы навязываться" и всегда доволен получить свою долю без малейших внешних колебаний! 

&nbsp;Их грехи - не свершаемые, а допускаемые. Заставляет вас чувствовать обязательства по отношению к ним не ТО, что они говорят, а то, что они НЕ говорят. Они слишком искусны, чтобы прямо просить вас, так как знают, что вы откажете им по ясным и простым причинам. 

&nbsp;Большой процент этих людей имеет специальные атрибуты, которые делают вашу зависимость от них более вероятной и эффективной. Многие духовные вампиры - инвалиды (или притворяются ими), или же "люди с эмоциональными и духовными нарушениями". Другие могут симулировать невежество и некомпетентность, так что вы из сожаления или, что более часто, - из раздражения оказываете им услуги. 

&nbsp;Традиционный путь экзорсизма дьявола или духа - выявить, чем он является на самом деле и изгнать его. Выявление этих современных демонов - единственное противоядие от их разрушительной деятельности. 

&nbsp;Многие люди принимают этих пассивно-зловещих индивидуумов за чистую монету только потому, что суть этих хитрых маневров никогда на была открыта им. Они воспринимают эти "бедные души" как более несчастливые, чем они сами и думают, что должны помочь им как могут. Это неверно направленное чувство долга (или неоткрытый комплекс вины) питает "альтруизм", на котором пируют эти паразиты! 

Духовный вампир существует благодаря тщательному подбору сознательных и добросовестных людей в качестве своих жертв - людей, глубоко осознающих свой "моральный долг". 

&nbsp;В некоторых случаях мы можем иметь дело не только с отдельными людьми, но и с целыми группами. Любая организация, собирающая деньги, будь это благотворительный фонд, муниципалитет, религиозная или творческая ассоциация и т.д., очень тщательно подбирают человека, прирожденного принуждать других, на должность председателя или координатора. Его работа заключается в том, чтобы заставить нас сначала открыть свои сердца, а затем и бумажники - получателю "добровольных пожертвований", никогда не упоминающего о том, что ИХ время не потрачено беззаветно и ими получены кругленькие суммы за их "великодушные дела". Они - мастера сыграть на сочувствии и внимании добросовестных людей. Как часто мы видим маленьких детей, посылаемых этими правоверными для безболезненного извлечения подношений от добрых людей. Кто устоит перед невинным обаянием ребенка? 

&nbsp;Есть, конечно, люди, которым неудобно не подать, но вряд ли многие из нас попадают под эту категорию. К несчастью, нам часто приходится делать вещи, которые, как нам кажется, не должны были бы от нас требоваться. Сознательный человек находит для себя очень затруднительным выбрать между добровольной и принудительной благотворительностью. Он хочет совершать правильные поступки и оказывается в затруднительном положении, пытаясь решить, кому точно он должен помочь и какая степень помощи должна ЗАКОННО ожидаться от него. Каждый человек должен решить для себя каковы его обязательства соответственно перед друзьями, семьей и обществом. До того, как пожертвовать свое время и деньги тем, кто непосредственно не входит в его семью и узкий круг друзей, он должен решить, что он может себе позволить без того, чтобы не обделить своих близких. Рассматривая все это, он должен включить СЕБЯ САМОГО в список тех, кто более всего значит для него. Прежде чем оказать помощь, необходимо тщательно оценить важность просьбы, а также личность и мотивы просящего. 

&nbsp;Для человека, всю жизнь говорившего "да", весьма сложно научиться говорить "нет". Но если он только не желает быть постоянным объектом извлечения выгоды, он должен научиться говорить "нет", когда обстоятельства требуют этого. Если же вы позволите им, духовные вампиры будут просачиваться в вашу повседневную жизнь до тех пор, пока в ней совсем не останется места личной стороне - и ваше участие к ним полностью лишит вас амбиций. 

&nbsp;Духовный вампир всегда выбирает себе в жертву человека, который относительно доволен и удовлетворен своей жизнью - человека, счастливого в браке, довольного своей работой и, в общем, неплохо приспособленного к окружающему миру - чтобы кормиться от него. Сам факт того, что духовный вампир паразитирует на счастливом человеке, указывает на то, что он сам лишен всего этого и сделает все возможное дабы вызвать неприятности и дисгармонию между своей жертвой и дорогими ей людьми. 

&nbsp;Посему, опасайтесь тех, у кого нет настоящих друзей и видимого интереса в жизни (кроме интереса к вам), Он всегда будет повторять вам, что очень разборчив в выборе друзей или не сходится с людьми легко из-за своих высоких стандартов. (Чтобы приобрести и удержать друзей, нужно быть готовым отдать себя, чего не способен сделать духовный вампир.) А он поспешит добавить, что ВЫ удовлетворяете все его требования и являетесь поразительным исключением среди прочих: вы - один из немногих, достойных его дружбы. 

&nbsp;Как бы вы не путали безнадежную любовь (которая является очень эгоистической вещью) с духовным вампиризмом, огромная разница между ними должна быть прояснена. Единственный способ определить, стали ли вы жертвой духовного вампира - взвесить все, что вы дали ему, в сравнении с тем, что он дал вам взамен. 

&nbsp;Вы можете иногда становиться раздраженными обязательствами, налагаемыми на вас вашими любимыми, друзьями или даже работодателями. Но перед тем, как назвать их духовными вампирами, вы должны спросить себя: "А что я получаю от них взамен?" Если ваша невеста или любовница настаивает на том, чтобы вы почаще звонили ей, но вы, в свою очередь требуете отчета о времени, проведенном не с вами, вы должны осознать, что это ситуация, требующая взаимных уступок. Или, скажем, если у вашего друга есть привычка звать вас на помощь в самые неподходящие моменты, но вы также можете положиться на него в случае необходимости, то следует рассматривать это как честный обмен. Если ваш начальник просит сделать вас немного больше, чем вы вправе ожидать в данном положении, но закрывает глаза на случайные опоздания или отпускает вас, когда нужно, то, без сомнения, у вас нет причин жаловаться и думать, что из вас извлекают выгоду. 

&nbsp;Вы, однако, вне сомнения попали под влияние духовного вампира, если вас без конца просят о помощи или ожидают уступок по отношению к тем, у кого в то время, как вам нужны его услуги, всегда находятся "неотложные" дела. Многие духовные вампиры могут давать вам материальные вещи, чтобы намекнуть вам, что вы должны им что-нибудь взамен, привязывая таким образом вас к себе. Различие между тем, что дают вам они и тем, что даете вы, заключается в том, что ваша ответная плата должна вернуться в невещественной форме. Они хотят чтобы вы чувствовали себя обязанными и будут разочарованы и даже обижены, если вы попытаетесь расплатиться с ними материально. По сути дела, вы "продали свою душу" им, и они теперь будут постоянно напоминать вам о вашем долге именно тем, что НЕ напоминают вам. 

&nbsp;Для настоящего Сатаниста единственный путь иметь дела с духовными вампирами - "валять дурака" и поступать так, словно они и на самом деле альтруистичны и на самом деле не ожидают ничего взамен. Проучите их, любезно принимая все. что они дают вам, благодаря их достаточно громко, чтобы слышали все, и уходите прочь! Таким образом, вы становитесь победителем, А что им остается сказать? Если же от вас все еще ожидают, что вы отплатите за их "великодушие" (вот здесь самая трудная часть!), вы говорите "НЕТ" - но снова любезно! Когда они почувствуют, что вы выскальзываете из их хватки, произойдут две вещи. Во-первых, они будут разыгрывать "подавленность", надеясь, что ваши чувства долга и сочувствия проявятся, а когда (или если) этого не произойдет, они покажут вам свою ИСТИННУЮ суть и станут злобными и мстительными. 

&nbsp;Когда вы доведете дело до этого места, ВЫ можете играть роль пострадавшей стороны, В конце концов, вы ничего не сделали неправого и, помимо этого, случается так, что вас "поджимают дела", когда они нуждаются в вас, и, раз уж ничего не ожидалось взамен их даров, то не должно быть и сильных чувств. 

&nbsp;В основном, после этого духовный вампир понимает, что его метод раскрыт и не будет проталкивать дело дальше. Он не будет продолжать тратить время на вас, а переключится на другую ничего не подозревающую жертву. Случается, однако, что духовные вампиры не отпускают своей хватки так легко и делают все возможное, чтобы помучить вас. Для этого у них есть предостаточно времени, потому что, будучи один раз отвергнутыми, они могут пренебречь всем остальным (тем малым, что у них есть), дабы посвятить каждую секунду своего бодрствования планированию мести, которой, по их убеждениям, должна быть посвящена их жизнь. По этой причине, во-первых, лучше всего избежать самой связи с такими людьми. Их "низкопоклонство" и зависимость от вас поначалу могут быть весьма лестными и их подарки весьма привлекательными, но, со временем вы поймете, что заплатили за них много больше. Не тратьте ваше время на людей, которые в итоге желают уничтожить вас, а сосредоточьте, вместо этого, свое внимание на тех, кто принимает ваше участие и сам может принять участие в ваших делах. 

&nbsp;А если же вы - духовный вампир, - берегитесь! Опасайтесь Сатанистов - они готовы и полны желания вбить вошедший в поговорку кол в ваше сердце! 
 ---

 ---

 ---

 ---

 ---

@endnode
