<html>
<body background="../../images/fondgris2.jpg" text="black" link="darkblue" vlink=darkred border="0">

<a name="a"></a>

<table>
<tr>
<td>
</td>
<td>
<font color="purple"><font size=5 face="helvetica"><a href="entetemonaco.html"target="description"><b>Pr&eacute;sentation de Monaco</b></a> </font>
</td>
</tr>
</table>

<HR>

<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Economie</font><font size=1 face="helvetica"> ( <A HREF="geomonaco.html">G&eacute;ographie</font></a><font size=1 face="helvetica"> - <A HREF="histoiremonaco.html">Histoire</font></a><font size=1 face="helvetica"> - Produits locaux</font><font size=1 face="helvetica"> - Enfants du pays)</font></a></STRONG><BR>
</font>

<BR>
<font size=3 face="helvetica">
M&ecirc;me si Monaco est un endroit tr&egrave;s appr&eacute;ci&eacute; des touristes (pour ses nombreuses manifestations sportives et culturelles, son casino et son climat agr&eacute;able), le tourisme n'arrive qu'en 3&egrave;me position dans les souces de revenus.<br>
<br>
Aujourd'hui Monaco tire la majeure partie de ses revenus de l'industrie, du commerce, des services, de l'hôtellerie et de l'immobilier.
<br>
L'&eacute;conomie reste caract&eacute;ris&eacute;e par la conservation d'un grand nombre de monopoles :<br>
commerce du tabac, r&eacute;seau de t&eacute;l&eacute;communications, r&eacute;ception de cha&icirc;nes de t&eacute;l&eacute;vision (les antennes ext&eacute;rieures sont interdites et le câble est un monopole), distribution de gaz et d'électricité, jeux d'argent, distribution d'eau, etc...<br>
<br>
L'État monégasque ne perçoit pas d'impôt sur le revenu. (seul les citoyens français installés &agrave; Monaco après 1958 sont assujetis à l'impôt en France). Seuls l'impôt direct sur le revenu des personnes physiques et l'impôt sur la fortune ne sont pas perçus, tous les autres droits et taxes sont comparables à ceux perçus par des pays tels la France.<br>
<br>

Monaco n'est pas membre de l'Union europ&eacute;enne, mais lui est fortement li&eacute;e aux travers de ses accords douaniers et mon&eacute;taires avec la France.<br>
<bR><br>
<A HREF="#a"<font color="#FF0000">haut de page</font> </A>

</body>
</html>