<html>
<body background="../../images/fondgris2.jpg" text="black" link="darkblue" vlink=darkred border="0">

<a name="a"></a>

<table>
<tr>
<td>
</td>
<td>
<font color="purple"><font size=5 face="helvetica"><a href="entetemonaco.html"target="description"><b>Pr&eacute;sentation de Monaco</b></a> </font>
</td>
</tr>
</table>

<HR>
<a name="geo"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Histoire</font><font size=1 face="helvetica"> ( <A HREF="geomonaco.html">G&eacute;ographie</font></a><font size=1 face="helvetica"> - <A HREF="ecomonaco.html">Economie</font></a><font size=1 face="helvetica"> - Produits locaux</font><font size=1 face="helvetica"> - Enfants du pays)</font></a></STRONG><BR>
</font>

<BR>
<font size=3 face="helvetica">


<b>- 6&egrave;me s&egrave;cle av. J-C :</b> Une tribu ligure habitant la r&eacute;gion aurait donn&eacute; son nom &agrave; Monaco.<br>
<br>
<b>- 1215 :</b> La R&eacute;publique de G&ecirc;nes qui a alors colonis&eacute; la ville y fait construire une forteresse.<br>
<br>
<b>- 8 janvier 1297 :</b> François Grimaldi dit « Malizia » (François le Malicieux) s'empare de la forteresse sous un déguisement de moine franciscain.<br>
<br>
<b>- 1314 :</b> L'autorit&eacute; des Grimaldi est d&eacute;finitivement reconnue.<br>
<br>

<b>- de 1793 &agrave; 1814 :</b> Monaco est intégré à la France (sous le nom de Fort Hercule).<br>
<bR>
<b>- Jusqu'en 1860 :</b> La ville est placée sous protectorat du royaume de Sardaigne (par le congrès de Vienne).<bR>
<br>


<b>- 1861 :</b> un trait&eacute; franco-mon&eacute;gasque assure la souverainet&eacute; de Monaco.<br>
<br>

<b>- En 1848 :</b> Les communes françaises de Menton et Roquebrune (qui faisaient alors partie de la principaut&eacute;) se soul&egrave;vent et se proclament villes libres.<br>
<br>
<b>- 1861 :</b> Les communes de Menton et Roquebrune sont rattach&eacute;es &agrave; la France.<br>
<br>
<b>- 1911 :</b> L'octroi de la constitution fait du pays une monarchie constitutionnelle.<bR>
<br>
<b>- Juillet 1918 :</b> un traité (faisant parti du traité de Versailles),accorde une protection limitée de la principauté par la France... le petit État devra s'aligner sur les intérêts politiques, militaires et économiques de la France.<br>
<br>
<b>- 1962 :</b> abolition de la peine de mort, droit de vote des femmes et mise en place d'une cour suprême garantissant les libertés fondamentales.<br>
<br> 
<b>- 1993 :</b> Monaco devient officiellement membre des Nations unies.<br>
<br>

<b>- 2001 :</b> Agrandissement du port d'Hercule en installant une digue flottante utilis&eacute;e par les bateaux de croisi&egrave;re.<br>
<br>
<b>- 2002 :</b> Un nouveau trait&eacute; entre la France et Monaco renforce le caract&egrave;re souverain et ind&eacute;pendant de la Principaut&eacute;.<br>
<br>
<b>- 2004 :</b> La principaut&eacute; de Monaco rejoint le Conseil de l'Europe.<br>
 



 
<bR><br>
<A HREF="#a"<font color="#FF0000">haut de page</font> </A>

</body>
</html>