
/*                       THIS IS PUBLIC DOMAIN. */

/* A simple means of running the PWM program using AREXX. */
/* Ensure PWM-LMB.EXE is in the the same drawer as this ARexx script. */
/* A simple idea from B.Walker, G0LCU. */

ADDRESS COMMAND 'PWM-LMB.EXE'

ECHO 'a'x'a'x'                        Left click the close gadget.'
