<!-- This HTML file has been created by texi2html 1.29af
     from ../AmigaFAQg.texinfo on 24 October 1995 -->

<TITLE>Amiga-FAQ - A1200-HD</TITLE>

<PRE><I>
&lt;&lt; <A HREF="AmigaFAQg_3.html">FPU</A>
&gt;&gt; <A HREF="AmigaFAQg_5.html">Betriebssystem</A>
<HR>
</I></PRE>

<A NAME="IDX9"></A>
<A NAME="IDX10"></A>
<H2><A NAME="SEC4" HREF="AmigaFAQg_toc.html#SEC4">Kann ich eine 3.5'-Festplatte im A1200 verwenden?</A></H2>
Viele Leute w&uuml;rden statt der im A1200 &uuml;blichen 2.5"-Festplatten
lieber eine 3.5"-Festplatte verwenden, da diese viel billiger
sind. Das ist auch m&ouml;glich, allerdings braucht man ein spezielles
Kabel, um die Festplatte an den eingebauten IDE-Controller
anzuschlie&szlig;en. Au&szlig;erdem sollte man isolierendes Material zwischen
die Festplatte und die Platine schieben. Es gibt Berichte &uuml;ber
thermische Probleme, aber ich habe nichts davon bemerkt.
<P>
Einige H&auml;ndler bieten f&uuml;r ca. 40-50DM Kabel, Isoliermaterial und
Informationen an, was sicherlich empfehlenswert ist. In den
&uuml;blichen Magazinen sollte man diesbez&uuml;gliche Anzeigen finden.
<P>
Thomas Schuh (thomas@stepout.tynet.sub.org)
<P>
Grunds&auml;tzlich sollte man beim Einbau von IDE-Festplatten (egal ob
2.5" oder 3.5") bedenken, da&szlig; man au&szlig;er bei den von Commodore
getesteten und freigegebenen Modellen und ROM-Versionen nicht sicher
sein kann, da&szlig; sie problemlos funktionieren werden. Beim A1200 sollte
man zus&auml;tzlich noch ber&uuml;cksichtigen, da&szlig; der Einbau von 3.5"-
Festplatten in diesen Rechner von Commodore nicht vorgesehen war und
die haupts&auml;chlich f&uuml;r den Einsatz in Notebooks konstruierten 2.5"-
Festplatten einige Vorteile haben k&ouml;nnen (z. B. bei Stromverbrauch,
Hitzeentwicklung oder Sto&szlig;festigkeit), die im engen Tastaturgeh&auml;use
des A1200 mit der begrenzten Stromversorgung relevant sein k&ouml;nnten.
Mit dem gr&ouml;&szlig;eren Format verschlechtert sich eventuell auch die
Bel&uuml;ftung des Rechners. Werden beim Einbau Manipulationen an den
Abschirmblechen vorgenommen, sind m&ouml;glicherweise auch die
Bestimmungen zur Funkentst&ouml;rung nicht mehr erf&uuml;llt.
<P>
Kurz gesagt: k&ouml;nnte man 3.5"-Festplatten wirklich ohne jedes Problem
im A1200 verwenden, h&auml;tte Commodore selbst bestimmt auch diese statt
der etwas teureren 2.5"-Festplatten im A1200-HD verwendet.
<P>

<PRE><I>
<HR>
&lt;&lt; <A HREF="AmigaFAQg_3.html">FPU</A>
&gt;&gt; <A HREF="AmigaFAQg_5.html">Betriebssystem</A>
</I></PRE>
