<!-- This HTML file has been created by texi2html 1.29af
     from ../AmigaFAQg.texinfo on 24 October 1995 -->

<TITLE>Amiga-FAQ - Font-Formate</TITLE>

<PRE><I>
&lt;&lt; <A HREF="AmigaFAQg_51.html">Fonts</A>
&gt;&gt; <A HREF="AmigaFAQg_53.html">Font-Quellen</A>
<HR>
</I></PRE>

<H3><A NAME="SEC52" HREF="AmigaFAQg_toc.html#SEC52">Die Amiga Font Formate</A></H3>
<P>
<OL>
<P>
<LI>Agfa IntelliFont (Endung .type oder .lib) ist das Standard Font-Format auf dem
  Amiga. Man kann es in jeder beliebigen Anwendung benutzen, und es kann in einen
  Bitmap-Font konvertiert werden. Dies geschieht mit den Utilities <TT>`IntelliFont'</TT> (OS 3.x)
  oder <TT>`Fountain'</TT> (OS 2.x).
<P>
<LI>Postscript Type 1 Fonts werden von vielen Anwendungen unterst&uuml;tzt,
  vor allem die Textverarbeitungs- und DTP-Programme. Es gibt zwei Arten des
  Type 1 Formats: Bin&auml;r &#38; ASCII (Endung .pfb &#38; .pfa). Die Software auf dem Amiga
  unterst&uuml;tzt das bin&auml;re Format, welches auch unter Windows benutzt wird.
  Das ASCII-Format wird auf Macintosh benutzt. Es ist sehr einfach, zwischen
  diesen Formaten zu konvertieren (z.B. mit TypeSmith oder PFB2PFA). Zus&auml;tzlich gibt es
  noch die Metrics Dateien mit den Endungen .afm oder .pfm. Sie enthalten Informationen
  &uuml;ber die Gr&ouml;&szlig;e (Breite) der einzelnen Zeichen. Die meisten Programme ben&ouml;tigen diese
  Datei im selben Verzeichnis wie die Font-Datei.
<P>
<LI>Postscript Type 3 Fonts (Endung: .ps oder nichts) werden nicht so h&auml;ufig auf dem
  Amiga benutzt, aber dennoch unterst&uuml;tzen einige Anwendungen dieses Format (z.B.
  PageStream). Es gibt auch verschiedene Drucker-Download-Tools aus dem
  PD-Bereich.
<P>
<LI>Truetype Fonts (Endung: .ttf) werden auf dem Amiga nicht sehr h&auml;ufig benutzt. Es
  gibt eine Textverarbeitung, die dieses Format unterst&uuml;tzt (Wordworth 3.0).
  Aufgrund der niedrigeren Qualit&auml;t dieses Formats benutzen Amiga-Anwender
  lieber eine h&ouml;here Qualit&auml;t f&uuml;r ihre DTV- und DTP-Anwendungen und ihre
  Textverarbeitungen... Es gibt hier ebenfalls zwei Formate: Mac &#38; Windows.
  Die Amiga-Software benutzt hier ebenfalls das Windows-Format.
<P>
<LI>DMF Fonts sind das Standard Font-Format von PageStream (Endung: .dmf), und da
  PageStream der Marktf&uuml;hrer unter den DTP Programmen auf dem Amiga ist, ist dieses
  Format relativ h&auml;ufig anzutreffen.
<P>
<LI>Bitmap Fonts (Endung: .font und Zahlen in einem Verzeichnis mit Namen des Fonts,
  manchmal auch .otag, wenn es von einem IntelliFont konvertiert wurde) wurden unter OS
  1.x benutzt und sind seit OS 2.0 durch das IntelliFont Format ersetzt worden, welches
  eine h&ouml;here Qualit&auml;t besitzt. Man kann jedoch immer noch Bitmap Fonts benutzen,
  welches gerade f&uuml;r kleinere Gr&ouml;&szlig;en besser ist. Fuer Ausdrucke sollte man jedoch
  eines der obengenannten Vector Font-Formate benutzen, da die Qualit&auml;t sehr viel
  h&ouml;her ist.
<P>
<LI>Colour Bitmap Fonts (=Farbige Bitmap Fonts) werden auch sehr h&auml;ufig auf
  dem Amiga benutzt (Endung wie Bitmap Fonts, jedoch die Zahlen haben am Ende noch ein C,
  z.B. 35C), vor allem in DTV Anwendungen, wie z. B. dem Video Toaster und Scala.
<P>
</OL>
<P>

<PRE><I>
<HR>
&lt;&lt; <A HREF="AmigaFAQg_51.html">Fonts</A>
&gt;&gt; <A HREF="AmigaFAQg_53.html">Font-Quellen</A>
</I></PRE>
