<!-- This HTML file has been created by texi2html 1.29af
     from ../AmigaFAQg.texinfo on 24 October 1995 -->

<TITLE>Amiga-FAQ - Druckersteuerung</TITLE>

<PRE><I>
&lt;&lt; <A HREF="AmigaFAQg_27.html">Compiler</A>
&gt;&gt; <A HREF="AmigaFAQg_29.html">AmigaBasic</A>
<HR>
</I></PRE>

<A NAME="IDX62"></A>
<A NAME="IDX63"></A>
<H2><A NAME="SEC28" HREF="AmigaFAQg_toc.html#SEC28">Warum funktioniert keine Esc-Sequenz?</A></H2>
Viele Drucker kommen mit einem Handbuch, das erkl&auml;rt, welche
<KBD>Esc</KBD>-Sequenzen welche Funktion ausl&ouml;sen. Aber wenn man diese Sequenzen
dann einmal ausprobiert, passieren oft merkw&uuml;rdige Sachen, n&auml;mlich entweder
gar nichts oder etwas ganz anderes, als geplant war. Und das hat auch
einen Grund, n&auml;mlich die Amiga-Druckertreiber. Diese Treiber sind so
gebaut, da&szlig; sie nur einen bestimmten Satz <CODE>ANSI-Esc-Sequenzen</CODE>
verstehen, nicht die (verschiedenen) druckereigenen, von den verschiedenen
Druckerherstellern definierten. Der Sinn dabei ist, da&szlig; jede Anwendung
auf dem Amiga nur diesen einen Standardsatz an Sequenzen verwendet und
so nicht zu wissen braucht, welcher Drucker tats&auml;chlich angeschlo&szlig;en
ist. Der Druckertreiber &uuml;bersetzt dann diese Standardsequenzen in die
druckereigenen. Eine Liste der verf&uuml;gbaren ANSI-Esc-Sequenzen findet
sich im aktuellen Workbench-Handbuch (oder in &auml;lteren
AmigaDOS-Handb&uuml;chern). Wenn Du nun eine Steuersequenz an den Drucker schicken
willst, die es nicht als ANSI-Sequenz gibt, so hast Du zwei M&ouml;glichkeiten,
dies doch zu erreichen:
<OL>
<LI>Umgeh den Druckertreiber (der erfolglos versuchen w&uuml;rde, die Sequenz
zu interpretieren oder zu &uuml;bersetzen) und sende die Ausgabe <STRONG>nur</STRONG>
f&uuml;r die L&auml;nge dieser Sequenz an <TT>`PAR:'</TT> (bzw. <TT>`SER:'</TT>). Dabei
mu&szlig; man die Druckerausgabekan&auml;le umst&auml;ndlich oft umschalten, und man mu&szlig;
wissen, wo der Drucker angeschlossen ist (<TT>`PAR:'</TT> oder <TT>`SER:'</TT>).
<LI>Benutze eine spezielle ANSI-Sequenz, genau f&uuml;r diesen Fall gedacht:
<PRE>
    <SAMP>`Esc[&#60;n&#62;"&#60;x&#62;'</SAMP>
</PRE>
wobei <SAMP>`&#60;n&#62;'</SAMP> die dezimal geschriebene Anzahl an Bytes in der Sequenz
<SAMP>`&#60;x&#62;'</SAMP> ist, die gerade die spezielle Drucker-Sequenz enth&auml;lt. Diese
ANSI-Sequenz sagt dem Druckertreiber, da&szlig; er die n&auml;chsten <SAMP>`&#60;n&#62;'</SAMP> Bytes
nicht interpretieren oder &uuml;bersetzen soll.
</OL>
Aber beide Methoden haben einen grossen Nachteil, wenn sie in einem
Anwendungsprogramm verwendet werden: Man verliert die
Druckerunabh&auml;ngigkeit! Solange man sich an die ANSI-Sequenzen h&auml;lt, kann
man jeden Drucker
der Welt ansteuern, solange es einen Amiga-Druckertreiber f&uuml;r ihn gibt.
Wenn man anf&auml;ngt, druckereigene Sequenzen zu verwenden, ist das Programm
an diesen einen Druckertyp gebunden und mit keinem anderen benutzbar
(oder man m&uuml;&szlig;te einige dutzend neue Druckertreiber f&uuml;r dieses Programm
erstellen).
<P>
Dr. Peter Kittel, peterk@cbmger.de.so.commodore.com
<P>

<PRE><I>
<HR>
&lt;&lt; <A HREF="AmigaFAQg_27.html">Compiler</A>
&gt;&gt; <A HREF="AmigaFAQg_29.html">AmigaBasic</A>
</I></PRE>
