<!-- This HTML file has been created by texi2html 1.29af
     from ../AmigaFAQg.texinfo on 24 October 1995 -->

<TITLE>Amiga-FAQ - TeX</TITLE>

<PRE><I>
&lt;&lt; <A HREF="AmigaFAQg_48.html">DTP</A>
&gt;&gt; <A HREF="AmigaFAQg_50.html">PostScript</A>
<HR>
</I></PRE>

<A NAME="IDX107"></A>
<H2><A NAME="SEC49" HREF="AmigaFAQg_toc.html#SEC49">Was ist TeX und wo bekomme ich es?</A></H2>
TeX ist eines der m&auml;chtigsten Textverarbeitungssysteme, die es gibt.
Es kann praktisch beliebige mathematische Formeln ebenso darstellen wie
komplexe Tabellen, Funktionen plotten (mit Hilfsprogrammen), Indexe oder
Inhaltsverzeichnisse erzeugen und viele andere Dinge. Sein gr&ouml;&szlig;ter Vorteil
ist, da&szlig; es frei kopierbar ist (TeX selbst, nicht unbedingt die
Drucker- und Bildschirmtreiber) und sich dadurch auf der ganzen Welt und
auf praktisch jeder Computerfamilie verbreitet hat. Sein gr&ouml;&szlig;ter Nachteil
ist, da&szlig; es sehr unhandlich und schwer zu erlernen ist (Es arbeitet
&auml;hnlich wie ein Compiler) und keinerlei Wysiwyg-F&auml;higkeiten hat.
Aber viele Leute m&ouml;gen es. (Dieser Text ist &uuml;brigens mit TeX erstellt
worden. 8-) ) Siehe Abschnitt <A HREF="AmigaFAQg_47.html#SEC47">Was f&uuml;r Textverarbeitungsprogramme gibt es?</A>.
<P>
Es gibt im wesentlichen zwei Implementationen auf dem Amiga. Amiga-TeX
von Thomas Rockicki und Radical Eye Software ist kommerziell und kostet etwa
200-300$. Es soll wirklich exzellent sein und seine Besitzer schw&ouml;ren
darauf.
<P>
Ich pers&ouml;nlich empfehle PasTeX, eine frei kopierbare Version. Es gibt
immer wieder Leute, die &uuml;ber Installationsprobleme klagen (besonders, was
das Laden und die automatische Erzeugung von Fonts angeht), aber ich kenne
niemanden, der unzufrieden ist, nachdem es erst einmal installiert ist.
(Ein Freund mit TeX-Kenntnissen kann enorm hilfreich sein.) Wenn man
sich an die Vorgaben des Installationsskripts h&auml;lt, sollte es eigentlich
keine Probleme geben. Wesentlich ist allerdings, da&szlig; man alles N&ouml;tige
installiert und dazu braucht man:
<UL>
<LI>5 Disketten mit dem eigentlichen TeX-Compiler
<LI>2 Disketten mit MetaFont
<LI>Nichts weiter
</UL>
J&ouml;rgen Grahn hat beschrieben, wie er LaTeX auf dem Amiga in Betrieb genommen
hat. Seine Beschreibung findet man auf dem Aminet, <TT>`text/tex/UsingLaTeX.lha'</TT>.
<P>
Viele Leute fragen nach Fonts. Diese sind Teil des MetaFont-Paketes und
werden automatisch erzeugt, wenn sie gebraucht werden, vorausgesetzt
nat&uuml;rlich, da&szlig; TeX so wie in der Dokumentation beschrieben installiert
ist. (Das Erzeugen der Fonts kann am Anfang nat&uuml;rlich dauern, bis die
wichtigsten erst mal da sind.) Bitte beachten Sie, da&szlig; die PasTeX-Disketten
mit Zoom gepackt sind. (siehe Abschnitt <A HREF="AmigaFAQg_71.html#SEC71">Was sind Dateien, die mit ... enden?</A>) PasTeX bekommt man per FTP
z.B. bei <CODE>ftp.uni-passau.de</CODE> im Directory
<TT>`/pub/amiga/tex/PasTeX1.3'</TT> und durch die Fish-CDs.
<P>

<PRE><I>
<HR>
&lt;&lt; <A HREF="AmigaFAQg_48.html">DTP</A>
&gt;&gt; <A HREF="AmigaFAQg_50.html">PostScript</A>
</I></PRE>
