<!-- This HTML file has been created by texi2html 1.29af
     from ../AmigaFAQg.texinfo on 24 October 1995 -->

<TITLE>Amiga-FAQ - Japanisch</TITLE>

<PRE><I>
&lt;&lt; <A HREF="AmigaFAQg_60.html">Nicht-Latin</A>
&gt;&gt; <A HREF="AmigaFAQg_62.html">Chinesisch</A>
<HR>
</I></PRE>

<A NAME="IDX109"></A>
<A NAME="IDX110"></A>
<A NAME="IDX111"></A>
<A NAME="IDX112"></A>
<A NAME="IDX113"></A>
<H3><A NAME="SEC61" HREF="AmigaFAQg_toc.html#SEC61">Japanische Editoren und Anzeigeprogramme</A></H3>
ANS (Amiga Nihongo System) Version 1.0 von
<PRE>
    SoftHouse Tecnode
    102 Coupo Izumi
    1-4-5 Houya-shi
    Izumi-machi
    Tokyo 202
    JAPAN
</PRE>
wird in Japan von MIQ Japan, Ltd. vertrieben. Es bietet eine
japanische Arbeitsumgebung, ist kompatibel zu AmigaOS 1.3 und 2.0 und
braucht allerdings wenigstens 1MB RAM. (Mehr ist sinnvoll) ANS
erlaubt japanische Fenster und Men&uuml;s (die die englischen Men&uuml;s
ersetzen), japanische Bitmapfonts (12 und 24 Pixel), Jinput/Joutput
(die gemeinsam eine Japanische Textbearbeitung erlauben),
XEDmini (ein einfacher japanischer Editor mit eingebautem Fonteditor,
den man auch als japanisches Terminal verwenden kann), ein Kana-Kanji
Konversionsw&ouml;rterbuch f&uuml;r XEDmini und JInput, Jfilter (mit dem man
japanische Files anschauen kann, w&auml;hrend man mit einer MS-DOS-Konsole
verbunden ist), und einigen Utilities zur Konversion und Kommunikation.
XEDmini ben&uuml;tzt pcj (Japanische Version von pcd) zur Kommunikation,
kann also Uploads oder Downloads durchf&uuml;hren, w&auml;hrend eine Datei
bearbeitet wird. Es soll angeblich einigerma&szlig;en billig und recht einfach
bedienbar sein.
<P>
JemTeX ist ein Pr&auml;prozessor, der eine Datei mit japanischem Text in
gew&ouml;hnliche TeX/LaTeX-Dateien &uuml;bersetzt. Das Archiv enth&auml;lt unter
anderem auch das Utility jis2mf und einen 24-Punkte Kanji-Font sowie ein
Programm, mit dem man Kanji-Tabellen erstellen kann.
Mit jis2mf kann man den Bitmap-Font in Metafont-Dateien &uuml;bersetzen.
JemTeX v2.0 sollte man auf jedem Amiga mit SAS/C compilieren
oder auch auf UNIX-Maschinen mit gcc. Man erh&auml;lt das Programm per FTP
von utsun.s.u-tokyo.ac.jp (133.11.11.11). Geschrieben ist es von
Francois Jalbert (jalbert@iro.umontreal.ca oder jalbert@cs.ubc.ca).
<P>
Die folgenden Programme k&ouml;nnen allesamt Texte anzeigen und sind auf dem
Aminet (Directory text/show) zu finden:
<P>
JIStoJi von Bart Mathias erkennt Texte in Old-JIS, New-JIS, Shift-JIS
oder EUC-JIS (aber auch ASCII) und zeigt sie auf einem eigenen Screen
an. Es beherrscht auch Ausgabe auf Drucker und l&auml;uft ab Kickstart 1.3.
<P>
jmore (Japanese more) ist ein More-Clone, der auch Texte in ns-kanji
(Shift-JIS) beherrscht. Er er&ouml;ffnet ebenfalls einen eigenen Screen
(Interlace) und ben&ouml;tigt einen Font-Handler namens jFontSys. Das Archiv
ent&auml;dlt jmore, jFontsys und einen Bitmap-Font namens wlook/16.
Kanji-Fonts braucht man au&szlig;erdem auch noch. (Aminet,
<TT>`text/font/amknj16.lzh'</TT>) Die gesamte Dokumentation kommt als
japanischer Text, d.h. man ben&ouml;tigt jmore selbst, um sie
anzuzeigen. Deshalb hier in aller K&uuml;rze die Installationsprozedur:
<OL>
<LI>Kopieren Sie den <CODE>wlook/16</CODE> nach <TT>`FONTS:'</TT>.
<LI>Erstellen Sie einen Assign <TT>`JFONTS:'</TT>, der in das Directory
zeigt, in dem die amknj16-Fonts stehen. Dies mu&szlig; nicht unbedingt
identisch mit <TT>`FONTS:'</TT> sein.
<LI>Kopieren Sie <TT>`jFont-startup'</TT> nach <TT>`S:'</TT>.
<LI>F&uuml;gen Sie die folgende Zeile in <TT>`s:User-Startup'</TT> ein:
<PRE>
    run &#62;nil: jFontSys
</PRE>
<LI>Um jmore zu benutzen, geben Sie das folgende Kommando ein:
<PRE>
    jmore &#60;japanese.txt&#62;
</PRE>
</OL>
<P>
JISconvert von Dwight Hubbard ist schlie&szlig;lich noch ein Utility zur
Konversion von Texten zwischen EUC, New JIS, Old JIS, NEC JIS und
Shift JIS. Es hat auch Optionen, mit denen halbgro&szlig;es Katakana
in volle Gr&ouml;&szlig;e umgewandelt werden kann oder mit denen man
Dateien reparieren kann, aus denen die ESC-Zeichen entfernt wurden.
Das Programm l&auml;uft ab AmigaDOS 2.04.
<P>

<PRE><I>
<HR>
&lt;&lt; <A HREF="AmigaFAQg_60.html">Nicht-Latin</A>
&gt;&gt; <A HREF="AmigaFAQg_62.html">Chinesisch</A>
</I></PRE>
