<!-- This HTML file has been created by texi2html 1.29af
     from ../AmigaFAQg.texinfo on 24 October 1995 -->

<TITLE>Amiga-FAQ - Compiler</TITLE>

<PRE><I>
&lt;&lt; <A HREF="AmigaFAQg_26.html">Developer</A>
&gt;&gt; <A HREF="AmigaFAQg_28.html">Druckersteuerung</A>
<HR>
</I></PRE>

<A NAME="IDX49"></A>
<H2><A NAME="SEC27" HREF="AmigaFAQg_toc.html#SEC27">Was f&uuml;r Compiler (und Assembler) gibt es?</A></H2>
Es gibt viele Programmiersprachen auf dem Amiga, kommerzielle Compiler ebenso
wie frei kopierbare. Ich m&ouml;chte nur diejenigen aufz&auml;hlen, die mir bekannt
sind oder die ich aus einem anderem Grund f&uuml;r erw&auml;hnenswert halte.
<P>
<DL COMPACT>
<A NAME="IDX50"></A>
<DT><STRONG>Assembler</STRONG>
<DD>Alle C-Compiler beinhalten einen Assembler. Frei kopierbar und zuverl&auml;ssig
sind A68K und PhxAss. (Aminet, Directory <TT>`dev/asm'</TT> oder Fish-Disks
521 bzw. 906)
<P>
Kommerzielle Assembler sind MaxonASM, OMA3.0 und DevPack3.14.
<P>
<A NAME="IDX51"></A>
<DT><STRONG>Basic</STRONG>
<DD>Derzeit sind folgende kommerzielle Basic-Compiler/Interpreter verf&uuml;gbar:
BlitzBasic2, Amos und MaxonBasic3.
<P>
<DT><STRONG>C</STRONG>
<DD><A NAME="IDX52"></A>
<A NAME="IDX53"></A>
<DT><STRONG>C++</STRONG>
<DD>Frei kopierbare C-Compiler sind der <CODE>gcc</CODE> (der sein eigenes Directory
<TT>`dev/gcc'</TT> auf dem Aminet hat) und die Probeversion (mit der man aber
schon eine ganze Menge anfangen kann) von <CODE>Dice</CODE> (per FTP von
<CODE>ftp.uni-paderborn.de</CODE>, Directory
<TT>`/news/comp.binaries.amiga/volume91/languages'</TT> oder auf Fish disk 491).
Der gro&szlig;e Vorteil von gcc ist, da&szlig; man ihn auf der ganzen Welt
und auf nahezu jedem Computer findet. Ein weiterer Vorteil ist, da&szlig; er sogar
einen C++-Compiler enth&auml;lt! Aber er ist langsam und ben&ouml;tigt 4MB RAM oder
mehr. Siehe Abschnitt <A HREF="AmigaFAQg_35.html#SEC35">Der GNU C Compiler: Allgemeine Informationen und Installation</A>. Siehe Abschnitt <A HREF="AmigaFAQg_86.html#SEC86">Diskussionen &uuml;ber Mail</A>.
<P>
Kommerzielle C-Compiler sind <CODE>Aztec-C</CODE>, <CODE>Dice</CODE>, <CODE>SAS-C</CODE>
und <CODE>MaxonC++</CODE>.
<CODE>Aztec-C</CODE> wird jedoch leider nicht mehr weiterentwickelt.
Was die kommerziellen Compiler auszeichnet, sind ihre hervorragenden
Source-Level-Debugger, die den anderen fehlen.
<P>
SAS hat leider angek&uuml;ndigt, den Amiga-Compiler nicht weiter zu
unterst&uuml;tzen. Verkauft wird er aber noch, und da er gegenw&auml;rtig noch
voll aktuell ist und sogar einen Crosscompiler von C++ in C enth&auml;lt
(der vom Debugger unterst&uuml;tzt wird),
ist er meines Erachtens derzeit das beste Angebot, insbesondere zu dem
&auml;u&szlig;erst g&uuml;nstigen Preis von 184.-DM f&uuml;r Studenten und Besitzer anderer
Compiler. In Deutschland erh&auml;lt man SAS/C bei
<PRE>
    SAS Institute, Inc.         SAS Institute GmbH
    Book Sales                  Postfach 10 53 40
    SAS Campus Drive            69043 Heidelberg
    Cary, NC 27513              Deutschland
    USA

    Phone: (919)677-8000        Telefon: 06221/4160
    EMail: sasdsb@vm.sas.com    EMail: eurdoc2@vm.sas.com
</PRE>
<P>
Dice bietet wie SAS einen Sonderpreis f&uuml;r Sch&uuml;ler und Studenten von
ca. 130.-DM. Der Compiler ist stabil und vor allem sehr schnell.
Der gr&ouml;&szlig;te Nachteil von Dice ist (verglichen mit den anderen
kommerziellen Compilern) der Debugger, ein sogenannter
Source-Line-Debugger: Dies bedeutet, da&szlig; man den Quelltext sieht
und das Programm Schritt f&uuml;r Schritt abarbeiten kann, aber leider
nur Speicher und nicht etwa bestimmte Variablen anzeigen kann.
Informationen &uuml;ber Dice: info@oic.COM.
<P>
Comeau C++ ist ebenfalls ein Crosscompiler, was an und f&uuml;r sich kein
Problem w&auml;re. Aber Comeau C++ hat keinen integrierten C-Compiler,
man braucht also zus&auml;tzlich SAS-C, Aztec-C oder Dice. Daf&uuml;r ist er
kompatibel zu AT&#38;T cfront 3.0, unterst&uuml;tzt Exceptions und l&auml;uft wie
<CODE>gcc</CODE> auf vielen verschiedenen Systemen. In Deutschland wird auch
Maxxon C++ angeboten, &uuml;ber das ich nichts sagen kann. Beide Compiler
sind kommerziell. Comeau's Adresse ist:
<PRE>
    Comeau computing
    91-34, 120th Street
    Richmond Hill, NY, 11418-3214
    USA

    EMail: Greg Comeau, comeau@bix.com
</PRE>
<P>
MaxonC++ ist sowohl ein C++ als auch ein C Compiler. Es gibt eine
Light-Version f&uuml;r ca. 190 DM und eine Developer-Version f&uuml;r ca. 450 DM.
Die Developer-Version entspricht dem AT&#38;T-Standard 3.0.
Maxon-Light enth&auml;lt einen Compiler und einen Editor.
Developer umfa&szlig;t einen Source-Level-Debugger, eine Amiga-Klassenbibliothek
und Hot Help mit Dokumenten zu den Amiga-Libs.
Da es ein deutsches Produkt ist, sind Compiler und Dokumentation in
Deutsch gehalten. Der Compiler besitzt einige kleinere Fehler,
trotzdem kann man mit ihm gut arbeiten.
<P>
<A NAME="IDX54"></A>
<DT><STRONG>Forth</STRONG>
<DD>JForth soll eine exzellente Forth-Version sein. Unter anderem enth&auml;lt es
objektorientierte Erweiterungen, ein volles Amiga-Interface und einen
Anwendungsgenerator. Es ist erh&auml;ltlich von:
<PRE>
    Delta Research
    P.O. Box 151051
    San Rafael, CA   94915-1051

    Phone: (415) 453-4320
    EMail: Phil Burk, phil@ntg.com
           Mike Haas, haas@starnine.com
</PRE>
<P>
<A NAME="IDX55"></A>
<DT><STRONG>Fortran</STRONG>
<DD>(Seufz! Es gibt immer noch Leute, die es brauchen :-&#60;) Frei kopierbar sind
BCF (Fish disk 470) und f2c, der Fortran in C-Quelltext umwandelt.
(Aminet, Directory <TT>`/dev/lang'</TT>). Ein kommerzieller Compiler ist von
ABSoft erh&auml;ltlich. Allerdings sind dies alles nur Fortran-77-Compiler,
es gibt keine Fortran-90-Compiler auf dem Amiga.
<P>
<A NAME="IDX56"></A>
<DT><STRONG>Lisp</STRONG>
<DD>Frei kopierbare Lisp-Interpreter sind XLisp (Fish-Disk 181) und OakLisp
(Fish-Disks 519 und 520) und CLISP (<TT>`/pub/lisp/clisp/binaries/amiga'</TT> at
<TT>`ma2s2.mathematik.uni-karlsruhe.de'</TT>). Auch Compiler gibt es: Gambit
(Fish-Disks 764 und 765) sowie Scheme-to-C (Fish-Disks 556-558). Von
Interesse ist vielleicht eine Mail-Liste: Senden Sie dazu eine Mail mit dem
Wort <SAMP>`Subscribe'</SAMP> an <CODE>amigalisp@contessa.phone.net</CODE>.
<P>
<A NAME="IDX57"></A>
<DT><STRONG>Prolog</STRONG>
<DD><TT>`/dev/lang/UNSWProlog.lha'</TT> und <TT>`dev/lang/sbp3_1e'</TT> auf dem Aminet
sowie <TT>`SBProlog'</TT> auf der Fish-Disk 141 und <TT>`SBProlog'</TT> auf der
Fish-Disk 145 sind frei kopierbare Prolog-Interpreter.
<P>
<A NAME="IDX58"></A>
<DT><STRONG>Modula-2</STRONG>
<DD>M2Amiga wird in Europa und Benchmark Modula-2 in den USA angeboten. Beide
sollen sehr gut sein und sowohl &uuml;ber gute Source-Level-Debugger als auch
eine umfangreiche Bibliothek verf&uuml;gen. Besonders M2Amiga wird sehr gut
unterst&uuml;tzt durch eine deutsche Benutzergruppe (AMOK), die z.B. eine eigene
PD-Serie anbieten. Siehe Abschnitt <A HREF="AmigaFAQg_86.html#SEC86">Diskussionen &uuml;ber Mail</A>.
<P>
M2Amiga bekommt man bei
<PRE>
    A+L AG
    Daderiz 61
    2540 Grenchen
    Schweiz

    Tel.: +41/65/52 03-11
    Fax:              -79
</PRE>
und Benchmark Modula-2 ist erh&auml;ltlich von:
<PRE>
    Armadillo Computing
    5225 Marymount Drive
    Austin, Texas 78723
    USA

    Phone/FAX: 512/926-0360.
    EMail: Jim Olinger, jolinger@bix.com
</PRE>
<P>
<DT><STRONG>Oberon</STRONG>
<DD><A NAME="IDX59"></A>
<A NAME="IDX60"></A>
<DT><STRONG>Oberon-2</STRONG>
<DD>Es gibt zwei Oberon-2-Compiler f&uuml;r den Amiga: AmigaOberon ist wie M2Amiga
von A+L und kommerziell. Der Compiler kommt mit einer integrierten
Entwicklungsumgebung (incl. freikonfigurierbarem Editor) und
umfangreicher Modulbibliothek. Library Linker zum einfachen Erzeugen
von AmigaOS Shared Libraries sowie Run-time Source-Level-Debugger
sind ebenfalls erh&auml;ltlich.
<P>
Oberon-A ist ein Freeware-Compiler, allerdings erst in einer Beta-Version,
insbesondere sind die Modulbibliotheken unvollst&auml;ndig. (Quelle: Aminet,
Directory <TT>`dev/obero'</TT>). Siehe Abschnitt <A HREF="AmigaFAQg_86.html#SEC86">Diskussionen &uuml;ber Mail</A>.
<P>
F&uuml;r beide Compiler gibt es Unmengen von Modulen und Bsp.-Sourcen auf
AMOK-Disks.
<P>
Zus&auml;tzlich zu den beiden Standalone-Compilern, die vor allem zum
Entwickeln von AmigaOS-Applikationen geeignet sind, existiert noch
eine Portierung des Oberon System V4, das ebenfalls einen Oberon-2
Compiler beinhaltet. Das Oberon System l&auml;uft auf dem Amiga als ein
AmigaOS-Task auf einem eigenen Screen. Hiermit kann man Software
entwickeln, die auch auf allen anderen Implementierungen des Oberon
System V4 (z.B. f&uuml;r Macintosh, Windows oder Sparc) nahezu ohne jede
&Auml;nderung lauff&auml;hig ist.
<P>
<A NAME="IDX61"></A>
<DT><STRONG>Pascal</STRONG>
<DD>Es gibt einen PD-Compiler namens PCQ (Aminet, Directory <TT>`dev/lang'</TT> oder
Fish-Disk 511), der allerdings kein voller Pascal-Compiler ist und dem
sehr wesentliche Dinge fehlen. P2C konvertiert Pascal in C und ist auf
der Fish-Disk 341 zu finden. (Aminet: <TT>`/dev/misc/p2c120.lha'</TT>) Ferner gibt
es zwei kommerzielle Compiler namens HiSoft-Pascal (von der gleichnamigen
Firma) und KickPascal von Maxxon. HiSoft und P2c behaupten, kompatibel zu
Turbo-Pascal 5.0 zu sein. HiSoft hat au&szlig;erdem einen guten
Source-Level-Debugger.
</DL>
<P>

<PRE><I>
<HR>
&lt;&lt; <A HREF="AmigaFAQg_26.html">Developer</A>
&gt;&gt; <A HREF="AmigaFAQg_28.html">Druckersteuerung</A>
</I></PRE>
