<!-- This HTML file has been created by texi2html 1.29af
     from ../AmigaFAQg.texinfo on 24 October 1995 -->

<TITLE>Amiga-FAQ - Tintenstrahldrucker</TITLE>

<PRE><I>
&lt;&lt; <A HREF="AmigaFAQg_73.html">Fish-Disk xxx</A>
&gt;&gt; <A HREF="AmigaFAQg_75.html">Quellen</A>
<HR>
</I></PRE>

<A NAME="IDX149"></A>
<A NAME="IDX150"></A>
<A NAME="IDX151"></A>
<H2><A NAME="SEC74" HREF="AmigaFAQg_toc.html#SEC74">Wie f&uuml;llt man die Tintenkartuschen der HPDeskjet-Drucker nach?</A></H2>
Dies ist eigentlich keine Amiga-spezifische Frage, taucht aber in den
Amiga-Newsgruppen so hartn&auml;ckig und regelm&auml;&szlig;ig auf, da&szlig; sie auch
in dieser FAQ beantwortet wird.
<P>
Die Drucker der Deskjet-Serie von HP besitzen einen in den Druckkopf
integrierten Tinten-Vorratsbeh&auml;lter. Wenn dieser Beh&auml;lter leer ist,
mu&szlig; normalerweise der komplette Druckkopf ausgetauscht werden. Doch
es geht auch billiger: Man kann den Tintenbeh&auml;lter mit etwas &Uuml;bung
problemlos mehrfach nachf&uuml;llen.
<P>
Man ben&ouml;tigt dazu eine Einwegspritze mit passender Nadel, etwas
schwarze F&uuml;llfederhalter-Tinte (z.B. Pelikan 4001) sowie
Isopropanol (a.k.a. Isopropylalkohol, erh&auml;ltlich in jeder gutsortierten
Apotheke).
<P>
Als erstes gibt man in das neu gekaufte Tintenf&auml;&szlig;chen einige Tropfen
Isopropanol (ca. 0,5-1,0 ml pro 30 ml Tinte). F&uuml;r eine F&uuml;llung des
Druckkopfes zieht man dann etwa 10-15 ml der Tintenmischung in die
Spritze, sticht mit der Nadel in die &Ouml;ffnung im oberen (gr&uuml;nen) Teil
des Druckkopfs und spritzt dann die Tinte langsam und vorsichtig in
den Druckkopf.  Achten Sie darauf, da&szlig; Sie die Nadel nicht ganz
"bis zum Anschlag" einstechen, w&auml;hrend des Einspritzens mu&szlig; die
verdr&auml;ngte Luft noch durch die &Ouml;ffnung entweichen k&ouml;nnen, sonst
tritt die Tinte eventuell durch die D&uuml;sen am unteren Ende des
Druckkopfs aus.
<P>
Die Dosierung des Isopropanols ist etwas kitzlig; zuviel f&ouml;rdert
das Verlaufen der Tinte auf dem Papier und f&uuml;hrt zu einem
unsauberen Schriftbild, zuwenig f&uuml;hrt eventuell zu verstopften D&uuml;sen
am Druckkopf.
<P>
Es gibt mittlerweile von verschiedenen Herstellern auch sogenannte
Nachf&uuml;llkits, die passende Spritzen und fertig vorbereitete
Tintenmischungen enthalten. Preislich liegen diese "Fertigl&ouml;sungen"
etwa in der Mitte zwischen der F&uuml;llertinte und einem neuen Druckkopf.
<P>
Die neuen Spezialdruckk&ouml;pfe mit doppeltem Volumen lassen sich
&uuml;brigens angeblich nicht mehr nachf&uuml;llen - es w&auml;re sch&ouml;n, wenn
das jemand mal aus eigener Erfahrung best&auml;tigen oder verneinen
k&ouml;nnte...?
<P>
J&uuml;rgen Weinelt, jow@rz.uni-wuerzburg.de
<P>

<PRE><I>
<HR>
&lt;&lt; <A HREF="AmigaFAQg_73.html">Fish-Disk xxx</A>
&gt;&gt; <A HREF="AmigaFAQg_75.html">Quellen</A>
</I></PRE>
