<!-- This HTML file has been created by texi2html 1.29af
     from ../AmigaFAQg.texinfo on 24 October 1995 -->

<TITLE>Amiga-FAQ - Monitore</TITLE>

<PRE><I>
&lt;&lt; <A HREF="AmigaFAQg_20.html">Doublebuffering</A>
&gt;&gt; <A HREF="AmigaFAQg_22.html">Programmierung</A>
<HR>
</I></PRE>

<A NAME="IDX31"></A>
<A NAME="IDX32"></A>
<A NAME="IDX33"></A>
<H2><A NAME="SEC21" HREF="AmigaFAQg_toc.html#SEC21">Was f&uuml;r Monitore arbeiten am Amiga 1200 oder 4000?</A></H2>
Monitore kann man klassifizieren nach der horizontalen Frequenz, die sie
f&uuml;r ihre Anzeige ben&ouml;tigen. Fernseher und Commodore's 1084 ben&ouml;tigen z.B.
etwa 15 kHz, VGA und SVGA ben&ouml;tigen mindestens etwa 30 kHz.
Multisync-Monitore k&ouml;nnen verschiedene Frequenzen darstellen.
<P>
Man kann also jeden dieser Monitore am A1200 verwenden, <STRONG>aber</STRONG>:
<P>
<UL>
<LI>
Mit einem gew&ouml;hnlichen VGA/SVGA-Monitor kann man nur einige Anzeige-Modi
(DblPal, DblNTSC und/oder Productivity, d.h. (320|640) x (256|512|1024)
Pixel) verwenden. Dies ist gro&szlig;artig f&uuml;r die Workbench und die meisten
ernsthaften Anwendungen, aber manche grafikorientierten Programme, vor allem
Spiele laufen fast sicher nicht: Sie benutzen n&auml;mlich die Preferences nicht,
&uuml;bernehmen statt dessen einfach die Maschine und gehen von einem 15 kHz
Monitor aus. Ferner kann man das Bootmen&uuml; nicht verwenden: Das arbeitet
n&auml;mlich ebenfalls nur mit 15 kHz. Schlie&szlig;lich haben VGA-Monitore keine
Lautsprecher und die VGA-artigen Modi unterst&uuml;tzen keine Genlocks.
<P>
<LI>
Das gr&ouml;&szlig;te Problem eines 15 kHz-Monitors ist das st&auml;ndige Flickern im
Interlace-Modus. Ein kleiner Tip ist hier die Verwendung von NTSC anstelle
von PAL. Dies erh&ouml;ht die Refresh-Rate von 25 Hz auf 30 Hz, kostet allerdings
einige darstellbare Zeilen. (Maximal m&ouml;glich sind 482.) Die NTSC- und
PAL-Modi sind aber nicht so schlecht, wie die Leute denken: Bei einem Monitor
mit viel Phosphor (der also lange nachgl&uuml;ht) ist PAL-Laced einigerma&szlig;en
akzeptabel und gibt eine Aufl&ouml;sung von 1448x566 in SuperHiRes. Mehr ist auf
keinem AGA-Amiga m&ouml;glich.
<P>
<LI>
Die beste L&ouml;sung sind die Multisync-Monitore, vorausgesetzt sie
unter&uuml;tzen die Bereiche von 15-31 kHz Horizontal- und 50-72
Vertikalfrequenz. Die 1940- und 1942-Monitore von Commodore sind
nicht schlecht, allerdings etwas umst&auml;ndlich zu handhaben: Bei jedem
Umschalten des Anzeige-Modus mu&szlig; man n&auml;mlich auch die
horizontale/vertikale Gr&ouml;&szlig;e und den Offset von Hand
einstellen. <A NAME="FOOT3" HREF="AmigaFAQg_foot.html#FOOT3">(3)</A> Geeignet sind z.B. auch der Mitsubishi EUM 1491 oder der EIZO
9060S.
<P>
Der Commodore 1960 hat nicht das Problem von 1940 oder 1942, ist aber auch
teurer.
</UL>
<P>
F&uuml;r einen VGA/SVGA- oder Multisync-Monitor braucht man ein Kabel, das
etwa 30 DM kostet.
<P>

<PRE><I>
<HR>
&lt;&lt; <A HREF="AmigaFAQg_20.html">Doublebuffering</A>
&gt;&gt; <A HREF="AmigaFAQg_22.html">Programmierung</A>
</I></PRE>
