/* Example23-4 */

SAY 'Following is the directory of the RAM: disk'
ADDRESS 'COMMAND' 'Dir Ram:'
SAY 'Following is a listing of the RAM: disk'
'List Ram:'