/* Example29-3 */

Score. = 100 /* Give everyone a starting score of 100 */
SAY "Results are:-"
DO x = 1 to 3
   SAY "Player" x "Score = " Score.x
END
