<HTML>
<HEAD><TITLE>Manuale in linea di Foundation - Sadeness Software &amp; Paul Burkey 1997/1998</TITLE></HEAD>
<BODY BGCOLOR="#000000" LINK="#FF0000" VLINK="#990000" text="#FFFFFF" background="gifs/background.gif">

<TABLE CELLSPACING=5 border=0 width=100%>
<td align=center valign=bottom width=300 colspan=2>
<IMG SRC="gifs/pb.gif" width=110 height=75 ALT="Paul Burkey" align=left>
<IMG SRC="gifs/sad-bar-fade.gif" width=300 height=75 ALT="Sadeness" align=left>
</td>

<TD COLSPAN=1 VALIGN=bottom ALIGN=right>
<IMG SRC="gifs/redline.gif" width=274 height=7 alt="--">

<tr>
<TD VALIGN=top align=center ROWSPAN=6 width=130>
</td>

<tr>
<TD VALIGN=top ALIGN=left COLSPAN=2>

<P>

<center>
<img src="gifs/found-logo.gif" width=350 height=104 alt="Foundation Logo">
</center>

<P>
<font size=+2 color=red>Regole di gioco generali:</FONT>
<P>

<UL>
<LH>Argomenti trattati:
<LI><a href="#summon">Richiamare la tua gente</a>
<LI><a href="#build">Creare un nuovo edificio</a>
<LI><a href="#food">Cibo e salute</a>
<LI><a href="#guards">Guardie</a>
<LI><a href="#magic">Altra magia</a>
<LI><a href="#control">Controllare la tua gente</a>
<LI><a href="#fight">Combattimenti</a>
<LI><a href="#dropped">Risorse abbandonate</a>
</UL>

<P>
<a name=summon>
<font size=+1 color=red>Richiamare la tua gente</FONT>
<p>
La prima cosa che devi imparare a fare &egrave; ordinare alla tua gente di abbandonare
un edificio. Questo pu&ograve; essere fatto in due modi. Il metodo pi&ugrave; semplice &egrave;
tramite l'uso del pannello di ordini immediati: puoi richiamare questo pannello
con un click in uno spazio vuoto della visuale di gioco; Il pannello di ordini
immediati ti mostrer&agrave; quante persone hai a disposizione, e selezionando una
di queste persone le ordinerai di lasciare la sua abitazione e di recarsi
nella locazione prescelta.
<P>
Un altro modo di ordinare a una persona di abbandonare un edificio &egrave;
tramite il pannello degli occupanti. Puoi richiamare questo pannello
selezionando due volte lo stesso edificio. Il pannello occupanti ti mostrer&agrave;
una semplice lista delle persone che si trovano nell'edificio selezionato,
potrai selezionarne una e ordinarle di uscire usando l'apposita icona.
<P>

<a name=build>
<font size=+1 color=red>Creare un nuovo edificio</FONT>
<P>
<img src="gifs/BuildingPanel.gif" width=213 height=91>
<P>
Creare edifici &egrave; facile e veloce. Devi innanzitutto scegliere una locazione
adatta nella visuale di gioco. Il primo click mostrer&agrave; il pannello di ordini
immediati, ma un secondo click far&agrave; comparire il pannello di scelta degli
edifici. Devi avere una quantit&agrave; sufficiente delle risorse necessarie ad un
particolare edificio per poterlo costruire, e devi essere in un luogo
adatto. La miniera, per esempio, deve trovarsi su un terreno rialzato, dove
il paesaggio &egrave; roccioso. La pompa idrica deve essere costruita dove la terra
&egrave; soffice. Non puoi costruire in aree che non siano state completamente esplorate.
In alcuni casi &egrave; possibile ordinare la costruzione dell'edificio anche se
le risorse non sono sufficienti.
<P>
Una volta scelto l'edificio da costruire ti saranno date delle fondamenta,
e presto arriver&agrave; un mago per &quot;magicostruire&quot; l'edificio sul posto.
Se non hai abbastanza magia a disposizione, allora questo momento dovr&agrave;
essere rinviato a pi&ugrave; tardi.
<P>

<a name=food>
<font size=+1 color=red>Cibo e salute</FONT>
<p>
Dovrai assicurare al tuo popolo cibo a sufficienza, e dovrai anche assicurarti
che ne abbiano una buona variet&agrave;. Abbiamo gi&agrave; accennato che i lavoratori
della miniera avranno bisogno di una dieta differente dagli scienziati che
lavorano in laboratorio. I depositi generalmente contengono ogni tipo
di cibarie e, in genere, in quantit&agrave; abbondante, ma altri edifici hanno
un menu limitato. Se la tua popolazione si ammala non ci saranno nuove nascite,
e la tua gente diventer&agrave; un facile bersaglio per eventuali aggressori.
Se le persone diventano troppo scontente potrebbero iniziare a disobbedire
agli ordini e diventare in generale meno valide ed efficienti. Perci&ograve;,
non &egrave; essenziale fornire una completa gamma di alimenti, ma &egrave; meglio tentare
di assicurarne pi&ugrave; tipi, per quanto possibile.
<P>

<a name=guards>
<font size=+1 color=red>Guardie</FONT>
<p>
Ogni edificio ha posto per almeno una guardia. &Egrave; bene avere qualcuno a
guardia dei tuoi edifici, perch&eacute; senza una guardia sei una facile preda.
Senza una guardia una squadra nemica potrebbe entrare nell'edificio
quando desidera. Quando ci sono nemici nell'edificio generalmente
si arriva a un combattimento, e il gruppo pi&ugrave; forte prende il controllo.
Anche se l'edificio &egrave; custodito, puoi subire l'attacco dei ladri.
<P>

<a name=magic>
<font size=+1 color=red>Altra magia</FONT>
<p>
La magia &egrave; un elemento utile nel mondo di Foundation. Non &egrave; soltanto
un comune metodo di costruzione di edifici, &egrave; anche usata per modificare il
paesaggio. Quando la tua tecnologia sar&agrave; avanzata a un buon livello ti saranno
resi disponibili altri incantesimi; questi incantesimi permetteranno ai tuoi
maghi di creare nuove pietre e alberi; questi possono essere distribuiti sul
territorio, in modo che i taglialegna e i tagliapietre li possano raccogliere.
Le pietre sono una buona fonte di carbone e minerali, ma le pietre pi&ugrave; comuni
sono semplici sassi. Altra magia pu&ograve; essere creata usando il forno crematorio;
questo particolare edificio trasformer&agrave; i resti delle tue persone in nuova
magia. Questo ti permette di avere una riserva di magia quasi infinita,
che durer&agrave; finch&eacute; avrai una popolazione.
<P>

<a name=control>
<font size=+1 color=red>Controllare la tua gente</FONT>
<p>
Il sistema di controllo per organizzare la tua gente e impartire comandi
&egrave; molto semplice, ma tramite un metodo semplice hai a disposizione una
complessa serie di comandi per controllare il tuo popolo.
<P>
La prima lezione da imparare riguarda la selezione. Questa viene fatta
premendo il pulsante sinistro del mouse in una zona vuota del paesaggio
e trascinando il puntatore (tenendo ancora premuto il pulsante sinistro)
sulla visuale, disegnando un rettangolo sullo schermo. Tutte le persone che
erano all'interno del rettangolo in quel momento saranno selezionate e
formeranno un gruppo. Un altro trucco da imparare &egrave; l'opzione di selezione
con il tasto SHIFT, che ti permette di aggiungere altre persone al gruppo.
<P>
Ora che hai selezionato un gruppo sei in grado di impartire ordini. Il pi&ugrave;
elementare &egrave; il comando di movimento; tale comando viene impartito con un
click del pulsante destro del mouse su una zona della visuale di gioco;
l'intero gruppo inizier&agrave; il proprio viaggio verso la destinazione da te
selezionata. Quando saranno arrivati vedrai che attenderanno un tuo
successivo comando. Il comando di movimento &egrave; il pi&ugrave; utile di tutti. Ti d&agrave;
il potere di ordinare a ognuna delle tue persone di recarsi in qualsiasi
destinazione valida, inclusi gli edifici. Se mandi una persona in un
edificio, questo diventer&agrave; la sua casa. Se questo edificio &egrave; di tipo
produttivo (per esempio una miniera), egli inizier&agrave; a lavorare l&igrave;. &Egrave; il
posto in cui passer&agrave; il resto dei suoi giorni, a meno che tu non gli ordini
di spostarsi in qualche altro luogo.
<P>

<a name=fight>
<font size=+1 color=red>Combattimenti</FONT>
<p>
La parte dei combattimenti &egrave; controllata come tutto il resto del gioco.
Devi semplicemente selezionare un gruppo o una singola unit&agrave; combattente
e ordinare loro di attaccare. Selezionando un soldato con il pulsante
sinistro del mouse e un edificio nemico con il pulsante destro, invierai
il soldato all'attacco. Selezionando un gruppo di soldati con il metodo
del trascinamento e selezionando poi un soldato nemico con il pulsante destro
del mouse, ordinerai al tuo gruppo si attaccare il soldato. Questa semplice
tecnica &quot;punta e clicca&quot; &egrave; usata per tutti i comandi di
battaglia.
<P>

<a name=dropped>
<font size=+1 color=red>Risorse abbandonate</FONT>
<P>
All'inizio di ogni partita ci saranno vari elementi sparsi per il territorio.
Noterai anche che alcune risorse rimangono sul terreno dopo una morte.
Un soldato pu&ograve; lasciare dell'armatura per terra, un lavoratore potrebbe
lasciare degli oggetti che trasportava, e spesso le persone lasceranno
una croce dopo la loro morte. Questi oggetti possono essere raccolti
ordinando a un lavoratore di recarsi nella esatta locazione in cui si
trovano. Il metodo pi&ugrave; facile &egrave; selezionare il luogo con il mouse,
aprendo cos&igrave; il pannello 'ordini immediati', e ordinare quindi a un
singolo lavoratore di andare in quel luogo. Una volta che il lavoratore
avr&agrave; raccolto l'elemento lo porter&agrave; nell'edificio pi&ugrave; adatto.
<P>

<CENTER>
<font size=+2 color="#FF0000"><a href="main.html">Menu principale</a></FONT>
</CENTER>

<P>

<tr>
<TD VALIGN=top>
<img src="gifs/trans-gif-160x4.gif" width=160 height=4>
</TD>

<TD VALIGN=top>

</TD>
</TR>

<P>

<tr>
<td colspan=2>
</td>
</tr>

<p>


<tr>
<TD COLSPAN=2>

<P>

<IMG SRC="gifs/redline2.gif" width=274 height=7 alt="--">

<P>

<CENTER>
<FONT SIZE=3>
Foundation &egrave; &#169;1997/1998 Sadeness Software e Paul Burkey. Tutti i diritti sono riservati.<br>
Pubblicazione - Sadeness Software - <A HREF="mailto:rich@sadeness.demon.co.uk">rich@sadeness.demon.co.uk</A><br>
Supporto di Foundation - Paul Burkey <A HREF="mailto:burkey@bigfoot.com">burkey@bigfoot.com</A>
</FONT>
<P align=center>
<font size=-1>Sadeness Software - 13 Russell Terrace - Mundesley - Norfolk - NR11 8LJ - UK</font><br>
Tel/Fax: +44 (0)1263 722169
</CENTER>
</TABLE>
</BODY>
</HTML>
