<HTML>
<HEAD><TITLE>Manuale in linea di Foundation - Sadeness Software &amp; Paul Burkey 1997/1998</TITLE></HEAD>
<BODY BGCOLOR="#000000" LINK="#FF0000" VLINK="#990000" text="#FFFFFF" background="gifs/background.gif">

<TABLE CELLSPACING=5 border=0 width=100%>
<td align=center valign=bottom width=300 colspan=2>
<IMG SRC="gifs/pb.gif" width=110 height=75 ALT="Paul Burkey" align=left>
<IMG SRC="gifs/sad-bar-fade.gif" width=300 height=75 ALT="Sadeness" align=left>
</td>

<TD COLSPAN=1 VALIGN=bottom ALIGN=right>
<IMG SRC="gifs/redline.gif" width=274 height=7 alt="--">

<tr>
<TD VALIGN=top align=center ROWSPAN=6 width=130>
</td>

<tr>
<TD VALIGN=top ALIGN=left COLSPAN=2>

<P>

<center>
<img src="gifs/found-logo.gif" width=350 height=104 alt="Foundation Logo">
</center>

<p>
<font size=5 color=red>Gestione degli edifici</FONT>
<p>
La maggior parte degli edifici rientra in una di due categorie: ci sono
gli edifici appartenenti alla categoria dei depositi, che servono a immagazzinare grandi
quantit&agrave; di risorse e persone. Poi ci sono gli edifici generici, che vengono
usati per la produzione, la coltivazione, oppure come fortini o, ancora, come
abitazioni. Un tipico esempio di deposito &egrave; il quartier generale.
<p>
<img src="gifs/bex_hq.gif" width=96 height=91>
<p>
Il deposito funziona allo stesso modo del quartier generale, e pu&ograve; contenere
40 elementi di ogni risorsa e 40 unit&agrave; per ogni tipo. Puoi impostare un limite
per ogni tipo di risorsa o unit&agrave;, se desideri. I lavoratori useranno sempre
questo valore da te impostato per stabilire quale edificio abbia bisogno di
quali risorse. Nell'immagine qui sopra si pu&ograve; vedere che l'acqua &egrave; stata
selezionata e che le &egrave; stato imposto un limite di 15. Si pu&ograve; anche notare
che sono presenti 31 unit&agrave; di acqua in magazzino, quindi se ci sono nelle vicinanze
altri edifici appartenenti alla categoria dei depositi, con un livello
d'acqua minore del loro limite impostato, i lavoratori distribuiranno l'acqua
in eccesso.
<P>
Gli altri edifici funzionano diversamente. Sono progettati per essere molto
pi&ugrave; ristretti, con tre tipi di contenuti.
<p>
<img src="gifs/bex_bgroups.gif" width=129 height=91 align=left hspace=20>
<br>
<font size=4>
1. <font colour=red>Gruppo alimenti.</font><br>
2. <font colour=red>Gruppo consumi.</font><br>
3. <font colour=red>Gruppo prodotti.</font><br>
</font>
<p clear=left>

<font colour=green>Gruppo alimenti.</font><br>
La piccola zona a sinistra &egrave; il gruppo alimenti; ci sono tre tipi di alimenti,
e una unit&agrave; di ciascun tipo pu&ograve; essere conservata qui. Se un particolare
alimento &egrave; disponibile, si illuminer&agrave;; se un alimento non &egrave; disponibile,
sar&agrave; visualizzato con un'icona scura. Nelle due immagini seguenti puoi
vedere un edificio con il cibo al completo, e un altro contenente solo
due tipi di cibo.
<p>
<img src="gifs/bex_meat.gif" width=96 height=91>
<img src="gifs/bex_nomeat.gif" width=96 height=91>
<p>
<font colour=green>Gruppo consumi.</font><br>
Il gruppo consumi &egrave; il gruppo dei materiali e dei lavoratori. Qui compaiono
le persone che lavorano e vivono nell'edificio, oltre ai materiali grezzi: la
raffineria avr&agrave; come materiali carbone e minerali, e avr&agrave; inoltre alcuni
lavoratori e una guardia.
<p>
<font colour=green>Gruppo prodotti.</font><br>
La parte inferiore &egrave; il gruppo prodotti. &Egrave; il luogo in cui le risorse
sono create, pronte ad essere esportate verso un posto che ne abbia
bisogno. Nell'immagine seguente puoi vedere la caserma con tre potenziali
elementi in uscita: maghi, scienziati e guardie. C'&egrave; anche un'immagine
del laboratorio, in cui puoi vedere un solo prodotto in uscita, cio&egrave;
le invenzioni.
<P>
<img src="gifs/bex_barracks.gif" width=96 height=91>
<img src="gifs/bex_lab.gif" width=96 height=91>
<P>
Il gruppo consumi pu&ograve; essere modificato in base alle tue necessit&agrave;, quindi
se sei a corto di lavoratori puoi abbassarne il numero in alcuni edifici. Un
esempio di ci&ograve; &egrave; la casa dei taglialegna nell'esempio sul cibo di poco
fa. Se vuoi avere una produzione lenta di pane, puoi dare al forno solo un
elemento di grano alla volta.
<P>
<font colour=green>Produzione variabile.</font><br>
<p>
Il gruppo prodotti non &egrave; sempre limitato alle risorse. La caserma ha un
gruppo prodotti che contiene maghi, scienziati e guardie. Queste unit&agrave;
sono create addestrando i lavoratori che si trovano nel gruppo consumi.
Se ti accorgi di aver bisogno di addestrare 4 scienziati, puoi impostare
il numero di scienziati a 4, e questi saranno quelli che otterrai. Puoi
impostare il livello a &quot;Max&quot;, e la caserma addestrer&agrave; scienziati
finch&eacute; non la fermerai. Nell'immagine della caserma qui sopra puoi vedere
che il numero di guardie in uscita &egrave; stato impostato a 5. Nell'immagine
seguente puoi vedere che la produzione di olio &egrave; stata disattivata; questo
pu&ograve; essere utile se hai molte miniere e non hai molto bisogno di olio; ci&ograve;
permette alle miniere di concentrarsi maggiormente sulla produzione di
altre risorse.
<p>
<img src="gifs/bex_mine.gif" width=96 height=91>
<P>



<CENTER>
<font size=+2 color="#FF0000"><a href="main.html">Menu principale</a></FONT>
</CENTER>

<P>

<tr>
<TD VALIGN=top>
<img src="gifs/trans-gif-160x4.gif" width=160 height=4>
</TD>

<TD VALIGN=top>

</TD>
</TR>

<P>

<tr>
<td colspan=2>
</td>
</tr>

<p>


<tr>
<TD COLSPAN=2>

<P>

<IMG SRC="gifs/redline2.gif" width=274 height=7 alt="--">

<P>

<CENTER>
<FONT SIZE=3>
Foundation &egrave; &#169;1997/1998 Sadeness Software e Paul Burkey. Tutti i diritti sono riservati.<br>
Pubblicazione - Sadeness Software - <A HREF="mailto:rich@sadeness.demon.co.uk">rich@sadeness.demon.co.uk</A><br>
Supporto di Foundation - Paul Burkey <A HREF="mailto:burkey@bigfoot.com">burkey@bigfoot.com</A>
</FONT>
<P align=center>
<font size=-1>Sadeness Software - 13 Russell Terrace - Mundesley - Norfolk - NR11 8LJ - UK</font><br>
Tel/Fax: +44 (0)1263 722169
</CENTER>
</TABLE>
</BODY>
</HTML>
