<HTML>
<HEAD><TITLE>Manuale in linea di Foundation - Sadeness Software &amp; Paul Burkey 1997/1998</TITLE></HEAD>
<BODY BGCOLOR="#000000" LINK="#FF0000" VLINK="#990000" text="#FFFFFF" background="gifs/background.gif">

<TABLE CELLSPACING=5 border=0 width=100%>
<td align=center valign=bottom width=300 colspan=2>
<IMG SRC="gifs/pb.gif" width=110 height=75 ALT="Paul Burkey" align=left>
<IMG SRC="gifs/sad-bar-fade.gif" width=300 height=75 ALT="Sadeness" align=left>
</td>

<TD COLSPAN=1 VALIGN=bottom ALIGN=right>
<IMG SRC="gifs/redline.gif" width=274 height=7 alt="--">

<tr>
<TD VALIGN=top align=center ROWSPAN=6 width=130>
</td>

<tr>
<TD VALIGN=top ALIGN=left COLSPAN=2>

<P>

<center>
<img src="gifs/found-logo.gif" width=350 height=104 alt="Foundation Logo">
</center>

<P>
<EM><font size=+2 color="#FF0000">I pannelli di controllo:</FONT></EM>
<P>
Gran parte del gioco &egrave; controllata da una vasta gamma di pannelli di controllo.
Questi forniscono, oltre alle statistiche, un'interfaccia per controllare
ogni dettaglio del tuo mondo.
<P>

<EM><font size=+1 color=red>Il pannello principale, il pannello statistiche e il pannello degli scambi</FONT></EM>
<P>
<img src="gifs/pan_main.gif" width=96 height=91>
<img src="gifs/pan_stats.gif" width=96 height=91>
<img src="gifs/pan_trading.gif" width=96 height=91>
<P>
Il primo pannello che ti viene presentato &egrave; il pannello principale. Da qui
puoi accedere a tutti gli altri pannelli. Il pannello principale mostra anche
alcune importanti statistiche di gioco, tra cui la tua popolazione totale,
la percentuale di completamento della missione e la quantit&agrave; di territorio
su cui hai il controllo diretto.
<P>
I pulsanti del pannello principale ti portano agli altri pannelli di gioco.
Tra questi vi sono i pannelli delle persone selezionate, degli edifici
selezionati, del totale delle risorse, il pannello degli scambi, delle
statistiche e la finestra delle opzioni di gioco.
<P>
Il pannello degli scambi serve a preparare un semplice baratto o uno scambio
commerciale con altre squadre. Questa possibilit&agrave; pu&ograve; essere utile nel
caso ti serva con urgenza una certa risorsa. Lo &quot;scambio immediato&quot;
&egrave; un'operazione istantanea con un basso valore di scambio; l'altro metodo
ti consente di ottenere una miglior valutazione, ma potrebbe essere necessario
del tempo prima che gli altri giocatori prendano in considerazione lo scambio,
il quale alla fine potrebbe essere rifiutato. Le opzioni di scambio devono
essere usate solo in casi di emergenza, oppure quando possiedi una quantit&agrave;
eccessiva di una particolare risorsa.
<P>
Il pannello statistiche &egrave; pieno di pulsanti che ti portano a informazioni
vitali per aiutarti nel gioco. Tra queste ci sono i grafici di produzione,
le statistiche di squadra, il numero degli edifici, le cause dei decessi,
le priorit&agrave; di produzione e di trasporto, le statistiche della missione,
il pannello &quot;Maggiore e Minore&quot; e il grafico delle statistiche
multiple.
<P>

<EM><font size=+1 color=red>Grafici di produzione</FONT></EM>
<P>
<img src="gifs/pan_prod.gif" width=96 height=91>
<img src="gifs/pan_inout.gif" width=96 height=91>
<P>
Il pannello della produzione mostra un semplice grafico sulla produzione
delle risorse. Grazie ad esso puoi prevedere forti cambiamenti nell'utilizzo
delle risorse e tentare di evitare di trovarti con troppe o troppo poche
unit&agrave; di un particolare elemento. Il grafico &quot;Dentro e Fuori&quot;
mostra la quantit&agrave; di risorse in entrata e la quantit&agrave; in uscita.
<P>

<EM><font size=+1 color=red>Numero edifici</FONT></EM>
<P>
<img src="gifs/pan_bcount.gif" width=96 height=91>
<P>
Mostra semplicemente quanti edifici di ogni tipo hai creato. Ti permette
di fare un rapido calcolo per decidere quale nuovo edificio creare. Il
pannello del numero di edifici pu&ograve; anche essere usato per individuare
velocemente i tuoi edifici. Se, per esempio, hai tre fattorie e fai
click sull'icona della fattoria, la visuale si sposter&agrave; sulla posizione
di tutte e tre le fattorie, a rotazione.
<P>

<EM><font size=+1 color=red>Cause dei decessi</FONT></EM>
<P>
<img src="gifs/pan_death.gif" width=96 height=91>
<img src="gifs/pan_popdeath.gif" width=96 height=91>
<P>
Per aiutarti nel compito di ridurre il numero di fatalit&agrave; &egrave; utile
controllare le cause dei recenti decessi. Un rapido sguardo agli ultimi 4
decessi spesso ti pu&ograve; fornire un indizio su cosa pu&ograve; essere fatto per
migliorare le probabilit&agrave; di vita della tua popolazione. Il grafico dei
decessi comuni mostra le pi&ugrave; frequenti cause di morte; esso rappresenta
un ulteriore aiuto per scoprire problemi di salute e altro.
<P>

<EM><font size=+1 color=red>Priorit&agrave; di produzione e di trasporto</FONT></EM>
<P>
<img src="gifs/pan_ppriority.gif" width=96 height=91>
<img src="gifs/pan_tpriority.gif" width=96 height=91>
<P>
Qui puoi riordinare i vari elementi in ordine di necessit&agrave;. Se hai molte
fattorie puoi decidere quale tipo di cibo preferisci produrre; un elemento
con priorit&agrave; pi&ugrave; alta sar&agrave; prodotto pi&ugrave; spesso di uno con priorit&agrave; minore.
La priorit&agrave; di produzione ha anche un altro significato: quando invii un
lavoratore in un edificio nemico, egli uscir&agrave; dall'edificio con merci rubate;
la scelta delle merci da rubare si basa sulla priorit&agrave; di produzione.
<P>
Persone e risorse possono essere spostate da un luogo all'altro; di questo si
occupano le persone che lavorano nei vari edifici. Sebbene tu possa
prendere il controllo di una persona in qualsiasi momento, &egrave; sempre
utile lasciarli continuare il loro lavoro. Un edificio spesso pu&ograve; contenere
molti tipi di risorse e molti tipi di persone; queste sono tutte quelle che
possono essere prelevate dall'edificio in qualsiasi momento, quindi &egrave;
necessario avere una preferenza. Le risorse hanno sempre una priorit&agrave;
superiore alle persone, quindi spesso vedrai i lavoratori abbandonare
un edificio prima di un cavaliere, sebbene il cavaliere possa avere
priorit&agrave; superiore ai lavoratori; ci&ograve; accade perch&eacute; il lavoratore sta
trasportando una importante risorsa ad alta priorit&agrave;, e questo gli d&agrave;
un vantaggio rispetto a un cavaliere.
<P>

<EM><font size=+1 color=red>Stato della missione</FONT></EM>
<P>
<img src="gifs/pan_mission.gif" width=96 height=91>
<P>
Questo pannello mostra un semplice grafico indicante l'attuale percentuale
di completamento della missione. Le squadre controllate dal computer
possono avere un obiettivo diverso dal tuo, per esempio potrebbero dover
eliminare tutte le altre squadre dall'isola o distruggere la tua squadra.
Se una squadra del computer raggiunge il 100% in questo pannello la partita
finir&agrave;.
<P>

<EM><font size=+1 color=red>Il pannello &quot;Maggiore e Minore&quot;</FONT></EM>
<P>
<img src="gifs/pan_bestworst.gif" width=96 height=91>
<P>
Questo &egrave; un pannello di statistiche semplice ma efficace. Con una rapida
occhiata puoi vedere di quali elementi hai troppe unit&agrave; e di quali altri ne
hai troppo poche. La percentuale &egrave; calcolata prendendo la popolazione
attuale e calcolando le quantit&agrave; ideali di ogni elemento. Un valore del 200%
indica che al momento hai il doppio della quantit&agrave; consigliata, mentre
un valore del 50% significa che devi raddoppiare la produzione di questo tipo
di risorsa.
<P>

<EM><font size=+1 color=red>Grafico delle statistiche multiple</FONT></EM><br>
<P>
<img src="gifs/pan_multistats.gif" width=96 height=91>
<P>
Qui puoi fare un paragone tra i giocatori della partita attuale. I valori
mostrati sono basati sugli ultimi 15 anni di gioco. Puoi avere un'idea di
quanto siano stabili le altre squadre grazie a indicatori come il
possesso territoriale, la riserva d'oro, la popolazione, i tassi di
produzione e la dimensione dell'esercito.
<P>

<CENTER>
<font size=+2 color="#FF0000"><a href="main.html">Menu principale</a></FONT>
</CENTER>
<P>
<tr>
<TD VALIGN=top>
<img src="gifs/trans-gif-160x4.gif" width=160 height=4>
</TD>

<TD VALIGN=top>

</TD>
</TR>

<P>

<tr>
<td colspan=2>
</td>
</tr>

<p>


<tr>
<TD COLSPAN=2>

<P>

<IMG SRC="gifs/redline2.gif" width=274 height=7 alt="--">

<P>

<CENTER>
<FONT SIZE=3>
Foundation &egrave; &#169;1997/1998 Sadeness Software e Paul Burkey. Tutti i diritti sono riservati.<br>
Pubblicazione - Sadeness Software - <A HREF="mailto:rich@sadeness.demon.co.uk">rich@sadeness.demon.co.uk</A><br>
Supporto di Foundation - Paul Burkey <A HREF="mailto:burkey@bigfoot.com">burkey@bigfoot.com</A>
</FONT>
<P align=center>
<font size=-1>Sadeness Software - 13 Russell Terrace - Mundesley - Norfolk - NR11 8LJ - UK</font><br>
Tel/Fax: +44 (0)1263 722169
</CENTER>
</TABLE>
</BODY>
</HTML>
