<html>
<body background="../images/fondtexte4.jpg">
<a name="a"></a>
<table>
<tr>
<td>

</td>
<td>
<font color="purple"><font size=5 face="helvetica"><a href="stpierreetmiquelon.html"target="description"><b>Pr&eacute;sentation de St Pierre et Miquelon</a> (975)</font><br>

</td>
</tr>
</table>
<hr>
<br>


<a name="geo"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">G&eacute;ographie</font></font><font size=1 face="helvetica"> ( Economie</font> <font size=1 face="helvetica"> - <a href="histoirepierremiquelon.html" target="description">Histoire</a></font><font size=1 face="helvetica"> - Produits locaux</font><font size=1 face="helvetica"> - Enfants du pays)</font></a></STRONG><BR>
</font>
<br>


Les &icirc;les de l'archipel appartiennent &agrave; la grande formation g&eacute;ologique des Appalaches comme la Nouvelle-Ecosse et Terre-Neuve. En g&eacute;n&eacute;ral et surtout &agrave; Saint-Pierre, le sol est pauvre, us&eacute; par l'&eacute;rosion glaciaire, le climat et le d&eacute;boisement excessif depuis le XVII&egrave;me si&egrave;cle.<br>   
<br>   
Tour &agrave; tour fran&ccedil;ais puis anglais, d&eacute;finitivement fran&ccedil;ais depuis 1816, l'archipel de Saint-Pierre et Miquelon est constitu&eacute; de trois &icirc;les principales : Saint-Pierre (26 km2), Miquelon (110 km2) et Langlade (91 km2), ces deux derni&egrave;res reli&eacute;es depuis le XVIII&egrave;me si&egrave;cle par un isthme de sable qui renferme dans sa partie nord une lagune sal&eacute;e "Le Grand Barachois". Quelques &icirc;lots, dont "Le Grand Colombier" et "L'&icirc;le aux Marins" habit&eacute;e jusque dans les ann&eacute;es 60, entourent Saint-Pierre dans la partie Est.<br>   
<br>   
Ces &icirc;les sont fort dissemblables : Saint-Pierre, la plus petite mais la plus peupl&eacute;e, assure l'essentiel des activit&eacute;s &eacute;conomiques. Sur Miquelon, on compte une centaine de familles vivant de la p&ecirc;che et de l'agriculture. A Langlade, l'Anse du Gouvernement est un hameau de r&eacute;sidences secondaires le long d'une splendide plage de sable fin, lieu de loisirs et de vill&eacute;giature.<br>   
<br>   
</body>
</html>