<html>
<body background="../images/fondtexte4.jpg">
<a name="a"></a>
<table>
<tr>

<td>
<font color="purple"><font size=5 face="helvetica"><a href="stpierreetmiquelon.html"target="description"><b>Pr&eacute;sentation de St Pierre et Miquelon</a> (975)</font><br>

</td>
</tr>
</table>
<hr>
<br>


<a name="geo"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Histoire</font></font><font size=1 face="helvetica"> ( <a href="geopierremiquelon.html"target="description">G&eacute;ographie</a></font> <font size=1 face="helvetica"> - Economie</font><font size=1 face="helvetica"> - Produits locaux</font><font size=1 face="helvetica"> - Enfants du pays)</font></a></STRONG><BR>
</font>
<br>


<br>

<i>- 19 octobre 1520 </i>: d&eacute;couverte officielle par le navigateur portugais 
                  Jos&eacute; Alvarez Faguendes.<br>  
<br>  

<i>- 1816 </i>: Les &icirc;les de l'archipel de Saint-Pierre et Miquelon deviennent d&eacute;finitivement
     fran&ccedil;aises ! <br>  
<br>  
<i>- 19 Juillet 1976 </i>: le territoire devient d&eacute;partement ! <br>  
<br>  

<i>- 11 juin 1985 </i>: Saint-Pierre-et-Miquelon est &eacute;rig&eacute; en collectivit&eacute; territoriale
               de la R&eacute;publique Fran&ccedil;aise !<br>
<br>
 
Les plus anciens indices arch&eacute;ologiques d'une pr&eacute;sence humaine &agrave; Saint-Pierre et Miquelon attestent du bref passage d Inuits en campagne de chasse &agrave; la baleine. Cet archipel fut d ailleurs certainement connu aussi des p&ecirc;cheurs et des chasseurs basques qui venaient chasser la baleine sur les bancs de Terre-Neuve, bien avant sa d&eacute;couverte officielle le 19 octobre 1520 par le navigateur portugais Jos&eacute; Alvarez Faguendes.<br>   
Baptis&eacute; alors &icirc;les des Onze Milles Vierges, l'archipel passe sous souverainet&eacute; fran&ccedil;aise quand Jacques Cartier en prend possession au nom de Fran&ccedil;ois Ier en Juin 1535. Des Fran&ccedil;ais venus de Bretagne, de Normandie et du pays Basque, p&ecirc;cheurs pour la plupart, fondent Saint-Pierre. Les &icirc;les subissent &agrave; divers reprises l'occupation anglaise et sont d&eacute;finitivement fran&ccedil;aises en 1816.<br>   
Le ralliement de l'archipel &agrave; la France libre, le 24 d&eacute;cembre 1941, conduit plusieurs centaines de Saint-Pierrais et Miquelonnais &agrave; s'engager aupr&egrave;s du G&eacute;n&eacute;ral de Gaulle.<br>   
Saint-Pierre-et-Miquelon re&ccedil;oit d'illustres voyageurs comme Ren&eacute; de Chateaubriand en 1791 (qui immortalise ces &icirc;les dans les "M&eacute;moires d'outre-tombe") et le g&eacute;n&eacute;ral de Gaulle en 1967, alors pr&eacute;sident de la R&eacute;publique.<br>     
<br> 
M&ecirc;me si certains vestiges d&eacute;montrent une pr&eacute;sence am&eacute;rindienne sur l'archipel, il est peu probable qu'il y ait eu de v&eacute;ritables peuplements au-del&agrave; d'exp&eacute;ditions de p&ecirc;che ou de chasse. <br>    
La premi&egrave;re s&eacute;dentarisation v&eacute;ritable remonte &agrave; la seconde moiti&eacute; du XVII&egrave;me si&egrave;cle et est d'origine fran&ccedil;aise. Le peuplement traditionnel r&eacute;sulte d'apports de population des ports fran&ccedil;ais, essentiellement normands, basques, bretons et saintongeais, d'Acadie et de Terre-Neuve.<br>   
<br>   
</body>
</html>