<html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>

<h1 align=center><b>7.1.1 &nbsp; Die richtigen Farbt&#246;ne f&#252;r
unsere Grafik</b></h1>

<p>F&#252;r unsere Zeichnung ben&#246;tigen wir folgende Farben, die wir
nun gemeinsam erstellen wollen: Zuerst ein Blau f&#252;r den Himmel.
Klicken Sie dazu einen beliebigen, wenn m&#246;glich freien Farbkasten an.
Stellen Sie daraufhin die Regler f&#252;r Rot und Gr&#252;n ganz nach links
(im Textfeld erscheint der Wert &quot;0&quot;) und jenen f&#252;r Blau
vollst&#228;ndig nach rechts (im Textfeld erscheint der Wert
&quot;255&quot;). Das Gr&#252;n f&#252;r den Rasen erzeugen wir auf
dieselbe Weise, wobei jedoch dieses Mal Rot und Blau nach links und
Gr&#252;n ganz nach rechts geschoben werden. </p>

<p>Die Sonne soll gelb werden. Diesen Farbton erreichen wir, indem der
Regler f&#252;r Rot und Gr&#252;n ganz nach rechts und jener f&#252;r Blau
ganz nach links geschoben wird. Das Dach des Hauses wird dunkelrot. Hierzu
stellen wir die Regler f&#252;r Gr&#252;n und Blau ganz nach links, jenen
f&#252;r Rot an jene Stelle, da&#223; im Textfeld daneben der Wert
&quot;150&quot; erscheint. </p>

<p>F&#252;r den Rauchfang ist ein Grauton n&#246;tig, der Rauch selbst wird
Dunkelgrau, die Wolke wei&#223;, die Fenster schwarz, die T&#252;re braun
und das Haus selbst bekommt einen violett&#228;hnlichen Farbton.
Mit Hilfe der untenstehenden Tabelle sollten Sie in der Lage sein,
alle diese Farben selbst zu mischen.  Die Werte geben jene Zah-
len  an,  die  neben  den  jeweiligen  Farbreglern  erscheinen  sollten.
Nat&#252;rlich k&#246;nnen Sie diese Werte auch direkt in die Eingabefel-
der tippen, anstatt die Schieberegler zu benutzen.  Vergessen Sie
bitte nicht, nach jeder Farbdefinition einen neuen Farbkasten anzu-
klicken, da andernfalls die alte Farbe verloren geht.
</p>

<br><center><table border=2 cellspacing=2 cellpadding=6>
<tr><th>Farbton</th><th>Rot</th><th>Gr&#252;n</th><th>Blau</th></tr>
<tr><td> blau <br> gr&#252;n<br> gelb<br> rot<br> grau<br> violett<br> braun<br>
wei&#223;<br> schwarz<br> dunkelgrau</td>
<td align=right> 0&nbsp;<br> 0&nbsp;<br> 255<br> 150<br> 150<br> 180<br>
162<br> 255<br> 0&nbsp;<br> 80</td>

<td align=right> 0&nbsp;<br> 255<br> 255<br> 0&nbsp;<br> 150<br> 87<br>
85<br> 255<br> 0&nbsp;<br> 80</td>

<td align=right> 255<br> 0&nbsp;<br> 0&nbsp;<br> 0&nbsp;<br> 150<br> 255<br>
0&nbsp;<br> 255<br> 0&nbsp;<br> 80</td></tr></table></center>

<p>Nachdem Sie diese Farben definiert haben, klicken Sie auf den
&quot;Zuweisen&quot;-Schalter. Damit stehen Ihnen die Farbt&#246;ne zur
Bearbeitung des Bildes bereit. Es ist &#252;brigens &#228;u&#223;erst
wichtig, da&#223; Sie den &quot;ZuweisenSchalter bet&#228;tigen. </p>

<p>W&#252;rden Sie das nicht tun, so sind zwar in der Colorbox die neuen
Farbt&#246;ne zu sehen, k&#246;nnen aber nicht verwendet werden.  W&#252;rde
die Colorbox geschlossen und wieder ge&#246;ffnet werden, sind die Ein-
stellungen ebenfalls verschwunden. Erst durch &quot;Zuweisen&quot; werden
die &#196;nderungen endg&#252;ltig gemacht.
</p>

<hr size=4></td></tr></table></center>
<br>                                  
</body>
</html>  
