<html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>6.2.3 &nbsp; Genaue Maussteuerung mittels Tastatur</b></h1>

<p>Doch auch f&#252;r dieses Problem gibt es eine einfache L&#246;sung: Der
Mauszeiger l&#228;&#223;t sich n&#228;mlich auch mit Hilfe der Tastatur
steuern. Bewegen Sie ihn zuerst mit Hilfe der Maus in die N&#228;he jener
Stelle, an der Sie zeichnen m&#246;chten. </p>

<p>Halten Sie nun eine der beiden Amiga-Tasten gedr&#252;ckt und
bet&#228;tigen Sie gleichzeitig die Cursor-Tasten in jene Richtung, in die
sich der Mauszeiger bewegen soll. Daraufhin f&#252;hrt dieser Bewegungen in
ein-Punkt-Schritten aus, was ein exaktes Plazieren erlaubt. </p>

<p>Wir k&#246;nnen dieses Verfahren beim Zeichnen der &#220;berst&#228;nde
anwenden. Bringen Sie dazu den Mauszeiger in die N&#228;he der linken
oberen Ecke des Hauses. Lassen Sie die Maus nun los und positionieren Sie
den Mauszeiger so, da&#223; dessen Mittelpunkt genau auf die linke obere
Ecke des Hauses zeigt. Halten Sie dazu eine der beiden Amiga-Tasten
gedr&#252;ckt (in diesem Fall empfiehlt sich, wie wir gleich sehen werden,
die linke Amiga-Taste) und verschieben Sie den Zeiger mit Hilfe der
Cursor-Tasten. </p>

<p>Wenn Sie das Ziel erreicht haben, beginnen wir mit dem Ziehen der Linie.
Hierzu ist es notwendig, die linke Maustaste gedr&#252;ckt zu halten. Es
w&#228;re jedoch wenig sinnvoll, zuerst den Mauszeiger mit Hilfe der
Tastatur pixelgenau zu positionieren und danach durch Bet&#228;tigen der
Maustaste denselben um einige Punkte zu verschieben. </p>

<p>Deshalb kann auch der Klick mit der Tastatur simuliert werden, indem die
linke Amiga- und Alt-Taste gleichzeitig gedr&#252;ckt wird. Halten Sie
diese beiden Tasten nieder und verwenden Sie wiederum die Cursor-Tasten, um
die Linie zu ziehen. Durch Loslassen der Alt-Taste wird die Linie fixiert.
</p>

<p>Vollf&#252;hren Sie dieselbe Operation auch auf der anderen Seite des
Hauses. Sobald Sie die &#220;berst&#228;nde fertiggestellt haben, kann das
Dach gezeichnet werden. Dies besteht wiederum aus zwei Linien, die entweder
mit der Maus oder genauer mit der Tastatur gezogen werden k&#246;nnen. Auch
der Rauchfang besteht aus zwei Linien. Auf diese wurde ein Rechteck als
Abschlu&#223; aufgesetzt. Der Rauch aus dem Rauchfang und die Wolke auf der
linken Seite wurden mit dem Freihand-Werkzeug (&lt;d&gt;) gezeichnet.
Ebenso die Horizontlinie im Hintergrund. Die Sonne ist ein einfacher Kreis
(&lt;c&gt;). </p>

<hr size=4></td></tr></table></center>
</body>
</html>
