<html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>3.1 &nbsp; Grundeinstellungen</b></h1>

<p>Bevor Xi-Paint nun das erste Mal gestartet wird, gilt es, einige wichtige
Parameter festzulegen, um das Programm auf Ihre Computerkonfiguration
anzupassen. Dazu finden Sie in der Schublade von Xi-Paint neben dem
Malprogramm selbst (&quot;XiPaint&quot;) auch ein Programm mit dem Namen
&quot;Xi-Prefs&quot;. Dieses erm&#246;glicht, &#228;hnlich wie die
Preferences der Workbench, eine Festlegung der wichtigsten
Grundeinstellungen. </p>

<p>Diese Einstellungen werden deshalb durch ein eigenes Programm getroffen, da
es sich hierbei um Parameter handelt, die bereits vor dem ersten Start von
Xi-Paint bekannt sein m&#252;ssen, da es andernfalls unter Umst&#228;nden
nicht m&#246;glich w&#228;re, das Programm &#252;berhaupt zu starten. </p>

<p><img src="bilder/xx01.gif" align=left width=263 height=91 hspace=6
alt="XiPaint Schublade">Aktivieren Sie nun den Voreinsteller Xi-Prefs durch
einen Doppelklick. Es &#246;ffnet sich ein eigenes Fenster, das alle
notwendigen Einstellungsm&#246;glichkeiten bietet </p>

<p>Als wichtigste Einstellung mu&#223; zuerst festgelegt werden, welche
Grafikkarte in Ihrem Computer eingebaut ist. Xi-Paint unterst&#252;tzt eine
ganze Reihe von weit verbreiteten 24-Bit-Erweiterungen, und je nach Version
werden entsprechend viele unterschiedliche Treiber mitgeliefert.
<br clear=all> </p>

<p><b>Festlegen der Grafikkarte </b><br>

Welche Ausgabetreiber zur Verf&#252;gung stehen, wird in der Liste
&quot;Verf&#252;gbare Grafikkarten&quot; angezeigt. Suchen Sie in dieser
jene Karte, die in Ihrem Computer vorhanden ist und w&#228;hlen Sie diesen
Eintrag durch Klick mit der linken Maustaste aus.
</p>

<p>Sofort erscheint ein neues Fenster, das alle m&#246;glichen
Aufl&#246;sungen enth&#228;lt, die mit Ihrer Grafikkarte m&#246;glich sind.
Aus dieser Liste k&#246;nnen Sie nun jene w&#228;hlen, in der Xi-Paint
betrieben werden soll. Nat&#252;rlich kann diese Festlegung jederzeit
wieder ge&#228;ndert werden, soda&#223; Sie auch probieren k&#246;nnen,
welche Aufl&#246;sung f&#252;r Sie am angenehmsten ist. </p>

<p>Um die gew&#228;hlte Aufl&#246;sung nachtr&#228;glich zu ver&#228;ndern,
gen&#252;gt ein Klick auf den Schalter &quot; Display w&#228;hlen&quot;.
Daraufhin &#246;ffnet sich erneut das Fenster mit den m&#246;glichen
Aufl&#246;sungen und Sie k&#246;nnen die gew&#252;nschte ausw&#228;hlen.
</p>

<p>Rechts neben der Liste der verf&#252;gbaren Grafikkarten befindet sich ein
Informationskasten, der mitteilt, welche Werte aktuell eingestellt sind.
Neben &quot;Karte:&quot; steht der Name der ausgew&#228;hlten Grafikkarte.
Darunter befindet sich die Angabe &#252;ber die gew&#228;hlte
Aufl&#246;sung und die verwendete Farbtiefe. Als letzte Angabe wird die
Karten-Interne Anzeigen-Nummer angegeben, die f&#252;r den t&#228;glichen
Gebrauch allerdings nicht von Interesse ist. </p>

<p>Beachten Sie, da&#223; Xi-Paint in der Liste der verf&#252;gbaren
Grafikkarten immer alle Treiber anzeigt, die mit dem Programm mitgeliefert
werden. Das bedeutet, da&#223; auch Eintr&#228;ge von Karten angef&#252;hrt
sind, die sich nicht in Ihrem Computer befinden.
</p>

<p>Diese k&#246;nnen zwar gew&#228;hlt werden, doch ist in einem solchen Fall
ein Starten von Xi-Paint nicht m&#246;glich, da das Programm
selbst&#228;ndig erkennt, da&#223; die eingestellte Grafikkarte nicht im
System vorhanden ist und deshalb die Arbeit abbricht. Entsprechend ist es,
wenn Sie in Xi-Prefs eine nicht vorhandene Erweiterung aufrufen, nicht
m&#246;glich, die Aufl&#246;sung einzustellen. </p>


<p><b>Minimale Speichermenge </b><br>

Die n&#228;chste festlegbare Einstellung betrifft jene Speichermenge, die
mindestens vorhanden und verf&#252;gbar sein mu&#223;, damit Xi-Paint
startet. Die entsprechenden Festlegungen k&#246;nnen im Eingabefeld
&#252;ber dem Text &quot;Min. freier Speicher&quot; getroffen werden. </p>

<p>Um ein sinnvolles Arbeiten mit Xi-Paint zu erm&#246;glichen, sollte hier
zumindest ein Wert von 1.000.000 stehen. Lediglich wenn Ihr Computer
&#252;ber relativ wenig Speicher verf&#252;gt (weniger als 2MB), ist es
ratsam diesen Wert zu verringern, da andernfalls Xi-Paint unter
Umst&#228;nden aus Speichermangel nicht startet. </p>

<p>Sobald alle Einstellungen getroffen wurden, k&#246;nnen diese mittels
&quot;Speichern&quot; gesichert werden. Sie stehen dann Xi-Paint
automatisch zur Verf&#252;gung und werden bei jedem Start des Malprogrammes
verwendet.  </p>

<p>Sollten Sie die getroffenen Einstellungen lediglich einmal ausprobieren
wollen, so k&#246;nnen Sie dies durch &quot;Benutzen&quot; erreichen. In
diesem Fall gelten die Festlegungen so lange, bis Sie einen Neustart des
Computers durchf&#252;hren. M&#246;chten Sie die &#196;nderungen verwerfen,
so k&#246;nnen Sie dies mit Hilfe des &quot;Abbrechen&quot;-Schalters
erreichen. </p>


<p><b>Die Men&#252;s </b><br>

Einige weitere M&#246;glichkeiten stehen Ihnen durch Verwendung der
Men&#252;s zur Verf&#252;gung. Im &quot;Vorgaben&quot;-Men&#252; finden Sie
die Eintr&#228;ge &quot;auf Vorgaben zur&#252;cksetzen&quot; (&lt;rechte
Amiga&gt; &lt;Z&gt;), &quot;auf zuletzt gespeichertes&quot; (&lt;rechte
Amiga&gt; &lt;L&gt;) und &quot;auf vorherigen Stand&quot; (&lt;rechte
Amiga&gt; &lt;S&gt;). </p>

<p>Mittels &quot;auf Vorgaben zur&#252;cksetzen&quot; werden die Einstellungen
von Xi-Prefs auf fixe, interne Werte zur&#252;ckgesetzt, die auch beim
allerersten Start nach der Installation angezeigt werden. &quot;auf zuletzt
gespeichertes&quot; bewirkt ein Laden der zuletzt abgespeicherten
Einstellungen und &quot;auf vorherigen Stand&quot; nimmt die zuletzt
durchgef&#252;hrten &#196;nderungen wieder zur&#252;ck. </p>
<hr size=4>
</td></tr></table></center>
<br>
</body>
</html> 
