<html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>9.3.1 &nbsp; Die Arbeitsweise der Pinselverwaltung</b></h1>

<p>Wenn die Liste der Pinsel voll ist, so &#252;berschreibt Xi-Paint,
beginnend mit dem ersten (und damit &#228;ltesten), nacheinander die
Eintr&#228;ge. Deshalb ist es nicht unbedingt sicher, da&#223; Sie die
Rohrteile am Ende der Liste finden. </p>

<p>Am besten, Sie klicken jeweils in den leeren Bereich des Schiebereglers,
der sich unter dem Regler befindet, soda&#223; immer genau um eine Seite
weitergeschaltet wird. Lassen Sie danach alle Pinsel darstellen. Dies kann,
je nach der Geschwindigkeit der Festplatte, einige Sekunden in Anspruch
nehmen. </p>

<p>Sobald Sie unsere Elemente gefunden haben, werden Sie feststellen,
da&#223; sie genau in der Reihenfolge vorliegen, in der sie aufgenommen
und manipuliert wurden.  Xi-Paint merkt sich n&#228;mlich nicht nur
die ausgeschnittenen Pinsel, sondern zeichnet auch jede &#196;nderung
(und damit auch das Drehen und das Spiegeln) auf.
</p>


<p><b>Das R&#246;hrensystem wird wie ein Puzzle zusammengesetzt </b></p>

<p>Um den Pinsel zu verwenden, gen&#252;gt es, diesen einfach anzuklicken.
Sofort haftet er am Mauszeiger und kann in einem beliebigen Zeichenfenster
eingef&#252;gt werden. Da wir beim Ausschneiden darauf geachtet haben,
da&#223; die Gr&#246;&#223;e des Pinsels genau 20x20 ist, pa&#223;t er
genau in unsere Gittereinstellung. </p>

<p>Auf diese Weise k&#246;nnen Sie nun das R&#246;hrensystem
zusammensetzen, indem Sie einfach das ben&#246;tigte Element aus dem
Pinselfenster aufnehmen und im Zeichenblatt einf&#252;gen. Auf diese Weise
lassen sich auch komplizierte Leitungen ohne Probleme erstellen. </p>

<p>Lassen Sie sich nicht von der Gr&#246;&#223;e der dargestellten Pinsel
im Pinsel-Fenster t&#228;uschen. Dort wird versucht, den Pinsel so
anzupassen, da&#223; er m&#246;glichst formatf&#252;llend erscheint.
Deshalb wird er in einer anderen Gr&#246;&#223;e angezeigt, als er danach
in Wirklichkeit ist. </p>

<p>Das R&#246;hrensystem ist &#252;brigens nur ein einfaches
Anwendungsbeispiel f&#252;r die Verwendung der Pinselverwaltung. Im
allt&#228;glichen Gebrauch wird man immer wieder darauf zur&#252;ckgreifen.
Anwender, die bereits mit DPaint oder einem &#228;hnlichen Malprogramm
gearbeitet haben, werden sicherlich wissen, wie unangenehm es ist, wenn man
w&#228;hrend der Arbeit immer wieder verschiedene Pinsel ben&#246;tigt und
diese laufend neu ausschneiden mu&#223;. Dieses Problem kennt man in
Xi-Paint nicht. Hier kann man auf die bis zu 128 letzten Pinsel
zur&#252;ckgreifen. </p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html>  
