<html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>9.2 &nbsp; Das Gitter als Positionierungshilfe</b></h1>

<p>Nachdem wir nun die Einzelteile fertiggestellt haben, k&#246;nnen wir
uns daranmachen, diese zu einem vollst&#228;ndigen R&#246;hrensystem zu-
sammenzusetzen.  Dazu &#246;ffnen wir zu erst ein neues Arbeitsblatt,
auf dem wir die Grafik erzeugen wollen.
</p>

<p><img src="bilder/xx16.gif" width=228 height=95 hspace=6 align=left
alt="Gitter-Requester">Es w&#228;re m&#252;hsam, die Einzelteile manuell
immer ganz genau aneinander zu h&#228;ngen. Aus diesem Grund wollen wir uns
des Positionierungsgitters von Xi-Paint bedienen. Der dazu notwendige
Requester wird entweder durch den entsprechenden Schalter in der Toolbox
oder durch den Men&#252;befehl &quot; Gitter&quot; (&lt;rechte Amiga&gt;
&lt;G&gt;) aus dem &quot;Men&#252;s&quot;-Men&#252;aufgerufen. In dem nun
erscheinenden Fenster k&#246;nnen Sie die Gr&#246;&#223;e des Gitters
festlegen. </p>
     
<p>Sie k&#246;nnen sich dies am besten wie ein unsichtbares Gitter
vorstellen, das &#252;ber die Zeichnung gelegt wird. Anfangs- und Endpunkte
von Bildelementen (Linien, Rechtecken,...) k&#246;nnen nun nur noch an den
Kreuzungspunkten der Gitterlinien liegen. </p>

<p>Dies entpricht in etwa der Vorgehensweise, wenn Sie auf einem karierten
Papier mit einem Lineal Linien ziehen, wobei deren Anfangsund Endpunkte
immer genau an den Eckpunkte der Karos liegen. </p>

<p>Wir nutzen diese Positionierungshilfe nun aus, um auf einfache Weise die
R&#246;hrenelemente plazieren zu k&#246;nnen. Dazu stellen wir die Breite
und die H&#246;he des Gitters jeweils auf 20 Punkte ein. Dadurch ist es nur
noch m&#246;glich, die Pinsel alle 20 Punkte zu setzen, also genau Kante an
Kante. </p>

<p>Vergessen Sie nicht, den Schalter in der linken unteren Ecke des
Gitter-Requesters auf &quot;Ein&quot; zu setzen. Andernfalls w&#252;rde das
Gitter nicht wirksam werden. Durch &quot;Schlie&#223;en&quot; k&#246;nnen
Sie das Fenster wieder verlassen, die Einstellung bleibt jedoch erhalten.
</p>

<p>Sollten Sie jedoch vorhaben, das Gitter zwischenzeitlich auszuschalten,
so lassen Sie den Gitter-Requester ge&#246;ffnet. Dann gen&#252;gt
n&#228;mlich das Umschalten das Ein-/Ausschalters, um die
Positionierungshilfe zu aktivieren/deaktivieren. </p>

<br><center><b><a href="tx20921.html" target="_top"> "Die Pinselverwaltung
sorgt f&#252;r Komfort" </a></b></center>

<hr size=4></td></tr></table></center>
<br>
</body>
</html>
