<html>
<head>
<!--      "author" content="Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>7.1 &nbsp; Die Colorbox</b></h1>

<p>Es &#246;ffnet sich nun die Colorbox, mit deren Hilfe die
ben&#246;tigten Farben gemischt und ausgew&#228;hlt werden k&#246;nnen. In
der oberen H&#228;lfte befinden sich die Schieberegler zum Einstellen der
Farbwerte, darunter 256 Farbk&#228;sten, denen beliebige Farbt&#246;ne
zugewiesen werden k&#246;nnen. Es sind im 64 Farbk&#228;sten gleichzeitig
sichtbar. Durch den Schieberegler auf der rechten Seite kann der sichtbare
Bereich gew&#228;hlt werden. </p>

<img src="bilder/xx08.gif" width=249 heigth=211 alt="Colorbox" hspace=6
align=left>Einige Farben sind bereits belegt. Durch Anklicken einer dieser
Farben wird sie zur aktuellen Zeichenfarbe gemacht. Probieren Sie es aus,
indem Sie eine Farbe ausw&#228;hlen und danach in unserer Zeichnung ein
Element malen. Wie Sie sehen, wird dieses sofort in der neuen Farbe
gezeichnet. </p>

<p>Mit Hilfe der drei Schieberegler, die f&#252;r die Farben Rot, Gr&#252;n
und Blau stehen, kann die Farbe des gerade aktiven Farbkastens (der zuletzt
angeklickte) ver&#228;ndert werden. Allen bisher noch nicht ben&#246;tigten
Farbk&#228;sten weist Xi-Paint automatisch die Farbe Schwarz zu. </p>

<p>Durch Anklicken eines solchen &quot;leeren&quot; Farbkastens k&#246;nnen
Sie f&#252;r diesen eine individuelle Farbe mischen und mit dieser danach
in der Zeichnung malen. Damit die &#196;nderung auch wirklich wirksam wird,
mu&#223; zuerst der &quot;Zuweisen&quot;-Schalter bet&#228;tigt werden.
Andernfalls wird die alte Farbe weiterverwendet, auch wenn im Farbkasten
bereits die neue sichtbar ist. </p>

<p>N&#228;here Informationen, wie man eine gew&#252;nschte Farbe mischen
kann, finden Sie entweder im Grundlagen-Kapitel oder bei der genaueren
Besprechung der Colorbox im Nachschlageteil dieses Handbuches. </p>

<p>Experimentieren Sie ruhig ein wenig herum und mischen Sie einige Farben,
indem Sie die Schieberegler entsprechend verschieben. Anstelle die
Schieberegler zu verwenden, k&#246;nnen Sie auch in den Textfeldern rechts
daneben die genauen Werte eingeben, wobei Zahlen von 0 bis 255 erlaubt
sind. </p>

<center><table border=0><tr><td><b><dl>

  <dt> 7.1.1 <a href="tx20711.html" target="_top"> "Die richtigen Farbt&#246;ne für unsere Grafik" </a></dt>
  <dt> 7.1.2 <a href="tx20712.html" target="_top"> "Unterschiede zu anderen Malprogrammen" </a></dt></dl></b>
</td></tr></table></center>
<hr size=4></td></tr></table>
<br>
</body>
</html>
