<html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>9.1 &nbsp; Ein R&#246;hrensystem als Aufgabe</b></h1>

<p><img src="bilder/xx13.gif" width=320 height=256 hspace=6 align=left
alt="R&#246;hrensystem (fertig)">Um die M&#246;glichkeiten in der Praxis
ausprobieren zu k&#246;nnen, wollen wir uns eine Aufgabe stellen, die auf
den ersten Blick &#228;u&#223;erst umfangreich erscheint, sich mit Xi-Paint
jedoch sehr einfach l&#246;sen l&#228;&#223;t. Sehen Sie sich dazu das
untenstehende Bild an: </p>

<p>Es handelt sich hierbei um ein R&#246;hrensystem, das &#252;ber den ganzen
Bildschirm verteilt ist.  Normalerweise w&#228;re es eine umfangreiche
Aufgabe, jede einzelne R&#246;hre zu zeichnen.  Doch gl&#252;cklicherweise
bietet uns Xi-Paint hier einige Hilfestellungen an.
</p>

<p>Wie Sie sich sicherlich denken k&#246;nnen, besteht das gesamte System
aus verschiedenen Einzelelementen, die beliebig zusammengesetzt werden
k&#246;nnen. Dieses Verfahren haben wir bereits beim Zaun des Hauses
kennengelernt, als wir uns mit den Grundbegriffen der Pinseloperationen
besch&#228;ftigt haben. <br clear=all></p>

<p><img src="bilder/xx14.gif" width=320 height=256 hspace=6 align=left
alt="R&#246;hrenteile">In diesem Fall ist die Aufgabe jedoch noch
einfacher. Das gesamte System wird aus lediglich drei Einzelteilen
zusammengesetzt, die durch die Pinselmanipulation in alle anderen
Variationen &#252;bergef&#252;hrt werden k&#246;nnen. Die drei Elemente
haben folgendes Aussehen: </p>

<p>Der 3D-Effekt l&#228;&#223;t sich sehr einfach erzeugen, indem Sie sechs
Farben erstellen, von denen eine immer ein wenig dunkler ist als die
andere. Dazu stellt der Farbrequester die komfortable Funktion
&quot;Verlauf&quot; zur Verf&#252;gung. Mit dieser wird ein m&#246;glichst
weicher &#220;bergang zwischen zwei Farbt&#246;nen automatisch erzeugt.
</p>

<br><center><table><tr><td><b>
<dl>
<dt> 9.1.1 <a href="tx20911.html" target="_top"> "Farbverl&#228;ufe im Farbrequester" </a></dt>
<dt> 9.1.2 <a href="tx20912.html" target="_top"> "Arbeitsersparnis mit Pinselmanipulationen" </a></dt>
</dl></b></td></tr></table></center><br clear=all>

<hr size=4></td></tr></table>
<br>
</body>
</html>
