<html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>5.1.1 &nbsp; Der Umgang mit Fenstern</b></h1>

<p>Der Rahmen eines Fensters enth&#228;lt bereits einige Schalter, die ein
Manipulieren mit diesem erlauben. Dadurch kann die Arbeitsoberfl&#228;che
immer so eingerichtet werden, wie es f&#252;r die aktuelle Arbeit am
sinnvollsten erscheint.
</p>

<p><img src="bilder/xx03.gif" width=320 height=256 hspace=6 align=left
alt="Fensterbeschreibung">In der Abbildung sehen Sie ein solches Fenster
mit allen zur Verf&#252;gung stehenden Schaltern. Nicht jedes Fenster
bietet alle M&#246;glichkeiten der Manipulation an, dies h&#228;ngt vom
jeweiligen Anwendungsgebiet ab, welche Elemente notwendig sind und welche
nicht. </p>


<p>Die Titelzeile enth&#228;lt bei einem neuen Arbeitsblatt den Text
&quot;Projekt X&quot; wobei das X f&#252;r eine Zahl steht, die die Nummer
der Zeichnung angibt. Sollte das Arbeitsblatt bereits gesichert oder
geladen worden sein, so wird in der Titelzeile der Dateiname eingeblendet.
</p>

<p>Bei Requestern dagegen wird in der Titelzeile der Name desselben angegeben,
soda&#223; die Funktion jederzeit auch aus dem Titel erfa&#223;t werden
kann. Neben dieser informativen Aufgabe dient die Titelzeile zum
Verschieben des Fensters. Durch Anklicken und Gedr&#252;ckthalten der
linken Maustaste kann das Fenster beliebig auf der Arbeitsoberfl&#228;che
verschoben werden. </p>

<p>Hierbei wird es w&#228;hrend der Bewegung nicht vollst&#228;ndig sondern
lediglich als Rahmen dargestellt. Erst nach dem Loslassen der Maustaste
wird das Fenster an der neuen Position neu gezeichnet. </p>

<p>In der rechten oberen Ecke befinden sich zwei Schalter, wobei der
&#228;u&#223;erst rechte zum Ordnen der Fenster dient. Hat man mehrere
Arbeitsbl&#228;tter und Requester ge&#246;ffnet, kann es sehr schnell
vorkommen, da&#223; wichtige Teile eines Fensters von einem anderen
&#252;berdeckt sind. Umgekehrt ist es m&#246;glich, da&#223; man ein
bestimmtes Fenster in den Hintergrund legen m&#246;chte. </p>

<p>F&#252;r diese Aufgaben steht der Tiefenschalter zur Verf&#252;gung. Wird
er angeklickt, so &#252;berpr&#252;ft Xi-Paint, ob das Fenster gerade von
anderen &#252;berdeckt wird. Ist dies der Fall, wird es automatisch
vollst&#228;ndig in den Vordergrund geholt. Sollte es jedoch bereits
komplett sichtbar sein, reiht es Xi-Paint im Hintergrund ein, wodurch es
von allen anderen, davorliegenden Fenstern &#252;berdeckt wird. Falls die
entsprechende Option eingeschaltet ist, gibt es in Xi-Paint noch eine
zweite M&#246;glichkeit, ein Fenster in den Vordergrund zu holen. Hierzu
gen&#252;gt es, einen Doppelklick auf das gew&#252;nschte Fenster
durchzuf&#252;hren. </p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html>
