<html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>7.2 &nbsp; F&#252;llen des Bildes</b></h1>

<p>Alle Vorbereitungen f&#252;r das Ausf&#252;llen des Bildes wurden nun
getroffen, die notwendigen Farben sind definiert. W&#228;hlen Sie nun das
Blau f&#252;r den Himmel aus und aktivieren Sie das Zeichenfenster. Danach
schalten Sie das F&#252;llwerkzeug (&lt;f&gt;) ein. Ein Mausklick innerhalb
des Himmels gen&#252;gt und bereits nach kurzer Zeit ist der Himmel in
strahlendem Blau zu sehen. </p>

<p>Sollte das Ergebnis nicht Ihren W&#252;nschen entsprechen, so
&#252;berpr&#252;fen Sie, ob der richtige Zeichenmodus eingestellt ist. Im
Men&#252;&quot;Zeichenmodus&quot; mu&#223; n&#228;mlich der Eintrag
&quot;Solid&quot; (&lt;linke Amiga&gt; &lt;1&gt;) gew&#228;hlt sein.
Andernfalls wird die Fl&#228;che nicht korrekt gef&#252;llt. </p>

<p>Sollte die Farbe aus irgendeinem Grund &quot; ausgelaufen&quot; sein,
das hei&#223;t, da&#223; auch andere Objekte (zum Beispiel das Dach oder
die Wiese) gef&#252;llt wurden, so liegt dies daran, da&#223; diese Objekte
nicht vollst&#228;ndig geschlossen waren, sondern L&#246;cher aufweisen.
Xi-Paint f&#252;llt n&#228;mlich so lange, bis es an eine Grenze
st&#246;&#223;t. </p>

<p>Um kleinere L&#246;cher zu &quot;stopfen&quot; gibt es zwei
M&#246;glichkeiten: Entweder diese werden durch das Freihand-Werkzeug
geschlossen, was vor allem bei gro&#223;en L&#252;cken empfehlenswert ist,
oder man verwendet zus&#228;tzlich zum Freihand- Werkzeug noch die Lupe.
Dies ist vor allem bei feinen L&#246;chern und an Stellen, bei denen es auf
pixelgenaues Arbeiten ankommt, empfehlenswert. </p>

<p>Um die Lupe zu verwenden, klicken Sie auf das entsprechende Sym-
bol in der Toolbox (&lt;m&gt;). Daraufhin erscheint ein Rechteck rund
um den Mauszeiger. Mit diesem k&#246;nnen Sie den zu vergr&#246;&#223;ernden
Ausschnitt w&#228;hlen.  Im Lupenfenster wird der gew&#252;nschte Bereich
vergr&#246;&#223;ert angezeigt und kann auf diese Weise punktgenau bearbei-
tet werden.
</p>

<p><img src="bilder/xx09.gif" width=320 height=256 alt="Strichzeichnung
gef&#252;llt" hspace=6 align=left>F&#252;llen Sie nun nacheinander alle
Fl&#228;chen der Zeichnung mit den zuvor definierten Farben. Sollte es zum
Auslaufen einer Farbe kommen, so vergessen Sie nicht, da&#223; Sie den
Vorgang jederzeit durch Undo wieder r&#252;ckg&#228;ngig machen
k&#246;nnen! </p>

<p>Wenn Sie Ihre Arbeit abgeschlossen haben, k&#246;nnen Sie das fertige
Bild speichern. Rufen Sie hierzu bitte nicht den Befehl &quot;Bild
sichern&quot; (&lt;rechte Amiga&gt; &lt;s&gt;) aus dem
&quot;Projekt&quot;-Men&#252;auf, sondern wiederum &quot;Bild sichern
als...&quot; und sichern Sie das Bild unter einem anderen Namen. Denn die
Strichzeichnung ben&#246;tigen wir noch f&#252;r das n&#228;chste Kapitel.
</p>

<p>W&#252;rden Sie n&#228;mlich &quot;Bild sichern&quot; w&#228;hlen, so
wird die bisherige Datei durch die aktuelle Version ersetzt. Daf&#252;r
ersparen Sie sich den Umweg &#252;ber den Dateirequester. Dieser Befehl ist
vor allem beim Zwischenspeichern sinnvoll, da man entweder durch einfaches
Dr&#252;cken der Tastenkombination oder durch Aufrufen des Men&#252;punktes
das Bild ohne zus&#228;tzliche Eingaben abspeichern kann. </p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html>
