<html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>1.1 &nbsp; Die Benutzung dieses Handbuches</b></h1>

<p>Xi-Paint ist &#228;u&#223;erst intuitiv und einfach zu bedienen.
Trotzdem sollten gerade Einsteiger sich zumindest kurz mit diesem Handbuch
befassen, um die &quot;wahren&quot; St&#228;rken des Programmes auch
wirklich vollst&#228;ndig kennenlernen zu k&#246;nnen. Auf jeden Fall
sollten Sie die Informationen des folgenden Kapitels lesen, das sich mit
der Installation und Grundeinstellung von Xi-Paint befa&#223;t. Denn
andernfalls k&#246;nnte es sein, da&#223; aufgrund einer fehlerhaften
Anpassung gar nicht alle M&#246;glichkeiten Ihres Computersystemes
ausgenutzt werden k&#246;nnen. </p>

<p>Danach folgt eine kurze Einf&#252;hrung in die Grundlagen der
24-Bit-Grafik, die vor allem f&#252;r jene interessant ist, die wissen
m&#246;chten, was sich &quot;hinter den Kulissen&quot; abspielt.
Dar&#252;ber hinaus erfahren Sie in diesem Kapitel auch viel wissenswertes,
das Sie die nat&#252;rlichen Grenzen des Malprogrammes verstehen
l&#228;&#223;t. Dies ist vor allem insofern wichtig, da Sie dadurch ein
Gef&#252;hl bekommen, was m&#246;glich ist und was nicht. </p>

<p>Das darauf folgende Kapitel befa&#223;t sich mit den Grundprinzipien von
Xi-Paint, die f&#252;r die t&#228;gliche Arbeit mit diesem Programm
&#228;u&#223;erst wichtig sind. Es werden jene &quot;Handgriffe&quot;
erkl&#228;rt, die bei h&#228;ufigem Gebrauch fr&#252;her oder sp&#228;ter
v&#246;llig automatisch ablaufen sollten, da sie die grundlegende Bedienung
von Xi-Paint darstellen. Im Anschlu&#223; daran kommen eine ganze Reihe von
Tutorialabschnitten, die Schritt f&#252;r Schritt in die Arbeit mit
Xi-Paint anhand von praktischen Beispielen einf&#252;hren. Auf diese Weise
erlernen Sie den Umgang mit dem Programm in unterhaltsamer und aktiver
Weise. Nat&#252;rlich werden auch einige Tips&amp;Tricks gegeben, um
Xi-Paint noch besser ausnutzen zu k&#246;nnen. Vor allem Einsteiger und
Neulinge auf dem Gebiet der 24-Bit-Malprogramme sollten sich diese Kapitel
durchlesen und die darin beschriebenen Aktionen nachvollziehen. </p>

<p>Ein gro&#223;er Abschnitt befa&#223;t sich schlie&#223;lich mit der
genauen Besprechung der einzelnen Funktionen von Xi-Paint. Diese Kapitel
sind einerseits dazu gedacht, sich einen &#220;berblick &#252;ber die
M&#246;glichkeiten von Xi-Paint zu verschaffen und andererseits k&#246;nnen
sie als Nachschlagewerk verwendet werden, wenn beim Arbeiten Probleme oder
Fragen auftauchen. </p>

<p>Den Abschlu&#223; bildet eine Beschreibung der ARexx-Schnittstelle von
Xi-Paint, die vor allem f&#252;r jene Anwender von Interesse ist, die mit
Hilfe der m&#228;chtigen Sprache ARexx neue Funktionen f&#252;r Xi-Paint
erstellen oder bestimmte Arbeitsabl&#228;ufe automatisieren m&#246;chten. </p>

<hr size=4></td></tr></table>
</body>
</html>
