<html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>6.1.1 &nbsp; Festlegen der Gr&#246;&#223;e</b></h1>

<p>Nach dem Anw&#228;hlen von &quot;Neu...&quot; &#246;ffnet sich in der
Mitte des Bildschirmes ein kleiner Requester, der Sie auffordert, die
Gr&#246;&#223;e der neuen Zeichnung einzugeben. Diese hat nichts mit der
gew&#228;hlten Aufl&#246;sung zu tun, sondern kann v&#246;llig frei
bestimmt werden. Ist die Zeichnung kleiner als die
Bildschirmaufl&#246;sung, wird auch das Arbeitsfenster in der
entsprechenden Gr&#246;&#223;e ge&#246;ffnet. Falls die Zeichnung
gr&#246;&#223;er ist als die derzeit am Monitor dargestellte
Aufl&#246;sung, so wird das Fenster Bildschirmf&#252;llend ge&#246;ffnet
und die linke obere Ecke des Bildes angezeigt. Durch Verschieben der
Schiebebalken kann der gew&#252;nschte Ausschnitt danach selbst festgelegt
werden. </p>

<p>Die maximale Gr&#246;&#223;e des Bildes h&#228;ngt nur vom vorhandenen
Speicher ab. Trotzdem sollte man sich bereits zu Beginn der Arbeit Gedanken
dar&#252;ber machen, wie gro&#223; das Kunstwerk wirklich werden soll.
Merkt man n&#228;mlich w&#228;hrend des Malens, da&#223; das Arbeitsblatt
zu klein ist, so stellt dies kein Problem dar. </p>

<p>In diesem Fall &#246;ffnet man einfach ein neues, gr&#246;&#223;eres
Blatt, nimmt die bisherige Zeichnung als Pinsel auf und f&#252;gt sie im
neuen Arbeitsblatt, das nun gro&#223; genug ist, an einer beliebigen Stelle
ein. Schwieriger ist es jedoch, wenn man feststellt, da&#223; man den
Umfang des Kunstwerkes zu gro&#223; gew&#228;hlt hat und diesen nun
nachtr&#228;glich verkleinern mu&#223;. Denn dies ist zwar m&#246;glich,
doch gehen dadurch mit Sicherheit Details verloren und das Ergebnis wird
nicht den Erwartungen entsprechen. </p>

<p>Die Gr&#246;&#223;e der Grafik h&#228;ngt immer von den sp&#228;teren
Anwendungsgebieten ab. Ben&#246;tigt man eine Zeichnung, um diese in einer
Pr&#228;sentation einzusetzen, so wird man von vornherein typische
Bildschirmaufl&#246;sungen (z.B. 640x512, 640x480 oder 800x600) verwenden,
damit das Kunstwerk sp&#228;ter Bildschirmf&#252;llend dargestellt werden
kann. </p>

<p>Entwirft man dagegen eine Grafik, die sp&#228;ter beispielsweise als
Poster oder Titelblatt ausgedruckt wird, dann ist es sinnvoll das
Breiten-/H&#246;henverh&#228;ltnis des Ausgabeformates zu verwenden. Bei
DIN A4 ist dies ungef&#228;hr 5:7, soda&#223; man beispielsweise eine
Aufl&#246;sung von 1000x1400 oder 500x700 verwenden wird. </p>

<p><img src="bilder/xx06.gif" width=163 heigth=113 align=left hspace=6
alt="Bildgr&#246;&#223;en-Requester">F&#252;r die ersten Schritte
gen&#252;gt eine relativ kleine Grafik, weshalb wir uns mit 320x200
begn&#252;gen wollen. Klicken Sie dazu zuerst mit der linken Maustaste in
das erste Eingabefeld. Dieses ver&#228;ndert seine Farbe und eine
Schreibmarke erscheint. L&#246;schen Sie den Inhalt nun durch Dr&#252;cken
von &lt;rechte Amiga&gt; &lt;x&gt; und tippen Sie 320 ein. </p>

<p>Schlie&#223;en Sie die Eingabe nicht durch die Eingabetaste sondern
durch die Tabulatortaste ab. Dadurch wird automatisch das n&#228;chste
Eingabefeld, das in diesem Fall f&#252;r die H&#246;he zust&#228;ndig ist,
aktiv. L&#246;schen Sie wiederum den Vorgabewert mit Hilfe von &lt;rechte
Amiga&gt; &lt;x&gt; und geben Sie dieses Mal 200 ein. Nun k&#246;nnen Sie
die Eingabetaste dr&#252;cken, um beide &#196;nderungen zu &#252;bernehmen.
Zum &#214;ffnen des gerade definierten Arbeitsblattes klicken Sie entweder
auf den &quot;Ok&quot;-Schalter oder dSr&#252;cken Sie erneut die
Eingabetaste. Falls der &quot;Neu...&quot;-Befehl versehentlich
ausgew&#228;hlt wurde, bricht der Schalter &quot;Abbrechen&quot; den
Vorgang ab, ohne ein neues Arbeitsblatt zu erstellen. </p>

</td></tr></table></center>
<hr size=4>
</td></tr></table></center>
<br>
</body>
</html>
