<html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>Maskieren des Pinsels</b></h1>

<p>Wenn Sie nun jedoch versuchen, das ausgeschnittene Element mehrmals
nebeneinander zu plazieren, werden Sie feststellen, da&#223; der
Hintergrund nicht durchsichtig ist und deshalb die bereits bestehenden
Teile immer wieder &#252;berzeichnet werden. </p>

<p>Xi-Paint kann nicht erkennen, welche Farbe die Hintergrundfarbe ist und
deshalb durchsichtig sein soll. F&#252;r uns ist es &quot;logisch&quot;,
da&#223; es die Grundfarbe ist, mit der das Arbeitsblatt gel&#246;scht
wurde. F&#252;r Xi-Paint kann es jede der 16,8 Millionen m&#246;glichen
Farben sein. </p>

<p>Deshalb mu&#223; man, oder besser gesagt, kann man gl&#252;cklicherweise
selbst w&#228;hlen, welche Farbe des Pinsels als durchsichtig behandelt
werden soll. Rufen Sie dazu die Colorbox auf und aktivieren dort jenen
Farbkasten, der die Farbe des Hintergrundes enth&#228;lt. Danach
gen&#252;gt ein Druck auf die &lt;/&gt;-Taste, und schon sind alle Teile
des Pinsels, die die aktuell gew&#228;hlte Farbe haben, durchsichtig. Nun
k&#246;nnen die Elemente nahtlos aneinandergereiht werden. </p>

<p>Sollten Sie &#252;brigens mit einem schwarzen Hintergrund arbeiten, so
k&#246;nnen Sie auch ohne Ausw&#228;hlen der Hintergrundfarbe in der
Colorbox die Maskierung durchf&#252;hren. Dr&#252;cken Sie dazu einfach die
&lt;[&gt;-Taste. Mit dieser wird eine Maximum-Maske erstellt, die bei
dunklem Hintergrund ebenfalls das gew&#252;nschte Ergebnis liefert. </p>

<p>Um zu bestimmen, welche Teile des Pinsels durchsichtig sind, kommt
&#252;brigens der bereits im Grundlagenkapitel besprochene Alpha-Kanal zum
Einsatz. Man nennt den eben beschriebenen Vorgang auch das
&quot;Maskieren&quot; eines Pinsels auf eine bestimmte Farbe. </p>

<p>Sie k&#246;nnen &#252;brigens auch die Farbe, mit der Sie das
Zaunelement gezeichnet haben, maskieren. Dadurch sehen Sie &#252;berall
dort, wo Sie die Linien gezogen haben, den Hintergrund durch. Probieren Sie
es aus, indem Sie das Zaunelement noch einmal ausschneiden, dieses Mal in
der Colorbox aber die Farbe aktivieren, mit der Sie das Element gezeichnet
haben. Nach einem Druck auf die &lt;/&gt;-Taste ist der Brush auf die
Linienfarbe maskiert. </p>

<p><img src="bilder/xx11.gif" width=320 heigth=256 hspace=6 align=left
alt="Zaungrafik">Setzen Sie nun mit Hilfe des Elementes (das nat&#252;rlich
wieder auf den Hintergrund maskiert sein mu&#223;) einen Zaun zusammen,
soda&#223; ein fertiges Bild entsteht: </p>

<p>W&#228;hrend es auf der rechten Seite nichts ausmacht, wenn der Zaun
&#252;ber die Zeichnung hinaussteht, da die &#252;berstehenden Teile
sowieso automatisch abgeschnitten werden, kann es bei den restlichen
Bereichen (vor allem rechts und links vom Haus) notwendig sein, auch nur
Teile der Zaunelemente einzuf&#252;gen. Schneiden Sie dazu einfach nur
jenen Teil des Elementes als Pinsel aus, den Sie gerade ben&#246;tigen, und
setzen Sie ihn an die gew&#252;nschte Stelle. <br clear=all></p>

<p><img src="bilder/xx12.gif" width=320 heigth=256 hspace=6 align=left
alt="Zaungrafik gef&#252;llt">Wenn der Zaun fertiggestellt ist, kann auch
dieses Bild gef&#252;llt werden. F&#252;r den Zaun verwenden wir dasselbe
Braun, das wir auch zum F&#252;llen der T&#252;re verwendet haben. Wenn Sie
seit unserer letzten Zeichnung Xi-Paint verlassen haben, so ist auch die
Palette, die wir dort definiert haben, nicht mehr vorhanden. </p>

<p>Deshalb ist es von Vorteil, da&#223; wir diese zuvor abgespeichert
haben. &#214;ffnen Sie nun die Colorbox und aktivieren Sie diese. Rufen Sie
im &quot;Palette&quot;-Men&#252; den Befehl &quot;Laden&quot; (&lt;rechte
Amiga&gt; &lt;l&gt;) auf. Daraufhin erscheint ein Dateirequester, in dem
Sie die gespeicherte Palette ausw&#228;hlen und in den Speicher laden
k&#246;nnen. Daraufhin steht die Palette sofort wieder zur Verf&#252;gung,
soda&#223; wir unser Bild problemlos mit den bereits definierten Farben
ausmalen k&#246;nnen: <br clear=all></p>

     
<hr size=4></td></tr></table>
<br>
</body>
</html>
