<html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>5.2.1 &nbsp; Nur sinnvolle Men&#252;s werden angezeigt</b></h1>

<p>Im Gegensatz zu sehr vielen anderen Programmen h&#228;ngt der Inhalt der
Men&#252;s immer vom gerade aktiven Fenster ab. Dadurch werden Ihnen als
Anwender immer nur jene M&#246;glichkeiten angeboten, die gerade sinnvoll
sind. </p>

<p>Ein weiterer Vorteil liegt in der Tatsache, da&#223; dadurch die einzelnen
Men&#252;s nicht &#252;berladen und un&#252;bersichtlich werden. Auf der
anderen Seite sollten Sie, wenn Sie mit Short-Cuts arbeiten, darauf achten,
da&#223; es zu keiner Fehlermeldung kommt, falls Sie eine Tastenkombination
verwenden, die gerade nicht zur Verf&#252;gung steht. </p>

<p>So geschieht beispielsweise nichts, wenn Sie gerade im Farbenrequester eine
bestimmte Farbe einstellen und hierbei die Kombination &lt;Rechte
Amiga-Taste&gt; &lt;4&gt; (zyklischer Farbverlauf bei F&#252;lloperationen)
dr&#252;cken. Sobald Sie in einem Zeichenfenster weiterarbeiten, wird mit
der alten Zeicheneinstellung gearbeitet, da im Requester f&#252;r die
Farbeinstellung das Zeichenmodus-Men&#252; und somit auch der Eintrag
&lt;Zyklisch&gt; nicht vorhanden ist. </p>

<p>In diesem Zusammenhang wurde allerdings darauf geachtet, da&#223; auch bei
den sich &#228;ndernden Men&#252;s gleiche Befehle immer dieselbe
Tastenkombination besitzen. Auch befinden sich bei &#228;hnlichen
Men&#252;s die einzelnen Eintr&#228;ge, so weit dies m&#246;glich ist,
immer an derselben Stelle. Dadurch ist einerseits die
&#220;bersichtlichkeit der Men&#252;s immer gew&#228;hrleistet und
andererseits wird die Einarbeitungszeit minimiert.
</p>

<p>Um w&#228;hrend der Arbeit schnell das Grundmen&#252;zu erhalten, das auch
nach dem Start von Xi-Paint zur Verf&#252;gung steht und das alle wichtigen
Operationen zum Laden und Neuerstellen von Zeichnungen besitzt, gen&#252;gt
es, die Arbeitsoberfl&#228;che an einer beliebigen Stelle anzuklicken.
Daraufhin werden alle Fenster deaktiviert und das Grundmen&#252;steht zur
Verf&#252;gung. </p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html> 
