<html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>2 &nbsp; Xi-Paint - Die Geschichte</b></h1>

<p>Damit Sie sich ein Bild &#252;ber die Entstehung dieses Malprogrammes
machen k&#246;nnen, soll an dieser Stelle kurz die Geschichte von - Paint
erz&#228;hlt werden. </p>

<p>Begonnen hat alles damit, da&#223; ein hervorragender Amiga-Entwickler
einen Framebuffer mit dem Namen VD2001 auf den Markt brachte. Diese
Erweiterung war in der Lage, Videobilder in Echtzeit zu digitalisieren und
mit 24 Bit darzustellen. </p>

<p>Doch die beste Hardware n&#252;tzt nichts, wenn die zugeh&#246;rige
Software fehlt. Aus diesem Grund beschlossen die Autoren des heutigen
Xi-Paint, ein Malprogramm f&#252;r die VD2001-Erweiterung zu programmieren.
Um einen Bezug zum Produktnamen herzustellen, wurden die ersten beiden
Buchstaben &#252;bernommen - somit war VD-Paint geboren. </p>

<p>Anf&#228;nglich war diese Software lediglich per Kommandozeile zu bedienen,
von interaktivem Zeichnen mit der Maus war man noch weit entfernt. Doch mit
der Zeit wurde das Programm laufend weiterentwickelt, soda&#223;
schlie&#223;lich auch ein grafisches Benutzerinterface mit
Mausunterst&#252;tzung implementiert wurde. </p>

<p>In der Zwischenzeit gab es neue Entwicklungen am Amiga-Markt und eine zum
damaligen Zeitpunkt unschlagbar g&#252;nstige 24-Bit-Grafikkarte schickte
sich an, diesen Markt zu erobern. Doch auch hier suchte man verzweifelt
nach einem Malprogramm, denn eine Grafikkarte ohne Software l&#228;&#223;t
sich nur schwer verkaufen. </p>

<p>Sehr schnell stellte sich heraus, da&#223; Retina und VD-Paint durchaus ein
interessantes Gespann sein k&#246;nnten. Aus diesem Grund einigte man sich
&#252;ber eine entsprechende Umsetzung und Anpassung an die Grafikkarte.
Das Ergebnis, immer noch unter dem Namen VD-Paint, wurde der Retina
kostenlos beigelegt. </p>

<p>Rein &#228;u&#223;erlich hatte dieses VD-Paint nur wenig mit dem heutigen
Xi-Paint zu tun. &#196;hnlich wie bei DPaint gab es lediglich eine Arbeits-
und eine Reserveseite. Ein Arbeiten bei offenen Requestern war nicht
m&#246;glich und die Zeichenfl&#228;che nahm immer den ganzen Bildschirm
ein.</p>

<p>Von den F&#228;higkeiten her konnte allerdings VD-Paint bereits viele
Optionen bieten, die auch in Xi-Paint zu finden sind. Deshalb war es wenig
verwunderlich, da&#223; die Anzahl der zufriedenen Anwender immer
gr&#246;&#223;er wurde. </p>

<p>Sehr schnell wurde auch der Wunsch nach Anpassungen an andere Grafikkarten
laut. Bei diesen lag VD-Paint allerdings nicht bei, sondern wurde extra
verkauft.</p>

<p>Im Herbst 1992 wagten die Autoren schlie&#223;lich einen Sprung in
unbekannte Gew&#228;sser. VD-Paint wurde f&#252;r den HAM-Modus des Amiga
umgesetzt! Das bedeutete, da&#223; jeder Amiga-Besitzer, auch ohne
Grafikkarte, 24-Bit-Bilder erstellen und bearbeiten konnte, denn intern
arbeitete diese Version weiterhin mit 16,7 Millionen Farben. </p>

<p>Da dieses hardwareunabh&#228;ngige Programm von einer anderen Firma
vertrieben wurde, wurde auch der Name ge&#228;ndert - neben VD-Paint gab es
pl&#246;tzlich TruePaint, das mit gleichem Funktionsumfang, gleicher
Bedieneroberfl&#228;che, aber Unterst&#252;tzung des HAM-Modus aufwarten
konnte. </p>

<p>Entgegen den Erwartungen blieb der gro&#223;e Erfolg aus. Die Gr&#252;nde
hierf&#252;r sind sicher vielschichtig und nur schwierig vollst&#228;ndig
zu erfassen. Mit Sicherheit spielte es eine Rolle, da&#223; nur wenige
Amiga-Anwender den gro&#223;en Nutzen erkannten, in 24-Bit arbeiten zu
k&#246;nnen, auch wenn das Ergebnis nur in HAM sichtbar ist. </p>

<p>Doch anstatt sich entt&#228;uscht zur&#252;ckzulehnen nahmen die Autoren
einen neuen Anlauf. Schon lange hatten sie den Plan gefa&#223;t, ein
v&#246;llig neues VD-Paint zu schreiben, das alles bisherige in den
Schatten stellen sollte. </p>

<p>Fenstertechnik, eine v&#246;llig neue Oberfl&#228;che, beliebig viele
Projekte gleichzeitig, neue Funktionen und noch mehr
Gestaltungsm&#246;glichkeiten sollten diese neue Version auszeichnen. Um
die endg&#252;ltige Trennung zu der bisherigen Entwicklung zu ziehen, wurde
der Name noch einmal ge&#228;ndert: Aus VD-Paint wurde Xi-Paint. </p>

<p>Die erste Pr&#228;sentation auf der Messe in K&#246;ln im Herbst 1993
lie&#223; viele Besucher staunen. Angespornt durch das gro&#223;e Interesse
wurde ein Erscheinungstermin Anfang 1994 geplant. Doch w&#228;hrend der
Arbeit tauchten immer neue Ideen auf, &#196;nderungen wurden vorgenommen
und Anregungen verwirklicht. </p>

<p>Wen wundert es da, da&#223; die endg&#252;ltige Version erst im Sommer 1994
vorlag? Doch was auch dem einstmals tastaturorientierten VD-Paint geworden
ist, kann sich, ohne &#220;bertreibung, sehen lassen. Xi-Paint stellt heute
mit Sicherheit, auch Plattform&#252;bergreifend, eines der besten und
leistungsf&#228;higsten 24-Bit Malprogramme dar, die am Markt
erh&#228;ltlich sind. </p>

<p>Trotzdem wird Xi-Paint auch heute noch laufend weiterentwickelt. Wenn Sie
deshalb eine Idee oder Anregung haben, so &#228;u&#223;ern Sie diese
einfach in Form eines Wunsches oder einer konstruktiven Kritik.
Nat&#252;rlich freuen sich die Autoren auch &#252;ber jede Art des Lobes
&#252;ber ihr Programm. </p>

<p>An dieser Stelle noch eine Bitte an alle Anwender. Wie Sie selbst sehen,
steckt sehr viel Arbeit und Zeit in diesem Programm. Wird dieses
raubkopiert, so bringen Sie die Autoren um ihren wohlverdienten Lohn.
Dar&#252;ber hinaus ist das Kopieren und Weitergeben des Programmes
gesetzlich verboten und strafbar. Unterst&#252;tzen Sie die
Weiterentwicklung von Xi-Paint, indem Sie dieses Programm nicht
unrechtm&#228;&#223;ig weitergeben und halten Sie auch Ihre Freunde und
Bekannten an, entsprechend ehrlich zu sein. Denn nur auf diese Weise kann
ein Fortbestehen von guten Programmen wie Xi-Paint und somit auch ein
Fortbestehen des Amiga gesichert werden. </p>

<p>In diesem Sinne - Viel Spa&#223; bei der Arbeit mit Xi-Paint
w&#252;nschen Ihnen <br>

Thomas Dorn &amp; Herbert Beilschmidt  </p>


<p>P.S.: <br>
Sie werden sicherlich Fragen zu dem einen oder anderen Thema haben -
kontaktieren Sie uns ruhig! Schreiben Sie uns oder schicken Sie ein Fax.
Wir werden uns Ihr Problem ansehen und eine L&#246;sung dazu finden. </p>

<p>Weiters steht die XiPaint-BBS f&#252;r Online-User zur Verf&#252;gung, und
f&#252;r Diskussionen bin ich im FIDO-Netz erreichbar. </p>


<table border=0>
<tr><td> &nbsp; &nbsp; </td>
<td>
Thomas Dorn <br>
A-1210 Wien <br>
Kerpengasse 69 <br><br>

Fax und Mailbox: 0043-1-2714549 <br>
Fido: 2:310/98.0 </td></tr></table>

<p>Ich m&#246;chte all denjenigen danken, die sich die Arbeit angetan haben,
mir das Handbuch korrektur zu lesen und das Programm in allen Phasen der
Entstehung ausgiebig zu testen. Besonderer Dank gilt: </p>

<table border=0>
<tr><td> &nbsp; &nbsp; </td>
<td>
Axel Bruns <br>
Wolf Faust <br>
Oliver Müller <br>
J&#252;rgen Schober <br>
Peter Stegemann <br>
Rolf Tingler <br>
Karl Wundsam </td>
<td> &nbsp; &nbsp; </td><td>
Michael Hermann <br>
Henning Friedl <br>
Reinhard P&#246;ssinger <br>
Rolf Stegemann <br>
Hartwig Tauber <br>
Tamara Trenkler <br>
Peter Wlcek </td></tr></table>
<hr size=4>
</td></tr></table></center>

</body>
</html>
