<html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>9.1.2 &nbsp; Arbeitsersparnis mit Pinselmanipulationen</b></h1>

<p>Die fehlenden Teile erzeugen wir, indem wir uns der Pinselmanipulationen
von Xi-Paint bedienen. Schneiden Sie zuerst die Gerade mit Hilfe des
Pinselwerkzeuges f&#252;r rechteckige Pinsel aus. Dr&#252;cken Sie danach
die &lt;z&gt;-Taste. Dadurch wird der Pinsel um 90Ogedreht. Somit haben wir
auch das Element f&#252;r den vertikalen Verlauf der R&#246;hre erstellt.
F&#252;gen Sie dieses in die Zeichnung ein. </p>

<p>Bitte achten Sie beim Ausschneiden der Pinsel bereits darauf, da&#223;
diese genau 20x20 Pixel gro&#223; sind und sich das Element genau in der
Mitte des Pinsels befindet. Dies ist zwar unter Umst&#228;nden nicht ganz
einfach, doch mit Hilfe der Lupe sollte dies kein Problem mehr darstellen.
</p>

<p>Wenn Sie diese Kleinigkeit nicht beachten, k&#246;nnen Sie die
Positionierungshilfe, die wir anwenden wollen, nicht einsetzen. </p>

<p>Nun fehlen uns noch die vier B&#246;gen, um Biegungen in alle Richtungen
zuzulassen. Schneiden Sie dazu den bereits erstellten Bogen aus. Um die
restlichen M&#246;glichkeiten zu erhalten, gibt es zwei unterschiedliche
Vorgangsweisen. Die erste besteht darin, da&#223; Sie jeweils die
&lt;z&gt;-Taste dr&#252;cken, soda&#223; der Pinsel immer um 90Odreht. </p>

<p>Wir wollen jedoch anders vorgehen, damit wir auch zwei weitere
Pinselmanipulationen von Xi-Paint kennenlernen, n&#228;mlich die
Spiegelungen. Nachdem Sie den Pinsel aufgenommen haben, dr&#252;cken Sie
die &lt;y&gt;-Taste. </p>

<p>Daraufhin wird der Pinsel an der Senkrechten gespiegelt und wir
k&#246;nnen das Ergebnis im Arbeitsblatt einf&#252;gen. Drehen sie den
Pinsel nun durch &lt;z&gt; um 90Ound wir haben bereits den dritten Bogen,
der ebenfalls in das Arbeitsblatt gesetzt wird. </p>

<p>Schlie&#223;lich gen&#252;gt ein Druck auf die &lt;x&gt;-Taste, der den
Pinsel diesmal an der horizontalen Achse spiegelt, um auch die letzte
notwendige Biegung zu erhalten. Nachdem auch diese im Arbeitsblatt abgelegt
wurde, k&#246;nnen wir die endg&#252;ltige Sammlung der Elemente
abspeichern. In Ihrem Zeichenfenster sollten sich nun alle m&#246;glichen
Elemente befinden. </p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html>  
