<html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>6.2.2 &nbsp; Fehlerkorrektur mittels UNDO</b></h1>

<p>Sollte Ihnen beim Zeichnen ein Fehler unterlaufen, so steht Ihnen die
Undo-Taste (&lt;u&gt;) zur Verf&#252;gung. Ein Druck auf diese gen&#252;gt,
und die letzte Zeichenoperation wird r&#252;ckg&#228;ngig gemacht. Durch
nochmaliges Dr&#252;cken der Undo-Taste wird auch der vorletzte Schritt
zur&#252;ckgenommen usw. Wieviele Bearbeitungsoperationen Sie
zur&#252;cknehmen k&#246;nnen, h&#228;ngt vom vorhandenen Arbeitsspeicher
ab. </p>

<p>Nat&#252;rlich kann es vorkommen, da&#223; die Undo-Taste
irrt&#252;mlich gedr&#252;ckt wird. F&#252;r dieses Fall gibt es die
Redo-Funktion (&lt;U&gt;), mit der alle Undo-Schritte wieder
r&#252;ckg&#228;ngig gemacht werden k&#246;nnen. </p>

<p>Probieren Sie die Funktionsweise dieser beiden Operationen am besten
selbst aus. Zeichnen Sie die beiden Fenster. Bet&#228;tigen Sie nun die
Undo-Taste. Das zuletzt gezeichnete Rechteck verschwindet vom Bildschirm.
Nochmaliges Dr&#252;cken entfernt auch das erste Fenster. </p>

<p>Um sie wieder zur&#252;ckzuholen, benutzen Sie die Redo-Operation. Nach
dem ersten Ausw&#228;hlen erscheint das letzte Rechteck wieder. Wird noch
einmal Redo gew&#228;hlt, so ist auch das zweite Rechteck wieder am
Bildschirm vorhanden. </p>

<p>Dem Haus fehlt nun noch ein Dach. Um dieses zeichnen zu k&#246;nnen, ist
das Linien-Werkzeug (&lt;v&gt;) notwendig. Zeichnen Sie zuerst die beiden
&#220;berst&#228;nde am oberen Rand des Rechtecks. Hierbei kommt es auf die
genaue Positionierung des Mauspfeiles an. Dies ist leider mit der Maus
selbst nicht sehr einfach zu realisieren, da diese oftmals Spr&#252;nge von
zwei bis drei Punkten vollf&#252;hrt. Dar&#252;berhinaus kommt es beim
Dr&#252;cken oder Loslassen der Taste meist zu Verschiebungen um einige
Pixel, was unerw&#252;nschte Effekte mit sich bringt. </p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html>  
