<html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>17.4.1 &nbsp; Festlegen der Schattenl&#228;nge</b></h1>

<p>Hierbei sind jeweils Werte von -20 bis 20 Punkte erlaubt. Dies sollte
f&#252;r so gut wie jede normale Anwendung ausreichen, denn ein Schatten,
der zu weit von dem ihn erzeugenden Objekt entfernt ist, wirkt
unnat&#252;rlich und kann den r&#228;umlichen Eindruck st&#246;ren. </p>

<p>Rechts neben den Schiebereglern befinden sich zwei Eingabefelder, die
immer die aktuelle Schattenposition anzeigen. Nat&#252;rlich k&#246;nnen
die Werte dort auch direkt eingegeben werden. Sind dies Zahlen
au&#223;erhalb des Wertebereiches, so werden diese sofort nach dem
Bet&#228;tigen der Eingabetaste auf die m&#246;glichen Maximalwerte
korrigiert. </p>

<p>Den gr&#246;&#223;ten Teil des Requesters nimmt die Vorschau ein, die
ein Gef&#252;hl daf&#252;r vermitteln soll, wie der Schatten sp&#228;ter in
der Zeichnung wirkt. Sobald die Werte mit Hilfe der Schieberegler oder der
Eingabefelder ver&#228;ndert werden, wird diese &#196;nderung auch im
Vorschaubereich sichtbar. </p>

<p>In der Praxis haben sich Schatten mit einem X/Y-Abstand von 36 als
sinnvoll erwiesen. Je nach Anwendung und Aufl&#246;sung kann dieser Bereich
jedoch variieren. </p>

<p>Um den Schattenwurf beim Zeichnen aktiv werden zu lassen, dient der
&quot;Ein&quot;/&quot;Aus&quot;-Umschalter in der linken unteren Ecke des
Requesters. Nat&#252;rlich kann das Fenster w&#228;hrend des Zeichnens
ge&#246;ffnet bleiben, wobei sich &#196;nderungen bei den
Schattenparametern sofort auf die weiteren Zeichenoperationen auswirken.
</p>

<p>Wird der Schatten-Requester nicht mehr ben&#246;tigt, so kann er durch
den &quot;Schlie&#223;en&quot;-Schalter geschlossen werden. Wenn der
Schatten eingeschaltet war, so bleibt er nat&#252;rlich weiterhin aktiv.
</p>

<p>Da alle notwendigen Einstellungen f&#252;r den Schatten im Requester
getroffen werden k&#246;nnen, gibt es keine Men&#252;s mit
zus&#228;tzlichen Anweisungen. </p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html> 
