<html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>14.3 &nbsp; Leuchttisch zur exakten Positionierung</b></h1>

<p>Damit eine exakte Positionierung des Stiftes m&#246;glich ist,
aktivieren wir zuerst das Fenster mit der Blume. Danach w&#228;hlen wir im
&quot;Zeichenmodus&quot;-Men&#252;den Befehl &quot;H-Fenster?&quot;
(&lt;rechte Amiga&gt; &lt;g&gt;) an. Damit wird diese Grafik zum
Hintergrundbild erkl&#228;rt. Nun wird wieder das noch leere, zweite
Fenster aktiviert und das Leuchttisch-Werkzeug aufgerufen. Dadurch scheint
die gerade als Hintergrund definierte Grafik in halber Helligkeit durch,
ohne uns bei der Arbeit zu beeinflussen. </p>

<p>So ist es m&#246;glich, den Mittelpunkt des Stiftes ungef&#228;hr mit
der Mitte der Bl&#252;te in &#220;bereinstimmung zu bringen. Ist dies
geschehen, wird der Stift eingef&#252;gt. Da es sich um einen Airbrush
handelt, mu&#223; die Maustaste einige Sekunden lang niedergehalten werden,
bis der Stift in seiner vollen Intensit&#228;t dargestellt wird. </p>

<p><img src="bilder/xx92.gif" width=150 heigth=110 align=left hspace=6
alt="Zeichenstift">Lassen Sie sich &#252;brigens nicht davon t&#228;uschen,
da&#223; auch nach l&#228;ngerer Zeit der eingef&#252;gte Pinsel nur sehr
bla&#223; erscheint. Dies liegt am eingeschalteten Leuchttisch, der auch
das Vordergrundbild nur mit halber Helligkeit darstellt. </p>
              
<p>Da wir den Leuchttisch aber sowieso nicht mehr ben&#246;tigen, kann
dieser ausgeschaltet werden. Sofort wird der eingef&#252;gte Stift in
seiner vollen Intensit&#228;t dargestellt. </p>

<p>Damit h&#228;tten wir alle Vorbereitungen f&#252;r unsere erste
Bildkomposition getroffen. Nun kann der Layer-Requester mit Hilfe des
Men&#252;-Befehles &quot; Layer...&quot; (&lt;rechte Amiga&gt; &lt;E&gt;)
aus dem &quot; Men&#252;s&quot;Men&#252;aufgerufen werden. </p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html>
