 <html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>18.3 &nbsp; Verlauf</b></h1>

<p><b>Men&#252;:</b> Zeichenmodus/Verlauf <br>
Shortcut: &lt;rechte Amiga&gt; &lt;3&gt; </p>

<p>Besondere Effekte lassen sich mit den vielf&#228;ltigen Verlaufsformen
von Xi-Paint erzielen. Um diese auch anwenden zu k&#246;nnen, existiert der
Zeichenmodus &quot;Verlauf&quot;. Ist dieser aktiviert, so wird der
aktuelle Farbverlauf (2-Punkt bis 5-Punkt) angewendet, unabh&#228;ngig vom
Zeichenwerkzeug. </p>

<p>Das bedeutet, da&#223; eine gef&#252;llte Ellipse ebenso mit dem
Farbverlauf versehen wird wie ein ungef&#252;lltes Rechteck, wobei bei
diesem eben nur die R&#228;nder unterschiedlich dargestellt werden. </p>

<p>Das Erstellen eines korrekten Farbverlaufes ist eine &#228;u&#223;erst
rechenintensive Angelegenheit und verlangt auch einem schnellen Amiga
einiges ab. Deshalb sollten Sie vor allem, bei gr&#246;&#223;eren
Fl&#228;chen darauf achten, da&#223; m&#246;glichst ein 1-Punkt-Stift
verwendet wird, um diese mit einem Farbverlauf zu versehen. </p>

<p>Denn andernfalls zeichnet Xi-Paint f&#252;r jeden Punkt der Fl&#228;che
einmal den kompletten Pinsel, was nat&#252;rlich zus&#228;tzliche
Rechenzeit beansprucht. Vor allem wenn zus&#228;tzlich noch Masken
aktiviert sind, kann sich die Zeit, bis der Verlauf erstellt ist,
entscheidend erh&#246;hen. </p>

<p>Allerdings kann es in manchen F&#228;llen durchaus erw&#252;nscht sein,
einen Verlauf mit einem Pinsel zu erstellen, um gewisse Spezialeffekte zu
erzielen. N&#228;here Informationen hierzu erhalten Sie im Tutorial-Teil,
in dem eine solche Anwendung gezeigt wird. </p>

<p>Falls Sie einmal nicht sicher sind, ob Xi-Paint noch arbeitet und mit
dem Erstellen des Verlaufes besch&#228;ftigt ist, dr&#252;cken Sie einfach
die &lt;ESC&gt;-Taste. Daraufhin erscheint ein Fenster, das den bisherigen
Arbeitsfortschritt anzeigt und fragt, ob abgebrochen werden soll. </p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html>
