<html>
<head>
<!--     "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>13.3 &nbsp; Motive freistellen</b></h1>

<p>Am h&#228;ufigsten wird man eine Maske zum Freistellen von Motiven
verwenden. Oft kommt es vor, da&#223; man einen bestimmten Ausschnitt eines
Bildes gerne als Pinsel aufnehmen m&#246;chte, um mit diesem daraufhin
weiterarbeiten zu k&#246;nnen. </p>

<p>Wenn die Grafik so wie die eben besprochene Eist&#252;te bereits mit
einem einfarbigen Hintergrund vorliegt, stellt dies kein Problem dar. Doch
gerade bei digitalisierten Grafiken ist die Abstufung zwischen dem
gew&#252;nschten Objekt und dem Hintergrund nicht so eindeutig gegeben.
</p>

<p>Wie wir sehen werden, ist es oft sogar der Fall, da&#223; eine Farbe des
Motivs auch im Hintergrund vorkommt. </p>

<p>Das folgende Beispiel behandelt die typische Vorgehensweise beim
Freistellen eines Motives, wobei bewu&#223;t eine Grafik verwendet wurde,
die so ziemlich alle Probleme mit sich bringt, die bei dieser Aufgabe
auftreten kann. </p>

<p><img src="bilder/xx88.jpg" width=320 heigth=234 align=left hspace=6
alt="Blume.JPEG">Es handelt sich hierbei um die Datei
&quot;Blume.JPEG&quot;, die mit -Paint mitgeliefert wird. &#214;ffnen Sie
diese Grafik, soda&#223; Sie sich ein Bild von der bevorstehenden Aufgabe
machen k&#246;nnen. </p>
     
<p>Es handelt sich um eine digitalisierte Bl&#252;te samt umgebendem
Bl&#228;tterwerk. Wir m&#246;chten nun lediglich die Bl&#252;te
freistellen, soda&#223; wir diese als Pinsel aufnehmen und weiterbearbeiten
k&#246;nnen. <br clear=all></p>

<p>Ziel ist es, das Bild so zu bearbeiten, da&#223; es zum Abschlu&#223;
folgendes Aussehen hat: </p>
         
<p><img src="bilder/xx89.jpg" width=320 heigth=234 align=left hspace=6
alt="Blume freigestellt">Wie man deutlich sieht, ist es in diesem Fall
unm&#246;glich, durch Sperren einer einzelnen Farbe das gew&#252;nschte
Ergebnis zu erzielen. Durch die &quot;Addieren&quot;-Funktion der
Xi-Paint-Maske ist es zwar denkbar, nacheinander jeweils alle im
Hintergrund vorkommenden Farben auszuw&#228;hlen und zur Maske zu addieren,
doch ist diese Vorgehensweise in der Praxis kaum sinnvoll. </p>

<p>Eine weitere, komplizierte L&#246;sung w&#228;re, den Umri&#223; der
Bl&#252;te manuell nachzuzeichnen und auf diese Weise das Objekt
freizustellen. </p>

<p>Der einfachste Weg ist und bleibt jedoch die Maske. Hier gilt es zuerst
zu entscheiden, welche Art der Maske sich f&#252;r die gew&#228;hlte
Aufgabe empfiehlt. </p>

<p>Auf den ersten Blick scheint sich die Wahl einer Farbbereichs-Maske
anzubieten, mit der man einfach alle Gr&#252;n-T&#246;ne sperren
k&#246;nnte. Dies w&#228;re sicherlich ein gangbarer Weg, doch leider gibt
es auf den Bl&#228;ttern auch Reflexionen, die auf diese Weise nicht
maskiert werden k&#246;nnen. </p>

<p>Da Bl&#228;tter und Bl&#252;te ungef&#228;hr dieselben Kontrast- und
S&#228;ttigungswerte aufweisen, scheidet auch die S&#228;ttigungs- und
Kontrastmaske von vornherein aus. </p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html>
