 <html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>17.8.9 &nbsp; ASL- oder Xi-Paint-Dateirequester</b></h1>

<p>Seit der Einf&#252;hrung von Kickstart/Workbench 2.0 existiert die
M&#246;glichkeit, einen einheitlichen File-Requester f&#252;r alle
Programme zu verwenden. Dies hat den Vorteil, da&#223; der Anwender sich
lediglich an einen einzigen Requester gew&#246;hnen mu&#223; und nicht bei
jedem neuen Programm umzulernen hat. Da die Bibliothek, die diesen
Requester zur Verf&#252;gung stellt,&quot;ASL.Library&quot; hei&#223;t, hat
sich die Bezeichnung ASL-Requester durchgesetzt. </p>

<p>Xi-Paint kann diesen Vorteil leider nicht nutzen, da es vollst&#228;ndig
auf einem 24-Bit-Bildschirm der Grafikkarte (also keinem emulierten
Intuition-Screen!) l&#228;uft. Der ASL-Requester kann n&#228;mlich nur auf
System-eigenen Bildschirmen ge&#246;ffnet werden. </p>

<p>Aus diesem Grund wurde f&#252;r Xi-Paint ein eigener Dateirequester
programmiert, der zwar dem ASL-Vorbild sehr &#228;hnlich ist, aber trotzdem
einige Unterschiede aufweist. Wer trotzdem auf das ASLOriginal nicht
verzichten m&#246;chte, der kann Xi-Paint anweisen, auf dieses
zur&#252;ckzugreifen. </p>

<p>Dazu existiert die Auswahlm&#246;glichkeit &quot; ASL-Requester&quot;.
Ist sie aktiviert, wird bei allen Dateioperationen auf den ASL-Requester
zur&#252;ckgegriffen. Dies hat allerdings einige wichtige Konsequenzen:
</p>

<p>So kann, wie erw&#228;hnt, der ASL-Requester nicht aur dem
Xi-PaintBildschirm ge&#246;ffnet werden. Stattdessen wird in diesem Fall
immer auf den Workbench-Schirm zur&#252;ckgeschaltet und der Requester dort
dargestellt. Nachdem die Dateioperation abgeschlossen wurde, wird wieder
zum Xi-Paint-Screen zur&#252;ckgekehrt. </p>

<p>Ein weiterer Nachteil liegt darin, da&#223; der ASL-Requester die
Darstellung der Minipics nicht erlaubt. Es mu&#223; also auf diese
komfortable Vorschau verzichtet werden. </p>

<p>Au&#223;erdem erlaubt der ASL-Requester keine Definition eigener
Men&#252;s. Aus diesem Grund kann bei der Verwendung desselben auch das
Speicherformat nicht wie gewohnt eingestellt werden. Stattdessen wird jenes
Format angewendet, das bei der letzten Verwendung des
Xi-Paint-Standard-Dateirequesters festgelegt wurde. </p>

<p>Bei der Auswahl von Schriften bietet der ASL-Requester allerdings einige
Vorteile. Denn im Gegensatz zum Xi-Paint-Requester werden die vorliegenden
Gr&#246;&#223;en angezeigt und dar&#252;ber hinaus existiert eine
Vorschau-Leiste, soda&#223; man bereits bei der Auswahl einen Eindruck
&#252;ber das Aussehen der Schrift bekommt. </p>

<hr size=4></td></tr></table>
<br>
</body>
</html>
