<html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>17.2 &nbsp; Gitter-Requester</b></h1>

<p><img src="bilder/xx51.gif" width=60 heigth=60 align=left hspace=6
alt="Gitterrequester-Icon">Shortcut: &lt;rechte Amiga&gt; &lt;G&gt;
<br clear=all></p>

<p><img src="bilder/xx52.gif" width=228 heigth=95 align=left hspace=6
alt="">Mit Hilfe des Gitter-Requesters kann eine unsichtbare
Positionierungshilfe definiert und aktiviert werden. </p>
                                        
<p>In vielen F&#228;llen kann es von Vorteil sein, wenn beim Zeichnen eine
Positionierungshilfe zur Verf&#252;gung steht. Vor allem bei technischen
Zeichnungen oder beim Zusammensetzen einer Grafik aus mehreren
Pinsel-Elementen kann eine solche Funktion die Arbeit stark erleichtern.
</p>

<p>Der Gitter-Befehl verwandelt das Arbeitsblatt sozusagen in ein kariertes
Blatt Papier, wobei das Zeichnen nur noch an den Eckpunkten der Rechtecke
m&#246;glich ist. </p>

<p>Der Vorteil gegen&#252;ber einem herk&#246;mmlichen karierten Papier
liegt in der Tatsache, da&#223; die Abst&#228;nde zwischen den einzelnen
Linien sowohl in horizontaler als auch in vertikaler Richtung frei
w&#228;hlbar sind. Dazu werden einfach die entsprechenden Abst&#228;nde in
die jeweiligen Felder f&#252;r die &quot;Breite&quot; und
&quot;H&#246;he&quot; eingetragen. </p>


<p><b>Der Startpunkt des Gitters kann frei festgelegt werden. </b></p>

<p>Nicht immer ist es w&#252;nschenswert, da&#223; das Gitter genau in der
linken oberen Ecke beginnt. Deshalb ist es in Xi-Paint m&#246;glich,
anzugeben, in welchem Abstand vom linken und oberen Rand das Gitter seinen
Ursprung haben soll. Die notwendigen Werte werden dazu in den
Eingabefeldern &quot;X-Offset&quot; und &quot;Y-Offset&quot; angegeben.
</p>

<p>Um das Gitter ein- und auszuschalten existiert der
&quot;Ein&quot;/&quot;Aus&quot;Umschalter. W&#228;hrend des Zeichnens kann
der Gitter-Requester am Bildschirm bleiben. In diesem Fall wirken sich
&#196;nderungen der Werte in diesem sofort auf die Zeichenfenster aus. </p>

<p>Das Gitter wirkt immer f&#252;r alle ge&#246;ffneten Zeichenfenster. Es
ist nicht m&#246;glich, dieses auf ein einzelnes Fenster zu
beschr&#228;nken. Auf andere ge&#246;ffnete Requester hat das
eingeschaltete Gitter keinen Einflu&#223;. </p>

<p>Da alle notwendigen Einstellungen f&#252;r das Gitter im Requester
getroffen werden k&#246;nnen, gibt es keine Men&#252;s mit
zus&#228;tzlichen Anweisungen. </p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html>
