<html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>11.1.1 &nbsp; Ein buntes Rechteck f&#252;r unsere Experimente</b></h1>

<p>F&#252;r unsere Experimente ben&#246;tigen wir ein Rechteck, dessen
Seitenl&#228;nge ungef&#228;hr 10 bis 15 Pixel betr&#228;gt. Es mu&#223;
sich hierbei nicht unbedingt um ein Quadrat handeln, die beiden Seiten
k&#246;nnen durchaus unterschiedlich lang sein. </p>

<p>Um das relativ kleine Rechteck besser zeichnen zu k&#246;nnen, sollten
Sie die Lupe (&lt;m&gt;) aktivieren. Das Rechteck sollte im definierten
Farbverlauf erscheinen. Ist dies nicht der Fall, so &#252;berpr&#252;fen
Sie noch einmal, ob tats&#228;chlich der Zeichenmodus im gleichnamigen
Men&#252;auf &quot;Verlauf&quot; gestellt wurde. </p>

<p>Ist erst einmal des Rechteck korrekt gezeichnet, kann dieses mit Hilfe
des Pinsel-Werkzeuges (&lt;b&gt;) ausgeschnitten werden. Achten Sie hier
vor allem darauf, da&#223; nicht irrt&#252;mlich der Hintergrund mit
ausgeschnitten wird. Zur leichteren Positionierung sollte auch hierbei die
Lupe eingeschaltet bleiben. </p>

<p>Sobald  der  gew&#252;nschte  Pinsel  ausgeschnitten  wurde,  kann  die
Lupe abgeschaltet werden.  Am Mauszeiger sollte nun ein kleines
Rechteck kleben, das mit dem Farbverlauf gef&#252;llt ist.  Aktivieren
Sie nun das Werkzeug zum Zeichnen von gef&#252;llten Freihandlinien
(&lt;W&gt;) und aktivieren Sie den Zeichenmodus &quot;As-it-is&quot; (&lt;rechte
Amiga&gt; &lt;8&gt;).
</p>

<p><img src="bilder/xx21.gif" width=320 heigth=256 hspace=6 align=left
alt="Umri&#223;">Zeichnen Sie nun einen Umri&#223;, der ungef&#228;hr die
Form hat, die in dem unten abgedruckten Bild zu sehen ist. Diese Form wurde
verwendet, damit der Effekt besonders deutlich zu sehen ist. </p>
    
<p>Sobald Sie die Maustaste loslassen, beginnt Xi-Paint mit seiner Arbeit.
Je nach der gew&#228;hlten Aufl&#246;sung und der Gr&#246;&#223;e, in der
Sie den Umri&#223; gezeichnet haben, kann die Wartezeit zwischen einigen
Sekunden, aber auch mehreren Minuten betragen. Dies h&#228;ngt auch von der
vorhandenen Rechenleistung ab. </p>

<p>Sobald die Arbeit abgeschlossen ist, pr&#228;sentiert sich jedoch ein
Ergebnis, das, wenn alles gut gegangen ist, durchaus f&#252;r diese
Wartezeit belohnt. Leider kann die Wirkung in diesem Handbuch nicht so gut
gezeigt werden, da durch die Beschr&#228;nkung auf den
SchwarzWei&#223;-Druck sehr viel des Effektes verloren geht. <br
clear=all></p>
    
<p><img src="bilder/xx22.gif" width=320 heigth=256 hspace=6 align=left
alt="F&#252;llk&#246;rper">In jedem Fall sollten Sie am Bildschirm nun
einen gef&#252;llten K&#246;rper sehen, dessen rechter Rand Gr&#252;n und
dessen linker Rand (sofern er sichtbar ist) blau dargestellt wird. Dadurch
entsteht jener Pseudo3D-Effekt, der vor allem von Fernsehanstalten, aber
auch in Pr&#228;sentationen sehr gerne verwendet wird. </p>

<p>Probieren Sie noch einige weitere Figuren aus, um zu sehen, wie der
Effekt, beispielsweise bei &#252;berkreuzenden Linien, wirkt. Bevor wir uns
im n&#228;chsten Abschnitt ansehen, wie es zu diesem wirklich h&#252;bschen
Darstellungen kommt, k&#246;nnen Sie die Objekte noch ein wenig
versch&#246;nern, indem Sie die einfarbigen, roten Fl&#228;chen mit einem
Farbverlauf versehen. <br clear=all></p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html>
