<html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>16.6 &nbsp; Text</b></h1>

<p><img src="bilder/xx45.gif" width=60 heigth=60 align=left hspace=6
alt="Text-Icon"> Shortcut: t </p>
                            
<p>Texte werden in sehr vielen F&#228;llen ben&#246;tigt. Egal, ob sie nur
zur Erl&#228;uterung dienen, oder selbst den Mittelpunkt der Grafik (z.B.
bei Videotiteln) darstellen, immer wieder wird man auf die M&#246;glichkeit
zur&#252;ckgreifen, Worte in das Bild einzuf&#252;gen. Wie bereits im
Tutorial gezeigt wurde, bietet Xi-Paint hierf&#252;r eine ganze Reihe von
M&#246;glichkeiten. </p>

<p>Um einen beliebigen Text in eine Zeichnung einzuf&#252;gen, wird diese
Funktion verwendet. Nach dem Aufruf &#246;ffnet sich ein kleines Fenster
mit einem Text-Eingabefeld. Dort k&#246;nnen Sie den gew&#252;nschten Text
eintippen, wobei Ihnen die gewohnten Editierm&#246;glichkeiten zur
Verf&#252;gung stehen. </p>

<p><img src="bilder/xx86.gif" width=242 heigth=88 align=left hspace=6
alt="Texteingabefenster">Nachdem die Eingabe abgeschlossen ist, generiert
Xi-Paint unter Verwendung der im Style-Requester festgelegten Schriftart-
und gr&#246;&#223;e einen Pinsel mit dem Text. </p>

<p>Dieser kann nun wie jeder andere Pinsel auch gehandhabt werden.
Das hei&#223;t, alle Manipulationsm&#246;glichkeiten wie Spiegeln, &#196;ndern
der Gr&#246;&#223;e usw.  stehen zur Verf&#252;gung.  Auch beim Einf&#252;gen des
Textes in die Zeichnung verh&#228;lt sich dieser wie ein herk&#246;mmlicher
Pinsel, soda&#223; viele Sonderfunktionen m&#246;glich sind.
</p>

<p>Weitere Informationen &#252;ber die umfangreichen
Gestaltungsm&#246;glichkeiten mit Texten erhalten Sie im Tutorial &#252;ber
Textgestaltung. </p>

<p>Xi-Paint ist keine Textverarbeitung! </p>

<p>Es sollte allerdings nie vergessen werden, da&#223; Xi-Paint ein Mal-
und kein Textverarbeitungsprogramm ist. Deshalb ist es f&#252;r die
Integration umfangreicherer Texte in eine Grafik eher nicht geeignet. Hier
empfiehlt sich, wie bei allen anderen Malprogrammen auch, das
Zur&#252;ckgreifen auf eine entsprechende Desktop-Publishing- oder
Textverarbeitungs-Software. Xi-Paint erlaubt ausschlie&#223;lich das
Einf&#252;gen von einzeiligen Textpassagen, die daf&#252;r beliebig
gestaltet und ver&#228;ndert werden k&#246;nnen. </p>

<p>Ein Schriftzug, der durch die Textfunktion erzeugt wird, steht
&#252;brigens auch automatisch als Pinsel in der Pinselverwaltung zur
Verf&#252;gung, soda&#223; auf diesen auch nachtr&#228;glich
zur&#252;ckgegriffen werden kann. </p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html>
