 <html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>18.5 &nbsp; Weich</b></h1>

<p><b>Men&#252;:</b> Zeichenmodus/Weich <br>
Shortcut: &lt;rechte Amiga&gt; &lt;5&gt; </p>

<p>In der Natur gibt es nur in ganz wenigen F&#228;llen harte Kanten, an
denen direkt eine Farbe in die n&#228;chste &#252;bergeht. Stattdessen gibt
es meist kleine Zwischenbereiche, die einen scheinbar weichen &#220;bergang
erm&#246;glichen. </p>

<p>Der Computer dagegen zeichnet aufgrund seiner technischen Beschaffenheit
ausschlie&#223;lich harte Kanten. Bei Skizzen und technischen Zeichnungen
sind diese zwar durchaus sinnvoll, doch der K&#252;nstler, der ein eher
weiches Gem&#228;lde schaffen m&#246;chte, kann an solchen harten
&#220;berg&#228;ngen verzweifeln. </p>

<p>Es w&#228;re jedoch ein Ding der Unm&#246;glichkeit, zu versuchen,
solche &#220;berg&#228;nge per Hand zu entfernen, da man hierf&#252;r
m&#252;hselig Tausende von Punkten einzeln setzen m&#252;&#223;te. </p>

<p>Aus diesem Grund existiert der Zeichenmodus &quot;Weich&quot;. Er
versucht, &#252;berall dort, wo mit diesem Modus gezeichnet wird, harte
Farbkanten durch weiche, angenehme &#220;berg&#228;nge zu ersetzen. Gerade
bei der vollen Palette von 16,7 Millionen Farben, die Xi-Paint ja ausnutzt,
ist diese Funktion sinnvoll. </p>

<p>Denn wer bisher lediglich den eher schlechten Weichzeichner von DPaint
kennt (dessen schlechte Qualit&#228;t jedoch nicht Schuld des
Programmierers, sondern der beschr&#228;nkten Farbpalette ist), wird von
der Perfektion des Xi-Paint-Weichzeichners &#252;berrascht sein. </p>

<p>Der Zeichenmodus &quot;Weich&quot; beeinflu&#223;t lediglich Farbkanten.
Wird er also auf einer einfarbigen Fl&#228;che angewendet, so geschieht gar
nichts, da diese ja nicht weicher gemacht werden kann. </p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html> 
