<html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>13.5 &nbsp; Mehrere Schritte f&#252;hren zum Ziel</b></h1>

<p>Wahrscheinlich wird man mit der ersten Version der Maske noch nicht ganz
zufrieden sein. Noch zuviele Teile der Bl&#252;te sind von der Maske nicht
erfa&#223;t. Da&#223; auch Teile des Hintergrundes zur Maske addiert
werden, l&#228;&#223;t sich leider nicht verhindern, hier ist
nachtr&#228;gliche manuelle Korrektur angesagt. </p>

<p>Schlie&#223;en Sie ein etwaiges Anzeige-Fenster, damit die nun folgende
Maskenoperation auf das richtige Projekt ausgef&#252;hrt wird. </p>

<p>Um die Maske zu vervollst&#228;ndigen, merken Sie sich, wo noch Teile
der Bl&#252;te nicht erfa&#223;t sind, und rufen Sie dementsprechend erneut
&quot;CLUT holen&quot; auf. Nun wird genau jener Bereich markiert, der
einen Teil der noch nicht ber&#252;cksichtigten Farbt&#246;ne erh&#228;lt.
</p>

<p><img src="bilder/xx90.gif" width=320 heigth=234 align=left hspace=6
alt="Maske f&#252;r Blume">Unter Umst&#228;nden kann es notwendig sein,
da&#223; ein mehrfaches Wiederholen dieser Prozedur notwendig ist, bis das
gew&#252;nschte Ergebnis erreicht wird. Im Bild sehen Sie, wie die fertige
Maske aussehen sollte. Sie wurde mit dreimaligem Aufruf von &quot;CLUT
holen&quot; erstellt. </p>
     
<p>Nun kann die Maske zuerst invertiert und danach eingeschaltet werden.
Daraufhin sind sowohl die Bl&#252;te als auch einige kleinere Teile des
Hintergrundes gesperrt. Leider ist es gerade bei diesem Beispiel nicht
m&#246;glich, einfach durch Zeichnen eines gef&#252;llten Rechtecks
f&#252;r einen einheitlichen Hintergrund zu sorgen. </p>

<p>Dies ist deshalb, da der Bl&#252;tenansatz ebenfalls zur Bl&#252;te
geh&#246;rt. Da dieser jedoch gr&#252;n ist und somit dieselben Farben
enth&#228;lt wie der Hintergrund, mu&#223; zumindest dieser Bereich per
Hand behandelt werden. <br clear=all></p>

<p><img src="bilder/xx91.gif" width=320 heigth=234 align=left hspace=6
alt="Blume (fast fertig)">Dazu gilt es, diesen Bereich zu
vergr&#246;&#223;ern und die Kontur des Bl&#252;tenansatzes manuell
nachzuziehen. Danach kann der Rest des Hintergrundes unter Verwendung eines
gro&#223;en einfarbigen Rechteck-Pinsels eingef&#228;rbt werden. </p>
               
<p>Nun folgt die letzte Retusche, die uns kein Malprogramm abnehmen kann.
Dazu wird die Maske ausgeschaltet, soda&#223; auch die noch &#252;brigen
Teile des Hintergrundes entfernt werden k&#246;nnen. <br clear=all></p>

<p><img src="bilder/xx89.gif" width=320 heigth=234 align=left hspace=6
alt="Blume (freigestellt)">Dazu ist zwar ein wenig Geduld notwendig, doch
ist dies noch immer entscheidend weniger Aufwand als bei den zu Beginn
erw&#228;hnten Methoden. </p>
          
<p>Das Endergebnis kann sich allerdings sehen lassen. Wir haben die
Bl&#252;te nun v&#246;llig freigestellt und k&#246;nnen diese als Pinsel
aufnehmen und beliebig in andere Projekte einf&#252;gen, ohne den
Hintergrund mit &#252;bernehmen zu m&#252;ssen. </p>

<p>Wie Sie anhand dieses Beispieles gesehen haben, kann die Maske gerade
beim Freistellen von Objekten durchaus hilfreich sein. <br clear=all></p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html>
