 <html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>17.11 &nbsp; Paletten-Requester</b></h1>

<p><img src="bilder/xx67.gif" width=60 heigth=60 align=left hspace=6
alt="Paletten-Icon">Shortcut: &lt;rechte Amiga&gt; &lt;C&gt;
<br clear=all></p>
     
<p>Im Farbrequester von Xi-Paint (Colorbox) lassen sich beliebige
Farbt&#246;ne erzeugen, die danach in der eigenen Zeichnung weiterverwendet
werden k&#246;nnen. </p>

<p><img src="bilder/xx68.gif" width=249 heigth=211 align=left hspace=6
alt="Paletten-Requester">Wie bereits in den einleitenden Kapiteln
erw&#228;hnt, kann man in -Paint immer mit allen zur Verf&#252;gung
stehenden Farben gleichzeitig arbeiten, da es sich um ein reinrassiges
24-Bit-Malprogramm handelt. Allerdings w&#228;re es sehr m&#252;hsam, die
gew&#252;nschte Farbe aus einer Liste auszusuchen, da diese mit 16,7
Millionen Farben &#228;u&#223;erst lang w&#228;re. Aus diesem Grund stellt
Xi-Paint eine Arbeitspalette von insgesamt 256 verschiedenen Farbt&#246;nen
zur Verf&#252;gung, die vom Benutzer frei definiert werden k&#246;nnen.
</p>

<p>In diesem Zusammenhang sei noch einmal darauf hingewiesen, da&#223; die
Funktion der Palette bei 24-Bit-Programmen wie Xi-Paint eine andere ist als
bei herk&#246;mmlicher Malsoftware wie beispielsweise DPaint. W&#228;hrend
dort ein &#196;ndern einer Farbe der Palette automatisch auch eine
&#196;nderung aller Punkte in der Zeichnung mit sich bringt, die in dieser
Farbe gezeichnet wurden, ist dies bei Xi-Paint NICHT der Fall. </p>

<p>Die &#196;nderung der Palettenfarbe geschieht v&#246;llig
unabh&#228;ngig von den Zeichenfenstern. Dies ist auch insofern wichtig,
als da&#223; die Arbeitspalette f&#252;r alle Zeichenfenster gleichzeitig
zur Verf&#252;gung steht. </p>

<center><table><tr><td><b><dl>
<dt> 17.11.1 <a href="tx217b1.html" target="_top">"Arbeitsfarben" </a></dt>
<dt> 17.11.2 <a href="tx217b2.html" target="_top">"Mischverfahren" </a></dt>
<dt> 17.11.3 <a href="tx217b3.html" target="_top">"Kopieren, Tauschen und Verlauf" </a></dt>
<dt> 17.11.4 <a href="tx217b4.html" target="_top">"Aufnehmen einer Farbe" </a></dt>
<dt> 17.11.5 <a href="tx217b5.html" target="_top">"Maxwellsches RGB-Dreieck" </a></dt>
<dt> 17.11.6 <a href="tx217b6.html" target="_top">"HSV-Schema" </a></dt>
<dt> 17.11.7 <a href="tx217b7.html" target="_top">"Palette-Men&#252;" </a></dt>
<dt> 17.11.8 <a href="tx217b8.html" target="_top">"Schema-Men&#252;" </a></dt>
</dl></b></td></tr></table></center>
 
<hr size=4></td></tr></table></center>
<br>

</body>
</html>
