<html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>

<h1 align=center><b>11.4.2 &nbsp; Ein Rahmen anstelle des gef&#252;llten
Rechtecks</b></h1>

<p>Ein Problem ergibt sich jedoch, wenn man nun kein gef&#252;lltes
Rechteck, sondern einen Rahmen mit abgerundeten Ecken erstellen
m&#246;chte. Hier mu&#223; man zu einem einfachen, aber effizienten Trick
greifen. </p>

<p>Denn leider gen&#252;gt es nicht, einfach das Zeichenwerkzeug f&#252;r
ungef&#252;llte Rechtecke aufzurufen und mit diesem den gew&#252;nschten
Rahmen zu ziehen. Wie Sie selbst feststellen k&#246;nnen, wird in diesem
Fall ein Rahmen in der Dicke der Ellipse gezeichnet, was wohl in den
wenigsten F&#228;llen gew&#252;nscht wird. Wie wir sehen werden, ist es
trotzdem relativ einfach m&#246;glich, zum Ziel zu gelangen: </p>

<p>Bevor Sie das &#228;u&#223;ere Rechteck zeichnen, rufen Sie den
GitterRequester (&lt;rechte Amiga&gt; &lt;G&gt;) auf. Sie k&#246;nnen nun
einstellen, wie dick der Rahmen werden soll. Hierzu stellen Sie die X- und
Y-Breite auf die gew&#252;nschten Werte. Auf diese Weise ist es sogar
m&#246;glich, f&#252;r die waagerechten Linien andere St&#228;rken
einzustellen als f&#252;r die senkrechen. F&#252;r das hier beschriebene
Beispiel verwenden wir jeweils den Wert drei. Aktivieren Sie das Gitter,
indem Sie den Schalter auf &quot;Ein&quot; stellen. </p>

<p>Sie sollten &#252;brigens als Pinsel noch die Ellipse aufgenommen haben,
die wir zuvor f&#252;r das gef&#252;llte Rechteck verwendet haben. Ist dies
nicht der Fall, so deaktivieren Sie das Gitter noch einmal und erstellen
Sie den ben&#246;tigten Pinsel. </p>

<p>Hierzu ist es nat&#252;rlich nicht notwendig, noch einmal alle Schritte
(Ellipse zeichnen, auschneiden,...) durchzuf&#252;hren. Schlie&#223;lich stellt
Xi-Paint ja die Pinselverwaltung zur Verf&#252;gung!
</p>

<p>Es gen&#252;gt also, einfach den Pinsel-Requester zu &#246;ffnen und
dort jenen Eintrag zu suchen, in dem unsere Ellipse abgelegt wurde. Ein
Mausklick gen&#252;gt - schon kann mit dem gew&#252;nschten Pinsel
gearbeitet werden. </p>

<p>Aktivieren Sie nun das Werkzeug f&#252;r gef&#252;llte Rechtecke und
zeichnen Sie ein entsprechendes Rechteck in der ben&#246;tigten
Gr&#246;&#223;e. Wie bereits zuvor erhalten wir ein gef&#252;lltes Rechteck
mit abgerundeten Kanten. </p>

<p>Rufen Sie nun den Farbrequester auf und stellen Sie einen der
Farbt&#246;pfe auf die Hintergrundfarbe ein. Aktivieren Sie diesen als
aktuelle Farbe und w&#228;hlen Sie als Zeichenmodus &quot;Solid&quot;
(&lt;rechte Amiga&gt; &lt;1&gt;). Als Zeichenwerkzeug verwenden wir
weiterhin das gef&#252;llte Rechteck. Um nun den Rahmen zu erzeugen, ist
einiges an Fingerspitzengef&#252;hl notwendig. </p>

<p>Positionieren Sie den Mauszeiger zuerst in der linken oberen Ecke des
Rechtecks, das hei&#223;t dort, wo Sie zuvor mit dem ausgef&#252;llten,
eingef&#228;rbten Rechteck begonnen haben. </p>

<p>Bevor Sie nun das neue Rechteck in der Farbe des Hintergrundes zeichnen,
m&#252;ssen Sie den Mauszeiger genau um eine Gitterposition weiter rechts
und eine weiter unten plazieren. Hier ist es von Vorteil, wenn Sie sich der
Tastatur bedienen, indem Sie die &lt;linke Amiga&gt; niederhalten und mit
den Cursor-Tasten arbeiten. </p>

<p>Sobald die gew&#252;nschte Position erreicht wurde, dr&#252;cken Sie
zus&#228;tzlich zur &lt;linken Amiga&gt; noch die &lt;linke Alt&gt;.
Dadurch wird ein Druck auf die linke Maustaste simuliert. Halten Sie beide
Tasten gedr&#252;ckt und ziehen Sie das Gummiband des Rechtecks mit Hilfe
der Pfeiltasten auf die gew&#252;nschte Gr&#246;&#223;e. </p>

<p><img src="bilder/xx25.gif" width=178 heigth=142 hspace=6 align=left
alt="Rahmen mit runden Ecken">Das Rechteck mu&#223; genau um eine
Gitterposition weiter oben und um eine weiter links aufh&#246;ren, als das
zuvor gezeichnete. Wenn Sie nun alle Tasten loslassen, zeichnet Xi-Paint
das Rechteck in der Hintergrundfarbe. </p>
      
<p>Nach kurzer Zeit hat Xi-Paint seine Arbeit abgeschlossen und als
Ergebnis wird ein Rahmen in der eingestellten Dicke dargestellt. Sollte die
Positionierung nicht genau genug gewesen sein, so verwenden Sie die
&quot;Und&#246;-Funktion (&lt;u&gt;), um den letzten Arbeitsschritt
r&#252;ckg&#228;ngig zu machen, und zeichnen Sie das innere Rechteck
erneut. </p><br clear=all>

<hr size=4></td></tr></table></center>
<br>
</body>
</html>
