<html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>17.3.4 &nbsp; Minipics zur Vorschau</b></h1>

<p>Eine Besonderheit von Xi-Paint stellt das sogenannte &quot;Minipic&quot;
dar. Hierbei handelt es sich um eine Miniaturausgabe der Originalgrafik,
die auf Wunsch von Xi-Paint erzeugt und danach automatisch nach dem
einmaligen Anklicken des Dateinamens rechts von der Datei-Liste angezeigt
wird. </p>

<p>Dadurch ist es m&#246;glich, sich einen Eindruck von dem gew&#228;hlten
Bild zu machen, ohne dieses in den Speicher laden zu m&#252;ssen. Vor
allem bei gr&#246;&#223;eren Bildbest&#228;nden kann diese M&#246;glichkeit viel Zeit
und M&#252;he sparen.
</p>

<p>Dem Dateirequester sind zwei Men&#252;s zugeordnet: <br>

<b>Minipic-Men&#252; </b></p>

<p>Generieren Shortcut: &lt;rechte Amiga&gt; &lt;g&gt; </p>

<p>Xi-Paint generiert die Minipics zu den einzelnen Grafiken automatisch.
</p>

<p>Bestehende Grafiken jedoch haben kein Minipic. Dieses kann man mit
&quot;Generieren&quot; erstellen. </p>

<p>Dazu gen&#252;gt es, die entsprechende Grafik im Dateirequester einmal
anzuklicken, soda&#223; deren Name im &quot;Datei&quot;-Eingabefeld
erscheint. Wenn daraufhin der Men&#252;punkt &quot;Generieren&quot;
ausgew&#228;hlt wird, wird das Minipic erzeugt. </p>

<p>Auf dem Datentr&#228;ger wird die Datei f&#252;r das Minipic im selben
Verzeichnis wie die Originalgrafik gespeichert, wobei auch derselbe Name
verwendet wird, an den die Endung &quot;MPIC&quot; angeh&#228;ngt wird.
Sollte man aus irgendeinem Grund das Minipic nachtr&#228;glich entfernen
wollen, so gen&#252;gt es, diese Datei zu l&#246;schen. Dateien im
IFF-ILBM-Format enthalten das Minipic im File selber, es ist also
&quot;unsichtbar&quot;. </p>


<p><b>Speicherformate-Men&#252; </b></p>

<p>Im &quot;Speicherformate&quot;-Men&#252;werden alle Grafikformate
aufgelistet, die zum Speichern eines Bildes von Xi-Paint aus verwendet
werden k&#246;nnen. Da hierf&#252;r die &quot;multipic.library&quot;
verwendet wird, h&#228;ngt die Anzahl der angebotenen Speicherformate von
der jeweiligen Version der Bibliothek ab. </p>

<p>Die Einstellungen f&#252;r das Speicherformat gelten f&#252;r alle
Speicheroperationen, egal ob es sich um ein ganzes Bild oder lediglich
einen Pinsel handelt. Das gerade aktivierte Format wird durch ein
H&#228;kchen vor dem Namen gekennzeichnet. </p>

<p>F&#252;r das Laden von Bildern und Pinseln ist die Einstellung des Spei-
cherformates unwirksam, da Xi-Paint automatisch das Format der
zu ladenden Datei erkennt.
</p>

<p><b>Alpha </b></p>

<p>Shortcut: &lt;keiner&gt;</p>

<p>e nachdem, ob dieser Men&#252;punkt aktiviert ist (es wird ein Haken vor
dem Befehl gezeigt) oder nicht, wird der Alpha-Kanal der Zeichnung mit
abgespeichert. Dieser ben&#246;tigt zwar zus&#228;tzlichen Platz auf der
Festplatte, doch besonders bei Pinseln, die zuvor markiert wurden, ist es
sinnvoll, den Alpha-Kanal mitabzuspeichern, da diese dann nach dem Einladen
sofort wieder maskiert zur Verf&#252;gung stehen. </p>

<p>&#220;bersicht der Men&#252;befehle
<pre>
  _____________________________________________________________
  |    Minipic  |      |                   Speicherformate    |
  -------------------------------------------------------------
  | Generieren  | A-g  |    Hier k&#246;nnen je nach verwendeter   |
  |             |      |       Version der &quot;multipic.library&quot; |
  |             |      | unterschiedlich viele Formate stehen |
  |             |      |--------------------------------------|
  |             |      |                            Alpha     |
  -------------------------------------------------------------
  
</pre></p>
<hr size=4></td></tr></table>
<br>
</body>
</html>
