<html>
<head>
<!--     "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>12.1 &nbsp; Texte mit Farbverl&#228;ufen</b></h1>

<p>Ein &#228;u&#223;erst einfacher, aber wirkungsvoller Trick ist das
Anwenden von Farbverl&#228;ufen auf einen Text. Dies l&#228;&#223;t sich in
Xi-Paint ohne Probleme realisieren. Rufen Sie dazu den Farbrequester
(&lt;rechte Amiga&gt; &lt;C&gt;) auf und weisen Sie den ersten beiden
Farbt&#246;pfen die Farben Rot (RGB = 255,0,0) und Gelb (RGB = 255,255,0)
zu. Vergessen Sie nicht, den &quot;Zuweisen&quot;-Schalter zu
bet&#228;tigen, soda&#223; die &#196;nderungen auch tats&#228;chlich
wirksam werden. </p>

<p>&#214;ffnen Sie nun den Verlauf-Requester (&lt;rechte Amiga&gt;
&lt;U&gt;) und stellen Sie einen &quot;2 Farben, Vertikal&quot;-Verlauf
ein. Nach dem Anklicken von &quot;Vorschau&quot; sollte im Vorschaurechteck
ein Verlauf zu sehen sein, der am oberen Rand mit Rot beginnt und danach
bis zum unteren Rand in Gelb verl&#228;uft. </p>

<p>Als n&#228;chsten Schritt rufen wir den Style-Requester (&lt;rechte
Amiga&gt; &lt;T&gt;) auf, um eine m&#246;glichst gro&#223;e Schrift
einzustellen. (Falls Ihnen die anderen Requester im Weg sind, k&#246;nnen
Sie diese selbstverst&#228;ndlich schlie&#223;en. F&#252;r das
Experimentieren hat es sich jedoch als praktisch erwiesen, wenn die
ben&#246;tigten Fenster ge&#246;ffnet bleiben, soda&#223; man die Parameter
relativ schnell ver&#228;ndern kann.) </p>

<p><img src="bilder/xx27.gif" width=267 heigth=139 hspace=6 align=left
alt="Style-Requester">Klicken Sie auf das Diskettensymbol und w&#228;hlen
Sie im FontRequester eine Schriftart, von der Sie wissen, da&#223; Sie
relativ dick ist. (Diese Schriften tragen sehr oft die Endung
&quot;bold&quot; oder &quot;_B&quot;.) Die Gr&#246;&#223;e wird auf
mindestens 50 Punkte eingestellt (je nach der Aufl&#246;sung, in der Sie
arbeiten, k&#246;nnen Sie auch gr&#246;&#223;ere Ausma&#223;e annehmen. 50
Punkte eignen sich vor allem bei 640x480 oder 800x600.) </p>
        
<p>Die Werte f&#252;r xdpi und ydpi werden nicht ver&#228;ndert, das
Antiliasing wird auf &quot;Ein&quot; gestellt. Dies ist vor allem bei
Schriften wichtig, die nicht im Compugraphic-, sondern im
herk&#246;mmlichen Amiga-FontFormat vorliegen, da diese bei der Anpassung
an die gew&#252;nschte Gr&#246;&#223;e zumeist stufige, ausgefranste
Konturen bekommen. Durch die Verwendung des Antiliasing werden diese
unsch&#246;nen Effekte so weit wie m&#246;glich ausgeglichen. </p>

<p>Damit sind eigentlich bereits so gut wie alle Vorbereitungen getrof-
fen.  &#214;ffnen Sie nun ein neues Zeichenfenster, falls Sie dieses nicht
sowieso bereits getan haben. Der Zeichenmodus wird auf &quot;Verlauf&quot;
(&lt;rechte Amiga&gt; &lt;3&gt;) gestellt und als Zeichenwerkzeug verwen-
den wir (klarerweise) den Text &lt;t&gt;. Es ist &#252;brigens auch wichtig,
da&#223; der Ein-Punkt-Stift verwendet wird.
</p>

<p>Es erscheint nun ein Texteingabe-Requester, in den wir den
gew&#252;nschten Text eintippen k&#246;nnen. Nat&#252;rlich stehen alle
Editierm&#246;glichkeiten zur Verf&#252;gung. Die Eingabe wird durch die
&lt;Eingabetaste&gt; abgeschlossen. </p>

<p>Daraufhin &quot;klebt&quot; der Schriftzug als Pinsel am Mauszeiger und
kann an jene Stelle geschoben werden, an der er endg&#252;ltig
eingef&#252;gt werden soll. </p>

<p><img src="bilder/xx28.gif" width=224 heigth=73 hspace=6 align=left
alt="Text mit Farbverlauf">Wenn Sie nun die linke Maustaste dr&#252;cken,
dauert es eine kurze Zeit, und der fertige Schriftzug wird in das Bild
gezeichnet. Wie Sie selbst feststellen k&#246;nnen, geschah dies unter
Verwendung des eingestellten Farbverlaufes! Das Ergebnis sieht bereits sehr
gut aus. Nat&#252;rlich lassen sich auch alle anderen Arten des
Farbverlaufes einsetzen. Stellen Sie beispielsweise einmal den
Vier-Punkt-Verlauf ein und f&#252;gen Sie die Schrift noch einmal ein. </p>
           
<p>Auf diese Weise lassen sich bereits &#228;u&#223;erst ansprechende
Schriftz&#252;ge erstellen. Doch hat diese Vorgehensweise einen Nachteil,
der jedoch nur in Spezialf&#228;llen zu Tage tritt. Der Farbverlauf wird
n&#228;mlich immer auf den gesamten Text angewendet. </p>

<p>Was geschieht jedoch, wenn man diesen Verlauf auf jeden Buchstaben
einzeln anwenden m&#246;chte? Bei vertikalen 2-Farb-Verl&#228;ufen
&#228;ndert dies nichts, doch bei allen anderen macht es einen gewaltigen
Unterschied. </p>

<center><table border=0><tr><td><b><dl> <dt> 12.1.1 <a href="tx21211.html"
target="_top">"Buchstabenweise Farbverl&#228;ufe" </a></dt>
</dl></td></tr></table></center>

<hr size=4></td></tr></table></center>
<br>
</body>
</html>
