 <html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>17.10.6 &nbsp; Video-Men&#252;</b></h1>

<p><b>DeInterlace </b><br>

Shortcut: &lt;rechte Amiga&gt; &lt;d&gt; </p>

<p>Durch das Halbbildverfahren, das in der Videotechnik eingesetzt wird,
ergeben sich Probleme beim Digitalisieren von schnellen Bewegungen.
W&#228;hrend ein Halbbild (Zeilen 1,3,5,...) noch den ersten Teil der
Bewegung zeigt, ist im zweiten (Zeilen 2,4,6,...) bereits die n&#228;chste
Bewegungsphase zu sehen. W&#228;hrend dies bei einem laufenden Bild
f&#252;r einen fl&#252;ssigen und klaren Ablauf der Darstellung sorgt, ist
eine solche Grafik, mit dem Digitizer zum Standbild gemacht, nicht
verwendbar. </p>

<p>Um nun auch schnelle Bewegungen in guter Qualit&#228;t digitalisieren zu
k&#246;nnen, wird das DeInterlace- Verfahren verwendet, das auch von
Xi-Paint zur Verf&#252;gung gestellt wird. Dabei wird, anstelle beide
Halbbilder anzuzeigen, eines der beiden verdoppelt, soda&#223; immer zwei
Zeilen denselben Inhalt haben (1 und 2, 3 und 4, 5 und 6,...). </p>

<p>Dadurch entf&#228;llt der Halbbildversatz, das Bild kann
weiterbearbeitet werden. </p>

<p>Der Menüpunkt "DeInterlace" sollte immer dann aufgerufen werden, wenn
bei einem digitalisierten Bild ein starker Halbbildversatz zu bemerken ist.
Der Men&#252;punkt &quot;DeInterlace&quot; sollte immer dann aufgerufen
werden, wenn bei einem digitalisierten Bild ein starker Halbbildversatz zu
bemerken ist. </p>


<p><b>VTR </b><br>

Shortcut: &lt;rechte Amiga&gt; &lt;v&gt; </p>

<p>F&#252;r die Digitalisierung macht es, wenn man auf hohe Qualit&#228;t
wert legt, einen Unterschied, ob direkt das Live-Bild einer Videokamera
oder aber ein Video von einem Band digitalisiert wird. Bei der Wiedergabe
vom Band ist aufgrund der zwischengeschalteten Aufzeichnung mit
Qualit&#228;tsverlusten zu rechnen. </p>

<p>Der Digitizer VLab bietet jedoch einige M&#246;glichkeiten an, diese
Verluste so weit wie m&#246;glich auszuschalten. Dazu gibt es einen
speziellen &quot;VTR&quot;-Modus, der sich auch von Xi-Paint durch
Anw&#228;hlen des entsprechenden Men&#252;punktes aktivieren und
deaktivieren l&#228;&#223;t. Dabei wird versucht, w&#228;hrend des
Digitalisierens auf das Band zu synchronisieren, was sich in einer besseren
Qualit&#228;t niederschl&#228;gt. </p>


<p><b>Modus </b><br>

Shortcut: keiner </p>

<p>Der Digitizer VLab unterst&#252;tzt sowohl das europ&#228;ische PAL- als
auch das amerikanische NTSC-System. F&#252;r die korrekte Digitalisierung
sollte das richtige System gew&#228;hlt werden. Dies ist mit dem
Men&#252;punkt &quot;Modus&quot; m&#246;glich, der zwei
Untermen&#252;punkte, PAL und NTSC, besitzt. </p>

<p>F&#252;r das Digitalisieren sollten Sie darauf achten, immer das
korrekte Fernsehsystem eingestellt zu haben. </p>


<p>&#220;bersicht der Men&#252;befehle
<pre>
       _______________________
       |       Video  |      |
       -----------------------
       | DeInterlace  | A-d  |
       |         VTR  | A-v  |
       |       Modus  |      |
       -----------------------
</pre></p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html>
