 <html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>17.13.4 &nbsp; Farbmatrix (CLUT)</b></h1>

<p><b>Men&#252;:</b> Farbmatrix <br>
Shortcut: &lt;rechte Amiga&gt; &lt;m&gt; </p>

<p>Das obengenannte Beispiel der Bl&#252;te vor dem Himmel-Hintergrund
stellt einen Idealfall f&#252;r eine Maske dar, wie er leider nur selten zu
finden ist. Viel &#246;fter wird man anstelle von lauter verwandten Farben
(wie zum Beispiel bei lauter Blaut&#246;nen) v&#246;llig unterschiedliche
Farbwerte vorfinden. </p>

<p>So ist es durchaus &#252;blich, da&#223; im Hintergrund einer
Bl&#252;te, um bei diesem Beispiel zu bleiben, nicht nur Himmel (blau),
sondern auch Bl&#228;tter (gr&#252;n) zu sehen sind. Mit Hilfe des
Farbbereiches w&#228;re es nun nicht m&#246;glich, beide Farbt&#246;ne zu
maskieren. Aus diesem Grund bietet Xi-Paint die M&#246;glichkeit an, auf
eine Farbmatrix zur&#252;ckzugreifen. </p>

<p>Dabei wird ein festlegbarer, rechteckiger Bereich des Bildes markiert
und die enthaltenen Farben in die Maske &#252;bernommen. Zus&#228;tzlich
lassen sich wie beim Farbbereich auch hier Abweichungen festlegen. </p>

<p>Die Vorgehensweise ist folgende: Zuerst wird die Gr&#246;&#223;e des
quadratischen Bereiches festgelegt, der in der Grafik markiert werden soll.
Dazu dient der Schieberegler &quot;Kantenl&#228;nge CLUT&quot;, bei dem die
Kantenl&#228;nge des Quadrates in Bildpunkten von 1 bis 20 bestimmt werden
kann. </p>

<p>Ist diese Festlegegung getroffen, wird auf den Schalter &quot;CLUT
holen&quot; geklickt. Aktiviert man nun das Zeichenfenster, erscheint am
Mauszeiger ein Rechteck mit der bei &quot;Kantenl&#228;nge CLUT&quot;
festgelegten Gr&#246;&#223;e. Nun kann jener Teil der Grafik,(der
m&#246;glichst viele Farben, die maskiert werden sollen, enth&#228;lt,)
angeklickt werden. Zum Abschlu&#223; kann wie bei &quot;Farbbereich&quot;
noch die Abweichung bestimmt werden. </p>

<p>Auf diese Weise lassen sich auch sehr viele v&#246;llig unterschiedliche
Farbt&#246;ne in einem Durchgang in die Maske &#252;bernehmen. </p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html>
