<html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>

<h1 align=center><b>11.4.3 &nbsp; Ein Rechteck mit abgeschr&#228;gten
Kanten</b></h1>

<p>Auf dieselbe Art und Weise kann &#252;brigens auch ein Rechteck mit
abgeschr&#228;gten Kanten erstellt werden. Alles, was hierzu ben&#246;tigt
wird, ist ein rautenf&#246;rmiger Pinsel anstelle der Ellipse. </p>

<p><img src="bilder/xx26.gif" width=122 heigth=118 hspace=6 align=left
alt="Raute">Diese Form l&#228;&#223;t sich relativ einfach erstellen, indem
Sie wiederum den Gitter-Requester aufrufen. Stellen Sie nun als Gitterweite
jeweils zehn Punkte ein. Zum Zeichnen verwenden wir den EinPunkt-Stift in
einer beliebigen Farbe. Als Zeichenwerkzeug kommt das gef&#252;llte Polygon
(&lt;W&gt;) zum Einsatz. </p>
                
<p>Zeichnen Sie nun eine Raute, wie Sie im obenstehenden Bild dargestellt
ist, wobei die Ecken jeweils einen Gitterpunkt voneinander entfernt liegen
sollten. Deaktivieren Sie danach das Gitter und schneiden Sie die Raute als
Pinsel aus. </p>

<p>Nachdem der Hintergrund durch Maskierung ausgeblendet wurde (die
Vorgangsweise ist dieselbe wie beim ellipsenf&#246;rmigen Pinsel),
k&#246;nnen dieselben Arbeitschritte durchgef&#252;hrt werden wie beim
ellipsenf&#246;rmigen Pinsel. </p>

<p>Das Ergebnis ist nun jedoch ein Rechteck mit abgeschr&#228;gten Ecken.
Wenn dieser Pinsel im Zusammenhang mit kleineren Ellipsen eingesetzt wird,
kommt es zu einem ungewohnten Aussehen derselben. </p>

<p>Diese Vorschl&#228;ge waren nat&#252;rlich wiederum nur Anregungen
f&#252;r eigene Experimente. Probieren Sie selbst weiter mit diesen
Funktionen und verbinden Sie diese unter Umst&#228;nden sogar mit
Farbverl&#228;ufen. Sie werden sehen: Die Ergebnisse sind oft
&#252;berraschend! Sollten Sie einmal den Verdacht haben, da&#223; Xi-Paint
abgest&#252;rzt ist, da es f&#252;r eine Operation zu lange braucht, so
dr&#252;cken Sie die &lt;ESC&gt;-Taste. </p>

<p>Daraufhin &#246;ffnet sich ein kleiner Requester, der den
Arbeitsfortschritt anzeigt und fragt, ob die Operation abgebrochen werden
soll. Falls Sie dieses Fenster nur zur Information aufgerufen haben,
k&#246;nnen Sie Xi-Paint durch den &quot;Nein&quot;-Schalter zur
Weiterarbeit veranlassen. </p>

<p>&quot;Ja&quot; bricht den aktuellen Zeichenvorgang ab. Um die bereits durch-
gef&#252;hrten &#196;nderungen r&#252;ckg&#228;ngig zu machen, gen&#252;gt es, diese mit-
tels &quot;UNDO&quot; zu entfernen.
</p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html>
