 <html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>17.11.3 &nbsp; Kopieren, Tauschen und Verlauf</b></h1>

<p>Neben der normalen Mischung jeder einzelnen Farbe bietet Xi-Paint noch
drei weitere Hilfsmittel an, um eine m&#246;glichst effiziente Erzeugung
des gew&#252;nschten Farbtones zu erm&#246;glichen. Das erste wird durch
den Schalter &quot; Kopieren&quot; repr&#228;sentiert. Er erm&#246;glicht
das Duplizieren einer bereits bestehenden Farbe. Dazu wird diese zuerst
angeklickt, danach der Schalter &quot;Kopieren&quot; gew&#228;hlt und zum
Abschlu&#223; jener Farbtopf gew&#228;hlt, der die Farbe zugewiesen
bekommen soll. </p>

<p>Mit &quot;Tauschen&quot; ist es m&#246;glich, zwei Farbt&#246;ne
auszutauschen. Die Vorgehensweise ist dieselbe wie beim Kopieren, mit dem
Unterschied, da&#223; nun die Inhalte der beiden Farbt&#246;pfe vertauscht
werden. Diese M&#246;glichkeit ist vor allem dann n&#252;tzlich, wenn man
Farbzyklen verwenden m&#246;chte, da es bei diesen ja auf die korrekte
Reihenfolge der Farbt&#246;ne im Farbrequester ankommt. </p>

<p>Eine besondere Hilfe stellt der Schalter &quot;Verlauf&quot; dar. Mit
ihm wird vollautomatisch ein Farbverlauf zwischen zwei beliebigen
Farbt&#246;nen erzeugt, wobei auch die Anzahl der Zwischenschritte beliebig
gew&#228;hlt werden kann. </p>

<p>Diese ist lediglich durch den Umfang der Palette beschr&#228;nkt, das
hei&#223;t, maximal sind inklusive Ausgangs- und Endfarbe 256
Zwischenschritte m&#246;glich. Dies sollte f&#252;r so gut wie alle
Anwendungen ausreichen. Um einen Verlauf zu erzeugen, wird zuerst die
Startfarbe angeklickt, danach der Schalter &quot;Verlauf&quot; und
schlie&#223;lich die Endfarbe. Daraufhin werden alle dazwischenliegenden
Farbt&#246;pfe automatisch mit dem entsprechenden Farbverlauf versehen.
</p>

<hr size=4></td></tr></table></center>
<br>

</body>
</html>             
