<html>
<head>
<!--     "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>13.2 &nbsp; Die Masken-Vorschau zur Kontrolle</b></h1>

<p>Nun k&#246;nnen Sie sich mittels &quot;Anzeigen&quot; die erstellte
Maske ansehen. Hierf&#252;r &#246;ffnet sich ein eigenes Zeichenfenster,
das ebenso gro&#223; ist wie jenes, in dem sich das zu maskierende Bild
befindet. </p>

<p>Allerdings wird das Ergebnis in Graustufen angezeigt. Hierbei bedeuten
schwarze Bereiche, da&#223; diese Teile der Grafik v&#246;llig vor dem
&#220;berzeichnen gesch&#252;tzt sind. Umgekehrt k&#246;nnen alle
wei&#223;en Bereiche vollst&#228;ndig, die dazwischenliegenden Graustufen
mit abnehmender Intensit&#228;t bearbeitet werden. </p>

<p>Wie bereits erw&#228;hnt, stellt auch dieses Vorschaufenster ein
vollwertiges Zeichenfenster dar. Das hei&#223;t, Sie k&#246;nnen in diesem
Malen und es ver&#228;ndern. Allerdings bedeutet dies auch, da&#223; es
ebensoviel Speicherplatz ben&#246;tigt wie das Ausgangsbild. </p>

<p>Aus diesem Grund schlie&#223;en wir die Vorschau vor dem Weiterarbeiten
wieder. Wollen Sie zur Kontrolle das Fenster doch ge&#246;ffnet lassen, so
vergessen Sie nicht, vor dem Weiterarbeiten unser Original-Zeichenfenster
zu aktivieren, da sich andernfalls alle weiteren Operationen auf das
Vorschaufenster beziehen w&#252;rden. </p>

<p><img src="bilder/xx87.gif" width=160 heigth=256 align=left hspace=6
alt="Maske f&#252;r Eis.JPEG">Auch bei allen weiteren Arbeiten sollten Sie
die Vorschau schlie&#223;en, bevor Sie weiterarbeiten. Dadurch wird
verhindert, da&#223; Sie irrt&#252;mlich eine Maske f&#252;r die Vorschau
anstelle f&#252;r unser Arbeitsbild definieren. </p>
   
<p>Sehen wir uns nun an, was die erstellte Maske f&#252;r die Praxis
bedeutet. Schalten Sie dazu mittels &quot;Maskierung einschalten?&quot; im
Masken-Requester die Maske ein. Wenn Sie nun mit einem beliebigen Werkzeug
im Zeichenfenster malen, l&#228;&#223;t sich nur noch der Hintergrund
bearbeiten, alle Bereiche der Eist&#252;te bleiben erhalten. </p>

<p>Dadurch ist es nun ein leichtes, ein beliebiges Hintergrundbild zu
zeichnen. Auch das Einf&#252;gen von Pinseln funktioniert problemlos, da
das Hauptmotiv nicht davon betroffen ist. </p>

<p>Nun k&#246;nnte man einwenden, da&#223; dieser Aufwand unter
Umst&#228;nden nicht gerechtfertigt ist, da man dasselbe Ergebnis auch
einfacher h&#228;tte erreichen k&#246;nnen, indem man die Eist&#252;te
einfach ausschneidet und den Pinsel nach der Hintergrundfarbe maskiert.
</p>

<p>Dieser Einwand ist durchaus korrekt und f&#252;r das eben beschriebene
Beispiel steht es jedem frei, seine eigene Wahl bez&#252;glich der
Vorgehensweise zu treffen. In der Folge wollen wir uns aber ein typisches
Beispiel ansehen, bei dem nur die Verwendung einer Maske zum Ziel
f&#252;hrt. </p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html>
