 <html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>17.15.2 &nbsp; Verkleinern des Ausschnittes</b></h1>

<p>Eine absolute Neuerung stellt die Verkleinerungsfunktion von -Paint dar.
Mit Hilfe der Lupe ist es n&#228;mlich nicht nur m&#246;glich, Bildteile zu
vergr&#246;&#223;ern, sondern auch, diese verkleinert darzustellen. </p>

<p>Der Sinn dieser M&#246;glichkeit ist vor allem dann gegeben, wenn man
&#252;bergro&#223;e Bilder zu bearbeiten hat. In diesem Fall ist es oft
nicht m&#246;glich, die gesamte Grafik am Monitor darzustellen. Dadurch ist
ein Bearbeiten von gr&#246;&#223;eren Bildteilen entweder gar nicht oder
nur unter gro&#223;em Aufwand realisierbar. </p>

<p>Anders bei Xi-Paint. Hier l&#228;&#223;t sich durch Einstellen eines
entsprechenden Verkleinerungsfaktors die gesamte Grafik in einem Fenster
darstellen. Im Gegensatz zum reinen Darstellen von &#252;bergro&#223;en
Bildern, wie es beispielsweise bei DPaint m&#246;glich ist, kann bei -Paint
auch in dem &#220;berblicksbild wie gewohnt gearbeitet werden. Wiederum
werden die &#196;nderungen sowohl im normalen als auch im Lupen-Fenster
sichtbar. Dadurch sind auch gro&#223;fl&#228;chige &#196;nderungen auf
einfache Weise realisierbar, wobei nat&#252;rlich mit zunehmendem
Verkleinerungsfaktor die Genauigkeit der Manipulationen abnimmt. </p>

<p>Der Verkleinerungsfaktor kann frei bis hin zu 64-facher Verkleinerung
gew&#228;hlt werden. Allerdings ist eine Verkleinerung nur dann
m&#246;glich, wenn dadurch eine sinnvolle Darstellung in einem Fenster
m&#246;glich ist. </p>

<p>Versucht man beispielsweise, eine 320x200-Grafik mit einem
Verkleinerungsfaktor von 20 darzustellen, so ignoriert Xi-Paint dies. Der
Grund liegt darin, da&#223; bei diesem Faktor die Grafik lediglich 16x10
Punkte gro&#223; w&#228;re. Dies erlaubt kein sinnvolles Arbeiten mehr.
</p>

<p>Im Gegensatz zur Vergr&#246;&#223;erung erscheint bei der Verkleinerung,
sofern die gesamte Grafik in einem Fenster untergebracht werden kann, kein
Rechteck zur Auswahl des Ausschnittes, wenn das Lupen-Symbol angeklickt
wird. Stattdessen &#246;ffnet sich automatisch das neue Fenster, das in
diesem Fall genau jene Ausma&#223;e annimmt, die f&#252;r die verkleinerte
Darstellung notwendig sind. </p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html> 
