<html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>10.2.2 &nbsp; Farbbalken in Vollendung</b></h1>

<p>Neben Rahmen sind es vor allem effektvolle Hintergr&#252;nde, die man
als K&#252;nstler am Computer immer wieder ben&#246;tigt. Neben den
vielf&#228;ltigen M&#246;glichkeiten der Farbverl&#228;ufe, die sp&#228;ter
in diesem Kapitel noch besprochen werden, bietet Xi-Paint unter Verwendung
der Zyklen noch eine ganz besondere M&#246;glichkeit: Die Erzeugung von
Farbbalken. </p>

<p>Der Effekt l&#228;&#223;t sich nur schwer beschreiben, am besten Sie
probieren die folgenden Schritte selbst aus. Nur so viel: Sie k&#246;nnen
sich das Ergebnis am ehesten vorstellen, wenn Sie sich den Vorschaubalken
immer wieder nebeneinander dargestellt denken und damit ein komplettes
Rechteck f&#252;llen. </p>

<p>F&#252;r unseren Versuch verwenden wir die Einstellungen, die bereits
beim Rahmen getroffen wurden, also ein Zyklus von Rot nach Blau und
Gr&#252;n und wieder zur&#252;ck &#252;ber Blau nach Rot. Auch die
Schrittanzahl bleibt gleich. </p>

<p>Schalten Sie nun jedoch das Gitter aus und malen Sie bei eingeschaltetem
&quot;Zyklisch&quot;-Zeichenmodus ein gef&#252;lltes Rechteck. Je nachdem,
wie gro&#223; Sie dieses gezeichnet haben, wird es nun mit einem mehr oder
weniger geordneten Farbmuster gef&#252;llt sein. Dieses kann zwar in
manchen F&#228;llen durchaus gew&#252;nscht sein, doch reicht es f&#252;r
uns als Hintergrund nicht aus. </p>

<p>Aus diesem Grund mu&#223; das Gitter wieder aktiviert werden. In diesem
Fall stellen wir die Breite wieder auf &quot;50&quot;, die H&#246;he wird
jedoch auf &quot;1&quot; zur&#252;ckgesetzt, soda&#223; die H&#246;he des
Rechtecks frei bestimmt werden kann. Um senkrechte Balken zu erhalten, wird
der Offset auf 0 gesetzt und der &quot;Zur&#252;cksetzen&quot;-Schalter
bet&#228;tigt. </p>

<p><img src="bilder/xx19.gif" width=320 heigth=256 hspace=6 align=left
alt="Rechteck mit Zyklus">Zeichnen Sie nun wiederum ein gef&#252;lltes
Rechteck und lassen Sie sich &#252;berraschen. Dieses scheint sich nun aus
lauter senkrechten Balken zusammenzusetzen, die ineinander &#252;bergehen.
Mit diesem Ergebnis l&#228;&#223;t sich bereits viel anfangen. </p>

<p>Doch es ist noch mehr m&#246;glich! &#196;ndern Sie einmal den
Offset-Wert im Cycle-Requester (den &quot;Zur&#252;cksetzen&quot;-Schalter
nicht vergessen!) und malen Sie danach wiederum ein gef&#252;lltes
Rechteck. Dieses ist nun mit schr&#228;gen Balken versehen, was oft noch
besser wirkt als die senkrechten Streifen. <br clear=all></p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html>
