<html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>12.1.1 &nbsp; Buchstabenweise Farbverl&#228;ufe</b></h1>

<p>Damit Sie diesen Unterschied selbst ausprobieren k&#246;nnen und
gleichzeitig auch die L&#246;sung f&#252;r das eben beschriebene Problem
erfahren, l&#246;schen Sie bitte Ihr Zeichenfenster. Stellen Sie nun als
Zeichenfenster &quot;Solid&quot; (&lt;rechte Amiga&gt; &lt;1&gt;) ein. </p>

<p>F&#252;gen Sie den Text auf diese Weise noch einmal in das
Zeichenfenster ein. Sollten Sie zwischendurch auf einen anderen Pinsel
geschaltet haben, so k&#246;nnen Sie den Schriftzug auf zwei Arten
zur&#252;ckholen. </p>

<p>Die einfachste L&#246;sung besteht darin, den Pinsel-Requester
aufzurufen. Dort ist der Schriftzug als Pinsel abgelegt und kann per
Mausklick zur&#252;ckgeholt werden. </p>

<p>Der zweite Weg besteht darin, noch einmal das Text-Werkzeug aufzurufen.
Der alte Text steht automatisch im Eingabefeld und dieser kann durch einen
Druck auf die &lt;Eingabetaste&gt; wieder &#252;bernommen werden. </p>

<p>Durch die Verwendung des &quot;Solid&quot;-Zeichenmodus, wird der Text
in der gew&#228;hlten Farbe dargestellt. Dies ist an sich nichts
&#252;berraschendes, ist es doch die normale Vorgangsweise, um einen
einfarbigen Text zu erstellen. </p>

<p>Weisen Sie nun im Farbrequester den ersten vier Farben folgende Werte
zu: Rot (RGB = 255,0,0), Gelb (RGB = 255,255,0), Blau (RGB = 0,255,0) und
Blau (RGB = 0,0,255). </p>

<p>Im Verlauf-Requester w&#228;hlen Sie den &quot; 4 Farben&quot;-Verlauf.
Nach einem Klick sollte dieser auch im Vorschau-Rechteck erscheinen, wobei
die soeben verwendeten Farben verwendet werden. </p>

<p>Verwenden Sie nun den Ein-Punkt-Stift und stellen Sie als Zeichenmodus
&quot; Verlauf&quot; ein. Das Zeichenwerkzeug ist &quot; F&#252;llen&quot;
(&lt;f&gt;). Klicken Sie nun jeden Buchstaben des Textes an. Auf diese
Weise wird der Farbverlauf auf jeden Buchstaben einzeln angewendet, wobei
Xi-Paint dar&#252;ber hinaus auch noch darauf achtet, da&#223; der Verlauf
so gut wie m&#246;glich an den Buchstaben angepa&#223;t wird. </p>

<p>Auf diese Weise lassen sich auch eine ganze Menge an Experimenten
anstellen. So kann man beispielsweise jedem Buchstaben einen eigenen
Farbverlauf zuweisen. Hierbei sollten Sie immer bedenken, da&#223; es sehr
schnell &quot;zuviel des Guten&quot; sein kann. </p>

<p>Denn ein &#252;bertrieben bunter Schriftzug wird in vielen F&#228;llen
eher un&#252;bersichtlich und schwer lesbar wirken. Hier m&#252;ssen Sie
sich selbst auf Ihr eigenes k&#252;nstlerisches Gef&#252;hl verlassen, dann
werden Sie ansprechende und professionelle Texte erstellen k&#246;nnen!
</p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html>
