 <html>
<head>
<!--      "author" content="Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>17.9.4 &nbsp; Pixel-Strom</b></h1>

<p>Eine besondere Option von Xi-Paint stellt der &quot;Pixel-Strom&quot;
dar. Denn normalerweise w&#252;rde beim Zeichnen jeder Punkt gesetzt
werden. Mit Hilfe von &quot;Pixel-Strom&quot; kann Xi-Paint nun angewiesen
werden, lediglich jeden x.Punkt zu zeichnen, wobei &quot;x&quot; f&#252;r
die mit dem Schieberegler &quot;Pixel-Strom&quot; festgelegte Zahl gilt.
</p>

<p>Es gibt eine ganze Reihe von Anwendungen f&#252;r diese Einstellung. Die
erste besteht in einer starken Einsparung von Rechenzeit. Vor allem bei
gr&#246;&#223;eren Pinseln (gr&#246;&#223;er als 5x5 Pixel) ist es nicht
notwendig, jeden Punkt einzeln zu zeichnen. </p>

<p>Abh&#228;ngig von der Gr&#246;&#223;e des Pinsels reicht es aus jeden 5.
bis 15.Punkt (oder bei gro&#223;en Pinseln einen noch h&#246;heren Wert) zu
zeichnen, ohne da&#223; sich das Ergebnis &#228;ndern w&#252;rde. Da aber
die Anzahl der zu zeichnenden Punkte entsprechend niedriger wird, sinkt
auch die Rechenzeit ungef&#228;hr um den Faktor 1/x. </p>

<p>Diese Erh&#246;hung der Geschwindigkeit bewirkt weiterhin, da&#223; man
auch mit relativ gro&#223;en Pinseln bei Freihand-Zeichnungen durchgehende
Linien erh&#228;lt, die genau den Bewegungen der Maus folgen und nicht die
bekannten &quot;Abk&#252;rzungen&quot; nehmen, welche Ecken hervorrufen und
bei anderen Malprogrammen durchaus &#252;blich sind. Probieren Sie es am
besten selbst aus, indem Sie einen Luftpinsel in der Gr&#246;&#223;e von
ungef&#228;hr 20x20 Pixel aufnehmen. Lassen Sie nun zuerst den Pixel-Strom
auf 1 gestellt und f&#252;hren Sie eine relativ schnelle Freihandzeichnung
durch. Die bekannten Ecken sind zu sehen und bewirken, da&#223; das
Ergebnis wenig mit der geplanten Zeichnung zu tun hat. </p>

<p>Stellen Sie nun den Pixel-Strom auf den Wert 6 und f&#252;hren Sie
dieselbe Zeichnung noch einmal aus. Das Ergebnis sollte &#252;berzeugen,
denn die Linie bleibt vom Aussehen her zwar dieselbe, doch folgt sie nun
ganz genau den Bewegungen der Maus. </p>

<p>Doch es gibt noch eine zweite Anwendung des Pixel-Stroms. Denn mit
diesem ist es ebenso m&#246;glich, bewu&#223;t eine punktierte Linie zu
erzeugen, indem der Wert entsprechend hoch eingestellt wird. Da diese
Einstellung auch f&#252;r F&#252;ll-Operationen verwendet wird, kann man
auf diese Weise sehr schnell auch interessante F&#252;llmuster erzeugen.
</p>

<p>An dieser Stelle ein wichtiger Hinweis, der bei der Benutzung des
Ellipsen-Werkzeuges von Bedeutung ist. Wird eine Ellipse mit einem geraden
Wert als Pixel-Strom gezeichnet, so ist nur deren obere H&#228;lfte
sichtbar! Dies ist kein Fehler von Xi-Paint, sondern ergibt sich aufgrund
der Technik, mit der die Ellipse gezeichnet wird. </p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html>
