<html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>10.2.1 &nbsp; Ein Rahmen f&#252;r alle F&#228;lle</b></h1>

<p>Dies ist jedoch in vielen F&#228;llen gar nicht notwendig,
erm&#246;glicht es doch die Zyklus-Funktion, einen wirkungsvollen Rahmen
mit einigen wenigen Handgriffen zu gestalten. Um diesen besser sichtbar
werden zu lassen, w&#228;hlen wir zuerst aus dem &quot;
Stifte&quot;-Requester (&lt;rechte Amiga&gt; &lt;P&gt;) einen
gr&#246;&#223;eren Stift (mindestens 2x2) aus. </p>

<p>Unser Rahmen soll von Rot beginnend nach Blau und schlie&#223;lich nach
Gr&#252;n &#252;bergehen, um danach wieder Blau und schlie&#223;lich Rot zu
werden. Dadurch wird ein geschlossener Zyklus erreicht. Diesen definieren
wir im Farbrequester, indem die Farbt&#246;pfe 0 und 4 Rot zugewiesen
bekommen (RGB = 255/0/0), die Farbt&#246;pfe 1 und 3 Blau (RGB = 0/0/255)
und der zweite Farbton schlie&#223;lich Gr&#252;n (RGB = 0/255/0). </p>

<p>Danach wird der Cycle-Requester aufgerufen. Als Schrittanzahl
w&#228;hlen wir &quot;50&quot; und f&#252;r &quot;von&quot; und
&quot;bis&quot; wird &quot;0&quot; und &quot;4&quot; eingetragen. Offset
erh&#228;lt den Wert &quot;0&quot;. Nach dem Anklicken des
&quot;Generieren&quot;-Schalters sollte im Vorschaubalken der
gew&#252;nschte Farbverlauf sichtbar sein. </p>

<p><b>Voraussetzungen f&#252;r einen gleichm&#228;&#223;igen Rahmen</b>
</p>

<p>Um nun zu erreichen, da&#223; der Rahmen ein gleichm&#228;&#223;iges
Aussehen bekommt, mu&#223; die Seitenl&#228;nge desselben ein Vielfaches
der Schrittanzahl sein. Dadurch wird erreicht, da&#223; bei jeder Ecke ein
Zyklus zu Ende ist. Um dies zu erreichen, verwenden wir die GitterFunktion
von Xi-Paint. </p>

<p>Nachdem der Gitter-Requester (&lt;rechte Amiga&gt; &lt;G&gt;) aufgerufen
wurde, werden f&#252;r die Breite und die H&#246;he jeweils 50 eingetragen.
Daraufhin wird der Schalter auf &quot;Ein&quot; gestellt, soda&#223; das
Gitter aktiv ist. </p>

<p>Bevor mit dem Zyklus gezeichnet werden kann, mu&#223; zuerst der
Zeichenmodus auf &quot;Zyklisch&quot; gestellt werden. </p>

<p>Wird jetzt die Zeichenfunktion &quot;ungef&#252;lltes Rechteck&quot;
verwendet, so kann man den Rahmen lediglich in Gr&#246;&#223;en ziehen, die
ein Vielfaches von 50 gro&#223; sind. Probieren Sie es aus, und zeichnen
Sie einige Rechtecke. </p>

<p>Sollte die Farbe an den Ecken nicht mit der ersten Farbe des Zyklus
&#252;bereinstimmen, so tragen Sie im Cycle-Requester bei
&quot;Offset&quot; &quot;0&quot; ein und bet&#228;tigen Sie den
&quot;Zur&#252;cksetzen&quot; - Schalter. </p>

<p>Mit diesen wenigen Schritten ist der Rahmen fertiggestellt. Er sollte
seine Wirkung eigentlich nicht verfehlen. Sollten Sie eine andere
Gr&#246;&#223;e f&#252;r den Rahmen ben&#246;tigen, die nicht ein
Vielfaches von 50 ist, so &#228;ndern Sie einfach die Schrittweite auf
jenen Wert, der f&#252;r Ihre Gr&#246;&#223;e notwendig ist. Hierbei sollte
auf keinen Fall vergessen werden, da&#223; der
&quot;Generieren&quot;-Schalter bet&#228;tigt wird. </p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html> 
