 <html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>18.2 &nbsp; Hintergrund</b></h1>

<p><b>Men&#252;:</b> Zeichenmodus/Hintergrund <br>
Shortcut: &lt;rechte Amiga&gt; &lt;2&gt; </p>

<p>Eine Spezialfunktion stellt der Zeichenmodus &quot;Hintergrund&quot; von
Xi-Paint dar. Mit ihm ist es m&#246;glich, Bildteile eines
&quot;dahinterliegenden&quot; Bildes durchzuzeichnen. Dazu ist es
nat&#252;rlich nicht notwendig, da&#223; ein Zeichenfenster genau hinter
einem anderen liegt, da dies nur schwer zu bewerkstelligen w&#228;re.
Deshalb geht Xi-Paint hier einen v&#246;llig neuen Weg, der viele
M&#246;glichkeiten er&#246;ffnet. </p>

<p>Einem Zeichenfenster kann n&#228;mlich ein beliebiges anderes, gerade
ge&#246;ffnetes Zeichenfenster als Hintergrundbild zugewiesen werden. Die
Gr&#246;&#223;e der beiden Bilder ist hierbei v&#246;llig egal, das
hei&#223;t, das Hintergrundfenster kann durchaus auch gr&#246;&#223;er oder
kleiner als das Zeichenfenster sein. </p>

<p>Allerdings gibt es hierbei eine kleine Einschr&#228;nkung. Es kann immer
nur ein einziges Hintergrundbild geben, das dann f&#252;r alle anderen
Zeichenfenster als solches agiert. Um dieses zu definieren, gen&#252;gt es,
das entsprechende Zeichenfenster zu aktivieren. </p>

<p>Danach wird der Men&#252;punkt &quot;H-Fenster?&quot; (&lt;rechte
Amiga&gt; &lt;g&gt;) aufgerufen. Dieser wird mit einem Haken versehen, und
das Fenster ist ab sofort das Hintergrundfenster. Diese Festlegung bleibt
so lange aufrecht, bis das Fenster geschlossen wird oder ein anderes
Zeichenfenster als Hintergrund definiert wird. </p>

<p>Nat&#252;rlich kann jederzeit w&#228;hrend des Zeichnens auch ein
anderes Fenster als Hintergrund zugewiesen werden. Die Vorgehensweise ist
dieselbe wie eben beschrieben. Das bisherige Hintergrundfenster verliert
dann seine Funktion und wird automatisch durch das neue ersetzt. </p>

<p>Wird das Hintergrundfenster geschlossen, so geht automatisch auch der
Zusammenhang zwischen diesem und dem Vordergrundbild verloren. Das
hei&#223;t, wenn nun weiterhin versucht wird, im Vordergrundbild mit dem
Zeichenmodus &quot;Hintergrund&quot; zu arbeiten, geschieht absolut nichts.
</p>

<p>Darauf sollten Sie &#252;brigens auch achten, wenn Sie in einem Fenster
mit dem Modus &quot;Hintergrund&quot; t&#228;tig sind, und zwischendurch in
einer anderen Zeichnung &#196;nderungen vornehmen m&#246;chten. Ist
n&#228;mlich der Hintergrund-Modus aktiviert, und es wird ein einem Fenster
gezeichnet, dem kein Hintergrundbild zugewiesen wurde, so geschieht absolut
nichts. </p>

<p>Dies f&#252;hrt manchmal zur Verwirrung, doch gen&#252;gt es, einfach im
&quot;Zeichenmodus&quot;-Men&#252;nachzusehen, ob &quot; Hintergrund&quot;
aktiviert, ist und unter Umst&#228;nden einen anderen, passenden
Zeichenmodus zu w&#228;hlen. </p>

<hr size=4></td></tr></table></center>
<br>
<br>
</body>
</html>
