<html>
<head>
<!--     "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>11.4.1 &nbsp; Ein Rechteck mit abgerundeten Ecken</b></h1>

<p>Dazu rufen wir zuerst den Farben-Requester auf und stellen dort jene
Farbe ein, in der das Rechteck erscheinen soll. Sie k&#246;nnen hier jeden
beliebigen Farbton verwenden, der Ihnen pers&#246;nlich zusagt. Stellen Sie
danach den Zeichenmodus auf &quot;Solid&quot; und aktivieren Sie den
Ein-Punkt-Stift. Als Zeichenwerkzeug kommt die gef&#252;llte Ellipse zum
Einsatz. </p>

<p>Es wird nun eine Ellipse oder ein Kreis gezeichnet, wobei Sie gleich
bedenken k&#246;nnen, da&#223; jeder Vierteilkreis sp&#228;ter einmal eine
Ecke darstellen wird. Um also langgezogene Ecken zu erhalten, ist eine
Ellipse notwendig. F&#252;r gleichf&#246;rmige Ecken wird ein Kreis
verwendet. </p>

<p>Achten Sie darauf, da&#223; die Ellipse nicht zu gro&#223; wird. Der
Durchmesser sollte maximal 20 bis 30 Bildpunkte betragen. Hierf&#252;r gibt
es mehrere Gr&#252;nde, die im sp&#228;teren Arbeitsablauf noch klar werden
sollten. </p>

<p>Sobald eine Ellipse nach Ihren W&#252;nschen gezeichnet wurde, kann
diese mit Hilfe des Pinsel-Werkzeuges ausgeschnitten werden. Hierbei sollte
die komplette Ellipse aufgenommen werden, das hei&#223;t, es sollte
vermieden werden, Teile derselben &quot;abzuschneiden&quot;. </p>

<p>Im Gegensatz zum rechteckigen Pinsel in den vorhergehenden Beispielen
l&#228;&#223;t es sich nun nicht mehr verhindern, da&#223; auch Teile des
Hintergrundes mit ausgeschnitten werden. Damit diese bei der Verwendung des
Pinsels durchsichtig werden, ist es notwendig, diesen entsprechend zu
maskieren. </p>

<p>Dazu wird, wie bereits beim Beispiel der Zaunteile gezeigt, einfach
die Hintergrundfarbe im Farbrequester angeklickt. Danach k&#246;nnen
jene Teile des Hintergrundes, die nun mit dem Pinsel ausgeschnit-
ten wurden, durch Druck auf die &lt;/&gt;-Taste durchsichtig gemacht
werden.
</p>

<p><img src="bilder/xx24.gif" width=191 heigth=172 hspace=6 align=left
alt="Rechteck mit runden Ecken">Den auf diese Weise entstandenen runden
Pinsel verwenden wir nun, um ein Rechteck mit abgerundeten Ecken zu
erstellen. Hierzu gen&#252;gt es, das Werkzeug f&#252;r gef&#252;llte
Rechtecke aufzurufen und ein entsprechendes zu zeichnen. Je nach
Gr&#246;&#223;e des von Ihnen ausgeschnittenen Pinsels und je nach Ihrer
Rechnerkonfiguration kann es nun einige Zeit (bis hin zu einigen Minuten)
dauern, bis Xi-Paint seine Arbeit erledigt hat. </p>
      
<p>Das Ergebnis sollte nun ein Rechteck mit den abgerundeten Ecken sein. Je
nach Form der zu Grunde liegenden Ellipse haben die Ecken eine
entsprechende Form. Der Grund, warum das Rechteck mit diesem Aussehen
entsteht, ist derselbe, wie er schon bei der Erzeugung des 3D-Effektes
besprochen wurde: Dadurch, da&#223; -Paint das Rechteck von links oben nach
rechts unten zeichnet, wird an den Ecken der urspr&#252;ngliche Pinsel
sichtbar. </p>

<p>Diese Vorgehensweise ist auf jeden Fall komfortabler und schneller, als
die Ecken per Hand zu zeichnen. Es ist lediglich darauf zu achten, da&#223;
das gezeichnete Rechteck um die Pinselausma&#223;e gr&#246;&#223;er wird,
als das beim Zeichnen angezeigte Gummiband, da ja f&#252;r jeden Punkt des
Gummibandes ebenfalls jeweils einmal der Pinsel gezeichnet wird. </p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html> 
