<html>
<head>
<!--     "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>12.2.1 &nbsp; Texte werden ebenso behandelt wie Linien
oder Rechtecke</b></h1>

<p>Im Gegensatz zu fast allen anderen Zeichenprogrammen interpretiert
Xi-Paint auch einen Text als ein solches Objekt, und wendet beim Darstellen
ebenfalls den zuletzt eingestellten Pinsel oder Stift an. Aus diesem Grund
war es beim vorhergehenden Beispiel auch so wichtig, da&#223; Sie vor dem
Einf&#252;gen der Schrift auf den Ein-PunktStift geschaltet haben. </p>

<p>Wie l&#228;&#223;t sich diese Eigenschaft nun f&#252;r Schriften nutzen?
Das folgende Beispiel soll Ihnen einen Eindruck davon geben, welche Effekte
sich erzeugen lassen, wenn man den richtigen Pinsel auf einen Text
anwendet. </p>

<p>&#214;ffnen Sie dazu wiederum den Farbrequester und weisen Sie den
ersten vier Farbt&#246;pfen wieder die Farben Rot, Gelb, Blau und Gr&#252;n
zu (siehe oben). Sollten diese noch vom vorherigen Beispiel eingestellt
sein, so brauchen Sie nichts mehr zu &#228;ndern. </p>

<p>Im Verlauf-Requester wird ein &quot;4 Farben&quot;-Verlauf aktiviert.
Als Zeichenmodus verwenden wir &quot;Verlauf&quot; und als Zeichenwerkzeug
das gef&#252;llte Rechteck (&lt;R&gt;). </p>

<p>Bevor Sie nun ein Rechteck zeichnen, schalten Sie die Lupe ein. Es ist
n&#228;mlich notwendig, das Rechteck genau 8x6 Punkte gro&#223; zu machen.
Dies erfordert einiges an Fingerspitzengef&#252;hl, sollte sich jedoch
bewerkstelligen lassen. </p>

<p>W&#228;hlen Sie danach das Werkzeug zum Ausschneiden von rechteckigen
Pinseln (&lt;b&gt;) und nehmen Sie genau das Rechteck als Pinsel auf.
Achten Sie dabei darauf, nicht irrt&#252;mlich Teile des Hintergrundes mit
auszuschneiden. </p>

<p>Sobald diese Arbeit erledigt ist, k&#246;nnen Sie die Lupe wieder
ausschalten. Im Style-Requester wird wieder eine m&#246;glichst dicke
Schrift eingestellt. Als Gr&#246;&#223;e verwenden wir dieses Mal
mindestens 75 Punkte. </p>

<p>Stellen Sie den Zeichenmodus wieder auf &quot; Solid&quot; und
aktivieren Sie das Text-Zeichenwerkzeug. Geben Sie nun einen beliebigen,
kurzen Text ein. Es empfiehlt sich, zwischen jedem Buchstaben ein
Leerzeichen einzugeben, da die einzelnen Buchstaben durch die Anwendung des
Pinsels ein wenig breiter werden. </p>

<p><img src="bilder/xx29.gif" width=279 heigth=84 hspace=6 align=left
alt="Text mit Pinsel">Schlie&#223;en Sie die Eingabe wieder mit der
&lt;Eingabetaste&gt; ab und f&#252;gen Sie den Text an einer beliebigen
Stelle in der Zeichnung ein. Nach kurzer Zeit sollte, wenn Sie alles
richtig gemacht haben, der Text mit einem &#228;u&#223;erst bunten und
effektvollen Pseudo-3D-Effekt angezeigt werden. </p>
                     
<p>Das Ergebnis sollte bereits &#252;berzeugend sein. Doch es
l&#228;&#223;t sich noch weiter verbessern, wenn Sie nun einen &quot;2
Farben, Vertikal&quot;Verlauf einstellen, den Ein-Punkt-Stift und das
F&#252;llwerkzeug aktivieren und als Zeichenmodus &quot;Verlauf&quot;
verwenden. Klicken Sie nun bei jedem Buchstaben in den gro&#223;en,
einf&#228;rbigen Bereich, und dieser wird mit dem Verlauf ausgef&#252;llt.
</p>

<p>Der so entstandene Schriftzug stellt wahrscheinlich alles in den
Schatten, was man bisher in Bezug auf Textgestaltung am Amiga kannte.
Selbst professionelle Videotitler k&#246;nnen solche Effekte nicht bieten!
</p>

<p>Doch dies ist erst der Anfang! Experimentieren Sie selbst weiter, und
Sie werden noch eine ganze Menge anderer, atemberaubender Effekte erzeugen.
Xi-Paint stellt das notwendige Werkzeug zur Verf&#252;gung - nutzen Sie es!
</p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html>
