<html>
<head>
<!--     "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>13.4 &nbsp; Die Farbmatrix zur Maskierung</b></h1>

<p>Im Endeffekt bleibt also nur noch das Verfahren der Color-LookupTable
(CLUT), das im Men&#252;unter der Einstellung &quot;Farbmatrix&quot;
(&lt;rechte Amiga&gt; &lt;m&gt;) zu finden ist. </p>

<p>Die CLUT ist eigentlich nichts anderes als ein frei w&#228;hlbarer
rechteckiger Bereich der Grafik. Xi-Paint untersucht nun, welche Farbwerte
sich in diesem Rechteck befinden, und maskiert diese. </p>

<p>Bei der Gr&#246;&#223;e des Rechtecks sind Werte von 1 bis 20 f&#252;r
die Kantenl&#228;nge desselben erlaubt. Bei maximaler Ausdehnung kann man
also mit einem Mal bis zu 400 verschiedene Farbt&#246;ne (20 x 20 = 400)
aufnehmen und sperren. </p>

<p>Wir wollen diese Vorgehensweise nun verwenden, um die Bl&#252;te
freizustellen. Dazu rufen wir den Masken-Requester auf und stellen als
Maskierungsart im gleichnamigen Men&#252;&quot; Farbmatrix&quot; ein. </p>

<p>Im Requester selbst wird der Schieberegler &quot;Kantenl&#228;nge
CLUT&quot; auf das Maximum, also auf 20 Pixel eingestellt. Nun kann das
Bild &quot;Blume.JPEG&quot; ge&#246;ffnet werden. Ist dies erledigt, rufen
wir zun&#228;chst den Befehl &quot;Maske l&#246;schen&quot; auf, um
sicherzustellen, da&#223; keine vorhandene Maske verwendet wird. </p>

<p>Jetzt kann mit der eigentlichen Definition der Maske begonnen werden.
Dazu wird der Schalter &quot;CLUT holen&quot; angeklickt. Sobald nun der
Mauszeiger &#252;ber das Bild der Blume bewegt wird, erscheint anstelle
desselben ein Rechteck, das einem Fadenkreuz &#228;hnlich sieht. </p>

<p>Mit Hilfe dieses Rechtecks kann nun jener Farbbereich der Grafik
ausgew&#228;hlt werden, der f&#252;r die Maske verwendet werden soll.
F&#252;r unser Beispiel wird der Mauszeiger so plaziert, da&#223; das
Rechteck ungef&#228;hr die Mitte der Bl&#252;te inklusive eines Teiles der
r&#246;tlichen Staubgef&#228;&#223;e umfa&#223;t. </p>

<p>Durch einen Klick auf die linke Maustaste wird dieser Bereich
&#252;bernommen. Durch &quot;Addieren&quot; kann eine entsprechende Maske
erstellt werden. Diese wird nun mit &quot;Anzeigen&quot; kontrolliert. Es
&#246;ffnet sich ein Fenster, das ebenso gro&#223; ist wie die Grafik.
Dieses enth&#228;lt jedoch die Maske selbst. </p>

<p>Die wei&#223;en Bereiche zeigen jene Bildteile an, die weiterhin
bearbeitet werden k&#246;nnen, w&#228;hrend die schwarzen Teile gesperrte
Farben bedeuten. Zwar ist derzeit unsere Maske noch falsch herum erstellt
(der Hintergrund ist schwarz, also gesperrt, die Bl&#252;te zur Bearbeitung
freigegeben), doch kann dies, sobald die Maske fertig definiert ist,
mittels des Men&#252;befehles &quot;Invertieren&quot; (&lt;rechte Amiga&gt;
&lt;v&gt;) des &quot;Maskenoperation&quot;-Men&#252;s jederzeit
ge&#228;ndert werden. </p>

<hr size=4></td></tr></tr></table></center>
<br>
</body>
</html>
