<html>
<head>
<!--     "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>14.8 &nbsp; Masken zum Einf&#252;gen als Layer</b></h1>

<p>Bevor wir das vierte Bild erstellen, wollen wir uns ansehen, wie die
Kombination der bisherigen drei wirkt. Dazu f&#252;gen wir unser neues
Arbeitsblatt, das ja, seitdem es mittels &quot;Neu&quot; erstellt wurde,
auch in der &quot;Projekte&quot;-Liste des Layer-Requesters angezeigt wird,
mittels &quot;Add&quot; in die &quot;Layer&quot;-Liste ein. </p>

<p>W&#252;rden wir nun &quot;Anzeigen&quot; w&#228;hlen, so w&#228;re das
Ergebnis dasselbe wie vorhin, es h&#228;tte sich nichts ge&#228;ndert. Der
Grund hierf&#252;r liegt in der Tatsache, da&#223; Xi-Paint f&#252;r das
Hinzuf&#252;gen weiterer Grafiken deren Masken verwendet. </p>

<p>Da diese aber noch nicht definiert wurde und somit leer ist, kann
Xi-Paint keine Elemente der neuen Grafik in die Komposition einf&#252;gen.
</p>

<p>Deshalb rufen wir den Masken-Requester auf. F&#252;r unsere Zwecke
reicht eine Maske, die die Helligkeitswerte des Verlaufes
ber&#252;cksichtigt, weshalb wir den Befehl &quot;Maximum-Maske&quot;
(&lt;rechte Amiga&gt; &lt;a&gt;) aus dem
&quot;Masken-Operation&quot;-Men&#252;aufrufen. </p>

<p><img src="bilder/xx95.gif" width=150 heigth=110 align=left hspace=6
alt="3-Layer-Komposition">Auf diese Weise wird die Maske v&#246;llig
automatisch erzeugt, soda&#223; auch das Klicken auf den
&quot;Addieren&quot; Schalter unterbleiben kann. Wenn Sie m&#246;chten,
k&#246;nnen Sie sich die neu definierte Maske mittels &quot;Anzeigen&quot;
im Masken-Requester darstellen lassen. Nun sind alle Vorbereitungen
getroffen, um alle drei Bilder zu kombinieren. Klicken Sie auf den
&quot;Anzeigen&quot;-Schalter des LayerRequesters und lassen Sie sich vom
Ergebnis &#252;berraschen. <br clear=all></p>
                       
<p>Um wirklich alle M&#246;glichkeiten des Layer-Requesters zeigen zu
k&#246;nnen, wollen wir nun noch eine vierte Grafik erstellen, die einen
horizontalen Farbverlauf enthalten soll. </p>

<p>Um Speicherplatz zu sparen, schlie&#223;en wir zuerst die durch die
Layer-Komposition erzeugte Grafik. </p>

<p>Auch das neue Bild soll wieder die Ausma&#223;e 150x110 Pixel haben. Im
Farben-Requester stellen wir die erste Farbe auf Gr&#252;n (0,255,0) und
die zweite auf Blau (0,0,255) ein (&quot;Zuweisen&quot; nicht vergessen!).
</p>

<p>Im Verlauf-Requester w&#228;hlen wir &quot;2 Farben, horizontal&quot;,
als Zeichenmodus &quot;Verlauf&quot; und als Zeichenwerkzeug wieder das
F&#252;llwerkzeug. Wie vorhin f&#252;llen wir nun auch das vierte Fenster.
</p>

<p>Wiederum mu&#223; eine Maske definiert werden, damit die neue Grafik
auch in die Layer-Kombination mit einbezogen werden kann. Die
Vorgehensweise ist dieselbe wie beim dritten Bild, da wieder eine
Maximum-Maske verwendet wird. </p>

<p><img src="bilder/xx96.gif" width=150 heigth=110 align=left hspace=6
alt="4-Layer-Komposition">Mittels &quot;Add&quot; f&#252;gen wir nun auch
das vierte Bild in die &quot;Layer&quot;Liste ein. Das Ergebnis sehen wir
uns mit &quot;Anzeigen&quot; an. Was nun geboten wird, erf&#252;llt
durchaus bereits professionellen Anspr&#252;chen und wurde trotzdem ohne
gro&#223;en Aufwand erzeugt. <br clear=all></p>
                                                
<p><img src="bilder/xx97.gif" width=150 heigth=110 align=left hspace=6
alt="4-Layer-Komposition (Variation)">Nat&#252;rlich lassen sich durch eine
andere Reihenfolge in der &quot;Layer&quot;Liste neue Effekte erzeugen.
Probieren Sie es selbst aus, indem Sie beispielsweise den horizontalen vor
den vertikalen Farbverlauf anordnen. Das Ergebnis sieht wiederum anders
aus. <br clear=all></p>
                                      
<p>Wichtig ist, da&#223; Sie sich immer vor Augen halten, da&#223; der
erste Eintrag der &quot;Layer&quot;-Liste f&#252;r die Helligkeit und der
zweite f&#252;r die Farbwerte zust&#228;ndig sind. Dann lassen sich,
Kreativit&#228;t und Fantasie vorausgesetzt, Bildkompositionen erzeugen,
die auch so manchen Profi-Grafiker erblassen lassen! </p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html>
