<html>
<head>
<!--     "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>11.2 &nbsp; Die zugeh&#246;rige Theorie</b></h1>

<p>Der eben beschriebene Effekt sieht zwar sehr gut aus, doch um ihn auch
wirklich nutzen zu k&#246;nnen, ist es f&#252;r Sie sicher von Interesse zu
erfahren, wie dieser zustande kommt. Wie bereits erw&#228;hnt, verwendet
Xi-Paint zum F&#252;llen von Fl&#228;chen nicht immer einen EinPunkt-Stift,
sondern setzt hierf&#252;r den aktuellen Pinsel ein. </p>

<p>Dieser wird jedoch nicht, entsprechend seiner Gr&#246;&#223;e, wie eine
Kachel nebeneinander gesetzt, sondern es wird trotzdem jeder einzelne Punkt
der zu f&#252;llenden Fl&#228;che gezeichnet. Das hei&#223;t, f&#252;r
jeden Punkt der Fl&#228;che wird einmal der gesamte Pinsel dargestellt.
Daraus erkl&#228;rt sich auch die relativ lange Rechenzeit, bis auch eine
kleine Fl&#228;che vollst&#228;ndig gef&#252;llt ist. </p>

<p>Xi-Paint geht bei &quot;F&#252;llen&quot;immer vom am h&#246;chsten oben
liegenden Punkt aus. Sollten mehrere Punkte auf derselben H&#246;he liegen,
so wird mit jenem begonnen, der am weitesten links liegt. Danach wird die
Fl&#228;che jeweils von links nach rechts und von oben nach unten
ausgef&#252;llt. </p>

<p>Auf diese Weise entsteht der Pseudo-3D-Effekt. Denn w&#228;hrend die
inneren Teile immer durch den oberen Rand des Pinsels (der in unserem Fall
Rot ist) dargestellt werden, ist am rechten und am linken Rand immer auch
der Rest des Pinsels sichtbar. </p>

<p>Wer diese Vorgehensweise einmal erkannt und verstanden hat, kann
Xi-Paint sogar bei der Arbeit &#252;ber die Schulter schauen. Stellen Sie
dazu noch einmal allen Einstellungen so ein, wie vorhin beim F&#252;llen
der Freihandfl&#228;che (Rechteck mit Verlauf als Pinsel, &quot;Solid&quot;
als Zeichenmodus) und w&#228;hlen Sie dieses Mal eine gef&#252;llte Ellipse
(&lt;E&gt;) als Zeichenwerkzeug. </p>

<p>Wenn Sie nun eine Ellipse zeichnen, werden Sie feststellen, da&#223; diese
(leider) keinen 3D-Effekt mehr aufweist. Stattdessen ist die untere
H&#228;lfte (bis auf den rechten Rand) mit Blau gef&#252;llt und die obere
H&#228;lfte mit Rot.
</p>

<center><table border=0><tr><td><b><dl>
  <dt> 11.2.1 <a href="tx21121.html" target="_top"> "Xi-Paint auf die Finger geschaut!" </a></dt></dl>
</td></tr></table></center>
<hr size=4></td></tr></table></center>
<br>
</body>
</html> 
