<html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>10.1.3 &nbsp; Offset-Angaben zur exakten Zyklus-Festlegung</b></h1>

<p>Wenn Sie nun an einer anderen Stelle weiterzeichnen, so bemerken Sie,
da&#223; der Zyklus wieder bei diesem Blauton fortgesetzt wird. Zeichnen
Sie nun wieder so lange, bis die blaue Farbe erreicht wird. Stellen Sie nun
im Cycle-Requester das Eingabefeld &quot;Offset&quot; auf &quot;0&quot; und
klicken darauf auf den &quot;Zur&#252;cksetzen&quot;-Schalter. </p>

<p>Wird nun weitergezeichnet, so beginnt Xi-Paint nicht mit der Farbe, mit
der zuletzt aufgeh&#246;rt wurde (Blau) sondern mit der ersten Farbe des
Zyklus (Rot). Mit dem Offset kann also festgelegt werden, mit welcher Farbe
des Zyklus die n&#228;chste Zeichenoperation beginnen soll. Normalerweise
verwendet Xi-Paint hierf&#252;r einen internen Wert, der sich aus der
zuletzt verwendeten Farbe ergibt. </p>

<p>In bestimmten Situationen kann es jedoch, wie wir gleich sehen werden,
w&#252;nschenswert sein, die Startfarbe selbst zu bestimmen. Dazu wird der
entsprechende Wert im &quot;Offset&quot;-Feld des Cycle-Requester
eingetragen und daraufhin der &quot;Zuweisen&quot;Schalter bet&#228;tigt.
Hierbei ist zu beachten, da&#223; f&#252;r jede neue Zeichenoperation der
&quot;Zuweisen&quot;-Schalter verwendet werden mu&#223;. </p>

<p>Nat&#252;rlich l&#228;&#223;t sich der Zeichenmodus
&quot;Zyklisch&quot;, wie alle anderen Zeichenmodi auch, mit allen
vorhandenen Pinseln und Stiften einsetzen. Bei Pinseln ist lediglich darauf
zu achten, da&#223; diese im &quot;Outline&quot;-Modus verwendet werden
m&#252;ssen, das hei&#223;t, da&#223; lediglich deren Form, nicht aber
deren Farben verwendet werden. </p>

<p>Probieren Sie ruhig ein wenig mit dem Zyklus herum, bevor Sie den
n&#228;chsten Abschnitt lesen. Versuchen Sie, eigene
Farb&#252;berg&#228;nge zu erzeugen, wobei Sie nat&#252;rlich nicht auf
drei verschiedene Farben beschr&#228;nkt sind. Es lassen sich theoretisch
beliebig viele Farbt&#246;ne verwenden. Beim Experimentieren sind lediglich
einige wichtige Dinge zu beachten. </p>

<p>Wenn Sie einen Zyklus &#252;ber mehrere Farben verwenden, so kann es
sehr schnell passieren, da&#223; der angegebene Wert bei
&quot;Schritte&quot; zu klein wird. Dies &#228;u&#223;ert sich darin,
da&#223; der Zyklus beim Zeichnen pl&#246;tzlich irgendwo abbricht und
wieder mit der ersten Farbe begonnen wird. </p>

<p>In diesem Fall mu&#223; die Schrittgr&#246;&#223;e erh&#246;ht werden.
Als Faustregel gilt, da&#223; pro verwendeter Farbe ungef&#228;hr 15 bis 20
Schritte verwendet werden sollten. Sollten trotzdem noch Fehler auftreten,
so versuchen Sie es mit einigen verschiedenen Werten (+/-10). </p>

<p>Ein oft gemachter Fehler: &quot;Generieren&quot; vergessen!</p>

<p>Vergessen Sie niemals, nach einer &#196;nderung der Werte im
CycleRequester den &quot;Generieren&quot;-Schalter zu bet&#228;tigen.
Andernfalls kommt es zu ungew&#252;nschten Effekten. W&#228;hrend eine
&#196;nderung der &quot;von&quot;/&quot;bis&quot;-Werte ohne Anw&#228;hlen
von &quot;Generieren&quot; die weitere Verwendung des bisherigen Zyklus
bedeutet, entstehen beim &#196;ndern der Schrittanzahl ohne
zus&#228;tzliches Klicken auf &quot;Generieren&quot; unsch&#246;ne Fehler
im Zyklus. </p>

<p>Diese ergeben sich daraus, da&#223; zwar intern angenommen wird,
da&#223; der Zyklus aus der neuen Anzahl an Schritten besteht, sich dieser
jedoch, da ja &quot;Generieren&quot; nicht angeklickt wurde, immer noch aus
der alten Schrittanzahl zusammensetzt. </p>

<p>Wurde eine gro&#223;e Anzahl an Schritten bei nur wenigen Farben
verwendet, so kann es passieren, da&#223; der Zyklus scheinbar nicht
funktioniert. Dies kann man leicht selbst ausprobieren, indem man die
Schritte beispielsweise mit &quot;2000&quot; festlegt und den Zyklus
&quot;von&quot; 0 bis &quot;1&quot; reichen l&#228;&#223;t. </p>

<p>Nach dem Anklicken von &quot;Generieren&quot; wird der Verlauf
v&#246;llig richtig angezeigt, doch sobald man im Zeichenfenster ein
Rechteck zieht, besteht der Rahmen scheinbar lediglich aus einer einzigen
Farbe. </p>

<p>Dies ist jedoch kein Fehler, sondern Xi-Paint tut genau das, was ihm
aufgetragen wurde, n&#228;mlich den Zyklus so aufzuteilen, da&#223; dessen
letzte Farbe erst nach 2000 Schritten erreicht wird. Wenn nun das Rechteck
durchschnittlich aus 200 Punkten besteht (50x50 Pixel), so sind lediglich
die ersten drei bis vier Abstufungen der ersten Farbe sichtbar, die oftmals
als sehr &#228;hnlich, wenn nicht sogar gleich angesehen werden. </p>

<p>Da&#223; der Zyklus trotzdem funktioniert, kann einfach
&#252;berpr&#252;ft werden, indem einige weitere Rechtecke gezogen werden;
oder man zeichnet mit dem Freihandwerkzeug eine m&#246;glichst lange Linie.
Auch dann merkt man, wie langsam der Zyklus durchlaufen wird. </p>

<p>Wenn diese Punkte beachtet werden, sollte es keine Probleme mehr mit der
Zyklus-Funktion geben. Experimentieren Sie ein wenig herum, bevor Sie im
n&#228;chsten Abschnitt einige Anwendungen f&#252;r die Praxis
kennenlernen. </p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html>  
