 <html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>17.14.9 &nbsp; Stifte-Men&#252;</b></h1>

<p><b>Swap to Disk </b><br>

Shortcut: &lt;rechte Amiga&gt; &lt;w&gt; </p>

<p>Um die Arbeit nicht durch unn&#246;tige Festplattenzugriffe zu
verz&#246;gern, speichert Xi-Paint alle &#196;nderungen in der
Stifteverwaltung (zum Beispiel Aufnahme oder Manipulation von Stiften)
zuerst im Hauptspeicher. Erst wenn nicht mehr gen&#252;gend Platz vorhanden
ist, werden diese Daten auf die Festplatte geschrieben. </p>

<p>Vor allem, wenn viel Speicher zur Verf&#252;gung steht, kann es
vorkommen, da&#223; sehr viele Stifte im Speicher gehalten werden, die sich
von jenen auf der Festplatte unterscheiden. Dies bedeutet, da&#223; im
Falle eines Absturzes die &#196;nderungen verloren gehen. </p>

<p>Mit diesem Befehl wird deshalb das Schreiben der Stifte auf die
Festplatte erzwungen. Dadurch ist eine &#220;bereinstimmung zwischen den
Daten auf der Festplatte und im Hauptspeicher gegeben. </p>
   
<p><b>Auffrischen </b><br>

Shortcut: &lt;rechte Amiga&gt; &lt;f&gt; </p>

<p>Der Befehl &quot;Auffrischen&quot; wird immer dann ben&#246;tigt, wenn
aus irgendeinem Grund Unordnung in die Stifteverwaltung gekommen ist (zum
Beispiel durch Dateimanipulationen an den Stiftedateien von anderen
Programmen aus). </p>

<p>Wird dieser Befehl aufgerufen, so werden zuerst ebenso wie bei
&quot;Swap to Disk&quot; alle im Hauptspeicher stehenden Daten auf die
Festplatte geschrieben. Daraufhin werden die Stiftedateien nacheinander
geladen und die dazugeh&#246;rigen Symbolbilder, die im StifteRequester
angezeigt werden, neu erzeugt. </p>

<p>Hierbei werden gleichzeitig einige &#220;berpr&#252;fungen
durchgef&#252;hrt. So wird beispielsweise &#252;berpr&#252;ft, ob es
Symbolbilder gibt, zu denen keine Stiftdatei mehr existiert (z.B. da diese
mit Hilfe eines anderen Programmes gel&#246;scht wurde). In diesem Fall
wird die Symboldatei entfernt. </p>

<p>Die Neugenerierung und &#220;berpr&#252;fung nimmt einige Zeit in
Anspruch, soda&#223; dieser Befehl wirklich nur sinnvoll ist, wenn man nach
l&#228;ngerer Arbeit mit Xi-Paint sicherstellen m&#246;chte, da&#223; das
Stifte-Verzeichnis wieder auf den neuesten Stand gebracht wird. </p>

<p><b>L&#246;schen </b> <br>

Shortcut: &lt;rechte Amiga&gt; &lt;D&gt; </p>

<p>Mit dieser Anweisung wird Xi-Paint dazu veranla&#223;t, alle verwalteten
Stifte zu l&#246;schen. </p>

<p>Dies empfiehlt sich vor allem, wenn eine gro&#223;e Anzahl an zu
verwaltenden Stiften eingestellt und bei der letzten Arbeit mit sehr
gro&#223;en Pinseln gearbeitet wurde. Da diese auf der Festplatte
gespeichert werden, belegen sie unter Umst&#228;nden unn&#246;tig Platz.
</p>

<p>Auch aus Datenschutzgr&#252;nden kann der Aufruf von
&quot;L&#246;schen&quot; sinnvoll sein. Dadurch ist es m&#246;glich,
Stifte, die anderen Anwendern nicht zug&#228;nglich sein sollen, aus der
Stifteverwaltung zu entfernen. </p>

<p><b>Einen Stift l&#246;schen </b> <br>

Shortcut: &lt;rechte Amiga&gt; &lt;x&gt; </p>
  
<p>Nicht immer m&#246;chte man tats&#228;chlich alle Stifte l&#246;schen.
Es sollen doch einige erhalten bleiben, soda&#223; ein Aufruf von
&quot;L&#246;schen&quot; nicht sinnvoll erscheint. </p>

<p>Neben dem Datenschutz, der bei Stiften wohl eher selten aktuell werden
wird, ist es vor allem der Festplattenverbrauch, der hier ausschlaggebend
sein kann. </p>

<p>Denn die Stifte werden, um sie zwischenzuspeichern, auf der Festplatte
abgelegt. Hat man nun bei einem Projekt mit einer ganzen Reihe von extrem
gro&#223;en Stiften gearbeitet (100x100), so k&#246;nnen dadurch unter
Umst&#228;nden einige MByte Plattenplatz verbraucht werden. </p>

<p>Wenn man die Arbeit abgeschlossen hat, empfiehlt es sich daher, die
nicht mehr ben&#246;tigten gro&#223;en Stifte gleich zu l&#246;schen, um
mehr freien Platz auf der Festplatte zu bekommen. </p>

<p>Das ist mit dem Men&#252;punkt &quot;Einen Stift l&#246;schen&quot;
m&#246;glich. Dazu mu&#223; der zu l&#246;schende Stifteintrag im
Stifte-Requester angeklickt und daraufhin dieser Men&#252;punkt aufgerufen
werden. Dadurch wird der Stift gel&#246;scht und der Platz auf der
Festplatte freigegeben. </p>

<pre>
    &#220;bersicht der Men&#252;befehle

        _______________________________
        |               Stifte  |     |
        -------------------------------
        |         Swap to Disk  | A-w |
        |          Auffrischen  | A-f |
        |              L&#246;schen  | A-D |
        |  Einen Stift l&#246;schen  | A-x |
        -------------------------------
</pre>

<hr size=4></td></tr></table></center>
<br>
</body>
</html>
