<html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>13 &nbsp; Masken - Helfer in vielen Situationen</b></h1>

<p>Bevor wir uns in diesem Kapitel in der Praxis mit Masken befassen,
wollen wir uns zuerst der Theorie zuwenden. Denn gerade die Maskenfunktion
von Xi-Paint stellt ein extrem wichtiges Werkzeug in der t&#228;glichen
Arbeit dar. Doch um diese auch sinnvoll anwenden zu k&#246;nnen, gilt es,
einiges Grundwissen zu besitzen. </p>

<p>Eine Maske dient dazu, bestimmte Bildbereiche vor der Bearbeitung, oder
vor dem &#220;bermalen, zu sch&#252;tzen. Dazu wird Xi-Paint mitgeteilt,
da&#223; Bildpunkte, deren Farbe mit denen der Maske definierten Farben
&#252;bereinstimmt nicht beeinflu&#223;t werden d&#252;rfen. </p>

<p>Dies klingt auf den ersten Blick ziemlich kompliziert, deshalb wollen
wir uns die Erzeugung einer Maske einmal ansehen, soda&#223; Sie ein
Gef&#252;hl f&#252;r die Anwendung bekommen. &#246;ffnen Sie dazu das File
&quot;Eis.JPEG&quot;, das mit Xi-Paint mitgeliefert wird. Es handelt sich
hierbei um eine Eist&#252;te, die in allen m&#246;glichen Farben
gl&#228;nzt. </p>
     
<p><img src="bilder/xx73.jpg" width=160 heigth=256 align=left hspace=6
alt="Eis.JPEG">Wir wollen nun mit der einfachsten Maske beginnen, die
Xi-Paint zu bieten hat. Nehmen wir an, es w&#228;re unsere Aufgabe,
f&#252;r die Eist&#252;te einen Hintergrund zu malen. Diese Aufgabe kann
ziemlich schwierig werden, denn w&#228;hrend der Arbeit m&#252;&#223;te man
laufend darauf achten, das Originalmotiv nicht zu &#252;bermalen. </p>

<p>Sehr schnell w&#252;nscht man sich in diesem Fall eine M&#246;glichkeit,
dieses Motiv einfach zu sperren, soda&#223; man zeichnen kann, ohne einen
Bereich der Eist&#252;te zu zerst&#246;ren. </p>

<p>Genau das wird durch das Erstellen einer Maske erreicht. Rufen Sie dazu
den Masken-Requester (&lt;rechte Amiga&gt; &lt;M&gt;) aus dem
&quot;Men&#252;s&quot;-Men&#252; auf. Dieser enth&#228;lt vielf&#228;ltige
Einstellungsm&#246;glichkeiten, von denen wir alle in diesem Tutorial
besprechen werden. F&#252;r uns ist der Schalter &quot;auf Farbe
maskieren&quot; von Interesse, sowie das rechts danebenstehende
Farb-Rechteck. <br clear=all></p>

<p><img src="bilder/xx72.gif" width=308 heigth=216 align=left hspace=6
alt="Masken-Requester">Prinzipiell ist zu beachten, da&#223; Xi-Paint alle
Masken-Operationen immer auf das zuletzt aktive Zeichenfenster anwendet.
Dies ist vor allem dann wichtig, wenn mehrere Fenster gleichzeitig
ge&#246;ffnet sind. In diesem Fall mu&#223; immer das gew&#252;nschte
Zeichenfenster aktiviert werden und erst danach die Maske aufgerufen
werden. </p>

<p>H&#228;ufig geschieht es n&#228;mlich, da&#223; man zwischendurch
mittels der Vorschau-Option, die Xi-Paint f&#252;r die Masken bietet, ein
Fenster &#246;ffnet, das die gerade aktuelle Maske darstellt. Dieses wird
automatisch aktiviert. </p>

<p>Da das Vorschaufenster jedoch ein vollwertiges Zeichenfenster darstellt,
kann es vorkommen, da&#223; man, sofern dieses nicht vor dem Weiterarbeiten
geschlossen wird, die n&#228;chsten Maskenoperationen auf dieses anwendet.
Um diesem Problem von vorneherein zu entgehen, sollten Sie die
Vorschaufenster vor dem Weiterarbeiten immer schlie&#223;en. </p>

<p>Dies hilft auch beim Speicherplatz-Sparen, da jedes Fenster ebenso viel
Speicher ben&#246;tigt wie das urspr&#252;ngliche Zeichenfenster.
M&#246;chte man den Werdegang der Maske verfolgen und deshalb die
Vorschaufenster ge&#246;ffnet lassen, so darf man nicht vergessen, immer
nach dem Anzeigen sofort das Arbeits-Zeichenfenster zu aktivieren. </p>
     
<p>Wir wollen erreichen, da&#223; Xi-Paint alle Farben der Zeichnung mit
Ausnahme des schwarzen Hintergrundes, f&#252;r die Bearbeitung sperrt. Dazu
ist es zuerst notwendig, dem Malprogramm mitzuteilen, wie die
Hintergrundfarbe aussieht. </p>

<p>Die einfachste M&#246;glichkeit, dies zu tun, besteht darin, zuerst die
&lt;#&gt;-Taste zu dr&#252;cken. Dadurch wird der Farbe Null (bzw. dem
aktuellen Palettenregister) jene Farbe zugewiesen, die sich beim
n&#228;chsten Mausklick unter dem Mauszeiger befindet. </p>

<p>Aus diesem Grund positionieren wir die Maus nun an einer beliebigen
Stelle des Hintergrundes und dr&#252;cken die linke Maustaste. Wenn Sie
wollen, k&#246;nnen Sie im Farbrequester (&lt;rechte Amiga&gt;&lt;C&gt;)
nachpr&#252;fen, ob die Farbe Null nun tats&#228;chlich mit der
Hintergrundfarbe &#252;bereinstimmt. </p>

<p>Als n&#228;chsten Schritt m&#252;ssen wir im Masken-Requester
einstellen, da&#223; die Farbe Null, die nun durch das Schwarz des
Hintergrundes dargestellt werden sollte, f&#252;r die Maskierung verwendet
werden soll. </p><br>

<center><table><tr><td><b><dl>

<dt> 13.1 <a href="tx2131.html" target="_top">"Die zu maskierende Farbe w&#228;hlen" </a></dt>
<dt> 13.2 <a href="tx2132.html" target="_top">"Die Masken-Vorschau zur Kontrolle" </a></dt>
<dt> 13.3 <a href="tx2133.html" target="_top">"Motive freistellen" </a></dt>
<dt> 13.4 <a href="tx2134.html" target="_top">"Die Farbmatrix zur Maskierung" </a></dt>
<dt> 13.5 <a href="tx2135.html" target="_top">"Mehrere Schritte führen zum Ziel" </a></dt>
</dl></b>
</td></tr></table></center>
<hr size=4></td></tr></table>
<br>
</body>
</html>
