<html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>

<h1 align=center><b>10.2.6 &nbsp; 5-Punkt-Verl&#228;ufe f&#252;r besondere
Effekte</b></h1>

<p>Eine Sonderstellung nimmt hier der 5-Punkt-Farbverlauf ein. Hier wird
von den Farbt&#246;pfen her dieselbe Aufteilung beibehalten wie beim
4-Punkt-Verlauf. Zus&#228;tzlich wird die Farbe des f&#252;nften Farbtopfes
f&#252;r den frei plazierbaren Punkt verwendet. </p>

<p>Diese freie Plazierbarkeit stellt nun die eigentliche Besonderheit des
Xi-Paint-5-Punkt-Farbverlaufes dar. W&#228;hrend es bisher &#252;blich war,
da&#223; sich der f&#252;nfte Punkt in der Mitte des Bildschirms befindet,
erlaubt es Xi-Paint dem Anwender nun, diesen frei innerhalb des Verlaufes
zu plazieren. </p>

<p>Hierf&#252;r stehen im Verlauf-Requester zwei Schieberegler zur
Verf&#252;gung, die dessen Position in X- und Y-Richtung angeben. Hierbei
wird auf Prozent-Angaben zur&#252;ckgegriffen, da der Verlauf selbst beim
Zeichnen ja unterschiedliche Ausma&#223;e annehmen kann, weshalb ein
Angeben von Pixel nicht sinnvoll w&#228;re. </p>

<p>Ein Wert von X=0% und Y=0% bedeutet, da&#223; sich der f&#252;nfte Punkt
in der linken oberen Ecke befindet. Dies hat wenig Sinn, da er dadurch vom
ersten Farbpunkt &#252;berdeckt wird. Man sollte darauf achten, da&#223;
der f&#252;nfte Punkt zumindest in einer Richtung mindestens 25% Prozent
vom Rand entfernt ist. Eine Angabe von Y=100% (unterer Rand) und X=25%
w&#228;re durchaus denkbar. Hier befindet sich der f&#252;nfte Punkt am
unteren Rand genau 1/4 vom linken Rand entfernt. </p>

<p><img src="bilder/xx20.gif" width=228 heigth=140 hspace=6 align=left
alt="Farbverlaufsrequester">Um einen Eindruck zu bekommen, wie der Verlauf
aussehen wird, kann der Schalter &quot;Vorschau&quot; verwendet werden. Die
Anzeige, die im Vorschau-Rechteck dargestellt wird, wird nur bei einem
Klick auf diesen Schalter aktualisiert. Deshalb ist das Vorschau-Rechteck
mit Vorsicht zu genie&#223;en. </p>
     
<p>Im Gegensatz zum Cycle-Requester, wo &#196;nderungen in der Farbe oder
bei den Parametern erst wirksam wurden, wenn der
&quot;Generieren&quot;-Schalter bet&#228;tigt wurde (der deshalb auch den
Namen &quot;Generieren&quot; und nicht &quot;Vorschau&quot; tr&#228;gt),
werden &#196;nderungen am Farbverlauf sofort &#252;bernommen, soda&#223;
die Vorschau-Anzeige nicht immer den gerade aktiven Farbverlauf
wiederspiegelt. </p>

<p>Ein einfaches Beispiel besteht darin, da&#223; Sie einen vertikalen
Verlauf von Rot nach Gr&#252;n entwerfen. Danach &#228;ndern Sie die erste
Farbe (Rot) in dem Farbrequester beispielsweise auf Blau. Im
VerlaufsRequester wird weiterhin der Verlauf von Rot nach Gr&#252;n
gezeigt, doch sobald Sie im Verlauf-Zeichenmodus malen, wird ein Verlauf
von Blau nach Gr&#252;n berechnet. </p>

<p>Aus diesem Grund sollte man immer, wenn man zwischenzeitlich mit dem
Farbrequester gearbeitet hat, den &quot;Vorscha&#252;-Schalter des
Verlauf-Requesters bet&#228;tigen, bevor man im Verlauf-Zeichenmodus
weiterarbeitet. Dadurch ist man automatisch vor unangenehmen
&#220;berraschungen sicher. </p>

<p>Die Arbeit mit Farbverl&#228;ufen gestaltet sich &#228;u&#223;erst
einfach. Nachdem ein entsprechender Verlauf definiert wurde, gen&#252;gt
das Ausw&#228;hlen des Verlauf-Zeichenmodus (&lt;rechte Amiga&gt;
&lt;3&gt;), und schon wirkt der Verlauf auf alle Zeichenoperationen. Das
bedeutet, da&#223; Linien und Freihandstriche ebenso als Verlauf
dargestellt werden wie gef&#252;llte Fl&#228;chen, unabh&#228;ngig von
deren Form. Experimentieren Sie auch hier ein wenig herum, indem Sie
beispielsweise den gesamten Hintergrund eines Bildes mit Hilfe des
F&#252;llwerkzeuges und eines Verlaufes f&#252;llen. Denn vor allem die
Mehrpunkt-Verl&#228;ufe er&#246;ffnen eine ganze Reihe von gestalterischen
M&#246;glichkeiten, die sich am besten durch Probieren herausfinden und
entsprechend einsetzen lassen. </p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html>
