 <html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>20.1 &nbsp; Was ist und kann ARexx?</b></h1>

<p>Seit der Version 2.0 des Amiga-Betriebssystems geh&#246;rt die
Skriptsprache ARexx zum Lieferumfang des Amiga. Viele Anwender scheuen die
Verwendung von ARexx, da dieses ein Grundwissen an
Programmiersprachenkenntnissen voraussetzt. Allerdings sind die Befehle so
einfach gehalten, da&#223; jeder, der schon einmal Basic programmiert hat,
auch mit ARexx arbeiten kann. </p>

<p>Im Gegensatz zu einer Programmiersprache, die entweder einen Interpreter
oder einen Compiler ben&#246;tigt, ist ARexx eine Skriptsprache. Das
bedeutet, die &quot;Programme&quot; liegen als Textdateien vor, in denen
Zeile f&#252;r Zeile die Befehle stehen. Man kann sich dies &#228;hnliche
einer Batch-Datei von Amiga-DOS vorstellen. </p>

<p>Wird ein ARexx-Skript aufgerufen, so wird dieses Befehl f&#252;r Befehl
abgearbeitet. Dies w&#252;rde, vor allem auch aufgrund des relativ geringen
Sprachumfanges von ARexx, noch keine Besonderheit ausmachen. Doch ARexx hat
die Eigenschaft, dem Anwender die M&#246;glichkeit in die Hand zu geben,
beliebige andere Programme zu steuern. </p>

<p>Einzige Vorbedingung ist, da&#223; das entsprechende Programm einen
sogenannten ARexx-Port besitzt. Dieser mu&#223; vom jeweiligen Programm
verwaltet werden und dient als Kommunikationskanal zwischen ARexx und dem
Anwenderprogramm. </p>

<p>Jedes Programm kann nun eine beliebige Anzahl an Befehlen zur
Verf&#252;gung stellen, die von ARexx aus aufgerufen werden k&#246;nnen und
danach im Programm selbst ausgef&#252;hrt werden. Auf diese Weise wird,
abh&#228;ngig von der Menge der zur Verf&#252;gung gestellten Befehle, ein
mehr oder weniger vollst&#228;ndiges Steuern eines Programmes von ARexx aus
m&#246;glich. </p>

<p>Dadurch k&#246;nnen einerseits wiederkehrende Arbeitsabl&#228;ufe sehr
einfach automatisiert werden und andererseits lassen sich auf diese Weise
v&#246;llig neue Funktionen in ein Programm integrieren. </p>

<p>Anhand eines einfachen Beispieles soll der Vorteil von ARexx
demonstriert werden. Nehmen wir an, Sie ben&#246;tigen laufend eine
Ellipse, die ein Seitenverh&#228;ltnis von 2:1 aufweist. Nat&#252;rlich
kann Xi-Paint eine solche Spezialfunktion nicht von Haus aus bieten, da der
Funktionsumfang sonst un&#252;bersichtlich werden w&#252;rde. </p>

<p>Normalerweise w&#228;re es nun notwendig, da&#223; Sie per Hand
versuchen, eine solche Ellipse zu erzeugen. Einfacher ist es jedoch, nun
eine eigene ARexx-Funktion zu entwerfen, die genau diese Aufgabe
&#252;bernimmt. Per Mausklick steht die gew&#252;nschte Ellipse dann immer
zur Verf&#252;gung. </p>

<p>An dieser Stelle ein kleiner Tip f&#252;r ARexx-Einsteiger: Oft ist es
leichter, ein bereits bestehendes ARexx-Skript zu ver&#228;ndern, anstelle
ein neues zu erzeugen. Hier bietet Xi-Paint eine ideale Unterst&#252;tzung,
denn alle Makros, die aufgezeichnet werden, werden als ARexx-Datei
abgelegt. </p>

<p>Sie k&#246;nnen diese nun in einen beliebigen Texteditor laden und so
ver&#228;ndern, wie Sie es f&#252;r notwendig erachten. Auf diese Weise
erh&#228;lt man sehr schnell das gew&#252;nschte Ergebnis, ohne zuvor
umfangreiche Programmierschritte durchf&#252;hren zu m&#252;ssen. </p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html> 
