 <html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>22 &nbsp; Lade- und Speicher-Funktionen</b></h1>

<p>Xi-Paint wickelt alle Lade- und Speicheroperationen &#252;ber die
sogenannte mulitpic.Library ab. Diese stellt eine ganze Reihe von Formaten
zur Verf&#252;gung, die einen beliebigen Austausch zwischen
Grafikprogrammen auch auf anderen Rechnerplattformen erlauben. Da im
24-Bit-Bereich leider nicht so wie bei normalen AmigaBildern ein
Standard-Format von allen Programmen verstanden wird, unterst&#252;tzt
Xi-Paint mehrere Grafikformate, die jedes f&#252;r sich Vorteile und
Nachteile haben. </p>

<p>Die zum Laden und Speichern unterst&#252;tzten Formate werden im
Folgenden aufgelistet: <ul>

 <li> DEEP </li>
 <li> ILBM </li>
 <li> PGM  </li>
 <li> PPM  </li>
 <li> SUNRASTER </li>
 <li> JPEG </li></ul>

<p>Nun eine Beschreibung der einzelnen Formate: <br>
<table>
<tr><td valign=top>ILBM:</td><td> 

Obwohl die Bitmap-Technik f&#252;r 24-Bit-Bilder nicht gerade sinnvoll ist,
bildet dieses Format doch eine Art Standard. Es wird von den meisten
Programmen, die mit 24 Bit arbeiten, unterst&#252;tzt. Es stellt eine
Erweiterung des Amiga-IFFStandards auf mehr Bitplanes dar, komprimiert auch
etwas, aber bei weitem nicht so gut wie der JPEG-Algorithmus. Leider
bedingt das Bitplane-Konzept ein etwas langsames Laden, da der Farbwert
f&#252;r jeden Pixel erst aus den verschiedenen Bitplanes zusammengesucht
werden mu&#223;.

</td></tr>
<tr><td valign=top>PPM:</td><td>

Dieses Format kommt aus der UNIX-Welt. Zur Portierung von Grafiken anderer
Workstations wurde es implementiert.

</td></tr>
<tr><td valign=top>JPEG:</td><td>

Das JPEG-Format ist ebenfalls standardisiert. Es k&#246;nnen also
JPEG-Bilder von anderen Rechnern ohne Probleme &#252;bernommen werden. Ein
weiterer Vorteil des JPEG-Formats ist die geringe Gr&#246;&#223;e eines
Bildes auf der Festplatte. Die Bildkompression erfolgt nach einem
ausgefeilten Algorithmus, der aber leider nicht verlustfrei arbeitet.
F&#252;r das Speichern in JPEG k&#246;nnen Sie im System-Men&#252;die
Qualit&#228;t des zu speichernden Bildes festlegen. 100 entspricht so gut
wie keinem Verlust, ein mit 1 gespeichertes Bild ist nicht
wiederzuerkennen. Je kleiner die Zahl, desto kleiner das gepeicherte File
auf der Platte. Sie m&#252;ssen vielleicht etwas experimentieren, um den
f&#252;r Ihre Anspr&#252;che geeigneten Speichergrad zu finden. Wenn
Bilder, die sehr stark komprimiert worden sind, wieder geladen werden
sollen, empfiehlt es sich, das Smoothing einzuschalten (ebenfalls im
System-Men&#252;). Durch die aufwendige Kompression dauert das Laden und
Speichern im Vergleich zu den anderen Formaten allerdings sehr lange. Da
das entpackte Bild als File zwischengespeichert wird, mu&#223; in den
Tooltypes auch ein Pfad f&#252;r dieses File angegeben werden.

</td></tr>
<tr><td valign=top>IFF-DEEP:</td><td>

Sie k&#246;nnen (von einer Festplatte aus) Bilder in einer
Sekunde in Xi-Paint laden. Beim Speichern erfolgt auch keine Kompression,
wodurch auch dieses schnell vonstatten geht.

</td></tr></table></p>
<hr size=4></td></tr></table></center>
<br>
</body>
</html>
