 <html>
<head>
<!--      "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>23 &nbsp; Zukunft</b></h1>

<p>Durch die konsequente Umstellung von Xi-Paint auf das Fensterund
Requester-System ergeben sich eine ganze Reihe von M&#246;glichkeiten, die
vor allem in der kommenden Version mit dem Namen &quot;Xi-Paint
Professional&quot; bereits implementiert sein werden. </p>

<p>Dazu  geh&#246;rt  beispielsweise  ein  einfacher  Raytracer,  der  die  Be-
rechnung von Szenen erlaubt, wie sie im t&#228;glichen Gebrauch im-
mer wieder in Zeichnungen eingef&#252;gt werden. (Beleuchtete Kugeln
und B&#228;lle, geometrische K&#246;rper, ...)  Die untenstehenden Grafiken
(Eist&#252;te, Ring) sollen ein kleiner Vorgeschmack auf die M&#246;glichkei-
ten sein, die sich daraus ergeben...
</p>

<p><center><img src="bilder/xx73.gif" width=160 heigth=256 alt="Eis">
<img src="bilder/xx74.gif" width=340 heigth=228 alt="Ring"></center></p>

<p>Nat&#252;rlich werden auch die bisherigen Funktionen weiterentwickelt.
So wird die Pinselverwaltung weiter ausgebaut, soda&#223; in sp&#228;teren
Version unter Umst&#228;nden sogar Symbolbibliotheken erstellt und
verwaltet werden k&#246;nnen. </p>

<p>Aufgrund des Xi-Paint-eigenen Undo/Redo-Systems ist auch eine
Objektorientierung denkbar. Das hei&#223;t, ein eingef&#252;gter Pinsel
kann unter Umst&#228;nden einmal wieder entfernt oder verschoben werden,
ohne da&#223; dadurch der Hintergrund verloren geht. </p>

<p>Ein gro&#223;es Thema ist selbstverst&#228;ndlich die Animation. Auf sie
wird ein gro&#223;es Augenmerk gerichtet. Auch eine ausgefeiltere
Bildverarbeitung, eine Z-Buffer-Nutzung und sogar an Morphing wird gedacht.
</p>

<p>Die weiteren Pl&#228;ne sollen hier noch nicht verraten werden. Aber
lassen Sie sich &#252;berraschen, denn ungeahnte M&#246;glichkeiten kommen
auf Sie zu. </p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html>
