@DATABASE opium.newmail.ru:666/2s.htm
@WORDWRAP

@NODE MAIN
@TITLE " Ave Satanas..."
 
   @{" " link "1_3s.guide/MAIN"}@{"../pau.gif" link "../pau.gif/MAIN"}
Назад    Черная Библия Девять Сатанинских Заповедей    @{" " link "3s.guide/MAIN"}@{"../pau0.gif" link "../pau0.gif/MAIN"}
Дальше 


   - Сатана олицетворяет потворство, а не воздержание! 
   - Сатана олицетворяет жизненную суть вместо несбыточных духовных мечтаний. 
   - Сатана олицетворяет неоскверненную мудрость вместо лицемерного самообмана! 
   - Сатана олицетворяет милость к тем, кто ее заслужил, вместо любви, потраченной на льстецов! 
   - Сатана олицетворяет месть, а не подставляет после удара другую щеку! 
   - Сатана олицетворяет ответственность для ответственных вместо участия к духовным вампирам. 
   - Сатана представляет человека всего лишь еще одним животным, иногда лучшим, чаще же худшим, чем те, кто ходит на четырех лапах; животным, которое вследствие своего "божественного, духовного и интеллектуального развития" стало самым опасным из всех животных! 
   - Сатана олицетворяет все так называемые грехи. поскольку они ведут к физическому, умственному и эмоциональному удовлетворению! 
   - Сатана был лучшим другом Церкви во все времена, поддерживая ее бизнес все эти годы! 
 ---

 ---

 ---

 ---

 ---

@endnode
