<html>
<body background="../../images/fondtexte2.jpg"  border="0">
<b>La L&eacute;gende de Saint-Martin<br>
La plus l&eacute;gend&eacute;e des l&eacute;gendes</b><br>
<br>
Avant de conna&icirc;tre la l&eacute;gende de Saint-Martin, il est peut-&ecirc;tre bon de vous
pr&eacute;senter ce dernier.<br>
A l'origine, Saint-Martin &eacute;tait un soldat. Par une nuit d'hiver, il rencontra un
mis&eacute;reux qui allait, par la rudesse du temps, mourir de froid avant la lev&eacute;e du
jour. L'aum&ocirc;ne n'&eacute;tait effectivement pas d'un grand secours. Au risque de se
voir condamner &agrave; mort pour avoir abim&eacute; et s'&ecirc;tre s&eacute;par&eacute; de son uniforme, notre
valeureux soldat d&eacute;chira sa cape pour en offrir la moiti&eacute; au mis&eacute;reux.<br>
Le lendemain &agrave; son r&eacute;veil, notre soldat d&eacute;couvrit que l'un et l'autre avait une
cape enti&egrave;re. Touch&eacute; par le Don de Dieu, Saint-Martin rentra dans les ordres et
devint &eacute;v&ecirc;que de Tours.<br>
<br>
La l&eacute;gende de Saint-Martin raconte que l'&eacute;v&ecirc;que de Tours serait venu dans les
Flandres maritimes pour pr&ecirc;cher la bonne parole, alors que Dunkerque n'&eacute;tait
qu'un tout petit hameau de p&ecirc;cheurs nich&eacute; dans les dunes. Allant de chaumi&egrave;res
en chaumi&egrave;res, notre bon &eacute;v&ecirc;que avait laiss&eacute; au dehors et au coeur de la
bourgade, sa pauvre et unique monture : un &acirc;ne.<br>
L'ennui grandissant et l'odeur des chardons all&eacute;chant les naseaux de l'&acirc;ne, ce
dernier s'&eacute;loigna de son lieu d'attente pour go&ucirc;ter son met favori et finit par
s'&eacute;garer parmi les dunes.<br>
<br>
Saint-Martin &eacute;tait bien en peine. Heureusement, les enfants du village se mirent
en qu&ecirc;te munis de lanternes et de <n> teutres qui imitaient le cri de l'animal tant
convoit&eacute;. L'&acirc;ne fut fort heureusement bien vite retrouv&eacute; gr&acirc;ce aux enfants.
L'animal tellement joyeux de retrouver son ma&icirc;tre, leva la queue pour faire un
crottin. Souhaitant r&eacute;compenser la gentillesse et le courage des enfants,
Saint-Martin transforma les crottes d'&acirc;ne en &raquo; Voolaren &raquo; (petits pains aux
raisins compos&eacute; de 3 boules). </i> <br>
<br>
Chaque ann&eacute;e, &agrave; l'approche de la Saint-Martin (c&eacute;l&eacute;br&eacute;e le Mardi Gras), f&ecirc;t&eacute; le
10 Novembre en raison de l'Armistice, les villes et villages de notre Flandre
Maritime honorent la m&eacute;moire du Saint Homme. A la tomb&eacute;e du jour, Saint-Martin
entour&eacute; d'enfants munis de lanternes et lampions d&eacute;filent au son d'une petite
harmonie dans les rues. Le d&eacute;fil&eacute; s'ach&egrave;ve par une grande distribution de
&raquo; voolaren &raquo; et par un concours de lanternes sculpt&eacute;es dans des betteraves &agrave;
sucre.<br>
<br>
Les recherches historiques sont venues prouver que Saint-Martin n'a pas perdu
son &acirc;ne dans les dunes car &agrave; l'&eacute;poque o&ugrave; Saint-Martin &eacute;tait &eacute;v&ecirc;que, Dunkerque
n'existait pas... qu'importe !<br>
<br><br>
Magali LUCZYSZYN<br>
<br><br>
<a href="dunkerque.html"target="description">Retour</a>
</html>
</body>