<html>
<body background="../../images/fondtexte2.jpg"  border="0">

<a href="59villesetcodepostaux.html#l"target="description"><font color="brown">Lille</font></a> (Altitude : ?)
<pre>
<hr>
D&eacute;partement : <a href="entetenord.html"Target="description">Nord </a>      R&eacute;gion : <a href="../entetenordpascalais.html"Target="description">Nord-Pas-de-Calais</a>

Code Postal : 59 000 et 59 800

  Habitants : 191 164 Lillois (en 1999) 
 Superficie : 3 483 ha (ou 34,83 km2)

  Situation : &agrave; 40 Km <a href="douai.html"target="description">Douai</a>, 76 Km <a href="cambrai.html"target="description">Cambrai</a>, 77 Km <a href="dunkerque.html"target="description">Dunkerque</a>,
              686 Km <a href="../../rhonealpes/rhone/lyon.html"Target="description">Lyon</a>

       Plus :
<hr>

</pre>
<b>La Cath&eacute;drale Notre Dame de la Treille :</b> (1854-1999).<br>
<br><br>




<b>La place du G&eacute;n&eacute;ral de Gaule :</b><br>
<table>
<tr>
<td>
<a href="lille1jpg.html"><img src="images/lille1.jpg" target="description" alt="" width="120" height="81" border=0</a><br>
</td>
</tr>
</table>
<br><br>
<b>La Vieille Bourse :</b> (fond&eacute;e en 1652)<br>
<br><br>
<b>Les tours d'Euralille :</b> (inaugur&eacute; en 1994).<br>
<br><br>
<b>La Braderie de Lille :</b><br>
<br>
C'est le plus grand march&eacute; aux Puces d'Europe (sur 200 kms de trottoirs) qui draine chaque ann&eacute;e plus de  2 millions de visiteurs !<br>
<br><br>
 
<b>Le Parc Zoologique de Lille :</b><br>
<br>
c'est 100 esp&egrave;ces diff&eacute;rentes et plus de 300 animaux (Rhinoc&eacute;ros blanc, Panth&egrave;res des neiges, Z&egrave;bres de Grant, Elands du Cap, L&eacute;muriens, Tamarins, Ouistitis, Pythons, Boas, Tortues, Iguanes, Gibbons &agrave; mains blanches, Siamangs, Capucins, Tapirs terrestres, Alpagas, Capybaras, Maras, Bernaches etc...)<br>
<br><br>
<b>Le Palais des Beaux Arts :</b> (batiment du 19&egrave;me si&egrave;cle)<br>
<br>
Le Mus&eacute;e des Beaux-Arts de Lille (2&egrave;me mus&eacute;e fran&ccedil;ais apr&egrave;s le Louvre) abrite  des collections de peintures europ&eacute;ennes (Rubens, Van Dyck, Goya, etc...), des c&eacute;ramiques des 17&egrave;me et 18&egrave;me si&egrave;cles.<br> 
<br>
 Le d&eacute;partement du Moyen-Age et de la Renaissance consacre une galerie enti&egrave;re &agrave; la sculpture fran&ccedil;aise du 19&egrave;me si&egrave;cle ( Houdon, Bourdelles, Pradier, Carpeaux, Carrier-Belleuse, Bartholdi, David d'Angers, Camille Claudel, Rodin...).<br>
<br>
Ouvert tous les jours sauf le mardi.<br>
- Le lundi : de 14h &agrave; 18h<br>
- les mercredi, jeudi, samedi, dimanche : de 10h &agrave; 18h<br>
- Le vendredi : de 10h &agrave; 19h.<br>
<br>
Renseignements : +33 (0)3 20 06 78 00<br>
<br><br>
<b>Le Mus&eacute;e de l'Hospice Comtesse :</b> (ancien h&ocirc;pital fond&eacute; en 1237)<br>
<br>
 Peinture flamande, hollandaise et du nord de la France (15&egrave;me - 18&egrave;me si&egrave;cle), fa&iuml;ence et orf&egrave;vrerie lilloises, mobilier, bois sculpt&eacute;s, tapisseries, fonds iconographique, collection d'instruments de musique anciens et de musique populaire...<br>
<br>
 Ouvert tous les jours sauf le mardi.<br>
- Le lundi : de 14h &agrave; 18h<br>
- Du mercredi au vendredi : de 10h &agrave; 12h30 et de 14h &agrave; 18h.<br>
- Les samedi et dimanche : de 10h &agrave; 18h.<br>
<br>
T&eacute;l : +33 (0)3 28 36 84 00<br>
(Entr&eacute;e gratuite le premier dimanche de chaque mois.)<br>
<br><br>  

<b>Le jardin Vauban :</b> (cr&eacute;&eacute; sous Napol&eacute;on III)<br>
<bR>
Avec ses arbres centenaires et son th&eacute;&acirc;tre de marionnettes...<br>
<br><br>
<b>Le jardin des plantes :</b> et sa serre &eacute;quatoriale<br>
<br><br>
<br>
<b>HISTOIRE :</b><br>
<br>
- 1066 : Premi&egrave;re mention de la ville dans une charte.<br>
<br>
- 1214 : Bataille de Bouvines : le Roi de France Philippe Auguste bat le comte de Flandre et l'Empereur Germanique Othon IV.<br>
<br>
- 1369 : Par mariage, Lille devient l'une des capitales de l'Etat Bourguignon, avec Dijon et Bruxelles.<br>
<br>
- 1477 : Mort de Charles le T&eacute;m&eacute;raire. Son h&eacute;riti&egrave;re Marie de Bourgogne &eacute;pouse Maximilien d'Autriche, apportant la ville aux Habsbourg.<br>
<br>
- XVI et XVII&egrave; s. : Lille fait partie des Pays Bas Espagnols sous le r&egrave;gne de Charles Quint jusqu'&agrave; Philippe IV.<br>
<br>
- 1667 : Prise de la ville par Louis XIV. Lille est rattach&eacute;e &agrave; la France.<br>
<br>
- 1708 - 1713 : Guerre de succession d'Espagne, Lille est occup&eacute;e par les Hollandais.<br>
<br>
- 1792 : si&egrave;ge de Lille par les Autrichiens.<br>
<br>
- 1846 : Premi&egrave;re ligne de chemin de fer entre Paris et Lille.<br>
<br>
- 1966 : Cr&eacute;ation de la Communaut&eacute; Urbaine.<br>

- 1983 : premi&egrave;re ligne de m&eacute;tro (VAL).<br>
<br>
- 1993 : Arriv&eacute;e du TGV Lille Paris, Lille est &agrave; 1 heure de Paris.<br>
<br>
- 6 mai 1994 : Inauguration du tunnel sous la Manche.<br>
<br>
- 1994 : Ouverture de la ligne TGV-Nord europ&eacute;ens Lille Londres Bruxelles et inauguration d'Euralille.<br>
<br><br>  


</body>
</html>
 



