<html>
<body background="../../images/fondtexte4.jpg">
<a name="a"></a>
<table>
<tr>
<td>
<font color="white">d&eacute;partement</font><br>
<A HREF="carteaisne.html"target="description"><img src="images/iconaisne.jpg" alt="carte de l'Aisne" border="0"</a>
<A HREF="enteteaisne.html"target="description"><img src="../../images/iconpresent.jpg" alt="" border="0"</a>
</td>
<td>
<font color="purple"><font size=5 face="helvetica"><a href="enteteaisne.html"target="description"><b>Pr&eacute;sentation de l'Aisne</a> (03)</font><br>

</td>
</tr>
</table>
<hr>
<br>


<a name="geo"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">G&eacute;ographie</font><font size=1 face="helvetica"> ( <A HREF="#eco">Economie</font></a> <font size=1 face="helvetica"> - <A HREF="#his">Histoire</font></a><font size=1 face="helvetica"> - <A HREF="#pro">Produits locaux</font></a><font size=1 face="helvetica"> - <A HREF="#enf">Enfants du pays</a>)</font></a></STRONG><BR>
</font>
<br>
C'est le seul d&eacute;partement fran&ccedil;ais qui touche d'un c&ocirc;t&eacute; &agrave; la r&eacute;gion parisienne et de l'autre nos fronti&egrave;res nationales.<br>
Le d&eacute;partement de l'Aisne fait partie du Bassin parisien, situ&eacute; &agrave; son contact avec le massif hercynien de l'Ardenne.<br>
<br>
 <b> Le sud du d&eacute;partement</b> est occup&eacute; par une succession de plateaux calcaires limoneux (Brie, Valois, Soissonnais, Laonnois) que l'&eacute;rosion a d&eacute;coup&eacute;s en massifs, voire en buttes. Les collines de calcaire et d'argile longent les vall&eacute;es alluvionnaires suivant une orientation est-ouest.<br>
<br>
<b>Le nord du d&eacute;partement</b> est compos&eacute; d'immenses plaines &eacute;lev&eacute;es o&ugrave; les seuls accidents de relief sont des vall&eacute;es peu profondes et des buttes sablonneuses.<br>
<br>
<b> Le nord-est du d&eacute;partement</b> est d&eacute;limit&eacute;e par les vall&eacute;es de l'Oise et de la Serre, s'&eacute;tend la Thi&eacute;rache qui fait suite aux premi&egrave;res hauteurs de l'Ardenne. <br>
<br>
Le d&eacute;partement est travers&eacute; par trois grandes rivi&egrave;res d&eacute;pendant du r&eacute;seau hydrographique de la Seine (Oise, Aisne, Marne) et donne naissance &agrave; la Somme, &agrave; la Sambre et &agrave; l'Escaut.<br>
<br>
 Les influences oc&eacute;aniques, plus marqu&eacute;es &agrave; l'ouest, et les influences continentales, plus sensibles &agrave; l'est, d&eacute;terminent un climat diversifi&eacute;. 


<br><br>
<a name="eco"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Economie</font><font size=1 face="helvetica"> ( <A HREF="#geo">G&eacute;ographie</font></a><font size=1 face="helvetica"> - <A HREF="#eco">&eacute;conomie</font></a><font size=1 face="helvetica"> - <A HREF="#his">Histoire</font></a><font size=1 face="helvetica"> - <A HREF="#enf">Enfants du pays</a>)</font></a></STRONG><BR>
</font>
<br>
Les ressources agricoles diff&egrave;rent selon les r&eacute;gions. La grande exploitation (c&eacute;r&eacute;ales, betterave), parfois associ&eacute;e &agrave; l'&eacute;levage bovin, domine sur les plateaux.<br>
 Les vall&eacute;es se consacrent aux cultures mara&icirc;ch&egrave;res.<br>
 La Thi&eacute;rache, r&eacute;gion d'&eacute;levage, a vu se d&eacute;velopper les industries laiti&egrave;res.<br>
 Le Tardenois et la Brie se partagent entre &eacute;levage et culture c&eacute;r&eacute;ali&egrave;re.<bR>
 Les coteaux de la vall&eacute;e de la Marne produisent du vin de Champagne.<br>
<br>
 L'industrie s'est surtout implant&eacute;e dans la vall&eacute;e de l'Oise et autour de St-Quentin et de Soissons : ses productions sont importantes et vari&eacute;es (verrerie, m&eacute;tallurgie, chimie, textile, industrie alimentaire).<br>

<br>

Le d&eacute;partement poss&egrave;de un patrimoine artistique tr&egrave;s riche, et, malgr&eacute; les guerres et les destructions, toutes les &eacute;poques se trouvent, repr&eacute;sent&eacute;es...<br>

L'Aisne est le deuxi&egrave;me d&eacute;partement de France pour le nombre des monuments historiques, class&eacute;s !<br>


 
<br><br>
<a name="his"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Histoire</font><font size=1 face="helvetica"> ( <A HREF="#geo">G&eacute;ographie</font></a><font size=1 face="helvetica"> - <A HREF="#eco">Economie</font></a><font size=1 face="helvetica"> - <A HREF="#pro">Produits locaux</font></a><font size=1 face="helvetica"> - <A HREF="#enf">Enfants du pays</a>)</font></STRONG><BR>
</font>
<br>
Form&eacute; par la r&eacute;union de petits pays (remontant aux "pagus" gallo-romains) appartenant aux provinces traditionnelles devenues gouvernements g&eacute;n&eacute;raux d'Ile-de-France (Laonnais, Soissonnais, Valois, Vermandois), de Picardie (Vermandois et Thi&eacute;rache) et, pour une faible part, de Champagne (Brie)...<br>
<br>
Pourtant, sur le plan historique, il est d'une profonde unit&eacute; puisque :<br>
La quasi-totalit&eacute; du d&eacute;partement, et m&ecirc;me le sud, appartient &agrave; la zone linguistique picarde; &agrave; l'exception de paroisses tr&egrave;s peu nombreuses qui relevaient de Reims, Troyes, Meaux et Cambrai.<br>
<br>
 Le d&eacute;partement co&iuml;ncide presque exactement avec les anciens dioc&egrave;ses de Laon et de Soissons (plus une partie de l'ancien &eacute;v&ecirc;ch&eacute; de Noyon).<br> 
<br>
Enfin l'identit&eacute; entre actuel d&eacute;partement de l'Aisne et ancienne g&eacute;n&eacute;ralit&eacute; (ou intendance) de Soissons, c'est-&agrave;-dire entre circonscription administrative r&eacute;volutionnaire et royale, est encore plus frappante (&agrave; l'exception du Saint-Quentinois qui relevait d'Amiens).<br>
<br>
 Les r&eacute;gions de l'actuel d&eacute;partement connurent une importante occupation humaine &agrave; l'&eacute;poque pr&eacute;historique et &eacute;taient habit&eacute;es par diverses tribus belgo-celtiques (Suessions, Veromandui, R&egrave;mes).<br>
<br>
<b>En 51 av. J.-C. :</b> Jules C&eacute;sar imposa la domination romaine au cours de la bataille de l'Aisne.<bR>
<br>

<b> En 486 : </b> Les l&eacute;gions romaines de Syagrius furent battues (&agrave; Soissons) par les Francs de Clovis qui s'empara de la r&eacute;gion.<br>
<br>
<b> En 511 :</b> Le royaume de Soissons fut cr&eacute;&eacute.<br>
<br>
 Au cours des si&egrave;cles suivants, la r&eacute;gion fut &acirc;prement disput&eacute;e entre les rois de Neustrie et d'Austrasie.<br>
<br>
<b> En 687 :</b> P&eacute;pin d'H&eacute;ristal, maire du palais d'Austrasie, vainquit les Neustriens (pr&egrave;s de St-Quentin) et assura la r&eacute;unification des royaumes francs au profit des Carolingiens. Son petit-fils, P&eacute;pin le Bref, se fit couronner roi &agrave; Soissons<br>
<br>
<b>En 752 :</b> apr&egrave;s avoir d&eacute;pos&eacute; Child&eacute;ric III, le dernier M&eacute;rovingien; il &eacute;pousa Berthe au grand pied, la fille de Caribert, comte de Laon. "La Chanson de Roland" &eacute;voque le palais de Charlemagne &agrave; Laon.<br>
<br>
<b>En 833 :</b> Louis le Pieux fut d&eacute;chu de ses droits royaux (&agrave; Soissons).<br>  
<br>
<b>En 876 :</b>c'est &agrave; Quierzy que Charles le Chauve pr&eacute;para le c&eacute;l&egrave;bre capitulaire, cr&eacute;ant en fait le syst&egrave;me f&eacute;odal, qui vit se d&eacute;velopper le pouvoir des &eacute;v&ecirc;ch&eacute;s, des grandes abbayes et de seigneurs turbulents, profitant de la faiblesse du roi pour &eacute;tendre leurs domaines.<br>
<br>
<b>En 987 :</b> L'&eacute;v&ecirc;que de Laon, Adalb&eacute;ron, joua un r&ocirc;le d&eacute;terminant dans l'accession d'Hugues Capet au tr&ocirc;ne de France.<br>
 La guerre de Cent Ans fut une p&eacute;riode de troubles graves et de ravages.<br>
<bR>
<b>En 1539 :</b>L'Ordonnance de Villers-Cotter&ecirc;ts.<br>
<br>
<b>En 1544 :</b> Le trait&eacute; de Cr&eacute;py entre Fran&ccedil;ois Ier et Charles Quint. <br>


<bR>
<b>En 1567 :</b> Soissons fut pill&eacute; par les calvinistes.<br> 
<br>
<b>En 1594 :</b> Laon fut un grand centre de la Ligue qu'Henri IV dut reprendre par la force . Les incursions espagnoles menac&egrave;rent la s&eacute;curit&eacute; de la Thi&eacute;rache jusqu'au trait&eacute; des Pyr&eacute;n&eacute;es (1659).<br>
<br>
<b>En 1814 :</b> C'est la bataille de Laon, entre Napol&eacute;on et les Prussiens, qui eut pour cons&eacute;quence 
directe l'abdication de l'Empereur.<br>
<br>
 Au cours de la guerre de 1914/18, le d&eacute;partement fut le th&eacute;&acirc;tre de m&eacute;morables op&eacute;rations militaires; ainsi, le Chemin des Dames, enjeu de combats acharn&eacute;s de septembre 1914 &agrave; octobre 1918, est un des hauts lieux du souvenir et reste encore une des plus impressionnantes r&eacute;gions d&eacute;vast&eacute;es.<br>

<br><br>
<a name="pro"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Produits locaux</font><font size=1 face="helvetica"> ( <A HREF="#geo">G&eacute;ographie</font></a><font size=1 face="helvetica"> - <A HREF="#eco">Economie</font></a><font size=1 face="helvetica"> - <A HREF="#his">Histoire</font></a><font size=1 face="helvetica"> - <A HREF="#enf">Enfants du pays</a>)</font></a></STRONG><BR>
</font>

<br>
-<b> Les plats :</b><br> 
<br>
- <b>Les fromages :</b><br> 
<br>
- <b>Les Patisseries et confiseries :</b><br>
<br>
- <b>Les boissons :</b><br> 
<br><br>
<a name="enf"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Enfants du pays</font><font size=1 face="helvetica"> ( <A HREF="#geo">G&eacute;ographie</font></a> <font size=1 face="helvetica"> - <A HREF="#eco">Economie</font></a><font size=1 face="helvetica"> - <A HREF="#his">Histoire</font></a><font size=1 face="helvetica"> - <A HREF="#pro">Produits locaux</a>)</font></STRONG><BR>
</font>
<br>

<br>
<a name="p"></a>
<A HREF="#a"<font color="#FF0000">haut de page</font> </A>

</body>
</html>

