<html>
<body background="../../images/fondtexte4.jpg">
<a name="a"></a>
<table>
<tr>
<td>

</td>
<td>
<font color="purple"><font size=5 face="helvetica"><a href="enteteaisne.html"target="description"><b>Pr&eacute;sentation de l'Aisne</a> (03)</font><br>

</td>
</tr>
</table>
<hr>
<br>


<a name="geo"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">G&eacute;ographie</font></font><font size=1 face="helvetica"> ( <A HREF="ecoaisne.html">Economie</font></a> <font size=1 face="helvetica"> - <A HREF="histoireaisne.html">Histoire</font></a><font size=1 face="helvetica"> - Produits locaux</font><font size=1 face="helvetica"> - Enfants du pays)</font></a></STRONG><BR>
</font>
<br>
C'est le seul d&eacute;partement fran&ccedil;ais qui touche d'un c&ocirc;t&eacute; &agrave; la r&eacute;gion parisienne et de l'autre nos fronti&egrave;res nationales.<br>
Le d&eacute;partement de l'Aisne fait partie du Bassin parisien, situ&eacute; &agrave; son contact avec le massif hercynien de l'Ardenne.<br>
<br>
 <b> Le sud du d&eacute;partement</b> est occup&eacute; par une succession de plateaux calcaires limoneux (Brie, Valois, Soissonnais, Laonnois) que l'&eacute;rosion a d&eacute;coup&eacute;s en massifs, voire en buttes. Les collines de calcaire et d'argile longent les vall&eacute;es alluvionnaires suivant une orientation est-ouest.<br>
<br>
<b>Le nord du d&eacute;partement</b> est compos&eacute; d'immenses plaines &eacute;lev&eacute;es o&ugrave; les seuls accidents de relief sont des vall&eacute;es peu profondes et des buttes sablonneuses.<br>
<br>
<b> Le nord-est du d&eacute;partement</b> est d&eacute;limit&eacute;e par les vall&eacute;es de l'Oise et de la Serre, s'&eacute;tend la Thi&eacute;rache qui fait suite aux premi&egrave;res hauteurs de l'Ardenne. <br>
<br>
Le d&eacute;partement est travers&eacute; par trois grandes rivi&egrave;res d&eacute;pendant du r&eacute;seau hydrographique de la Seine (Oise, Aisne, Marne) et donne naissance &agrave; la Somme, &agrave; la Sambre et &agrave; l'Escaut.<br>
<br>
 Les influences oc&eacute;aniques, plus marqu&eacute;es &agrave; l'ouest, et les influences continentales, plus sensibles &agrave; l'est, d&eacute;terminent un climat diversifi&eacute;. 


<br><br>

<A HREF="#a"<font color="#FF0000">haut de page</font> </A>

</body>
</html>

