<html>
<body  background="../../images/fondtexte2.jpg">
<a href="02villesetcodepostaux.html#l"target="description"><font color="brown">Laon</font></a>    (altitude 79 m)
<pre>
<hr>
D&eacute;partement : <a href="enteteaisne.html"Target="description">Aisne </a>      R&eacute;gion : <a href="../entetepicardie.html"Target="description">Picardie</a>

Code Postal : 02 000

  Habitants : 27 878 Laonnois (en 1999)
 Superficie : 42 Km2

  Situation : &agrave; 38 km <a href="vervins.html"target="description">Vervins</a>, 130 Km Paris

    Plus... : 
<hr>
</pre>
La ville offre un patrimoine architectural exceptionnel (cath&eacute;drales, 8 kilom&egrave;tres de
remparts m&eacute;di&eacute;vaux perc&eacute;s de portes monumentales, anciennes abbayes, H&ocirc;tel-Dieu...).
Laon compte plus de 80 monuments historiques inscrits ou class&eacute;s !<br>
<br><br>

<b>La cath&eacute;drale Notre-Dame :</b> (&eacute;difi&eacute;e entre 1150 et 1180) 110 m de long<br>
<br>
- 4 tours, campaniles ou clochers.<br>
<br>
- des animaux sculpt&eacute;s grandeur nature (boeufs) sont install&eacute;s sur les &eacute;tages des tours.<bR> 
<br><br>
<b>Mus&eacute;e Municipal de Laon :</b><br>
<br>
Le mus&eacute;e cr&eacute;&eacute; en 1861 regroupe des collections exceptionnelles (plus de 2 000 objets) autour de l'arch&eacute;ologie m&eacute;diterran&eacute;enne et r&eacute;gionale...De plus, vous pourez admirer des tableaux, des sculptures et du mobilier.<br>
<br>


- l'arch&eacute;ologie m&eacute;diterran&eacute;enne :<br>
collection d'antiquit&eacute;s m&eacute;diterran&eacute;ennes de l'&acirc;ge du bronze aux premiers si&egrave;cles apr&egrave;s J&eacute;sus-Christ.<br>
<br>
- l'arch&eacute;ologie r&eacute;gionale :<br>
la vie quotidienne des habitants de l'Aisne vu &agrave; travers leurs objets en terre, en bronze et en verre (de la pr&eacute;histoire &agrave; la Renaissance).<br>
<br>

- les beaux arts : Peintures datant du XVe au XIXe si&egrave;cle, sculpture et mobilier de l'&eacute;poque
m&eacute;di&eacute;vale jusqu'au 19e si&egrave;cle...<br> 

<table>
<tr>
<td> 
<br><br>
Adresse :<br>
Mus&eacute;e Municipal de Laon<br>
32, rue Georges Ermant<br>
02000 LAON<br>
T&eacute;l&eacute;phone : 03.23.20.19.87<br>
Email : musee.laon@wanadoo.fr <br>
<br>
</td>
<td>
Horaires d'ouverture :<br>
14-18 H du 01/10 au 31/05 (le matin sur RdV pour les groupes)<br>
11-18 H du 01/06au 30/09<br>
<br>
 Fermeture :<br>
Tous les lundis, 1er janvier, 1er mai, 14 juillet,<br>
25 d&eacute;cembre<br>
</td>
</tr>
</table>

<br><br>

<b>HISTORIQUE :</b><br>
<br>
- A l'origine, Laon &eacute;tait connue sous le nom de Lugdunum !<br>
<br>
- Capitale du royaume &agrave; l'&eacute;poque carolingienne<br>
<br>
<b>entre le VIII&egrave;me et le Xe si&egrave;cle :</b> elle abrite les r&eacute;sidences des Rois de France<br>

<b>Au Moyen Age :</b> La ville devient un centre religieux et intellectuel renomm&eacute; !<br>
<br>
<b>1112 :</b>  Louis VI vient ch&acirc;tier les acteurs de l'insurrection communale (lors de cette r&eacute;volte, l'&eacute;v&ecirc;que est tu&eacute; par les bourgeois de la ville).<br>
<br>
<b>1359 :</b> Durant la guerre de cent ans, les Anglais incendient l'Abbaye Saint-Vincent !<br>
<br>
<b>1150 :</b> Incendie de la Cath&eacute;drale carolingienne !<br>
<br> 
<b>1155-1235 :</b> l'&eacute;v&ecirc;que Gauthier de Mortagne fait &eacute;difier la cath&eacute;drale Notre-Dame, une des premi&egrave;res cath&eacute;drales gothiques en France.<br>
<br>
<b>Au XVIe si&egrave;cle :</b> Laon devient une place forte militaire qui subit plusieurs si&egrave;ges.<br>
<br>
<b>&Agrave; la fin du XVIe si&egrave;cle :</b> Henri IV fait payer &agrave; la ville son attachement &agrave; la Ligue...il fera raser tout un quartier et ordonnera l'&eacute;dification d'une citadelle pour punir et mieux surveiller les habitants.<br>
<br>
<b>Depuis la R&eacute;volution :</b> L'ancienne Abbaye Saint-Jean accueille la pr&eacute;fecture du nouveau d&eacute;partement de l'Aisne.<br>
<br>
<b>1857 :</b> Le chemin de fer s'y implante<br>
<br><br>




</body>
</html>