<html>
<body background="../images/fondtexte2.jpg"  border="0">
<font color="brown">Archipel des Tuamotus</font>
<pre>
<hr>
<a href="../polynesiefrancaise/polynesiefrancaise.html"Target="description">Polyn&eacute;sie Fran&ccedil;aise </a>      <a href="../enteteoutremer.html"target="description">Outre Mer</a>

76 &icirc;les et &icirc;lots : Rangiroa, Tikehau, Manihi, Hao, Apataki, Takapoto,
                   Takaroa, Arutua, Kaukura, Mataiva, Fakarava, Anaa, Nukutavake

    Habitants : 12 500 Paumotu

      Plus... : 
<hr>
</pre>
&nbsp;L'archipel des Tuamotu&nbsp;:&nbsp; il pr&eacute;sente un milieu plus ingrat que compensent les
techniques de p&ecirc;che et d horticulture. Lagons, r&eacute;cifs et oc&eacute;an sont les trois
territoires de p&ecirc;che.<br>
<br><br>



A l'est des &icirc;les de la soci&eacute;t&eacute;, l'archipel des Tuamotu est constitu&eacute; de 77 atolls., &eacute;tendus sur 1500 km du nord ouest au sud est et 500 km d'est en ouest.<br>
Cet &eacute;parpillement a pour cons&eacute;quence l'isolement de certaines &icirc;les parfois inhabit&eacute;es, m&ecirc;me si 23 &icirc;les disposent d'un a&eacute;rodrome.<br>
Essentiellement constitu&eacute; d'&icirc;les basses coralliennes, l'archipel comprend aussi des &icirc;les hautes, anciens atolls soulev&eacute;s par des mouvements de la cro&ucirc;te terrestre, telle Makatea.<br>
La plus grande &icirc;le des Tuamotu, Rangiroa est le deuxi&egrave;me plus grand atoll du monde par sa surface.<br>
Rangiroa enserre un lagon si grand que Tahiti toute enti&egrave;re pourrait y entrer.<br>
A 175 km de Rangiroa, l'atoll de Manihi est r&eacute;put&eacute; pour ses fermes perli&egrave;res de la beaut&eacute; de son lagon.<br>
Tout pr&egrave;s de sa soeur g&eacute;ante Rangiroa, Tikehau est de plus en plus pris&eacute;e par les habitants de Tahiti en tant que lieu de vill&eacute;giature.<br>
Les habitants des Tuamotus ont une culture tr&egrave;s proche de celle des habitants de la soci&eacute;t&eacute;, m&ecirc;me si dans l'est de l'archipel on parle encore un dialecte d&eacute;riv&eacute; du Tahitien.<br>
<br>
<img src="images/tuamotu.gif">
</body>
</html>