<html>
<body  background="../images/fondtexte2.jpg"  border="0">
<font color="brown">Archipel de la Soci&eacute;t&eacute;</font>
<pre>
<hr>
<a href="../polynesiefrancaise/polynesiefrancaise.html"Target="description">Polyn&eacute;sie Fran&ccedil;aise </a>      <a href="../enteteoutremer.html"target="description">Outre Mer</a>

Compos&eacute; des : - Iles du Vent (<a href="tahiti.html"Target="description">Tahiti</a>, <a href="moorea.html"Target="description">Moorea</a> et <a href="tetiaroa.html"target="description">Tetiaroa</a>) 
              - Iles Sous le Vent (<a href="raiatea.html"target="description">Raiatea</a>, Tahaa, <a href="huahine.html"target="description">Huahine</a>, <a href="borabora.html"target="description">Bora Bora</a> et Maupiti)&nbsp;


   Capitale : <a href="papeetee.html"target="description">Papeete</a>

  Habitants : 214 445 (en 1996)

    Plus... : 
<hr>
</pre>
L'archipel de la soci&eacute;t&eacute; constitue le groupe principal des &icirc;les de polyn&eacute;sie francaise, il comprend les plus grandes &icirc;les en terme de superficie, ce sont des &icirc;les hautes, &agrave; l'exception de quelques atolls.<br>
<br>
L'archipel est compos&eacute; de deux groupes, les &icirc;les du vent &agrave; l'est et les &icirc;les sous le vent vers l'ouest.<br>
Le premier groupe se compose de deux &icirc;les majeures. Tahiti, la plus grande &icirc;le, est aussi le site de la capitale, Papeetee.<br>
Moorea plus calme que sa voisine offre des paysages tr&eacute;s spectaculaires, dont la fameuse baie de Cook.
Ce groupe comprend aussi trois &icirc;les plus petites, dont Tetiaroa, l'atoll de Marlon Brando.<br>
<br>
Le groupe des &icirc;les sous le vent, &agrave; l'ouest, est compos&eacute; de cinq &icirc;les hautes et quelques atolls.
La premi&egrave;re en venant de l'est est huahine, connue pour abriter le plus grand marae pre-europeen de polyn&eacute;sie.
Ensuite viennent Raiatea et Tahaa, les deux &icirc;les sont enserr&eacute;es dans un lagon commun.
Raiatea est l'&icirc;le sacree de polyn&eacute;sie francaise.<br>
Bora-Bora est l'arch&eacute;type de l'&icirc;le paradisiaque, Maupiti plus &agrave; l'ouest est sa r&eacute;plique en plus petite.
Plus &agrave; l'ouest encore, on rencontre quelques atolls inhabit&eacute;s.<br>
<br>
<b>Les Iles du Vent :</b><br>
<br> 
Tahiti, avec son mont Orohena qui culmine &agrave; 2 241 m d'altitude,
est une &icirc;le "haute". Elle abrite la ville de Papeete, centre administratif et commercial
de la Polyn&eacute;sie fran&ccedil;aise. Cette &icirc;le est la plus habit&eacute;e du territoire et dispose d'un
a&eacute;roport international. En face, Moorea, l'&icirc;le soeur, n'en est s&eacute;par&eacute;e que par un chenal.
Elle est r&eacute;put&eacute;e pour sa douceur de vivre et le go&ucirc;t succulent&nbsp;de ses ananas. De nombreux
h&ocirc;tels de grand luxe ainsi que de charmantes pensions de famille y accueillent les
touristes en mal de d&eacute;paysement. Il est vrai que la beaut&eacute; de ses sites, ses plages de
sable blanc et ses fonds marins en font une destination privil&eacute;gi&eacute;e. Non loin, Tetiaroa,
magnifique atoll, &eacute;merge &agrave; peine de son lagon turquoise.<br>
<br><br>
<b>Les Iles sous le Vent :</b><br>
<br>
 Dans la mythologie polyn&eacute;sienne, elles sont consid&eacute;r&eacute;es comme le
pays originel o&ugrave; se trouvait la patrie mythique (Havai i correspondant &agrave; Raiatea) et d'o&ugrave;
proc&eacute;daient les dieux et les traditions. Bora-Bora fait figure de centre politique et
c'est &agrave; Maupiti que les vestiges du pass&eacute; ont le mieux r&eacute;sist&eacute; aux dommages du temps et
des hommes.<br>
<br><br>
<img src="images/ilesdelasociete.jpg">

<br>



</body>
</html>