<html>
<body background="../images/fondtexte4.jpg">
<a name="a"></a>
<table>
<tr>
<td>

</td>
<td>
<font color="purple"><font size=5 face="helvetica"><a href="polynesiefrancaise.html"target="description"><b>Pr&eacute;sentation de la Polyn&eacute;sie Fran&ccedil;aise</a></font><br>

</td>
</tr>
</table>
<hr>
<br>



<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Histoire</font></font><font size=1 face="helvetica"> ( <a href="geopoly.html"target="description">G&eacute;ographie</a></font> <font size=1 face="helvetica"> - Economie</font><font size=1 face="helvetica"> - Produits locaux</font><font size=1 face="helvetica"> - Enfants du pays</font><font size=1 face="helvetica">)</a></STRONG><BR>
</font>
<br>


Le peuplement des archipels de la Polyn&eacute;sie remonte &agrave; plus de 6 000 ans et l' hypoth&egrave;se qui reste la plus probable aujourd hui (confirm&eacute;e par des indices botaniques, zoologiques et linguistiques) est celle d'une racine asiatique (Asie du sud-est).<br>
<br>
- 1595 : L'Espagnol Mendana baptise les &icirc;les Marquises du nom de son &eacute;pouse.<br>
<br>
- 1605 : L'espagnol Quiros traverse l'archipel des Tuamotu<br> 
<br>
- 1767 : Wallis d&eacute;barque &agrave; Tahiti.<br>
<br>
- 1768 : Bougainville d&eacute;barque &agrave; Tahiti et lui donne le nom idyllique de &laquo; Nouvelle Cyth&egrave;re &raquo;.<br>
<br>
- 1769 : James Cook, prestigieux explorateurs anglais, et cartographe de renom parviendra, &agrave;  Tahiti &agrave; bord de son navire Endeavour.<br>
<br>
- 1791 : L'amiral Marchand s'empare des Marquises au nom du roi de France<br>
<br>
- 1793 : La dynastie locale des Pomare s'affirme &agrave; Tahiti. (dans la lutte coloniale qui oppose les Fran&ccedil;ais et les Anglais dans le Pacifique. La lutte d'influence de leurs missionnaires respectifs se termine &agrave; Tahiti)<br>
<br>
- 1797 : la dynastie locale des Pomare r&egrave;gne sur toutes les Iles-du-Vent.<br>
<br> 
- fin du 18&egrave;me si&egrave;cle les contacts avec les Europ&eacute;ens se font de plus en plus nombreux, commer&ccedil;ants et missionnaires se disputant les influences.<br>
<br>
- 1842 : La France s'impose &agrave; Tahiti en &eacute;tablissant  un protectorat qui comprend les Iles-du-Vent, les Iles-sous-le-Vent, les Tuamotu et les Australes.<br>
<br>
- 1877 : Mort de la reine Pomare IV.<br>
<br>
- 1880 : Tahiti devient colonie. Les &icirc;les Gambier, Tuamotu, Australes, Marquises et Sous- le-Vent furent progressivement rattach&eacute;es &agrave; la R&eacute;publique.<br>
<br>
- 1957 : les Etablissements fran&ccedil;ais de l'Oc&eacute;anie changent de nom pour celui de Polyn&eacute;sie Fran&ccedil;aise.<br>
<br>
- 1914-1918 : lors de la Premi&egrave;re Guerre Mondiale, Papeete est bombard&eacute;e par la marine allemande<br>
<br>

- 1946 : la Polyn&eacute;sie fran&ccedil;aise devient territoire d'Outre-mer et est dot&eacute;e d'une Assembl&eacute;e territoriale (le 25 octobre)<br>
<br>
- 12 Avril 1996 : la Polyn&eacute;sie Fran&ccedil;aise b&eacute;n&eacute;ficie d'un statut d'autonomie<br>
<br><br>



<br>

<br>
<A HREF="#a"<font color="#FF0000">haut de page</font> </A><br>

</body>
</html>