/* Example5-4 */
/* This illustrates SAYing a mathematical expression */
/* which is within a string as well as one not in a string */

SAY '3 + 4 * 5 =' 3 + 4 * 5
