/* Example09-1 */

SAY 'Enter Number 1'
PULL N1
SAY 'Enter Number 2'
PULL N2
SAY N1 'to the power of' N2 'is' N1 ** N2
SAY N1 'divided by' N2 '=' N1 % N2 'remainder' N1 // N2
