/* Example3-3.rexx */

SAY 'a'x||CENTRE('Hi there - I am an AREXX program started from an Icon!',79)
SAY CENTRE('This  window  will  go away  by itself  in 10 seconds.',79)

DO UNTIL TIME('E') > 10
END
