/* Example3-1.rexx */

Count = 1

DO FOREVER
  SAY 'Hi there - I am your first example ARexx Program - Count =' Count
  SAY 'Hold down the CTRL key and press C to stop me.'||'a'x
  Count = Count + 1
END