/* Example8-2 */

SAY 'Enter your First Name:'
PARSE PULL First
SAY 'Enter you Surname:'
PARSE PULL Surname
SAY 'Enter your Age'
PARSE PULL Age
SAY 'Hi' First Surname'. You will be 100 in' 100 - Age 'years.'
