/* Example 5-5 */
/* This program has an error and so will not run */

SAY "I am using inverted commas"  /* this is OK */
SAY 'I am using apostrophes'      /* this is OK */
SAY "This is not allowed'         /* this is NOT OK */
