/* Example8-1 */

SAY 'Enter your First Name:'
PULL First
SAY 'Enter you Surname:'
PULL Surname
SAY 'Enter your Age'
PULL Age
SAY 'Hi' First Surname'. You will be 100 in' 100 - Age 'years.'
