<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<!-- AUTHOR="Bj&ouml;rn Knorr" -->
<!-- EMAIL="No-em@il-yet" -->
<!-- PROGRAM="WebPlug v1.2 © 1996 Esteve Boix" -->
<!-- COMMENT="Infopage" -->
<TITLE>Infos &uuml;ber X-Treme Productions</TITLE>
</HEAD>
<BODY BACKGROUND="pic/Marble.gif">
<IMG SRC="pic/XT90.gif" WIDTH="104" HEIGHT="780" ALIGN="LEFT">
<CENTER><H1>Informationen</H1></CENTER>
<HR>
<FONT SIZE="3">
<BLOCKQUOTE>
<I>
X-Treme Productions ist eine Filmproduktionsvereinigung von Bj&ouml;rn Knorr und Patrick Lassmann. Wir produzieren nun schon seit 2 Jahren unsere eigenen Filme. Dazu schreiben privat Drehb&uuml;cher, besorgen uns Requisiten und verfilmen anschlie&szlig;end unsere Werke auf VHS-C. Bei uns steht der Actionfilm hoch im Kurs, gefolgt von Trash und Klaumauk. Wobei wir beschlossen haben, besonders letztere Sparte, den Klaumauk (Parodie) Film st&auml;rker als bisher voran zu treiben. Unsere Projekte verwirklichen wir meist ohne viel Aufwand, auch kann es schon einmal sein, da&szlig; wir ein Projekt einfrieren oder ganz abbrechen.<BR>
Der Antrieb f&uuml;r unsere Arbeit an diesem Hobby, ist nichts als pure Leidenschaft und die Hoffung auf Anerkennung unserer Leistung.<BR>
Wir sind trotzdem darauf aus uns zu verbessern, obwohl wir wissen da&szlig; uns teilweise Grenzen gesetzt sind (wir haben kein 10 Millionen Budget um ein Flugzeug real abst&uuml;rtzen zu lassen). Jeder der uns unterst&uuml;tzen will, kann das tun.
</I><BR>
<BR>
<U>Einige Sachen liegen uns besonders am Herzen, das sind:</U><BR>
<UL>
<LI>Produktions Seite:<BR>
<UL>
<LI>Wir suchen Schauspieler in unserem Alter (18/19) und in unserer Umgebung (Bayern/Oberpfalz/Amberg-Sulzbach)<BR>
<LI>Wir suchen Drehb&uuml;cher zu den Themen (Action/Trash...)<BR>
<LI>Wir suchen Kontakt zu anderen Videogruppen, Filmfans, John Woo Liebhabern usw....<BR>
<LI>Wir suchen Ausstattung f&uuml;r unsere Filme (Modellaufbauten von St&auml;dten, Spielzeugwaffen, Kost&uuml;me......)<BR>
</UL>
<BR>
<LI>Technische Seite:<BR>
<UL>
<LI>Wir suchen g&uuml;nstig/geschenkt/gesponsort Videokameras und Zubeh&ouml;r<BR>
<LI>Wir suchen g&uuml;nstig/geschenkt/gesponsort Videohard- und softwareware (Titler, Ditizer, Genlock, Schnitt?.. nur f&uuml;r <A HREF="AMIGA.html" NAME="AMIGA">AMIGA</A>!)<BR>
<LI>Wir suchen g&uuml;nstig.... ein Video-/ Audiomischpult<BR>
<LI>Wir k&ouml;nnen alles was man zum Filmdrehen brauchen kann irgendwie verwenden (Videokassetten, Kabel, Mikrofon...)<BR>
</UL>
<BR>
<LI>&ouml;ffentliche Seite:<BR>
<UL>
<LI>Wir w&uuml;rden es zu sch&auml;tzen wissen falls, jemand uns bei der Ver&ouml;ffentlichung unserer Filme hilfreich w&auml;re. (Internet, Fernsehen,... !?)
</UL>
</UL>
<BR>
<RIGHT><FONT SIZE=5>Bj&ouml;rn Knorr</FONT></RIGHT>
<BR>
<HR>
<CENTER>
© 1998 by <A HREF="BK.html">Bj&ouml;rn Knorr</A> eXe-design with AMIGA 4000 and WebPlug 1.2 [VER$ 1.5 - 18.01.1998]<BR><BR>
<A HREF="INDEX.HTML"><IMG SRC="pic/I.GIF" ALT="INDEX" WIDTH="111" HEIGHT="27"></A>
<A HREF="MOVIES.HTML"><IMG SRC="pic/M.GIF" ALT="MOVIES" WIDTH="111" HEIGHT="27"></A>
<A HREF="CONTACT.HTML"><IMG SRC="pic/C.GIF" ALT="CONTACT" WIDTH="111" HEIGHT="27"></A>
</CENTER>
</FONT>
</BODY>
</HTML>