@DATABASE opium.newmail.ru:666/22s.htm
@WORDWRAP

@NODE MAIN
@TITLE " Ave Satanas..."
 
   @{" " link "21s.guide/MAIN"}@{"../pau.gif" link "../pau.gif/MAIN"}
Назад    Черная Библия "Книга Левиафана
 (Вода)"    @{" " link "23s.guide/MAIN"}@{"../pau0.gif" link "../pau0.gif/MAIN"}
Дальше 

Бушующее море 


&nbsp;Несмотря на протесты людей, так или иначе отрицающих значение слов, вершины эмоционального экстаза или яростные приступы мучений могут быть достигнуты посредством речевого общения. Если магическая церемония подразумевает максимальную обостренность всех чувств, нужные звуки смогут оказать здесь весомую помощь. Несомненно верно, что "действие говорит громче слов", но слова - это памятники мысли. 

&nbsp;Самый заметный недостаток напечатанных заклинаний прошлого - бедность эмоций, которые должны присутствовать при их прочтении. Старый маг, знакомый автору этих строк, однажды произносивший сочиненное им заклинание большого личного значения в свете своих магических устремлений, просто-напросто не смог подыскать нужных слов в момент кульминации ритуала, незадолго до его успешного завершения. Осознавая необходимость дальнейшей подпитки своего эмоционального состояния, он быстро сымпровизировал и прочел первые пришедшие ему на ум слова - несколько четверостиший из поэмы Рэдъярда Киплинга! И с этими словами, с помощью последнего вливания адреналина он завершил принесшую успех церемонию! 

&nbsp;Последующие заклинания сочинены, дабы служить воззваниями уверенности, а не опасениями скулящего щенка. По этой причине они лишены поверхностных дароподношений и пустой благотворительности. Левиафан, великий Дракон из Водной Бездны, возносит свой рык подобно бушующему морю, и эти заклинания - его приговоры. 
 ---

 ---

 ---

 ---

 ---

@endnode
