/* Example13-2.rexx */

X = 2 ; Y = 2 ; Z = 2

IF X = 2 | Y = 2 & Z = 1 THEN SAY 'YES'
ELSE SAY 'NO'

IF (X = 2 | Y = 2) & Z = 1 THEN SAY 'YES'
ELSE SAY 'NO'
