/* Example12-3 */

SAY 'I am Example12-3 and I am now going to Example12-4' ; SAY
CALL 'Example12-4.rexx'
SAY ; SAY 'I am back from Example12-4 and have received this string from it:-' ; SAY
SAY RESULT
