/* Example12-4 */

Item = 'This string is from Example12-4'
SAY 'I am Example12-4 and I will send this string back to Example12-3:-' ; SAY
SAY Item
EXIT Item
