/* Example17-2.rexx */

SAY 'Civil Time before counter loop is:'
SAY TIME('C')

DO c = 1 to 5
  SAY "C =" c
END

SAY 'Civil Time after counter loop is:'
SAY TIME('C')


