/* Example16-6.rexx */

ARG Value2
Value3 = 'VALUE FROM EXAMPLE16-6'
SAY 'a'x'Here I am at Example16-6'
SAY 'Example16-5 sent me the value:-      ' Value2
SAY 'I am returning to 16-5 the value:-   ' Value3
RETURN Value3
