<html>
<body background="../../images/fondtexte2.jpg"  border="0">
<a href="94villesetcodepostaux.html#l"target="description"><font color="brown">Le Perreux-sur-Marne</a></font></a> (Altitude 33 m)
<pre>
<hr>
D&eacute;partement : <a href="entetevaldemarne.html"Target="description">Val-de-Marne</a>      R&eacute;gion : <a href="../enteteiledefrance.html"Target="description">&Icirc;LE de FRANCE</a>

Code Postal : 94 170

  Habitants : 30 227
 Superficie : 396 hectares 

  Situation : &agrave; 7 Km Paris

    Plus... : 
<hr>

</pre>
<b>L'H&ocirc;tel de Ville :</b> (1891)<br>
<br><br>
 
 
<b>Le ch&acirc;teau du Perreux :</b>(18&egrave;me si&egrave;cle)<br>
<br><br>  
 

<b>La Mairie du Perreux :</b><br> 
 La salle des mariages occupe tout le premier &eacute;tage. Avec une superficie de 310 m2 (28 m&egrave;tres de long sur 11 de large avec une hauteur de plafond de 6,45 m&egrave;tres).Le mobilier servant au mariage est d'origine !<br>
Avec son escalier &agrave; double vol&eacute;e, sa monumentale chemin&eacute;e et son plafond (une oeuvre d'Alexandre Bailly), ce b&acirc;timent ne manque pas d'attrait...<br> 
<br><br>

<b>L'&eacute;glise Saint-Jean Baptiste :</b> (1890)<br>

- une fresque (1924) ex&eacute;cut&eacute; par le peintre Deteix repr&eacute;sente &laquo; Les anges adorant le Seigneur &raquo;.<br>
- un b&eacute;nitier du 12&egrave;me si&egrave;cle (provenant de l'ancienne &eacute;glise de Noisy-le Grand !).<br>
-  Les orgues (construits par Cavaill&eacute;-Coll !)<br>
<br><br>

 
 
 

<b>L'&eacute;glise protestante :</b> (1897)<br>
<br><br>
 
 

<b> La Poste</b> (1933)<br>
&eacute;difi&eacute;e en briques de Champigny par Charles Wallon dans le plus pur style art-d&eacute;co ! <br>

<br><br>
<b>La place Robert Belvaux :</b><br> 
On peut y voir le plus haut (26 m&egrave;tres) immeuble du Perreux (construit en 1913) !<br>
<br><br>
<b>La pierre perreusienne :</b><br>
<br><br>
<b>la &laquo;Villa Jacques&raquo; :</b> (rue de Metz)<br> 
d&eacute;corations en c&eacute;ramique sur la fa&ccedil;ade!<br>
<br><br>
<b>la maison baptis&eacute;e &laquo;Pourquoi pas ?&raquo; :</b> (con&ccedil;u par Nachbauer, avenue Gabriel P&eacute;ri)<br>
Une sculpture de mouette aux ailes d&eacute;ploy&eacute;es, orne sa fa&ccedil;ade !<br>
<br><br><br>
 
<b>HISTOIRE :</b><br> 
<br>
- sous le r&egrave;gne de Saint Louis : le territoire du Perreux est un fief appartenant &agrave; un certain Pierre du Perreux.<br>

Un manoir y est construit permettant &agrave; ses occupants de chasser dans les bois proches de celui de Vincennes !<br>

<br>
  
- Jusqu'&agrave; la R&eacute;volution : 3 familles vont se succ&eacute;der &agrave; la t&ecirc;te de la seigneurie du Perreux, les Anthonis, les Deschiens de Ressons et les Millin. <br>
<br>
- En 1697 : le manoir m&eacute;di&eacute;val est abattu et un premier ch&acirc;teau est construit.<br>
<br>
- En 1760 : Robert Millin, financier et secr&eacute;taire du roi, ach&egrave;te les terres et la seigneurie et d&eacute;cide d'y construire un nouveau ch&acirc;teau en faisant appel &agrave; un architecte du roi, Etienne-Louis Boull&eacute;e.<br>
<br>
- Ce ch&acirc;teau est abattu vers 1895 (seul une aile est encore pr&eacute;sente dans le quartier du Parc, rue du docteur Faugeroux).<br>
<br>
- Pendant la R&eacute;volution, en 1794, J&eacute;r&ocirc;me-Robert Millin du Perreux (financier et directeur de la loterie royale) est guillotin&eacute; !<br>
<br>
- En 1800, Nicolas de Neufch&acirc;teau (&eacute;l&egrave;ve de Voltaire, acad&eacute;micien, ministre de l'Int&eacute;rieur, Directeur et Pr&eacute;sident du S&eacute;nat) est propri&eacute;taire des terres du Perreux. Les terres et le ch&acirc;teau vont ensuite passer dans les mains de nombreux propri&eacute;taires jusqu'en 1857.<br>
<br>
- milieu du 19&egrave;me si&egrave;cle : construction de la ligne de chemin de fer de Paris &agrave; Mulhouse !<br>
<br>
- Les guinguettes sur les bords de la Marne peuvent d&egrave;s lors attirent ouvriers, artistes et &eacute;crivains. <br>
<br>
- En 1881, le hameau du Perreux &eacute;tait attach&eacute; administrativement &agrave; la ville de Nogent-sur-Marne !<br>
Henri Navarre, avec d'autres habitants du hameau, lance l'id&eacute;e d'une s&eacute;paration entre Le Perreux et Nogent...<br>
<br>
- Le 28 f&eacute;vrier 1887 : le Pr&eacute;sident de la R&eacute;publique signe la loi donnant naissance &agrave; la Ville du Perreux !<br>
et Henri Navarre devient le premier maire du Perreux...<br>


 

</body>
</html>