<html>
<body background="../images/fondtexte4.jpg">
<a name="a"></a>
<table>
<tr>
<td>
</td>
<td>
<font color="purple"><font size=5 face="helvetica"><a href="guadeloupe.html"target="description"><b>Pr&eacute;sentation de la Guadeloupe</a></font><br>

</td>
</tr>
</table>
<hr>
<br>


<a name="geo"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Histoire</font></font><font size=1 face="helvetica"> ( <a href="geoguadeloupe.html" target="description">G&eacute;ographie</a></font> <font size=1 face="helvetica"> - <a href="ecoguadeloupe.html" target="description">&eacute;conomie</a></font><font size=1 face="helvetica"> - Produits locaux</font><font size=1 face="helvetica"> - Enfants du pays)</font></a></STRONG><BR>
</font>
<br>


<br>

- <b>3 000 ans avant J.C.:</b> pr&eacute;sence humaine en Guadeloupe !<br>
<br>
- <b>300 ans apr&egrave;s J.C :</b> Pr&eacute;sence des Indiens Arawaks, un peuple pacifique (agriculteurs et p&ecirc;cheurs) venu du bassin de l Or&eacute;noque (actuel V&eacute;n&eacute;zuela)<br>
<br>
- <b>Vers le 8&egrave;me si&egrave;cle :</b> les Indiens Cara&iuml;bes d&eacute;cimes et supplante les Indiens Arawaks !<br>
L'&icirc;le s'appele alors "Karuk&eacute;ra" (qui en cara&iuml;be signifie "l &icirc;le aux belles eaux")<br>
<br>
- <b>novembre 1493 :</b> Christophe Colomb d&eacute;couvre l'&icirc;le de Karuk&eacute;ra, qu'il baptise Guadeloupe en r&eacute;f&eacute;rence au monast&egrave;re espagnol de Santa Maria de Guadalupe situ&eacute; en Estr&eacute;madure...<br>
<br> 

- <b>Au 16&egrave;me si&egrave;cle :</b> les Espagnols font quelques tentatives pour conqu&eacute;rir la Guadeloupe mais sont repouss&eacute;s par les Cara&iuml;bes.<br>
<br>
- <b>Au 17&egrave;me si&egrave;cle :</b> des marchands fran&ccedil;ais fondent la Compagnie des Iles d'Am&eacute;rique (sous le patronage du cardinal de Richelieu) et organise la colonisation&nbsp;...<br>

<br> 
- <b>le 28 juin 1635 :</b> mandat&eacute;s par la compagnie, Li&eacute;nard de L'olive et Duplessis d'Ossonveille (mandat&eacute;s par la compagnie des Iles d'Am&eacute;rique) d&eacute;barquent &agrave; la Guadeloupe et prennent possession de l'&icirc;le... Ils livrent une guerre sans merci aux Indiens Cara&iuml;bes.<br>
<br>
- <b>1643 &agrave; 1664 :</b> Charles Houel est le gouverneur de la Guadeloupe !<br>
Il fonde la ville de Basse-Terre, et devient propri&eacute;taire de l'&icirc;le en la rach&egrave;tant &agrave; la Compagnie des&nbsp;Iles d Am&eacute;rique... Louis XIV lui donnera le titre de Marquis de Guadeloupe !<br>
<br>
- <b>vers 1644 :</b> Des Africains r&eacute;duits en esclavage sont amen&eacute;s dans les plantations de cannes &agrave; sucres.<br>
<br>
- <b>1674 :</b> La Compagnie est supprim&eacute;e ! L &icirc;le (rattach&eacute;e directement au pouvoir royal) devient colonie du royaume.<br>
<br>
- <b>1685 :</b> Le Code noir est proclam&eacute;, il r&eacute;gira l'esclavage dans les colonies fran&ccedil;aises !<br>
<br>
- <b>18&egrave;me si&egrave;cle :</b> la France et l'Angleterre se dispute la conqu&ecirc;te des &icirc;les carib&eacute;ennes.<br>
<br>
- <b>1756-1763 :</b> c'est la guerre de Sept ans !<br>
<pre>
    - <b>En 1759 :</b> la Guadeloupe est occup&eacute;e par les Anglais qui fondent
                le port de Pointe-&agrave;-P&icirc;tre.
    - <b>En 1763 :</b> le trait&eacute; de Paris met fin &agrave; la guerre et restitue la
                Guadeloupe et la Martinique &agrave; la France.

</pre>
- <b>1775: </b> L'&icirc;le obtient son autonomie vis-&agrave;-vis de la Martinique !<br>
<br>
- <b>1794 :</b> Les Anglais occupe l'&icirc;le qui sera aussit&ocirc;t reprise par Victor Hugues (le commissaire de la Convention) qui proclame l'abolition de l esclavage.<br>
<br>
- <b>1802 :</b> Le g&eacute;n&eacute;ral Richepance vient (sur ordre de Bonaparte) r&eacute;tablir l'esclavage et r&eacute;primer le soul&egrave;vement du chef de bataillon Delgr&egrave;s.<br>
<br>
- <b>le 27 avril 1848 :</b> (sur proposition de Victor Schoelcher) un d&eacute;cret aboli l' esclavage.<br> 
<br>
- <b>19 mars 1946 :</b> La Guadeloupe devient un d&eacute;partement fran&ccedil;ais d'outre-mer<br>
<br> 

<br>

En tant que d&eacute;partement fran&ccedil;ais d'outre-mer, la Guadeloupe fait partie de l'Union europ&eacute;enne au sein de laquelle elle constitue une r&eacute;gion ultra-p&eacute;riph&eacute;rique ; &agrave; ce titre, elle b&eacute;n&eacute;ficie de "mesures sp&eacute;cifiques" qui adaptent le droit communautaire en tenant compte des caract&eacute;ristiques et contraintes particuli&egrave;res de ces r&eacute;gions.<br>
<br><br>




</body>
</html>