<html>
<body background="../images/fondtexte2.jpg">


<a name="a"></a>

<A HREF="#p"<font color="brown">Saint-Barth&eacute;l&eacute;my</font></a>
<pre>
<hr>
D&eacute;partement <a href="../enteteoutremer.html"target="description">Outre-Mer</a> : <a href="guadeloupe.html"Target="description">GUADELOUPE</a>

            Habitants : 5 000
           Superficie : environ 25 Km2 (8Km de long et 3 Km de large)
              Densit&eacute; : 200 hab/km2

           Pr&eacute;fecture : Gustavia (2000 habitants)
          12 Villages : Colombier, Corossol, Lorient, Marigot, Saint-Jean

            Situation : &agrave; l'extr&ecirc;me nord-est de la mer des Cara&iuml;bes !
                        &agrave; 25 km St-Martin, 150 km St-Thomas, 200 km la Guadeloupe
                        et &agrave; 6000 km Paris

        Altitude maxi : 281 m (le morne Vitet)

               Climat : de type tropical maritime sec (il pleut rarement).
                        La temp&eacute;rature moyenne varie entre 22 et 30&deg;C.
                        seul une l&eacute;gere brise venant de l'Est offre une
                        sensation de fraicheur !

     &Icirc;les principales : &icirc;le Chevreau, Coco, &icirc;le Fourchue, &icirc;le Fr&eacute;gate, La Tortue,
                        &icirc;le le Boulanger, Les Grenadins, Pain de Sucre, &icirc;le Pel&eacute;,
                        &icirc;le Petit Jean, &icirc;le St Barth&eacute;l&eacute;my, Toc Vers
<hr>
  
</pre>

Christophe COLOMB, ayant d&eacute;couvert l'&icirc;le le jour de la f&ecirc;te de son fr&egrave;re, lui donna son nom !<br>
 <br><br>

<b>Saint-Jean :</b> p&ocirc;le touristique de l'&icirc;le avec de nombreux commerces, restaurants et h&ocirc;tels au bord d'une magnifique baie...<br>
<br>
<b>Lorient :</b> Un village pittoresque qui &agrave; su gard&eacute; un aspect traditionnel !<br>
 Arr&ecirc;tez-vous quelques instants pour voir son joli cimeti&egrave;re (loin du lugubre)...<br>
<br>

Le Grand Cul sac : Superbe plage ! 

Le Petit Cul de Sac : Superbe plages !

<b>Le morne Vitet :</b> (point culminant de l'&icirc;le &agrave; 281m)<br>
offre un splendide panorama !<br>
<br>

<b>La Saline :</b> superbes plages dont les bassins servent aujourd'hui de refuge aux oiseaux migrateurs !<br>
Les routes d'acc&egrave;s escarp&eacute;es permettent de nombreux points de vue f&eacute;eriques...<br>
<br>

<b>Lurin :</b> quartier r&eacute;sidentiel o&ugrave; la route offre de nouveau quelques points de vue exceptionnels.<br>
<br>

<b>Colombier :</b><br>
<br>

<b>l'Anse des Cayes :</b> quartier r&eacute;sidentiel, dont la plage est surtout fr&eacute;quent&eacute;e par les surfeurs<br>
<br>
<b>l'Anse des Flamands :</b> petit village nich&eacute;e dans une v&eacute;g&eacute;tation exub&eacute;rante avec une tr&egrave;s belle plage ombrag&eacute;e de cocotiers.<br>
<br>
<b>La pointe &agrave; Colombier :</b> avec sa plage, l'extr&eacute;mit&eacute; occidentale de l'&icirc;le, est accessible uniquement &agrave; pied, mais du haut du point de vue de Grande Roche o&ugrave; la route se termine, vous aurez une vue panoramique vers les &icirc;lets alentour, Saint-Martin, la baie de Colombier, endroit de mouillage appr&eacute;ci&eacute; par les plaisanciers, et vous dominerez toute l'&icirc;le.<br>


<br>

<b>Corossol :</b> un petit village de p&ecirc;cheurs, rest&eacute; &agrave; l'&eacute;cart du d&eacute;veloppement touristique.<br>
Petites cases &agrave; vent en bois peint, bateaux de p&ecirc;che multicolores, femmes portant la coiffe traditionnelle (quichenotte) et fabriquant des chapeaux et autres objets &agrave; partir de feuilles de latanier.<br>
<br>
<b> mus&eacute;e du coquillage :</b><br>
<br>

  

  





  

<a name="p"></a> 
<A HREF="#a"<font color="#FF0000">haut de page</font> </A>


</body>
</html>