<html>
<body background="../images/fondtexte2.jpg">


<a name="a"></a>

<font color="brown">Saint-Martin</font>
<pre>
<hr>
D&eacute;partement <a href="../enteteoutremer.html"target="description">Outre-Mer</a>  : <a href="guadeloupe.html"Target="description">GUADELOUPE</a>

            Pr&eacute;fecture : Marigot
         autres villes : Colombier, Cul-de-Sac, Grand-Case,
                         Oyster Pand, Quartier-d'Orl&eacute;ans, Rambaud

             Habitants : 33 000 habitants
            Superficie : 54 Km2 (pour la partie Fran&ccedil;aise)
               Densit&eacute; : 611 hab/km2

         Altitude maxi : 424 m (Mt Paradis)  

             Situation :

      D&eacute;calage Horaire : 6 heures de moins l'&eacute;t&eacute; et 5 heures de moins l'hiver 
                         (par rapport &agrave; la France M&eacute;tropolitaine)

                Climat : tropical 

                   Eau : distribu&eacute;e par les usines de dessalement dans toute l'&icirc;le,
                         elle la particularit&eacute; d'&ecirc;tre ti&egrave;de voire chaude &agrave; certaines
                         p&eacute;riodes (m&ecirc;me si vous tournez le robinet d'eau froide). 

<hr>
  
</pre>
  
<b>Le Mus&eacute;e "Sur la trace des Arawaks"</b><br>
<br>

 Les premiers habitants de l'&icirc;le, les salines, de nombreux documents d'&eacute;poque, des photos, des objets d&eacute;couverts pendant les fouilles arch&eacute;ologiques. Pour conna&icirc;tre toute l'histoire de Saint-Martin, un mus&eacute;e tr&egrave;s int&eacute;ressant &agrave; visiter situ&eacute; Route de Sandy Ground &agrave; Marigot - Ouvert de 9 H 00 &agrave; 13 H et de 15 H &agrave; 19 H - T&eacute;l 0590 29 22 84 - Voir Histoire 

 <br>
<b>Le fort Louis</b><br>
<br>

 Construit en 1789 cet &eacute;difice est accessible en voiture ou &agrave; pieds par le le port et permet une vue tr&egrave;s belle de la baie de Marigot. Les canons t&eacute;moignent de l'&eacute;poque de Louis XVI. 


 
<b>Le march&eacute; de Marigot</b><br>
<br>

 Situ&eacute; sur le port de Marigot le march&eacute; offre tout un &eacute;ventails d'objets artisanaux expos&eacute;s tout les jours. Uniquement le mercredi et le samedi vous pourrez voir et acheter des bananes en quantit&eacute;s importantes, d'autres fruits et l&eacute;gumes exotiques sur les &eacute;tals des marchands cr&eacute;oles. 

 <br>
<b>Le pic Paradis</b><br>

 Sommet culminant de Saint-Martin, les 424 M&egrave;tres de hauteur offre un panorama superbe permettant de profiter de la nature et d'une douce fra&icirc;cheur. Une randonn&eacute;e agr&eacute;able &agrave; faire par la route de Rambaud ou par l'autre versant situ&eacute; &agrave; Quartier d'Orl&eacute;ans. 

 <br>
<b>La ferme aux papillons</b><br>
<br>

 Cette ferme aux papillons est un endroit indispensable &agrave; visiter. De nombreux d&eacute;cors naturels reconstitu&eacute;s permettent de voir &eacute;voluer des papillons au couleurs magnifiques. Des papillons de toutes les parties du monde vivent et se reproduisent. V&eacute;ritable le&ccedil;on de choses dans une ambiance de d&eacute;tente. A ORIENT BAY Ouvert de 9 H 00 &agrave; 16 H - T&eacute;l : 0590 87 31 21 - Leur site Internet (En Anglais) 
<br><br>
 

<b> Quelques &icirc;les autour de Saint-Martin</b><br>
<br>

 Vous trouverez une dizaine d'&icirc;les dans un rayon de 30 Km autour de Saint-Martin, donc facilement accessible par bateau, des navettes situ&eacute;es sur plusieurs zones d'embarquement vous emm&egrave;nerons vers ces destinations.


 - Anguilla
 - Saint-Barth&eacute;lemy
 - Saba
 - Saint-Kitts et Nevis
- Saint-Eustache
 

 
<b>La plage de Maho Beach</b><br>
<br>

 A voir absolument, cette plage est situ&eacute; juste en bout de piste de l'a&eacute;roport de Juliana, sensation garantie en vous pla&ccedil;ant &agrave; proximit&eacute; de cette plage vous pourrez voir de tr&egrave;s pr&egrave;s les avions de grandes lignes pass&eacute;s au dessus de vous, sinon un peu plus loin une petite plage plus calme avec h&ocirc;tels et logements.
<br><br>


<b>HISTOIRE :</b><br>
<br>
- vers 1800 avant JC : Les indiens Salado&iuml;des et Arawaks, arrivent à Saint-Martin, venus en pirogue du bassin de l'Or&eacute;noque (en Am&eacute;rique du Sud).<br>
 D&eacute;couvrant &eacute;tangs et lagunes dont le produit - le sel - restera l'une des principales ressources de l'&icirc;le, ils baptis&egrave;rent celle-ci "SUALIGA" terre du sel.<br>
<br>
 Les pacifiques Arawaks furent ensuite envahis par d'autres indiens plus belliqueux, aux moeurs anthropophages&nbsp;: "&nbsp;les Cara&iuml;bes&nbsp;"
<br>
<br>
- Vers 1500 apr&egrave;s J.C. : Les Tainos furent les derniers habitants am&eacute;rindiens de Saint-Martin .<br>
<br>
 Ils furent d&eacute;cim&eacute;s peu apr&egrave;s la d&eacute;couverte de l'&icirc;le par les premiers colons europ&eacute;ens<br>
<br>
- Fin du 15 &egrave;me Si&egrave;cle : Christophe Colomb d&eacute;couvre l'&icirc;le pour le monde occidental (lors de son second voyage aux Antilles).<br>
<br>
- Le 11 novembre 1493, Christophe Colomb d&eacute;die sa d&eacute;couverte &agrave; l'&eacute;v&ecirc;que de Tour Saint-Martin dont c'est l'anniversaire ce jour l&agrave; .<br>
<br>
 

- 16 &egrave;me Si&egrave;cle<br>
<br>

 L'&icirc;le est visit&eacute;e par de nombreuses nations europ&eacute;ennes&nbsp;: Espagnols, Fran&ccedil;ais, Hollandais, Portugais, Anglais, Flamands &agrave; la recherches de mouillages prot&eacute;g&eacute;s. C'est la grande &eacute;poque des corsaires et des flibustiers<br>
<br>
 R&eacute;duisant , les autochtones en esclavage, ils les arrachent souvent &agrave; leur &icirc;le pour les transf&eacute;rer dans des &icirc;les voisines . Les mauvais traitements et les maladies vont tr&egrave;s vite les d&eacute;cimer.<br>
<br>
- En 1595, Sir Francis Drake croise au large de Saint-Martin<br>
<br>
- 1648 :  Trop petite et d'un int&eacute;r&ecirc;t limit&eacute; pour les conquistadors, les Espagnols quitt&egrave;rent l'&icirc;le .<br>
 Pendant cette ann&eacute;e, Saint-Martin &eacute;tait occupait par 4 Fran&ccedil;ais et 5 Hollandais, chaque gouvernement de ces 2 nationalit&eacute;s sign&egrave;rent un trait&eacute; afin de partag&eacute; l'&icirc;le en deux parties. <br>
 <br>
 

- 17 et 18&egrave;me Si&egrave;cle<br>
<br>
 Au cours de ces deux si&egrave;cles, sujette aux guerres maritimes et aux conflits d&eacute;vastateurs qui &eacute;branl&egrave;rent la cara&iuml;be, l'&icirc;le de Saint-Martin subit les attaques incessantes de l'Espagne et de l'Angleterre.<br>
<br>
- Le 23 mars 1648, les Fran&ccedil;ais et les Hollandais r&egrave;glent le probl&egrave;me de leur souverainet&eacute; par la signature du Trait&eacute; du Mont des Accords.<br>

<br>

 C'est &agrave; cette &eacute;poque en 1776 que fut construit le Fort Saint Louis, juch&eacute; sur un morne surplombant la ville de Marigot. Il permettait de la prot&eacute;ger des constantes attaques anglaises. <br>
 <br>
 
 


 Comment d&eacute;limiter la fronti&egrave;re de Saint-Martin entre Fran&ccedil;ais et Hollandais?<br>
<br>
 Deux coureurs de chaque nationalit&eacute; s'&eacute;lanc&egrave;rent chacun de leur c&ocirc;t&eacute; afin de parcourir la plus grande distance. Le coureur Fran&ccedil;ais ayant effectu&eacute; une distance plus longue, permit d'obtenir une surface repr&eacute;sentant plus des deux tiers de l'&icirc;le. Une l&eacute;gende raconte que le coureur Fran&ccedil;ais ayant consomm&eacute;&nbsp; "juste un peu de vin rouge" se permit de prendre quelques raccourcis expliquant ainsi sa performance remarquable. Autre particularit&eacute;, Saint-Martin est la plus petite &icirc;le au monde par sa superficie &agrave; &ecirc;tre partag&eacute;e par deux pays.<br> 
 <br>
  

- 19&egrave;me et 20&egrave;me Si&egrave;cle.<br>
<br>
- En 1816, la signature du Trait&eacute; de Vienne met un terme aux d&eacute;chirements coloniaux, assurant d&eacute;finitivement la pr&eacute;dominance Franco-Hollandaise.<br>

- En 1848, l'esclavage est aboli dans la partie fran&ccedil;aise de l'&icirc;le et 1863 pour la partie Hollandaise. Peu &agrave; peu, les &eacute;changes commerciaux d&eacute;clinent :<br>
<br>


- 1875 : la production sucri&egrave;re de l'&icirc;le cesse !<br>
<br>
- 1923 : la production du coton cesse !.<br>
<br>
- vers 195 : Les salines ferment leurs portes !<br>
<br>
 Ce d&eacute;clin &eacute;conomique contraint de nombreux Saint-Martinois &agrave; l'exil. ils &eacute;migrent vers de nouveaux p&ocirc;les d'emploi: raffinerie de Cura&ccedil;ao et Aruba, plantations de Saint-Domingue et les Etats-Unis, tissant des liens affectifs et durables avec le continent am&eacute;ricain. <br>
 <br>
 

- 1945<br>
<br>
 Pendant la guerre, la partie fran&ccedil;aise de l'&icirc;le reconna&icirc;t le gouvernement de Vichy et par contrecoup sub&icirc;t le blocus des forces alli&eacute;es.<br>
<br>
 La guerre contribue largement &agrave; l'am&eacute;ricanisation de l'&icirc;le, dont les Etats-Unis sont le fournisseur unique.<br>
<br>
 Cette p&eacute;riode f&ucirc;t aussi faste pour les trafiquants qui &eacute;tabliront de grandes fortunes<br>
<br>
 Le marasme &eacute;conomique de l'&icirc;le persistera jusqu'aux ann&eacute;es 50. <br>
 
 
 
 




  




</body>
</html>