<HTML>
<HEAD>
<TITLE> Nota del Autor</TITLE>
</HEAD>
<BODY BGCOLOR="#000000">
<center><p><br>
<IMG SRC="barrita3.jpg" ALT="Barra encima counter"><br>
<font color="#FFFF99" size=3><b>NOTA DEL AUTOR</b><br></font>
<IMG SRC="barrita4.jpg" ALT="Barra debajo de counter"><p><br>

<p>
<TABLE WIDTH=90%>
<TR>
<TD WIDTH=100%>
<font color="#FFFF99" size=3>
 Primero de todo, agradecerte, lector, que est&eacute;s leyendo esta p&aacute;gina Web.  Me
gustaría  que  me pusieras un e-mail sobre cualquier sugerencia o sobre lo que
te parezca.
<p>
 Esta  lista  de  Amigueros  de  Internet,  la hice porque no había ninguna
disponible,  y  como ya había cogido experiencia haciendo el <A HREF="amidigi.html">AmiyDigi</A>, pues
puse manos a la obra.<br> En estos momentos, el AMIyDIGI est&aacute; un poco abandonado, ya sea porque Internet se ha comido las redes de correo amateur como Fidonet y Amiganet, ya sea porque han empezado a desaparecer BBS míticas en el rutado de Amiganet como Amiga Penedes BBS o Tu Amiga BBS.
<p> Su cometido principal es el de mantaner a los amigueros en Internet unidos. Ya somos demasiado pocos comparados con los usuarios de otras plataformas como para no saber que hay otros usuarios de AMIGA como nosotros por ahí.<br> De esta manera, al estar incluido en esta lista junto con tu direcci&oacute;n de e-mail, tu comentario sobre tus preferencias, gustos, tipo de ordenador, programas que usas, etc, puedes entrar en contacto con otros usuarios con tus mismos gustos, compartir ideas, problemas, y sobre todo, hacer nuevos amigos. ¿No te gustaría saber si hay algun usuario de AMIGA en tu pueblo o ciudad?. Pues con esta lista eso es lo que pretendo, que estemos conectados, informados y que formemos una piña haciendo realidad ese dicho: La uni&oacute;n hace la fuerza.
<p>
 
 El AMIyNET consiste principalmente en varias secciones:<p><ul><IMG SRC="cuadradito.gif" border=0> Podreis buscar a los usuarios por orden alfab&eacute;tico de su nombre (no por su apellido porque la mayoría de la gente se conoce por el nombre),<p> <IMG SRC="cuadradito.gif" border=0> y buscarlos por el Dominio de su e-mail (de esta manera podreis saber quien se conecta con vuestro mismo proveedor y asi intercambiar dudas o solucionar problemas en la conexi&oacute;n).</ul><p> Dentro de cada ficha de usuario, podreis saber el nombre completo, el e-mail, el alias que usa en IRC, su foto (si es que me la manda), y un comentario sobre &eacute;l (sus preferencias, programas que usa, modelo de AMIGA que posee, c&oacute;mo lo tiene equipado, d&oacute;nde vive, y otras cosas que quiera poner). Claro est&aacute;, yo me reservo la última palabra en cuanto a lo aceptable en el comentario, es decir, no permitir&eacute; ni insultos, ni descalificaciones, ni salidas de tono, etc.

<p>
 Si  quereis  que  añada algo al AMIyNET como lugares de reunion, IRC Chat,
direcciones de utilidad, etc..  pues hacermelo saber. Aunque para eso ya est&aacute;n otras p&aacute;ginas, pero bueno, siempre es bueno tener todo en un mismo sitio, ¿no?. ;-) De todas maneras, ya hay un link en el menú principal que os mantendr&aacute; informado de lugares interesantes de Internet para los amigueros.
<p>
 Quisiera agradecer a los amigueros por su colaboraci&oacute;n ya que sin ellos no
existiría  esta  lista  ;-)  y  adem&aacute;s  porque  ¿c&oacute;mo  puedo  poner la foto
digitalizada  de  alguien  si  &eacute;ste  no  me  la  da?.   Tampoco  es plan de
convertirme en un "Paparazzi" de revista del coraz&oacute;n.  8-)
<p>
 Este  último  punto me hace pediros por favor que me inform&aacute;rais de nuevos
internautas,  cambios  en  las direcciones, etc...  así como que si quereis
salir con foto en el Magazine, me paseis ya sea una digitalizaci&oacute;n, foto, o
video en la que salgais.  Ya me encargo yo de digitalizarlo. Pero siempre es mejor que me la mandeis ya digitalizada.
<p>
 Quien   quiera   puede   mandarme   adem&aacute;s   de  su  digitalizaci&oacute;n,  otra
digitalizaci&oacute;n  por ejemplo del logo de su BBS (en el caso de que sea Sysop
de  una),  o de la ciudad en donde vive, o de su ordenador, o de un gr&aacute;fico
que  haya  hecho  y le haya quedado chulo, etc.  Pero siempre referido a lo
que  ponga en su comentario.  Es decir, si pone que vive en Madrid, pues en
la  palabra "Madrid" le pongo un boton que haga que salga la digitalizaci&oacute;n
de  Madrid.   Pero  s&oacute;lo  me  podeis  mandar  tres  añadidos  externos  por
internauta porque si no, me vais a acabar el espacio para poner mi p&aacute;gina Web...
<p>
 Como he visto que hay muchos Internautas con varias direcciones de correo,
me  gustaría  que  me  dijeran  cu&aacute;l es la direcci&oacute;n que m&aacute;s usan, para así
poder  los  dem&aacute;s  saber  d&oacute;nde mandar los Nets y los mensajes.  Tambi&eacute;n me
gustaría  que  me  dijeran  si  alguna de esas direcciones ya ha dejado de
existir.
<p>
<A HREF="josevergara.html">Jos&eacute; Vergara Gonz&aacute;lez</A>, el Editor.<p>
</td>
</tr>
</table>
</center> 
<center><a href="amiynet.html"><IMG SRC="amiynetp3.gif"  ALT="Logo de AmiyNEt" border=0></a><P>
<font color="#FFFF99" size=3>© Jos&eacute; Vergara Gonz&aacute;lez.<br> <a href="mailto:jvergara@idecnet.com">jvergara@idecnet.com</a>
</center>
</BODY></HTML>
