<HTML>
<HEAD>
<TITLE> Hacer ficha en linea del AMIyNET </TITLE>
</HEAD>
<BODY BGCOLOR="#000000">
<center>
<p><br>
<IMG SRC="barrita3.jpg" ALT="Barra encima counter"><br>
<font color="#FFFF99" size=3><b>FICHA</b><br></font>
<IMG SRC="barrita4.jpg" ALT="Barra debajo de counter">
<p><br><p>
<IMG SRC="barrita.jpg" ALT="Barra de final de comentario">
<TABLE width=70%>
<TR>
<TD width=100%><font color="#FFFF99" size=3>
<center><p><br>
 Aqu&iacute; podreis rellenar vuestros datos en linea y cuando hayais finalizado darle al bot&oacute;n de mandar y yo los recibir&eacute; por e-mail de una manera r&aacute;pida y sencilla. En unos d&iacute;as os dar&eacute; de alta. Si en <b>tres</b> d&iacute;as no habeis recibido noticias m&iacute;as por e-mail de que vuestro formulario ha sido recibido, es que ha habido algún problema en el env&iacute;o. Si usais el <b>VOYAGER NG 2.70</B>, este programa sea posiblemente la causa porque aun no esta muy depurado y la opci&oacute;n de mandar un e-mail desde &eacute;l no funciona muy bien. Con el <b>VOYAGER NG 2.88</B> este problema ya está resuelto.
<p>
 Los datos a rellenar se explican por s&iacute; solos. Lo único, es en la secci&oacute;n de "Comentario" donde no se os ocurra qu&eacute; poner. Aqu&iacute; podeis poner desde d&oacute;nde viv&iacute;s, como os llamais, d&oacute;nde soleis estar en IRC, qu&eacute; lugares os gusta visitar, qu&eacute; modelo de AMIGA teneis, accesorios, cu&aacute;nto tiempo llevais con el AMIGA, que trabajillos habeis hecho con el AMIGA, direcci&oacute;n de vuestra p&aacute;gina personal en Internet, etc... <p>
 Otra cosa a tener en cuenta es si quereis mandarme una foto vuestra para que la gente os pueda reconocer en alguna Party, etc. Esta foto me la tendreis que mandar por e-mail a la direcci&oacute;n <b>jvergara@idecnet.com</B> y ya me encargar&eacute; yo de acortarla, transformarla, etc... As&iacute; mismo, si quereis mandarme alguna foto m&aacute;s de donde viv&iacute;s, o de vuestro ordenador o algo relacionado con vosotros, me la mandais tambi&eacute;n y la incluir&eacute; en la secci&oacute;n de "Comentario", pero s&oacute;lo me podreis mandar <b>una</b>.

</center></font>
</TD>
</TABLE>
<p>
<IMG SRC="barrita2.jpg" ALT="Barra de final de comentario"><p><br>

<font color="#FFFF99" size=3>
<FORM ACTION="mailto:jvergara@idecnet.com" METHOD="POST" ENCTYPE="TEXT/PLAIN"><br>
-<b>Nombre y apellidos:</b><INPUT TYPE="text" NAME="Nombre" SIZE="25" MAXLENGTH="40"> <p>
-<b>Direcci&oacute;n de e-mail:</b><INPUT TYPE="text" NAME="e-mail" SIZE="25" MAXLENGTH="50"> <p>
-<b>Alias en IRC:</b><INPUT TYPE="text" NAME="Alias" MAXLENGTH="50"> <p>
-<b>Comentario sobre vosotros y lo que haceis con el AMIGA:</b><br><TEXTAREA NAME="Comentarios" ROWS="35" COLS="90"></TEXTAREA>
<P><center><INPUT TYPE="submit" VALUE="Enviar datos"> 
<INPUT TYPE="reset" VALUE="Borrar datos"> </center>
</font></form>
<p><br>
<p>
<center>
<a href="amiynet.html"><IMG SRC="amiynetp3.gif"  ALT="Logo de AmiyNEt" border=0></a><P>
<font color="#FFFF99" size=3>
© Jos&eacute; Vergara Gonz&aacute;lez.<br> <a href="mailto:jvergara@idecnet.com">jvergara@idecnet.com</a>
</center>
</BODY></HTML>
