<html>
<body background="../../images/fondtexte2.jpg"  border="0">

<a href="01villesetcodespostaux.html#bo"target="description"><font color="brown">Bourg-en-Bresse</font></a>     (Altitude : 241 m)
<pre>
<hr>
D&eacute;partement : <a href="enteteain.html"Target="description">Ain </a>      R&eacute;gion : <a href="../enteterhonealpes.html"Target="description">Rh&ocirc;ne-Alpes</a>

Code Postal : 01 000

  Habitants : 43 008 Burgiens ou Bressans (en 1999)
 Superficie : 24,68 km2 

  Situation : &agrave; 41 Km <a href="nantua.html"target="description">Nantua</a>, 43 km <a href="arssurformans.html"Target="description">Ars-sur-Formans</a>, 77 Km <a href="belley.html"target="description">Belley</a>,
              110 Km <a href="gex.html"target="description">Gex</a>

    Plus... :
<hr>

</pre>


Capitale de la Bresse depuis le moyen-&acirc;ge !<br>
<br><br>

<b>Le monast&egrave;re royal de Brou :</b> (75 000 visiteurs/an)<br>
<br>
Joyau du gothique flamboyant, le monast&egrave;re royal de Brou doit sa naissance &agrave; une belle
histoire d'amour entre Marguerite d'Autriche et son jeune et bel &eacute;poux. Pr&eacute;voir une
demi-journ&eacute;e pour visiter l'&eacute;glise, les 3 clo&icirc;tres (toiture "&agrave; la fran&ccedil;aise" avec
tuiles verniss&eacute;es de 4 couleurs dispos&eacute;es en losanges), les superbes salles vo&ucirc;t&eacute;es 
d'ogive, les grands jardins et mus&eacute;e ... <br>
<br>
<br>
<b>Le bastion</b>, derni&egrave;re trace d'une muraille &eacute;difi&eacute;e par les Ducs de Savoie !<br>
<br><br>
<b>Le quartier ancien de Bourmayer</b>, 1er quartier de la ville !<br>
<br><br>

<b>L'H&ocirc;tel de Ville</b> &eacute;rig&eacute; en 1771 !<br>
<br><br>
<b>Les maisons &agrave; pans de bois</b> datant de 1494 !<br>
<br><br>
<b>La porte des Jacobins </b>(1437) : C'est le monument le plus ancien de la ville .<br>
<br><br>
<b>Le th&eacute;&acirc;tre et le complexe de la Grenette</b><br>
<br><br>
<b>Le kiosque &agrave; musique des Quinconces</b><br>
<br><br>
<b>Le centre Albert Camus</b> qui abrite l'Office de Tourisme et une annexe de la m&eacute;diath&egrave;que<br>
<br><br>
<b>La chapelle de l'ancien coll&egrave;ge j&eacute;suite</b> devenu lyc&eacute;e Lalande<br>
<br><br>
<b>L'H&ocirc;tel-Dieu et son apothicairerie</b><br>
<br>

<br>
 
<br><br>
<b>Parc de loisirs de Bouvent :</b><br>
<br>
1986 : ouverture du parc !  <br>
<br>
c'est 56 hectares vallonn&eacute;s et arbor&eacute;s, un plan d'eau de 21 hectares avec plage et baignade surveill&eacute;es, coins p&ecirc;che, espaces pique-niques, jeux, circuit p&eacute;destre (2,5 km), tir &agrave; l'arc, &eacute;cole de voile et snack-bar<br>
<br>
il accueille quelque 60 000 personnes pendant la saison d'&eacute;t&eacute;. De nombreuses manifestations s'y d&eacute;roulent r&eacute;guli&egrave;rement.<br>
<br>
Le parc de loisirs abrite &eacute;galement le golf public municipal (9 trous homologu&eacute; : 3 980 m sur 22 hectares).<br>
<br><br>

<b>La for&ecirc;t de Seillon :</b> <br>
<br>
C'est une for&ecirc;t domaniale de 600 hectares (bien entretenue) qui permet d'agr&eacute;able ballade sur ses sentiers ainsi qu'un parcours sportifs pour les plus volontaires ;-)<br>

<br>
  

 

<br>
  
<br>

<b>HISTOIRE :</b><br>
 <br>
Bourg voit le jour au temps des Gaulois !<br>
<br>
<b>1272 :</b>, Bourg et la Bresse deviennent savoyardes par le mariage de Sybille de B&acirc;g&eacute; et Am&eacute;d&eacute;e V de Savoie. Quelques si&egrave;cles plus tard, Philibert le Beau devient duc de Savoie et &eacute;pouse Marguerite d'Autriche. Il en na&icirc;tra le joyau du monast&egrave;re de Brou.<br>
<br>
<b>1437 :</b> Guillod, riche marchand, fait construire la Porte des Jacobins...(Elle marquait autrefois l'entr&eacute;e d'un couvent de Dominicains). C'est le monument le plus ancien de la ville. Aujourd'hui cette belle arche de pierre domine de son &eacute;l&eacute;gante silhouette gothique, la place Edgar Quinet, toujours tr&egrave;s anim&eacute;e et o&ugrave; il fait bon fl&acirc;ner &agrave; la terrasse des bistrots.<br>
<br>

<b>En 1601</b> la Savoie c&egrave;de la Bresse et une grande partie de l'Ain &agrave; la France !<br>
<br>
<b>Apr&egrave;s la r&eacute;volution</b> Bourg-en-Bresse devient pr&eacute;fecture de l'Ain...L' Industrie et l'agriculture s'y d&eacute;veloppent jusqu'&agrave; la seconde guerre mondiale....<br>
<br>
<b>1894</b> cr&eacute;ation d'une grande avenue centrale (l'avenue Alsace-Lorraine)allant de l'H&ocirc;tel de Ville &agrave; la Pr&eacute;fecture.<br>

<br>
<br>
<b>Sp&eacute;cialit&eacute; :</b><br>
<br>
- <i>la grenouille po&ecirc;l&eacute;e au beurre et persill&eacute;e</i>, grande sp&eacute;cialit&eacute; de la r&eacute;gion !<br>
<br>
- <i>le poulet de Bresse</i> : Poulet &agrave; la cr&egrave;me et aux morilles, quenelles sauce Nantua<br>
la volaille de Bresse est la seule au monde &agrave; poss&eacute;der une Appellation d'Origine Contr&ocirc;l&eacute;e (AOC)...<br>
<br>
- <i>quenelles sauce Nantua</i>,<br>
La quenelle est n&eacute;e ici (au d&eacute;dut du si&egrave;cle) gr&acirc;ce au talent d'un restaurateur Burgien...la quenelle Giraudet (nature, au brochet, &agrave; la volaille) s'exporte dans toute la France.<br><br>
<br>
- <i>la carpe des Dombes</i><br>
<br> 
- <i>Les vignobles du Bugey</i> : vins rouges, blancs et p&eacute;tillants<br>
<br>
- <i>la galette bressane</i><br>
<br> 
- <i>Les gaudes</i> : soupe de farine de ma&iuml;s grill&eacute;, d'eau et de lait (unique repas du soir des temps difficiles).<br> 
<br>
- <i>le "vincuit"</i> sorte de confiture &agrave; base de poires et de pommes sans ajout de sucre.<br>
 



</body>
</html>