/* Short ARexx script to play sample and */
/* load (5)text Whittle Quiz */

address command '$SamplePlayer Samples/Channel5/StartTheClock'
address command 'Progs/Whittle'
exit

