@DATABASE opium.newmail.ru:666/25s.htm
@WORDWRAP

@NODE MAIN
@TITLE " Ave Satanas..."
 
   @{" " link "24s.guide/MAIN"}@{"../pau.gif" link "../pau.gif/MAIN"}
Назад    Черная Библия Приложение    @{" " link "26s.guide/MAIN"}@{"../pau0.gif" link "../pau0.gif/MAIN"}
Дальше 

Одиннадцать Сатанинских Правил на Земле. 

   - Не высказывайте своей точки зрения и не давайте советов, если только вас об этом не попросят. 
   - Не рассказывайте о своих неприятностях другим, если только вы не уверены в том, что вас хотят выслушать. 
   - В чужой берлоге выказывайте уважение, либо не появляйтесь там вообще. 
   - Если гость вашей берлоги досаждает вам, обходитесь с ним жестоко и безжалостно. 
   - Не делайте попыток сексуального сближения, если только не получаете приглашающий сигнал. 
   - Не берите вещь, не принадлежащую вам, если только она не является бременем для ее хозяина и он не просит об освобождении его от этого бремени. 
   - Признайте силу магии, если она была успешно вами применена для достижения ваших целей. Если вы отрицаете силу магии после того, как с успехом ею воспользовались, вы лишитесь всего достигнутого. 
   - Не выражайте своего недовольства по поводу того, что не имеет к вам никакого отношения. 
   - Не обижайте маленьких детей. 
   - Не убивайте животных кроме как для пропитания и при защите от их нападения. 
   - Находясь на открытой территории, не мешайте никому. Если кто-то мешает вам, попросите его прекратить. Если он не останавливается, уничтожьте его. 

@{"i"}Антон Шандор ЛаВей,
 II Аппо Satanas (1967г. н.э.) @{"ui"}
 ---

 ---

 ---

 ---

 ---

@endnode
