 <html>
<head>
<!--     "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>3.1.1 &nbsp; Neue Men&#252;s</b></h1>

<p>Es ist nun ein &quot;Bearbeiten&quot;-Men&#252; hinzugekommen, mit
folgenden Punkten: </p>

<table border=0 width=100% cellpadding=8>
<tr><td>
<table border=2 cellspacing=1 cellpadding=6>
<tr><td>Bearbeiten</td><td>Shortcut</td></tr>
<tr><td>Halbieren<br>H&#228;lfte X<br>H&#228;lfte Y<br>Verdoppeln<br>Spiegeln X<br>Spiegeln Y<br>
Transponieren<br>Drehen 90°<br>Drehen...<br>Stauchen...<br>Bend...<br>Slant...<br>
Perspektive..</td>
<td>A-h<br>A-X<br>A-Y<br>A-H<br>A-x<br>A-y<br>A-Z<br>A-z<br>A-$<br>A-%<br>
A-)<br>A-(<br>A-&</td></tr>
</table>
</td>
<td valign=top><p>Eine Bearbeitungsfunktion gilt immer f&#252;r den aktuell
ausgew&#228;hlten Pinsel. Die Gl&#228;ttungsfunktion f&#252;r die Pinseloperationen kann
im System-Notebook unter "Pinsel" eingeschaltet werden (sehr zu
empfehlen!). </p>

<p>Hat ein Brush durch eine Operation (z. B. Verzerrung) einen
schwarzen Rand bekommen, k&#246;nnen Sie diesen leicht maskieren,
indem Sie im Farbrequester die Farbe Schwarz ausw&#228;hlen und die
Taste '/' dr&#252;cken. </p>
</td></tr></table>

<ul>
<li><b>Halbieren </b><br>

Verkleinert den aktuellen Pinsel auf die H&#228;lfte seiner Gr&#246;&#223;e </li>


<li><b>H&#228;lfte X </b><br>

Halbiert die Pinselgr&#246;&#223;e horizontal </li>


<li><b>H&#228;lfte Y </b><br>

Halbiert die Pinselgr&#246;&#223;e vertikal </li>


<li><b>Verdoppeln </b><br>

Verdoppelt die Pinselgr&#246;&#223;e (mit Gl&#228;ttung) </li>


<li><b>Spiegeln X/Y </b><br>

Spiegelt den Pinsel an der X- bzw. Y-Achse </li>


<li><b>Transponieren </b><br>

Diese Funktion transponiert den Pinsel (Vertauschung von PixelZeilen und
-Spalten) </li>


<li><b>Drehen 90° </b><br>

Dreht den Pinsel um 90° </li>


<li><b>Drehen... </b><br>

Öffnet einen Requester zur Einstellung des Drehwinkels. Dieser kann mit
einem Slider eingestellt werden. Ein Rechteck gibt Auskunft &#252;ber die gerade
gew&#228;hlte Lage (wei&#223;er Rand ist aktuelle Oberkante des Pinsels). <br>

Mit dem Schalter "Winkel zeichnen" kann der Winkel auch direkt im Bild
gezeichnet werden, und so das Einpassen eines Pinsels in ein bestehendes
Bild erleichtert werden. <br>

"Erzeugen" generiert den gedrehten Pinsel. Dieser wird bei AutoVerwaltung
(siehe oben) als neuer Pinsel in die Pinsel-Verwaltung aufgenommen. </li>


<li><b>Stauchen... </b><br>

Ver&#228;ndert die Gr&#246;&#223;e eines Pinsels beliebig. Die Zielgr&#246;&#223;e kann im sich
&#246;ffnenden Requester entweder per Zahleneingabe festgelegt werden oder zum
Einpassen direkt im Bild gezeichnet werden (Schalter "Gr&#246;&#223;e zeichnen").
</li>


<li><b>Bend... </b><br>

Verbiegt einen Brush, um ihn z. B. an ein Objekt im Bild anzupassen. Der
Bend-Requester bietet zwei Slider (mit gekoppelter M&#246;glichkeit zur
Zahleneingabe) zur Einstellung an. Der horizontale Slider gibt die Gr&#246;&#223;e
der Auslenkung an, der vertikale die Poisition der maximalen Auslenkung.
<br>

Ein Vorschau-Rechteck zeigt die aktuellen Einstellungen direkt an. Mit
"Erzeugen" wird der gebogene Pinsel berechnet. </li>


<li><b>Slant... </b><br>

Verzieht einen Pinsel horizontal. Die Gr&#246;&#223;e der Verschiebung kann in einem
Requester eingestellt werden </li>


<li><b>Perspektive... </b><br>

kippt einen Pinsel in den Raum. Der Perspektive-Requester hat zwei Slider
zur Einstellung. Der obere Slider gibt die Auslenkung links an, der untere
die Auslenkung rechts. Anhand des VorschauRechtecks l&#228;&#223;t sich die Wirkung
sofort sehen. <br>

Mit dieser Funktion lassen sich Pinsel dreidimensional in den Raum stellen
und als Textur f&#252;r Objekte verwenden. Experimentieren sie mit diesen
Funktionen, Sie werden von den Ergebnissen &#252;berrascht sein. </li></ul>

<hr size=4></td></tr></table></center>
<br>
</body>
</html>
