<html>
<body  background="../images/fondtexte2.jpg" text="black" vlink="black" border="0" >

 <a href="listeoiseaux.html"taget="description">Retour</a><br>
<table>
<tr>

<td>
<br><br>
<b>Le Balbuzard P&ecirc;cheur</b>
<hr>
<i>Ordre des </i>
<pre>
      Nom du m&acirc;le : 
Nom de la femelle : 
 Nom de son petit : 
    Longueur maxi : 1,80 m d'envergure
       poids maxi :
        long&eacute;vit&eacute; : 
              cri : il est pratiquement muet, seuls quelques cris sont entendus
                    lorsqu'un adulte apporte de la nourriture &agrave; ses jeunes.
</pre>
<hr><br>


</td>
</tr>
</table>
<br>
<b>Description :</b><br>
<br>
Le balbuzard p&ecirc;cheur est un nicheur tr&egrave;s rare en France (21 couples ont nich&eacute; en 1998). C'est un rapace de taille moyenne, mais, avec ses 1,80 m d'envergure, nettement plus grand qu'une buse variable et m&ecirc;me qu'un milan royal. Avec son ventre blanc contrastant avec ses ailes plus sombres aux extr&eacute;mit&eacute;s, son collier et son bandeau sombre sur l'oeil, le balbuzard ne peut pas &ecirc;tre confondu avec un autre rapace. Sa silhouette typique avec ses ailes &eacute;troites et fortement arqu&eacute;es &eacute;vite toute confusion avec un circa&egrave;te Jean-le-Blanc ou une buse variable aux parties inf&eacute;rieures particuli&egrave;rement blanches.<br>
<br><br> 

<b>Alimentation :</b><br>
<br>
le balbuzard est un piscivore &agrave; 99,9%. Ce sont essentiellement des poissons de taille moyenne &agrave; assez grande (brochets, br&egrave;mes, petites carpes,...) qui sont pr&eacute;lev&eacute;s.<br>
 <br><br> 

<b>Habitat :</b><br>
<br>
Dans nos pays d'Europe occidentale, le balbuzard p&ecirc;cheur est avant tout un migrateur mais, depuis le milieu des ann&eacute;es 1980, s'ajoutant aux populations corses qui elles sont s&eacute;dentaires, quelques couples nichent d&eacute;sormais dans le Centre de la France.<br>
 <br><br> 

<b>Port&eacute;e :</b><br>
<br>
La ponte de 2 &agrave; 3 oeufs est d&eacute;pos&eacute;e entre la mi-mars et le d&eacute;but mai et leur incubation dure 5 &agrave; 6 semaines. Les jeunes balbuzards s&eacute;journent ensuite 6 &agrave; 7 semaines dans leur nid avant de savoir voler. Il restent quelques semaines dans les alentours avant de partir en migration vers l'Afrique, en ao&ucirc;t-septembre, avec leurs parents, ou en se dispersant simplement &agrave; l'int&eacute;rieur du bassin m&eacute;diterran&eacute;en. Ces deux mois sont &eacute;galement les p&eacute;riodes de passage des oiseaux nordiques qui traversent nos pays en faisant des haltes de quelques jours parfois sur nos plans d'eau et fleuves, laissant quelques retardataires en octobre-novembre. Quelques rares cas d'hivernage ont &eacute;t&eacute; not&eacute;s dans l'extr&ecirc;me sud-ouest de la France.<br>
 <br><br> 

<b>Comportement :</b><br>
<br>
Les oiseaux qui ont pass&eacute; l'hiver en Afrique occidentale au sud du Sahara, arrivent dans nos r&eacute;gions d&egrave;s le mois de mars et le passage de ces individus qui vont nicher dans le nord de l'Europe se prolonge jusqu'&agrave; la fin mai.<bR>
Nos nicheurs retrouvent leur aire assez t&ocirc;t, fin f&eacute;vrier- d&eacute;but mars, pour les oiseaux corses, mi-mars pour les quelques couples continentaux.<br>
<br>
Ce rapace passe une grande partie de son temps &agrave; se reposer (en occupant un arbre mort)... mais le spectacle de sa p&ecirc;che est un moment fort !<br>
<br>
 Apr&egrave;s un long plan&eacute; 20 m&egrave;tres au-dessus de la surface de l'eau destin&eacute; &agrave; rep&eacute;rer sa proie, le Balbuzard se stabilise dans les airs en pratiquant avec aisance le vol sur place ; au moment o&ugrave; le poisson qu'il convoite s'approche suffisamment de la surface, il se laisse tomber, serres en avant, et s'immerge parfois totalement... Apr&egrave;s une seconde ou deux o&ugrave; il reste pantois, les ailes semi-&eacute;cart&eacute;es trempant dans l'eau, il red&eacute;colle laborieusement en fouettant les flots avant de s'&eacute;brouer en plein vol, tout en tenant fermement sa proie.Il se dirige ensuite sans h&eacute;sitation vers son perchoir habituel pour la d&eacute;guster.<br> 
<br><br>  
</body>
</html>