<html>

<body  background="../images/fondtexte2.jpg" text="black" vlink="black" border="0" >
<table>
<tr>
<td valign=top>

<a href="listemammiferes.html"target="description">Retour</a><br> 
<br>
<a href="blaireaujpg.html"><IMG SRC="images/blaireau.jpg" ALT="Le Blaireau" WIDTH="234" HEIGHT="164" border=0</A><br>          


</td>
<td>




<b>Le blaireau</b><br>
<pre>
<hr>

<i>Mammif&egrave;re de l'ordre des carnassiers
 (famille des must&eacute;lid&eacute;s)</i>

   comportement : nocturne
   alimentation : omnivore
        habitat : for&ecirc;t
     habitation : terrier
   reproduction : janvier &agrave; mars
          poids : 12 &agrave; 15 kg (avant l'hiver il peut atteindre 20 &agrave; 22 kg)
       longueur : de 70 cm &agrave; 1 m.
      long&eacute;vit&eacute; : 15 ans
         port&eacute;e : 2 &agrave; 7 petits
<hr>
</pre>
</td>
</tr>
</table>
 



<b>Description :</b><br>
<br>
 Le blaireau n'a pas une vue tr&egrave;s per&ccedil;ante, par contre, il a un tr&egrave;s bon odorat. Ses pattes, courtes et puissantes sont pourvues de grandes griffes (surtout celle de
 devant, avec lesquelles il creuse la terre, et la d&eacute;blaie &agrave; reculons),
&agrave; la base de sa queue courte et touffue, il poss&egrave;de des glandes odorantes qui lui permettent de marquer son territoire, mais c'est aussi un signe de reconnaissance entre membre d'un m&ecirc;me clan. pour s'impr&eacute;gner mutuellement de leur odeur les blaireaux font des s&eacute;ances fesse &agrave; fesse.<br>
<br>
<br><br> 

<b>Alimentation :</b><br>
<br>
Le blaireau, est omnivore, il mange aussi bien des lombrics (jusqu'&agrave; 100 kg par an), des vers blancs, des taupes, petits rongeurs, insectes, champignons, plantes herbac&eacute;es, oeufs d'oiseaux (qui niche &agrave; terre), fruits, graines, nids de gu&ecirc;pes (leur piq&ucirc;re est inoffensive sur son &eacute;pais pelage), des lapereaux (garennes ou li&egrave;vres).<br>
 il adore aussi les &eacute;pis de ma&iuml;s (pas &agrave; maturit&eacute;, encore tendre).<br>

 


<br>
 <br><br> 

<b>Habitat :</b><br>
<br>
 Le terrier des blaireaux se trouve souvent au pied d'une butte, d'une falaise, o&ugrave; d'un talus.<br>
C'est un v&eacute;ritable labyrinthe souterrain parfois sur plusieurs &eacute;tages. Il est compos&eacute; de plusieurs galeries qui peuvent descendre jusqu'&agrave; 3 ou 4 m de profondeur, elles m&egrave;nent &agrave; des "chambres" o&ugrave; m&acirc;les, femelles et jeunes passent la journ&eacute;e tranquillement &agrave; dormir ou &agrave; se reposer.<br>
<br>
Certains terriers sont l'aboutissement du travail de plusieurs g&eacute;n&eacute;rations sur plusieurs si&eacute;cles. Ils peuvent alors avoir de 30 &agrave; 40 entr&eacute;es et leurs surfaces peut atteindre 2000 m2.<br>
<bR>

 En moyenne la taille de son territoire couvre 40 &agrave; 50 hectares.<br>
<br>

 Il n'est pas rare de trouver pr&egrave;s de leur habitation des mares ou des ruisseaux, mais aussi des arbres abattus, source de jeux et r&eacute;serve de nourriture.

 Ils appr&eacute;cient aussi la proximit&eacute; des arbres et buissons &agrave; baies, tels que le sureau dont ils se r&eacute;galent l'&eacute;poque venue (la prolif&eacute;ration de ces arbres doit beaucoup aux animaux, ils en rejettent les graines dans leurs crottes (ce qui n'emp&ecirc;che pas la germination, bien au contraire).


 <br><br> 

<b>Port&eacute;e :</b><br>
<br>
L'&eacute;poque de la reproduction chez les blaireaux se d&eacute;roule en g&eacute;n&eacute;rale du mois de janvier, au mois de mars.<br> 
 L'ovule f&eacute;cond&eacute; reste en attente pendant 10 mois avant de se fixer dans l'ut&eacute;rus.

 La p&eacute;riode de gestation &agrave; proprement parler ne dure que deux mois environ. Les petits na&icirc;tront l'ann&eacute;e suivante en f&eacute;vrier - mars.<bR>
<bR>
 Ce type de reproduction s'appelle l'ovo-implantation diff&eacute;r&eacute;e.<bR>
<br><bR>

 La femelle donne naissance à&agrave; une port&eacute;e de 2 &agrave; 7 petits qui commenceront &agrave; sortir du terrier familial vers l'&acirc;ge d'un mois et demi. Ils seront allait&eacute;s pendant 3 mois.<br>
<br> 

 A l'&acirc;ge de 2 ans ils seront en &acirc;ge de se reproduire.<br>

 
 <br><br> 

<b>Comportement :</b><br>
<br>
Les blaireaux ont des moeurs nocturnes. Ils ne sortent que le soir venu pour aller &agrave; la chasse et faire leurs besoins.<br>
<bR>
 Le blaireau est tr&egrave;s m&eacute;fiant et tr&egrave;s propre, il ne fait jamais ses besoins dans le terrier, mais &agrave; l'ext&eacute;rieur dans des petits trous en forme d'entonnoir creus&eacute;s &agrave; cet effet.<br>
<br>
Son hospitalit&eacute; est connue de toute la for&ecirc;t, et il n'est pas rare de le voir partager son terrier avec un renard, un chat sauvage, un putois.....<br>
<br>
 Il aime la vie de famille et les terriers sont souvent habit&eacute;s par plusieurs groupes familiaux ou clans.<bR>
un clan familial de blaireaux est form&eacute; d'un groupe de 5 &agrave; 12 blaireaux.<br>
<br>
Le blaireau est un grand terrassier, pour creuser les galeries de son terrier il peut remuer jusqu'&agrave; 40 tonnes de terre.<br>
<br>
Une femelle peut s'accoupler avec plusieurs m&acirc;les d'un m&ecirc;me clan !<br>
<br>

 Pendant la p&eacute;riode hivernale le clan, va conna&icirc;tre une p&eacute;riode de repos (pas d'hibernation !) ils r&eacute;duisent tr&egrave;s forts leur activit&eacute; et vivent sur les r&eacute;serves de graisse fabriqu&eacute;e pendant l'automne (durant cette p&eacute;riode un blaireau peut augmenter son poids de 60%).<br>

<br><br>  
</body>

</html>