<html>
<body  background="../images/fondtexte2.jpg" text="black" vlink="black" border="0" >

<a href="listeoiseaux.html"taget="description">Retour</a><br><br>
<br>



<table>
<tr>
<b>Le bouvreuil pivoine</b>
<pre>
<hr>
<i>Ordre des </i>

      Nom du m&acirc;le : 
Nom de la femelle : 
 Nom de son petit : 
    Longueur maxi : 
       poids maxi :
        long&eacute;vit&eacute; : 
              cri : un "diu" fl&ucirc;t&eacute; de faible sonorit&eacute; 
</pre>
<hr><br>

 

</td>
</tr>
</table>
<br>



<b>Description :</b><br>
<bR>
Trois passereaux communs poss&eacute;dant une poitrine rouge posent probl&egrave;mes aux d&eacute;butants. Le rougegorge avec sa gorge rouge orang&eacute;e, le m&acirc;le de pinson des arbres dont la poitrine et le ventre sont rouge vineux et le bouvreuil au torse rouge carmin. Hormis cette subtile mais &eacute;vidente diff&eacute;rence de coloration dans les rouges, le bouvreuil pivoine m&acirc;le se reconna&icirc;t imm&eacute;diatement &agrave; sa calotte noire et &agrave; son croupion blanc bien visible &agrave; l'envol. Ces deux caract&eacute;ristiques se retrouvent &eacute;galement chez la femelle dont la poitrine est dans les tons gris brun ros&eacute;. Le jeune, aux couleurs ternes comme la femelle, ne poss&egrave;de pas de calotte noire. &Agrave; noter que parmi nos passereaux communs, c'est le seul &agrave; exhiber un croupion blanc, avec le pinson du Nord qui en pr&eacute;sente un plus &eacute;troit.<br>

<br><br>



<b>Alimentation :</b><br>
<br>
il a un penchant tr&egrave;s net pour les bourgeons des arbres fruitiers qu'il &eacute;t&ecirc;te au printemps. Pourtant son r&eacute;gime alimentaire est des plus vari&eacute;s, essentiellement granivore mais &eacute;galement frugivore &agrave; l'automne o&ugrave; il se r&eacute;gale des baies (et de leurs p&eacute;pins et noyaux).<br>
 Comme chez tous les fringilles, il est exceptionnellement insectivore au moment du nourrissage des jeunes au nid.<br>
 En toute saison, il est avant tout arboricole, pr&eacute;levant moins fr&eacute;quemment sa nourriture &agrave; terre que directement sur les arbres et les plantes.<br>
<br>
Vous l'attirerez facilement en lui pr&eacute;sentant un m&eacute;lange classique de graines o&ugrave; pr&eacute;dominent comme d'habitude les graines de tournesol.<br>
<br><br>


<b>Habitat :</b><br>
<br>
Le bouvreuil pivoine se pla&icirc;t dans les jardins, les parcs urbains, les ripisylves, les petits bois, les massifs forestiers de plaine et de montagne au sous-bois dense, le bocage et les alignements de haies, les zones humides envahies par les saules.<br>
<bR>
 C'est dans les for&ecirc;ts de conif&egrave;res de montagne (qui forment son habitat originel) qu'on trouve la plus grande  densit&eacute; de bouvreuil pivoine.<br>
<br><br>



<b>Port&eacute;e :</b><br>
<br>
le bouvreuil pivoine d&eacute;bute sa reproduction dans les derniers jours de mars.<br>
 Le nid est le plus souvent construit dans un petit conif&egrave;re, r&eacute;guli&egrave;rement dans des buissons. 4 &agrave; 5 oeufs y sont d&eacute;pos&eacute;s et couv&eacute;s pendant 13 &agrave; 14 jours. Les jeunes s'envolent &agrave; l'&acirc;ge de 16 &agrave; 18 jours. Le p&egrave;re s'en occupe quelques jours encore tandis que la femelle s'affaire d&eacute;j&agrave; &agrave; la seconde ponte.<br>
<br><br>


<b>Comportement :</b><br>
<br>
Passereau s&eacute;dentaire !<br>
<br><br>
</body>
</html>