<html>
<body  background="../images/fondtexte2.jpg" text="black" vlink="black" border="0" >
<a href="listeoiseaux.html"target="description">Retour</a><br>

<table>
<tr>
<td valign=top>
<a href="buse2jpg.html"><IMG SRC="images/buse2.jpg" ALT="La buse variable" WIDTH="250" HEIGHT="187" border=0</A><br>    </td>


<b>La buse variable</b>
 <hr>
<pre> 
     classification : <i>rapaces diurnes
ordre des falconiformes (famille des accipitrid&eacute;s)</i>

             r&eacute;gime : carnivore
           longueur : 51 cm - 56 cm
          envergure : 1,2 - 1,4 m
      poids du m&acirc;le : 600 - 900 gr
poids de la femelle : 800 - 1200 gr 
          long&eacute;vit&eacute; : 25 ans maxi
       reproduction : mars et d&eacute;but mai
            son cri : "hi&eacute;&eacute;"
 <hr>
</td>
</tr>
</table>
 </pre>
 80 &agrave; 90 % des rapaces diurnes de nos campagnes sont des buses (environ 50 000 couples).<br>
 <br>
           


 <br>
<b>Description :</b><br>
<br>
<br><br> 

<b>Alimentation :</b><br>
<br>

 Campagnols et autres petits mammif&egrave;res des champs repr&eacute;sentent l'essentiel de son r&eacute;gime. Mais parfois, elle peut ajouter &agrave; son menu, des lapereaux, des jeunes oiseaux, des batraciens et m&ecirc;me des reptiles (surtout en p&eacute;riode chaude, pour nourrir ses jeunes). En hiver lorsque la nourriture est plus rare, elle ne d&eacute;daigne pas les charognes
 
 <br><br> 

<b>Habitat :</b><br>
<br>
Souvent visible au dessus des champs et des prairies, elle niche le plus souvent en for&ecirc;t.<br>
Son territoire s'&eacute;tend sur 4 &agrave; 6 km2.
Si l'endroit est suffisamment riche en nourriture, 5 &agrave; 7 couples peuvent vivre sur une &eacute;tendue de 10 km2.<br>
 <br><br> 

<b>Port&eacute;e :</b><br>
<br>

  <br>
 Apr&egrave;s avoir choisi un arbre &eacute;lev&eacute;, la construction du nid commence, le couple am&eacute;nage le "plancher" &agrave; l'aide de branches et de brindilles qu'ils tapissent d'herbes s&egrave;ches, d'&eacute;corces et de mousses. Au final, le nid (l'aire) fera environ 60 cm de diam&egrave;tre. Toutefois, si notre couple est un peu fain&eacute;ant, il lui arrive d'am&eacute;nager un ancien nid de corbeaux.<br>
D&eacute;but avril, la femelle pondra 2 &agrave; 3 oeufs blancs tachet&eacute;s.<br>
 La seule activit&eacute; de la femelle sera dor&eacute;navant de couver, et celle du m&acirc;le d'apporter de la nourriture.<br>
 Lorsque le m&acirc;le arrive avec une proie il s'annonce en poussant de petits cris, la femelle laisse alors son nid le temps de se rassasier (le m&acirc;le l&agrave; remplace sur le nid seulement &agrave; cette p&eacute;riode).<br>
 33 &agrave; 35 jours apr&egrave;s, c'est l'&eacute;closion, la femelle reste pr&egrave;s de ses petits pour leur tenir chaud et les prot&eacute;ger. Une semaine apr&egrave;s l'&eacute;closion, elle repart de nouveau &agrave; la chasse, c'est &eacute;galement la p&eacute;riode o&ugrave; les plumes des petits commencent &agrave; appara&icirc;tre et &agrave; les prot&eacute;ger du froid.
A l'&acirc;ge de 21 jours, ils tiennent d&eacute;j&agrave; sur leurs pattes et se manifestent par de petits cris lorsque les parents passent pr&egrave;s du nid.
A l'&acirc;ge de 1 mois, les jeunes commencent &agrave; battre des ailes, cette gymnastique pr&eacute;pare le futur envol qui ne se produira que vers la mi-juin, puis ils resteront encore d&eacute;pendants de leurs parents pendant deux mois.
Enfin, devenus grands et autonomes, ils se s&eacute;parent de leurs parents et m&egrave;nent une vie errante jusqu'&agrave; ce qu'ils rencontrent l'&acirc;me soeur.<br>
 <br><br> 

<b>Comportement :</b><br>
<br>
La buse est un migrateur partiel, c'est &agrave; dire que seuls les oiseaux qui vivent le plus au nord de l'Europe migrent vers l'Europe du sud ou de l'ouest.<br>
<br>
Elle se nourrit des proies qu'elle guette du haut de son aff&ucirc;t. Elle se poste sur un poteau (facilement rep&eacute;rables gr&acirc;ces aux fientes blanch&acirc;tres qui les recouvrent et aux pelotes de r&eacute;jections qui jonchent le sol), une haie ou un arbre (pas tr&egrave;s haut) et scrute le sol, attentive au moindre d&eacute;placement.
 
 Une fois la proie rep&eacute;r&eacute;e, elle la capture et la tue avec ses serres puis la d&eacute;chiquette avec son bec, sur place ou dans son aire.<br>
<bR>
C'est au mois de f&eacute;vrier, apr&egrave;s les rigueurs de l'hiver, que les buses manifestent l'envie de se reproduire.<br>
 Les parades nuptiales sont tr&egrave;s faciles &agrave; observer. Solitaires ou en groupe de quelques individus, elles planent et effectuent des acrobaties a&eacute;riennes pour ce faire remarquer d'un partenaire. Une fois les couples form&eacute;s, suivent de longs vols plan&eacute;s circulaires suivants les courants ascendants en poussant des petits cris aigus pour d&eacute;limiter leur territoire nuptial.<br>
 <br><br> 
<br><br>  
</body>
</html>
