<html>
<body  background="../images/fondtexte2.jpg" text="black" vlink="black" border="0" >
<table>
<tr>
<td valign=top>

<a href="listeoiseaux.html"taget="description">Retour</a><br><br>
<br>
<table>
<tr>
<td>

<b>Le butor &eacute;toil&eacute;</b>
<hr>
<pre>
<i>Ordre des </i>

      Nom du m&acirc;le : 
Nom de la femelle : 
 Nom de son petit : 
    Longueur maxi : 
       poids maxi :
        long&eacute;vit&eacute; : 
            Chant : &agrave; la tonalit&eacute; proche de celle d'une corne de brume, ressemblant
                    &agrave; un mugissement (ce qui lui a valu le surnom de buf des marais). 
                   
</pre>
<hr><br>



<br><br>

</td>
</tr>
</table>
<br>
<b>Description :</b><br>
<br>
 Le plumage brun stri&eacute; de beige de ce h&eacute;ron de taille l&eacute;g&egrave;rement inf&eacute;rieure au h&eacute;ron cendr&eacute; est facilement reconnaissable. <br>
<br><br>
<b>Alimentation :</b><br>
<br>
 <br><br> 

<b>Habitat :</b><br>
<br>
Oiseau g&eacute;n&eacute;ralement s&eacute;dentaire pr&eacute;sent toute l'ann&eacute;e en France, le butor &eacute;toil&eacute; reste assez commun dans les grandes roseli&egrave;res des &eacute;tangs littoraux de Languedoc-Roussillon et de Camargue alors que seuls de petits noyaux de population se maintiennent dans les grandes zones humides de France (Bri&egrave;re, Brenne, Sologne, Picardie, Champagne-Ardenne et Lorraine). Son biotope est repr&eacute;sent&eacute; par les grandes roseli&egrave;res bordant les plans d'eau. En hiver, on peut n&eacute;anmoins le rencontrer en train de p&ecirc;cher au bord d'un cours d'eau ou chasser dans un petit marais o&ugrave; le couvert v&eacute;g&eacute;tal est moindre. C'est d'ailleurs &agrave; cette &eacute;poque de l'ann&eacute;e que les chances de l'apercevoir sont les plus grandes.<br>
Avec 300-350 couples en France, le butor &eacute;toil&eacute; est une de nos esp&egrave;ces les plus menac&eacute;es de disparition.<br>
 <br><br> 

<b>Port&eacute;e :</b><br>
<br>
Le nid, simple cuvette compos&eacute;e de tiges de phragmites, est install&eacute; au coeur de la roseli&egrave;re 10 cm au-dessus du niveau de l'eau. Les 3 ou 4 oeufs (maximum 7) sont pondus d'avril &agrave; juin selon la lattitude et sont couv&eacute;s pendant 24 jours.<br>
 <br><br> 

<b>Comportement :</b><br>
<br>
 Si vous veniez &agrave; le d&eacute;ranger, plut&ocirc;t que de s'enfuir en s'envolant, il pr&eacute;f&eacute;rera courir se r&eacute;fugier dans la phragmitaie ou, si la fuite est impossible, opter pour une position immobile &eacute;tonnament mim&eacute;tique, le cou relev&eacute;, esp&eacute;rant que vous ne l'apercevrez pas. Mais la plupart du temps, il vous faudra vous r&eacute;signer &agrave; n'entendre que son chant si &eacute;trange (&eacute;mis entre mars et juin) que l'oiseau &eacute;mettra &agrave; quelques m&egrave;tres de vous sans que vous ne puissiez l'apercevoir au milieu de la phragmitaie.<br>
<br>
Le m&acirc;le est polygame et peut donc f&eacute;conder plusieurs femelles qui se chargeront seules de l'&eacute;levage des jeunes.<br>
Pour cela, elles doivent s'absenter r&eacute;guli&egrave;rement pour se nourrir ou pour apporter des proies &agrave; leurs jeunes affam&eacute;s. Tout d&eacute;rangement r&eacute;p&eacute;t&eacute; &agrave; cette p&eacute;riode cruciale entra&icirc;ne la mort des jeunes par sous-alimentation, la femelle n'osant plus s'approcher de son nid.<br>
<br>
Les butors &eacute;toil&eacute;s de la moiti&eacute; nord de la France peuvent migrer plus au sud lors d'hivers rigoureux.<br>
<br><br>  
<br>
</body>
</html>