<html>
<body  background="../images/fondtexte2.jpg" text="black" vlink="black" border="0" >
<table>
<tr>
<td valign=top>

<a href="listeoiseaux.html"target="description">Retour</a><br> 
<br>
<a href="canardjpg.html"><img src="images/canard.jpg" alt="photo de canard fourni par Patrick Verdier" width="280" height="174" border=0</a><br>          


</td>
<td>
<b>Le canard</b><br>
<hr>
<i>Ordre des ans&eacute;riformes (famille des anatid&eacute;s)</i><br>

<pre>
      Nom du m&acirc;le : le canard
Nom de la femelle : la cane
 Nom de son petit : le caneton ou le canardeau
    Longueur maxi : 
       poids maxi :
        long&eacute;vit&eacute; :
              Cri : Il cancanne.
</pre>
<hr><br>

</td>
</tr>
</table>
<b>Description :</b><br>
<br>

<i>Les canards français</i> <br> 
<br>

- Le Blanc de l'Allier. <br> 
<br>

Un canard de belle taille (4 kg pour le canard et 3,5 kg pour la cane), tr&egrave;s rustique, massif, trapu mais d'allure vive et d&eacute;gag&eacute;e, au plumage blanc sans taches ni reflets.<br>
Sa croissance est rapide et les canes ont une ponte pr&eacute;coce d'oeufs de 80 g &agrave; coquille blanche.
<br><br>




- Le canard de Bourbourg<br>
<br>

Un corps massif, large, presque horizontal et bien en chair bec blanc ros&eacute;, tarses jaune orang&eacute;, yeux fonc&eacute; et plumage blanc.<br>
<br><br>





- Le canard de Challans<br>  

<br><br>



- Le canard Cou-nu <br> 
<br>

Cette race poss&egrave;de plusieurs caract&eacute;ristiques uniques chez les canards. Cou, t&ecirc;te et abdomen partiellement d&eacute;nud&eacute;s, tarses et doigts d&eacute;pourvus d'&eacute;cailles, r&eacute;miges et croupion atrophi&eacute;s.<br>
<br>
Le canard p&egrave;se 1,2 kg environ et la cane 1,1 kg,, les oeufs, de 50 &agrave; 60 g, poss&egrave;dent une coquille de couleur verd&acirc;tre (rarement blanch&acirc;tre).<br>
ils ne paraissent pas souffrir du froid !<br>
<br>




- Le canard Duclair<br>  
<br>


<br><br>

- Le canard d'Estaires<br>  
<br>

Tr&egrave;s rare de nos jours, il a la m&ecirc;me forme que le canard de Bourbourg mais est moins gros (2 &agrave; 2,5 kg).<br>
C'est un canard rustique, pr&eacute;coce ayant une bonne ponte et une chair un peu moins fine que celle du Bourbourg.<br>

<br><br>

- Le canard de Rouen clair<br>
<br>
Ce canard est élevé depuis des temps immémoriaux dans la région de Rouen : c'est le canard Colvert amélioré par sélection dans le but de lui faire prendre du volume.<br> 
Le Rouen clair, dont la chair est particulièrement savoureuse, est un de nos meilleurs canards de rapport (4,5 kg).<br>
La cane pond des oeufs de 80 g minimum, &agrave; coquille verd&acirc;tre tr&egrave;s clair.<bR>
<br>
- Le canard de Rouen fonc&eacute; :<br>
<br>
Moins &eacute;l&eacute;gant et de couleurs plus sombre que le  Rouen clair. Il se d&eacute;place &eacute;galement plus difficilement et plus lentement.<br>
La f&eacute;condation est assez laborieuse. La cane pond (tr&egrave;s peu) des oeufs de 80 g minimum &agrave; coquille verd&acirc;tre avec des nuances plus claires (blanch&acirc;tres) ou plus fonc&eacute;es (bleu&acirc;tres).<br>
 Le canard p&egrave,se 3,5 kg et la cane 3 kg.<br>

<br><br> 

<b>Alimentation :</b><br>
<br>
Il se nourrit de particules v&eacute;g&eacute;tales ou de petites proies trouv&eacute;es dans l'eau et retenues par les lamelles du bec.
 <br><br> 

<b>Habitat :</b><br>
<br>
 <br><br> 

<b>Port&eacute;e :</b><br>
<br>
 <br><br> 

<b>Comportement :</b><br>
<br>

<br><br>  
<br>
</body>
</html>