<html>
<body  background="../images/fondtexte2.jpg" text="black" vlink="black" border="0" >

<a href="listepoissons.html"taget="description">Retour</a><br><br>
<br>
<table>
<tr>
<td>
<b>La Carpe</b><br>
<hr>
<i>Famille: cyprinidae (ordre des cypriniformes)</i><br>
<pre>
  Longueur : de 50 &agrave; 80 cm
poids maxi : 1 &agrave; 2.5 kg (carpes d'&eacute;levages) 
             et jusqu'&agrave; 37 Kg (carpes sauvages )
                    
 long&eacute;vit&eacute; : de 10 et 30 ans.  
</pre>
<hr><br>


 Sa rusticit&eacute; et sa vitesse de croissance en font le poisson id&eacute;al pour la pisciculture d'&eacute;tang.&nbsp;<br> 
<br>
 
</td>
</tr>
</table>



 
<b>Description :</b><br>
<br>
Poisson typique des eaux calmes (se pla&icirc;t dans des eaux entre 15 et 25 &deg;).<br> 
<br>
Dans sa forme sauvage, la carpe poss&egrave;de un corps de forme allong&eacute;e enti&egrave;rement recouvert de grosse &eacute;cailles. Le dos est g&eacute;n&eacute;ralement brun fonc&eacute;, tandis que les flancs sont dans les tons bronz&eacute;s et cuivr&eacute;s. Quatre barbillons et des l&egrave;vres &eacute;paisses lui permettent de fouiller le fond pour se nourrir. Encore appel&eacute;e carpe franche royale, la carpe commune peut d&eacute;passer les 30 kg dans les grands fleuves ou plans d'eau.<br>
<br>
- La carpe cuir a la peau lisse (vari&eacute;t&eacute; d'&eacute;levage)<br>
- La carpe miroir ne poss&egrave;dent que quelques rang&eacute;es de grosses &eacute;cailles (vari&eacute;t&eacute; d'&eacute;levage).<br>
<br>
 Leur corps est &agrave; la fois plus haut et plus trapu, au point que certaines craquent au bout de la ligne. Le record actuel est toujours d&eacute;tenu par un poisson de 37 kg captur&eacute; dans L'Yvonne, dans la r&eacute;gion de Montereau.<br>
<br><br> 

<b>Alimentation :</b><br>
<br>
Son r&eacute;gime alimentaire tr&egrave;s vari&eacute; peut &ecirc;tre qualifi&eacute; d'omnivore (plancton, larves, petits poissons , v&eacute;g&eacute;taux, vers de vase, &eacute;crevisses ...).<br>
<br>
<i>- app&acirc;t</i> : Tout ce qui se mange fait le bonheur de la carpe, pomme de terre, ma&iuml;s, petits pois, arachides, noisettes tigr&eacute;es, bl&eacute; etc...<br>
 En d&eacute;but de saison, on utilise &eacute;galement des vers de terreau, du pain ou des asticots.<br>
<br>
 <br><br> 

<b>Habitat :</b><br>
<br>
La carpe poss&egrave;de une grande facult&eacute; d'adaptation, mais elle pr&eacute;f&egrave;re les eaux chaudes, calme et profondes. On la rencontre dans les fleuves et les rivi&egrave;res, dans les &eacute;tangs, les sabli&egrave;res et les lac, ainsi que dans les canaux.<br>
 <br><br> 

<b>Port&eacute;e :</b><br>
<br>
 <br><br> 

<b>Comportement :</b><br>
<br>
Gr&eacute;gaire d&egrave;s son plus jeune &acirc;ge , elle est surtout active la nuit.

<br><br>  
<br>
</body>
</html>
