<html>
<body  background="../images/fondtexte2.jpg" text="black" vlink="black" border="0" >
<table>
<tr>
<td valign=top>

<a href="listemammiferes.html"target="description">Retour</a><br> 
<br>
<a href="parcdesecrins5jpg.html"><IMG SRC="../provencealpescotedazur/hautesalpes/images/parcdesecrins5.jpg" ALT="Le cheval" WIDTH="250" HEIGHT="178" border=0</A><br>          


</td>
<td>
<b>Le cheval</b><br>
<hr>
<i>mammif&egrave;res domestiques de l'ordre des ongul&eacute;s,<br>
famille des &eacute;quid&eacute;s</i>
<br>
<pre>
Nom de la femelle : la jument
      Nom du m&acirc;le : un &eacute;talon
 Nom de son petit : le poulain
    Longueur maxi :  
       poids maxi : 
        long&eacute;vit&eacute; : de 25 &agrave; 30 ans
        Gestation : 11 mois
</pre>
<hr>
</td>
</tr>
</table>
<br>


 
<b>Description :</b><br>
<br>
Les chevaux sont remarquablement adapt&eacute;s &agrave; la course, caract&eacute;ris&eacute;s par l'allongement des membres et la possession d'un seul doigt &agrave; chaque patte (doigt m&eacute;dian), le deuxi&egrave;me et le quatri&egrave;me doigt &eacute;tant r&eacute;duits &agrave; de courts stylets osseux. Les &eacute;quid&eacute;s, herbivores stricts, dont seuls les m&acirc;les poss&egrave;dent des canines, coupent l'herbe avec leurs incisives.<br>
Ils ont une ou&iuml;e tr&egrave;s fine et voient tr&egrave;s bien la nuit.<br>
<br>
 Il ne subsiste qu'une seule esp&egrave;ce sauvage : le cheval de Prjevalski.<br>
 C'est le cheval actuel (seulement pr&eacute;sent dans les zoos) qui ressemble le plus &agrave; ceux repr&eacute;sent&eacute;s sur les fresques rupestres du pal&eacute;olithique.<br>
<br>
Le cheval est un herbivore au syst&egrave;me digestif bien particulier. C'est un animal monogastrique. Son tube digestif d'une longueur totale de 30 m&egrave;tres environ et contient de 230 litres est caract&eacute;ris&eacute; par le faible volume de l'estomac (10 a 15 litres) et par le volume au contraire important du gros intestin..<br>
<br><br>
 


<b>Alimentation :</b><br>
<br>
le cheval dig&egrave;re relativement mal la cellulose mais tr&egrave;s bien les mati&egrave;re prot&eacute;&iuml;que.<br>
<br>
 Les sucres sont les &eacute;l&eacute;ments id&eacute;aux de l'&eacute;nergie musculaire, le sel favorise la digestibilit&eacute;, les fourrages ou la paille, bien que cellulosique, sont n&eacute;cessaire pour assurer le lest indispensable au bon travail intestinal.<br>
<br>
 Certains &eacute;l&eacute;ments sont indispensables : le calcium, le phosphore, et les vitamines.<br>
 <br>
L'eau doit &ecirc;tre &agrave; libre disposition (le cheval r&eacute;gulant lui m&ecirc;me sa consommation). Le cheval boit 25 &agrave; 30 litres d'eau par jour.<br>
<br><br>
<b>Habitat :</b><br>
<br>
Le logement d'un cheval quel qu'il soit doit &ecirc;tre correctement entretenu. Cet entretien comprend :<br>

<br>
- un entretien journalier qui consiste &agrave; renouveler la liti&egrave;re<br>
- un entretien hebdomadaire qui consiste &agrave; vider enti&egrave;rement le logement et laver le sol et les murs.<br>
- un entretien annuel qui consiste en un grand nettoyage compl&eacute;t&eacute; d'une d&eacute;sinfection soigneuse.<br>
<br><br>
 <br><br> 

<b>Port&eacute;e :</b><br>
<br>
La jument ne donne naissance qu'&agrave; un seul petit qui na&icirc;t couvert de poils et les yeux ouverts.<br>

 <br><br> 

<b>Comportement :</b><br>
<br>

<br><br>  
<b>Les allures :</b><br>
<br>
- Le pas : est une allure &agrave; quatre temps où 3 membres sont &agrave; l'appui tandis que la 4eme est en l'air. <br>
<br>
- Le trot : est une allure &agrave; 2 temps qui proc&egrave;de par bip&egrave;de diagonaux.<br>
Ant&eacute;rieur droit + post&eacute;rieur gauche = diagonal droit<br>
Ant&eacute;rieur gauche + post&eacute;rieur droit = diagonal gauche<br>
De plus lorsque le cheval lance le 2&egrave;me bip&egrave;de, le premier n'est pas encore en contact avec le sol : c'est la p&eacute;riode de suspension.<br>
<br>
- L'amble : est une allure &agrave; 2 temps dans laquelle les membres sont associes par bip&egrave;de lat&eacute;raux. Cette allure est plus rapide et plus confortable mais elle et interdite dans les &eacute;preuves fran&ccedil;aises.<br>
<br>
- Le traquenard : est un trot alt&eacute;r&eacute; dans lequel il y a des dissociation au bip&egrave;de diagonal.<br>
<br>
- L'aubin : tient &agrave; la fois du trot et du galop. Le cheval trotte des ant&eacute;rieurs (membres de devant) est galope des post&eacute;rieur(membres de derri&egrave;re) ou inversement.<br>
<br>
- Le galop : allure disym&eacute;trique &agrave; 3 temps sauter.<br>
  <br><br>
<b>La toilette :</b><br>
<br>

 Le pansage &agrave; pour premier but de nettoyer la peau, c'est &agrave; dire de d&eacute;coller,d'enlever la poussi&egrave;re, et de lustrer le poil. Mais il a &eacute;galement un r&ocirc;le hygi&eacute;nique essentiel. En effet, le pansage est l'occasion d'enlever la peau et les poils superflus tout en constituant un v&eacute;ritable massage favorisant le bon fonctionnement de l'appareil circulatoire participant &agrave; l'entretien du syst&egrave;me musculaire.<br>
<br><br>
<b>Les robes:</b><br>
<br>
 La robe est l'ensemble des poils et des crins qui recouvrent presque toute la peau du cheval. Il existe des robes simples (poils et crins d'une seul couleur) et les robes compos&eacute;es(poils et crins de couleur diff&eacute;rentes).Les 12 robes de base composent un sigle mn&eacute;motechnique qui est :BLANC-BIS-GAL-R-P<br>

<br>


ROBES SIMPLES<br>
B BLANC<br>
A ALEZAN : poils et crins jaune plus ou moins fonces<br>
N NOIR<br>
C CAFE AU LAIT poils et crins jaune clair a gris&acirc;tre<br>
<br>
ROBES COMPOSEES :<br>
2 COULEURS DONT UNE POUR LES CRINS<br>
B BAI POILS ROUGE, MARRON, CRINS NOIR<br>
I ISABELLE POILS JAUNE, GRISATRE, CRINS NOIR<br>
S SOURIS<br>
2 COULEURS MELANGES<br>
G GRIS<br>
A AUBERE POILS ET CRINS BLANC ET ROUGE MELANGES<br>
L LOUVET POILS ET CRINS BLANC ET JAUNE MELANGES<br>
3 COULEURS<br>
R ROUAN POILS NOIR, BLANC ET ROUGE<br>
<br><br>


2 COULEURS DONT L'UNE ET BLANCHE, EN PLAQUE<br>
P PIE<br>

<br><br>
<b>L'anc&ecirc;tre du cheval :</b><br>
<br>
 Son &eacute;volution repr&eacute;sente une v&eacute;ritable adaptation, ob&eacute;issant &agrave; des changements de milieu et r&eacute;sultant de mutations et d'une s&eacute;lection naturelle importante.<br>
<br>
 Il y a 70 millions d'ann&eacute;es : EOHIPPUS mesurait 30 cm et poss&eacute;dait 4 doigts.<br>
   Vers 36 millions d'ann&eacute;es : MESOHIPPUS mesurait 50 &agrave; 60 cm et ne poss&eacute;dait plus que 3 doigts.<br>
   Vers 30 millions d'ann&eacute;es : MERYCHIPPUS mesurait 90 cm : ses membres se sont allong&eacute;s. <br>
   Vers 13 millions d'ann&eacute;es : PLIOIPPUS mesurait 1 m&egrave;tre 20 : il ne poss&eacute;dait plus qu'un doigt tr&egrave;s d&eacute;velopp&eacute; accompagn&eacute; de 2 doigts atrophi&eacute;s.<br>
  Vers 2.5 millions d'ann&eacute;es : le genre EQUUS comprend le z&egrave;bre, l'&acirc;ne, l'h&eacute;mione qui se sont s&eacute;par&eacute;s de L'EQUUS CABALLUS cheval d'aujourd'hui.<br>
<br><br>

<b>Le saviez-vous ?</b><br>
<br>
 Dans le Sud-Est de la Russie, l'utilit&eacute; du cheval ne se borne pas &agrave; son r&ocirc;le de cheval de selle ou de trait... on fait fermenter son lait qui donnera le koumys.<br>
<br><br>
</body>
</html>