<html>
<body  background="../images/fondtexte2.jpg" text="black" vlink="black" border="0" >
<table>
<tr>
<td valign=top>

<a href="listemammiferes.html#d"target="description">Retour</a><br> 
<br>

<a href="ecureuil1jpg.html"><IMG SRC="images/ecureuil1.jpg" ALT="L'&eacute;cureuil, par Gilles Mathevet" WIDTH="320" HEIGHT="251" border=0</A><br>   
</td>
<td>
<b>L' Ecureuil</b><br>
<pre>
<hr>
<i>Ordre des Rongeurs (famille des Sciurid&eacute;s)</i>

    Longueur : 20 &agrave; 28 cm + 14 &agrave; 24 cm de queue.
       poids : 200 &agrave; 450 grammes.
   long&eacute;vit&eacute; : de 4 &agrave; 5 ans
   Gestation : 38 jours 
<hr>
</pre>


<a href="ecureuil2jpg.html"><IMG SRC="images/ecureuil2.jpg" ALT="L'&eacute;cureuil" WIDTH="109" HEIGHT="110" border=0</A><br> 

</tr>
</table>
</pre>



 
 Reproduction<br>
<br>
Accouplement : janvier &agrave; ao&ucirc;t.<br>
Nombre de jeunes : 2 &agrave; 7, g&eacute;n&eacute;ralement 3 ou 4, ind&eacute;pendants &agrave; 7 ou 8 semaines; 2 port&eacute;es par an, parfois 3.<br>
Allaitement : jusqu'&agrave; 6 semaines environ.<br>
Maturit&eacute; sexuelle : 8-10 mois.<br>

 


Organisation sociale<br>
<br>
 Les &eacute;cureuils poss&egrave;dent des domaines vitaux qui se recoupent. Leur surface peut varier en fonction de la p&eacute;riode du cycle de reproduction et des ressources alimentaires disponibles, mais en moyenne ceux des m&acirc;les sont plus &eacute;tendus (4 ha en for&ecirc;ts de conif&egrave;res; 9 ha en feuillus) que ceux de femelles (3,4 ha en for&ecirc;t r&eacute;sineuse, 8 ha en for&ecirc;t feuillue). En outre, ils se recouvrent davantage. Bien que l'&eacute;cureuil soit un animal solitaire, chaque individus peut communiquer avec ses cong&eacute;n&egrave;res &agrave; l'aide d'une multitude de signaux: visuels (mouvements de la queue, posture), olfactifs (d&eacute;p&ocirc;ts d'urine, s&eacute;cr&eacute;tions), tactiles et vocaux (cris, grognements, ...). Il existe une hi&eacute;rarchie au sein des populations, les adultes dominant les juv&eacute;niles et les subadultes; les m&acirc;les dominant les femelles.<br>
<br><br>


<br><br>


<br><br>
<b>Description :</b><br>
<br>
longue queue en panache. En hiver, les oreilles sont termin&eacute;es par des "pinceaux" form&eacute;s de longs poils. La couleur du pelage est variable selon la couleur du milieu ambiant et les conditions climatiques. Des jeunes roux et noirs peuvent se rencontrer dans la m&ecirc;me nich&eacute;e.<br>
<br><br> 

<b>Alimentation :</b><br>
<br>
Au printemps, l'écureil consomme surtout des pousses et des bourgeons mais aussi des fleurs, des insectes, des limaces, des oeufs, des oisillons. Les baies et les fruits deviennent ses mets de prédilections en été. A l'automne, ses menus se composent essentiellement de graines de conifères (pins ou épicéas), de noix, de noisettes, de faînes, de glands, de champignons.
 <br><br> 

<b>Habitat :</b><br>
<br>
L'&eacute;cureuil roux est l'h&ocirc;te de nos bois et de nos for&ecirc;ts. Il manifeste une pr&eacute;f&eacute;rence pour les for&ecirc;ts de conif&egrave;res mais se rencontre aussi dans les for&ecirc;ts mixtes ou feuillues ainsi que dans les grosses haies, les parcs et les vergers. Il m&egrave;ne une vie essentiellement arboricole mais est &eacute;galement tr&egrave;s &agrave; l'aise au sol. Toutefois, il ne s'aventure que pour y rechercher sa nourriture. En maints endroits, il a appris &agrave; faire confiance &agrave; l'homme. C'est ainsi qu'il est parfois devenu tr&egrave;s familier dans les parcs et les grands jardins, jusqu'au coeur m&ecirc;me des villes.<br>
 <br><br> 

<b>Port&eacute;e :</b><br>
<br>
Nids sph&eacute;riques (de 20 &agrave; 50 cm de diam&egrave;tre) construits &agrave; la cime des arbres, pr&egrave;s du tronc ou dans une enfourchure de branches. Faits de branchettes, d'herbes, de mousses, recouverts de feuilles. Peuvent parfois se confondre avec un nid d'oiseau. S'en distingue par leur ouverture en bas ou sur le c&ocirc;t&eacute; (peu visible). L'&eacute;cureuil construit g&eacute;n&eacute;ralement plusieurs nids: un nid principal o&ugrave; naissent les jeunes et plusieurs nids secondaires. Parfois, il se contente d'am&eacute;nager un ancien nid de corvid&eacute;s (pie ou corneille) ou un creux d'arbre. Plus rarement, il colonise des terriers de lapin ou s'installe dans les greniers. Le nid offre un excellent isolement thermique &agrave; l'animal, m&ecirc;me en plein hiver.<br>
<br><br>
 <br><br> 

<b>Comportement :</b><br>
<br>
A l'automne, il se constitue des r&eacute;serves de nourriture en pr&eacute;vision de l'hiver. Noisettes et autres graines sont enfouies dans le sol, dans les trous d'arbre, parfois dans des nids d'oiseaux abandonn&eacute;s. Quand la nourriture se fait rare ou tout simplement par go&ucirc;t pour la s&egrave;ve, l'&eacute;cureuil s'attaque &agrave; l'&eacute;corce des arbres.
<br><br>  
L'&eacute;cureuil constitue un cas exceptionnel parmi les mammif&egrave;res de nos r&eacute;gions en ce sens qu'il est totalement diurnes. Le jour, il passe la plupart du temps &agrave; se nourrir, &agrave; se toiletter, &agrave; faire des r&eacute;serves, &agrave; prendre des bains de soleil, &agrave; construire des nids ou simplement &agrave; se d&eacute;placer de cime en cime. Il est perp&eacute;tuellement sur le qui-vive.<br>
<br>
- En &eacute;t&eacute;, il est surtout actif le matin et en fin de journ&eacute;e.<br>
- En hiver, contrairement &agrave; la croyance populaire, l'&eacute;cureuil n'hiberne pas mais diminue son activit&eacute; (env. 4 &agrave; 5 heures, le matin) et peut rester inactif plusieurs jours dans son nid si le temps est trop mauvais.<br>
<br>
 L'&eacute;cureuil vit seul sauf pendant la p&eacute;riode de reproduction. Celle-ci d&eacute;bute vers la mi-janvier. Elle peut &ecirc;tre retard&eacute;e jusqu'en f&eacute;vrier ou mars si la nourriture est insuffisante ou si les conditions m&eacute;t&eacute;orologiques sont trop mauvaises. Les m&acirc;les peuvent alors parcourir 
des distances consid&eacute;rables pour s'accoupler. Une seconde saison d'accouplement prend place en mai.
<br>
 
<br><br>
</body>
</html>
