<html>
<body  background="../images/fondtexte2.jpg" text="black" vlink="black" border="0" >

 <a href="listeoiseaux.html"target="description">Retour</a><br>

<br>
<table>
<tr>
<td>
<pre>
<b>Le Faucon Cr&eacute;cerelle</b><br>
<hr>
      Nom du m&acirc;le : 
Nom de la femelle : 
 Nom de son petit : 
    Longueur maxi : 
       poids maxi :
        long&eacute;vit&eacute; : 
</pre>
<hr><br>
Le faucon cr&eacute;cerelle est pr&eacute;sent durant toute l'ann&eacute;e dans la majeure partie de nos r&eacute;gions d'Europe de l'Ouest. Seul un fort enneigement le contraint &agrave; quitter momentan&eacute;ment certaines zones de montagnes ou du Nord-Est de la France lors d'hiver rigoureux. 
Notre population de faucons cr&eacute;cerelles est consid&eacute;r&eacute;e comme migratrice partielle, les oiseaux du Sud-Ouest &eacute;tant les plus s&eacute;dentaires et ceux du Nord-Est les plus migrateurs. Cette migration peut les mener assez loin, jusqu'en Afrique du Nord et de l'Ouest pour des oiseaux n&eacute;s en France. Nos pays accueillent en hiver des oiseaux originaires du Nord et de l'Est d'Europe mais la plupart d'entre eux ne font que traverser nos r&eacute;gions lors des deux migrations.<br>
<br><br>
</td>
</tr>
</table>

<br><br>

 Observer le faucon cr&eacute;cerelle<br>
<br>

 Pour observer le faucon cr&eacute;cerelle, &agrave; moins qu'un couple se reproduise sur l'&eacute;glise de votre commune ou que vous habitiez aux abords de Notre-Dame de Paris, il faut vous rendre en pleine campagne pour le d&eacute;couvrir. Au premier oiseau de petite taille effectuant un vol sur place au-dessus d'un pr&eacute; ou d'un labour, arr&ecirc;tez-vous car il y a de tr&egrave;s grandes chances qu'il s'agisse alors d'un faucon cr&eacute;cerelle. Vous pourrez alors l'observer &agrave; votre guise, car, apr&egrave;s avoir attrap&eacute; sa proie au sol, il viendra probablement la d&eacute;pecer bien en vue sur le poteau de parc le plus proche.<br>
<br><br>

 De quoi se nourrit le faucon cr&eacute;cerelle<br>
<br>

 S'il rep&egrave;re parfois ses proies &agrave; l'aff&ucirc;t depuis le sommet d'un poteau t&eacute;l&eacute;phonique ou sur les fils &eacute;lectriques, le faucon cr&eacute;cerelle excelle dans l'art du vol sur place. S'&eacute;levant &agrave; une hauteur de 10 &agrave; 30 m&egrave;tres du sol, il se maintient en l'air par des battements d'ailes rapides, la t&ecirc;te dirig&eacute;e vers le sol, scrutant le moindre d&eacute;placement de campagnol. 
 

 Entendre le faucon cr&eacute;cerelle<br>


 Le faucon cr&eacute;cerelle est assez loquace aux abords du nid et son cri ressemble &agrave; celui de la plupart des falconid&eacute;s. Il l'&eacute;met surtout lorsqu'un pr&eacute;dateur, animal ou humain, s'approche trop pr&ecirc;t de sa nich&eacute;e.<br>

<br><br>
 Le faucon cr&eacute;cerelle et l'homme<br>
<br>

 Apr&egrave;s avoir souffert comme tous les rapaces des pers&eacute;cutions de la part de l'homme, et malgr&eacute; son statut d'esp&egrave;ce totalement prot&eacute;g&eacute;e, le faucon cr&eacute;cerelle est en r&eacute;gression dans bien des r&eacute;gions d'Europe occidentale. L&agrave; encore, c'est la faute &agrave; l'agriculture intensive qui transforme les milieux prairiaux riches en micromammif&egrave;res et en sites de nidification, en cultures uniformes et extr&ecirc;mement pauvres en nourriture pour lui.<br>
N&eacute;anmoins, la principale cause de destruction directe est l'&eacute;lectrocution sur les lignes de basse et moyenne tension. M&ecirc;me si les pyl&ocirc;nes &eacute;lectriques lui fournissent d'excellents sites de nidification, l'enfouissement de ces lignes meurtri&egrave;res serviraient davantage le faucon cr&eacute;cerelle et bien d'autres esp&egrave;ces qui ont le malheur de faire une pose sur les poteaux et de c&ocirc;toyer de trop pr&egrave;s la f&eacute;e &eacute;lectricit&eacute;.<br>
Pour esp&eacute;rer voir le faucon cr&eacute;cerelle faire du sur-place au-dessus de votre jardin, il vous faut poss&eacute;der une vaste prairie ou une pelouse riche en micromammif&egrave;res. N&eacute;anmoins, comme son territoire de chasse est tr&egrave;s important, vous pouvez installer un nichoir aux dimensions ad&eacute;quates pour h&eacute;berger sa nich&eacute;e. Il lui faudra un endroit relativement calme et inaccessible. La fa&ccedil;ade d'une vieille grange est souvent l'endroit id&eacute;al pour l'accrocher.<br>

<br>
<b>Description :</b><br>
<br>
 La femelle et le jeune faucon cr&eacute;cerelle poss&egrave;dent un plumage brun roux tachet&eacute; de noir sur les parties sup&eacute;rieures. Le m&acirc;le s'en distingue par une calotte gris bleu et par une barre noire bien visible en vol &agrave; l'extr&eacute;mit&eacute; de sa queue grise.<br>
En vol, le faucon cr&eacute;cerelle ne poss&egrave;de pas la silhouette typique du faucon comme le hobereau. De la taille d'une femelle d'&eacute;pervier, il poss&egrave;de de longues ailes peu pointues et une longue queue. La confusion a plut&ocirc;t lieu avec cette derni&egrave;re qu'avec d'autres falconid&eacute;s. Sa facult&eacute; de faire du vol stationnaire est certainement le meilleur crit&egrave;re pour l'identifier, m&ecirc;me &agrave; distance car seul le rare faucon kobez sait l'imiter.<br>
<br><br>
<br><br> 

<b>Alimentation :</b><br>
<br>
Le campagnol terrestre et les autres petits rongeurs constituent la plus grande partie de son r&eacute;gime alimentaire. Les insectes, les l&eacute;zards et les petits oiseaux, &eacute;galement saisis au sol, le compl&egrave;tent. Il n'y a gu&egrave;re qu'au coeur des grandes cit&eacute;s que le moineau domestique prend la place pr&eacute;pond&eacute;rante.<br>
 <br><br> 

<b>Habitat :</b><br>
<br>
Avec la buse variable et l'&eacute;pervier d'Europe, le faucon cr&eacute;cerelle est l'un des rapaces le plus commun en France, en Belgique, en Suisse et au Luxembourg. On le trouve dans tous les milieux ouverts : zones bocag&egrave;res, plaines de culture, chaumes de montagne et m&ecirc;me au coeur des villes o&ugrave; il niche sur les cath&eacute;drales et les &eacute;glises et chasse les moineaux plut&ocirc;t que les rongeurs. C'est d'ailleurs cette forte d&eacute;pendance vis &agrave; vis des campagnols principalement qui explique son abondance plus forte dans les zones de prairies que dans les zones de cultures o&ugrave; les produits chimiques arrivent &agrave; limiter le nombre de micromammif&egrave;res et o&ugrave; l'absence d'arbres suite aux remembrements limite les sites de nidification.<br>
 <br><br> 

<b>Port&eacute;e :</b><br>
<br>
La ponte a lieu en avril-mai selon la latitude et l'altitude dans un vieux nid de corvid&eacute;s sur un arbre ou un pyl&ocirc;ne &eacute;lectrique, ou dans une cavit&eacute; d'un b&acirc;timent ou d'une falaise. Les 4 &agrave; 6 oeufs sont couv&eacute;s pendant un mois environ et les jeunes restent au nid 4 semaines avant de savoir voler.<br>
 <br><br> 

<b>Comportement :</b><br>
<br>

<br><br>  
</body>
</html>