<html>
<body  background="../images/fondtexte2.jpg" text="black" vlink="black" border="0" >
<table>
<tr>
<td valign=top>


<a href="listeamphibiens.html"taget="description">Retour</a><br><br>
<br>
<a href="grenouillejpg.html"><IMG SRC="images/grenouille.jpg" ALT="La Grenouille" WIDTH="250" HEIGHT="187" border=0</A>      </td>
<td>
<pre>
<b>La grenouille</b>

<i>Batracien de l'ordre des anoures 
     (famille des ranid&eacute;s)</i>
  
 Nom de son petit : t&eacute;tard
         Longueur : 
       poids maxi :
        long&eacute;vit&eacute; : 
              Cri : elle coasse
</pre>
<a href="stmartingrenouille2jpg.html"><IMG SRC="images/stmartingrenouille2.jpg" ALT="La grenouille" width="116" height="81" border=0</A>


<a href="stmartingrenouille1jpg.html"><IMG SRC="images/stmartingrenouille1.jpg" ALT="La grenouille" width="121" height="81" border=0</A> 
</td>
</tr>
</table>
Le saviez-vous ?<br>
<br>
Il existe plus de 200 esp&egrave;ces de grenouilles<br>
La grenouille goliath du Cameroun mesure jusqu'&agrave; 40 cm et p&egrave;se 6 kg.<br>
 Au Cameroun il existe &eacute;galement une grenouille poilue, ainsi nomm&eacute;e en raison des pseudo-poils que pr&eacute;sente le m&acirc;le &agrave; l'&eacute;poque des amours.<br> 
<br>
La plupart des grosses grenouilles peuvent faire sortir leurs yeux de leurs orbites, ce qui leurs permet d'ouvrir plus largement leur bouche
<br><br>
<b>Description :</b><br>
<br>
Une peau lisse des membres post&eacute;rieurs plus long que le corps des membres inf&eacute;rieurs plus courts
4 doigts palm&eacute;s &agrave; l'avant et 5 &agrave; l'arri&egrave;re. 2 rang&eacute;es de petites dents les distinguent des crapauds.<br>
<br>
- <i>la grenouille verte</i><br>
<br>
- <i>la grenouille rousse</i><br> 
<bR>
- <i>La Rainette m&eacute;ridionale</i><br>
<bR>
<br><br> 

<b>Alimentation :</b><br>
<br>
Les grenouilles se nourrissent d'insectes.<br>
Les t&eacute;tards mordillent les v&eacute;g&eacute;taux qu'ils trouvent puis au bout de quelques semaines ils se nourrissent de minuscules animaux...

 <br><br> 

<b>Habitat :</b><br>
<br>
Elle vit principalement dans l'eau !<br>
 <br><br> 

<b>Port&eacute;e :</b><br>
<br>
La plupart des grenouilles pondent leurs oeufs dans l'eau. Chaque oeuf est un petit point noir prot&eacute;g&eacute; par une sorte de gel&eacute;e d'o&ugrave sortira un t&eacute;tard.  
 <br><br> 

<b>Comportement :</b><br>
<br>
La grenouille attend fig&eacute et silencieuse que se pr&eacute;sente une proie.Puis, en un &eacute;clair elle sort sa langue visqueuse sur laquelle viendront se coller les insectes qu'elle avalera aussit&ocirc;t<br>
<br>
Le m&acirc;le &eacute;met des sons (en gonflant leur gorge) pour attirer une femelle.<br>
<br>
La fr&eacute;n&eacute;sie de l'accouplement est telle qu'un nombre impressionnant de m&acirc;les peut s'agglutiner sur une femelle, au point de finir par la noyer.<br> 
<br><br>  
</body>
</html>