<html>
<body  background="../images/fondtexte2.jpg" text="black" vlink="black" border="0" >

<a href="listemammiferes.html#h"target="description">Retour</a><br> 
<br>



<b>Le lama</b><br>
<pre>
<hr> 
<i>Mammif&egrave;re de l'ordre des Artiodactyles</i> (famille des Cam&eacute;lid&eacute;s)

           Taille : 115 cm
       poids maxi : Entre 80 et 160kg
        long&eacute;vit&eacute; : de 15 &agrave; 25 ans
Maturit&eacute;e sexuelle: Entre 12 et 24 mois chez les femelles et 2 ans pour les m&acirc;les
<hr> 
</pre>
 

</td>
</tr>
</table>

<b>Description :</b><br>
<br>
Principalement de couleur beige sable, il peut avoir quelques taches noires ou &ecirc;tre totalement noir ou brun.<br>
<br>
Une t&ecirc;te mince, un grand museau en forme de c&ocirc;ne, des oreilles tr&egrave;s mobiles, de grands yeux avec de long cils, un cou mince et long comme ses jambes, une queue &eacute;paisse mais tr&egrave;s courte, une l&egrave;vre sup&eacute;rieure divis&eacute;e, 30 dents et une langue tr&egrave;s saliv&eacute;e.<br>
<br>
On peut diff&eacute;rencier le m&acirc;le de la femelle entre 15 et 20 jours apr&egrave;s la mise-bas.<bR>
<br>
Il existe 2 races sauvage (le guanaco et la vigogne) et 2 races domestiques (le lama proprement dit et l'alapaga)<br>
<br>
Au printemps, et une fois par an, la tonte s'av&egrave;re indispensable ...<br>
<br><br> 

<b>Alimentation :</b><br>
<br>
Le Lama est herbivore il aime l'herbe, les broussailles, les ronces, le fourrage, le ma&iuml;s, l'orge etc..<br>
 <br><br> 

<b>Habitat :</b><br>
<br>
Le lama domestique habite principalement au P&eacute;rou et les lamas sauvages plut&ocirc;t dans les r&eacute;gions montagneuses de l'Am&eacute;rique du sud (cordill&egrave;re des Andes).<br>
 <br>
 <br><br> 

<b>Port&eacute;e :</b><br>
<br>
Apr&egrave;s une gestation de 11 mois, la femelle donne naissance &agrave; un seul petit par an.<bR>
 <br><br> 

<b>Comportement :</b><br>
<br>
 Il  crache mais seulement pour se d&eacute;fendre.<br>
La femelle se tient g&eacute;n&eacute;ralement en petit groupe avec un m&acirc;le.<br>
 Le lama est capable de sauter 1,60 m et plus lorsqu'il se sent menac&eacute;...
<br><br>  
</body>
</html>
