<html>
<body  background="../images/fondtexte2.jpg" text="black" vlink="black" border="0" >

<a href="listemammiferes.html#h"target="description">Retour</a><br> 
<br>
<table>
<tr>
<td>
<pre>
<b>Le Lapin</b>
<hr>
<i>Mammif&egrave;re de l'ordre des lagomorphes.</i>
(Famille des L&eacute;porid&eacute;s)

         Longueur : 34 &agrave; 50cm
            Poids : 1 &agrave; 2,5kg
Nom de la femelle : la lapine
 Nom de son petit : le lapereau

        Gestation : de 28 &agrave; 33 jours.

        Long&eacute;vit&eacute; : de 8 &agrave; 9 ans

              Cri : il clapit

     vitesse maxi : 80 km/h.
<hr>
</pre>

Souvent appel&eacute;s rongeurs dans le langage courant, les lapins et les li&egrave;vres appartiennent en r&eacute;alit&eacute; &agrave; un groupe diff&eacute;rent, celui des lagomorphes.<br> 

 
  

</td>
</tr>
</table>
<br>
<b>Description :</b><br>
<br>
Le lapin se distingue du li&egrave;vre par sa taille, ses oreilles et sa queue plus petites.<br>
Leur m&acirc;choire sup&eacute;rieure porte deux paires d'incisives alors que la m&acirc;choire inf&eacute;rieure une seule.<br>
Leurs pattes post&eacute;rieures, longues et puissantes, leur permettent d'effectuer des bonds de plusieurs m&egrave;tres.
<br><br> 

<b>Alimentation :</b><br>
<br>
 <br><br> 

<b>Habitat :</b><br>
<br>
 <br><br> 

<b>Port&eacute;e :</b><br>
<br>
La femelle arrive &agrave; produire de 40 &agrave; 50 lapereaux par an.<br>
A chaque port&eacute;e (de 4 &agrave; 7 par an), elle creuse un nouveau terrier qu'elle tapisse avec les poils de son ventre.<br>
<br>
Les port&eacute;es comptent de 3 &agrave; 9 jeunes dont la gestation dure environ 30 jours. Les lapereaux, aveugles &agrave; la naissance, ne s'aventurent hors de leur terrier qu'apr&egrave;s trois semaines.<br>

 <br><br> 

<b>Comportement :</b><br>
<br>
Les lapins sont sociables, ils vivent en colonies et leur vari&eacute;t&eacute; naine constitue d'excellents animaux de compagnie. A l'&eacute;tat sauvage, les lapins creusent des terriers appel&eacute;s garennes. Leur activit&eacute; est essentiellement cr&eacute;pusculaire et nocturne, mais ils peuvent sortir durant le jour s'ils ne sont pas d&eacute;rang&eacute;s.<bR> 
<br><br>  
</body>
</html>