<html>
<body  background="../images/fondtexte2.jpg" text="black" vlink="black" border="0" >

<a href="listemammiferes.html"target="description">Retour</a><br> 
<br>

<pre>
<b>Le porc</b> (ou cochon domestique)
<hr>
<i>Ordre des  (famille des suid&eacute;s)</i>

      Nom du m&acirc;le : le verrat
Nom de la femelle : la truie
 Nom de son petit : le porcelet
         Longueur : 
       poids maxi :
        long&eacute;vit&eacute; : 
<hr>
</pre>
<br>
viande de porc : 34,3 kg/habitant/an (en 1997)<br>
Le cochon sauvage appara&icirc;t &agrave; l'&egrave;re tertiaire (4 000 000 d'ann&eacute;es avant JC).<br>
<br>
<br>
<b>Description :</b><br>
<br>
Il existe, en France, de nombreuses races de porc (le <i>Noir gascon</i>, le <i>Basque</i>, le <i>Cul noir du Limousin</i> etc...)dont voici les 4 principales :<br>
<br>
- Le <i>Large White</i> : porc blanc &agrave; oreilles droites.<br>
- Le <i>Landrace</i> : porc blanc à oreilles inclinées<br>
- Le <i>Piétrain</i> : porc tacheté noir et blanc à oreilles droites<br>
- Le <i>Landrace Belge</i> : porc blanc à oreilles inclinées<br>
<br><br> 

<b>Alimentation :</b><br>
<br>
On lui donne d'importantes rations de c&eacute;r&eacute;ales (bl&eacute;, orge, seigle, ma&iuml;s.). Puis, on lui fournit &eacute;galement prot&eacute;ines, min&eacute;raux et vitamines n&eacute;cessaires &agrave; sa croissance.<br>
En fonction de son &acirc;ge, un porc mange de 1 &agrave; 2 kg d'aliment par jour.<br>

<br><br> 

<b>Habitat :</b><br>
<br>
En France, la production porcine est majoritairement localis&eacute;e en Bretagne (55%) et en Pays de Loire (11%).<bR>
 <br><br> 

<b>Port&eacute;e :</b><br>
<br>
A 7 mois, la cochette (jeune femelle) devient <i>truie</i> quant au verrat, il ne sera capable de se reproduire qu'&agrave; partir du 8&egrave;me mois.<br>
<br>
La gestation de la truie dure pendant 114 jours (3 mois, 3 semaines et 3 jours).Sa port&eacute;e compte en moyenne 11 porcelets (et peux aller jusqu'&agrave; 18)<bR>
D&egrave;s leur naissance, les porcelets t&egrave;tent leur m&egrave;re, mais il faudra attendre leur 4&egrave;me semaine pour qu'ils soient capables de se nourrir seuls.<br>
 <br><br> 

<b>Comportement :</b><br>
<br>
Contrairement &agrave; ce que l'on dit, le cochon n'est pas un animal sale. Certes, il aime se rouler dans la boue !Mais c'est pour prot&eacute;ger sa peau fragile. Il appr&eacute;cie d'&ecirc;tre propre, il aime l'eau et fait ses besoins &agrave; l'ext&eacute;rieur de la soue.<br>
<br><br>  
</body>
</html>