<html>
<body  background="../images/fondtexte2.jpg" text="black" vlink="black" border="0" >
<table>
<tr>
<td valign=top>

<a href="listemammiferes.html#m"target="description">Retour</a><br> 
<br>
        
<a href="renard1jpg.html"><IMG SRC="images/renard1.jpg" ALT="photo fourni par Gilles Mathevet" WIDTH="220" HEIGHT="196" border=0</A><br>   

</td>
<td>
<pre>
<b>Le renard</b>
<hr>
<i>Ordre des carnassiers (famille des canid&eacute;s)</i>

Nom de la femelle : la renarde
 Nom de son petit : le renardeau
         Longueur : 1,25 m (queue comprise)
            poids : 6 &agrave; 7 kg en moyenne (10 kg maxi)
  long&eacute;vit&eacute;e maxi : 9 ans 
        Gestation : 52 jours
     Vitesse maxi : 60 km/h
              Cri : il glapit
<hr>
</pre>
<br>

</td>
</tr>
</table>
<br>
<b>Description :</b><br>
<br>
un corps &eacute;lanc&eacute; au pelage g&eacute;n&eacute;ralement brun-roux, un museau allong&eacute;, de grandes oreilles triangulaires port&eacute;es dress&eacute;es, noires en arri&egrave;re et une longue queue touffue, en panache, généralement plus ou moins blanche au bout. 
<br><br> 

<b>Alimentation :</b><br>
<br>
L'essentiel de ses repas est constitué de petits rongeurs (un renard mange de 6 &agrave; 10 000 petits rongeurs par an). Il consomme &eacute;galement &eacute;norm&eacute;ment de vers de terre...<br>
  Il capture aussi d'autres proies comme les lapins, li&egrave;vres, oiseaux, h&eacute;risson, insectes. Les renards se nourrissent &eacute;galement de baies (surtout des m&ucirc;res), fruits et de charognes.<br>
Il lui arrive aussi de capturer des l&eacute;zards, des poissons, des gu&ecirc;pes, des sauterelles ou des escargots.
<br>
 <br><br> 

<b>Habitat :</b><br>
<br>
Les renards s'adaptent &agrave; leurs milieux et on peut les trouver aussi bien dans les zones bois&eacute;es que dans les terrains d&eacute;couverts d'Europe, d'Am&eacute;rique et d'Asie. Comme les ratons laveurs ils colonisent peu &agrave; peu les zones urbaines.<br>
<br>
Le renard vit dans un terrier qui comprend plusieurs galeries creus&eacute;es jusqu'&agrave; 3 ou 4 m&egrave;tres de profondeur et qui ont souvent plusieurs orifices (2 &agrave; 4).<br>
Son territoire varie de 50 &agrave; 600 ha.<br>
 <br><br> 

<b>Port&eacute;e :</b><br>
<br>
de 3 &agrave; 6 petits par port&eacute;e.<br>
&Agrave; la naissance, les nouveau-n&eacute;s p&egrave;sent 100 grammes. Ils sont aveugles et sourds. Ils ouvriront les yeux et commenceront &agrave; entendre &agrave; l'&acirc;ge de 2 semaines.<br>
A 4 semaines, les petits commencent &agrave; manger de la viande.   
 <br><br> 

<b>Comportement :</b><br>
<br>
Le renard commun ou renard roux vit souvent en clan compos&eacute; d'un m&acirc;le pour plusieurs femelles. Il chasse, plut&ocirc;t la nuit, le jour, il se repose dans une tani&egrave;re.<br>
Dans un clan, seule une femelle ou deux se reproduit. Lorsque les deux renardes ont des petits, elles partagent alors un m&ecirc;me terrier.<br>
<br><br>  
</body>
</html>