<html>
<body  background="../images/fondtexte2.jpg" text="black" vlink="black" border="0" >
<table>
<tr>
<td valign=top>

<a href="listeamphibiens.html"taget="description">Retour</a><br><br>
<br>
<a href="salamandrejpg.html"><IMG SRC="images/salamandre.jpg" ALT="La Salamandre" WIDTH="250" HEIGHT="187" border=0</A><br>          


</td>
<td>
<pre>
<b>La Salamandre</b>
<hr>
<i>Batracien de l'ordre des urod&egrave;les</i> (avec queue)
<i>famille des salamandrines</i>

     alimentation : vers, mollusques, insectes, etc...
          habitat : proximit&eacute; des ruisseaux, sources, lacs.
           moeurs : cr&eacute;pusculaire et nocturne
 
     reproduction : ovovivipare (l'incubation des oeufs se
                    fait dans les voies g&eacute;nitales de
                    la femelle)

         longueur : 20 cm en moyenne, plus rarement 25

       long&eacute;vit&eacute; : 25 ans maximum

maturit&eacute; sexuelle : environ 4 ans

       pr&eacute;dateurs : h&eacute;risson, couleuvre &agrave; collier ....
<hr>
</pre>  
</td>
</tr>
</table>
 Même si ce petit animal pourrait par sa forme, &ecirc;tre confondu
 avec un l&eacute;zard, il est facilement reconnaissable :
 la salamandre est dodue, brillante, et de couleur noir tachet&eacute;e de jaune. Les dessins qu'elle porte sur son dos sont uniques, chaque salamandre poss&egrave;de un dessin diff&eacute;rent (celui-ci ne variant pas dans le temps !).<br>
<br>
<b>Sa morphologie</b><br>
<br>
 Sa peau fine, est constitu&eacute;e de plusieurs couches. La couche superficielle tombe environ tous les mois ( c'est une mue), elle commence &agrave; se d&eacute;tacher pr&egrave;s de la bouche, et glisse ensuite le long du corps.<br>
Sa peau tr&egrave;s vascularis&eacute;e contient de nombreuses glandes, dont certaines lui permettent de maintenir l'humidit&eacute; corporelle qui lui est n&eacute;cessaire. Une autre glande produit un venin laiteux irritant, qu'elle rejette lorsque un danger se pr&eacute;sente (glande paroto&iuml;de, qui se trouve entre ses yeux).<br>
 Ses pattes au nombre de quatre sont pourvues de doigts (4 sur les mains et 5 sur les pieds).<br>
A l'&acirc;ge adulte, elle a des poumons, et son odorat est tr&egrave;s d&eacute;velopp&eacute;, lui permet de d&eacute;nicher une proie hors de son champ de vision, situ&eacute;e &agrave; quelques m&egrave;tres d'elle (surtout les lombrics dont elle raffole) qu'elle peut ainsi "croquer" &agrave; belles dents (dentition sur les 2 m&acirc;choires).<br>
 <br><br>
 
 

 
 
<b>Sa naissance</b><br>
<br>
 La gestation, mal d&eacute;finit, est assez longue (plusieurs mois).<br>
La naissance a lieu parfois en octobre, mais plus fr&eacute;quemment apr&egrave;s l'hibernation en mars. La femelle lib&egrave;re dans l'eau, par son cloaque, des larves bien d&eacute;velopp&eacute;es (entre 10 et 35, parfois beaucoup plus) de 3 cm de long. Exceptionnellement, il arrive que la femelle expulse les larves encore dans leur oeuf, l'&eacute;closion ayant alors lieu dans les secondes qui suivent.
Les larves naissent dans un milieu aquatique ou l'eau est peu profonde. Elles ressemblent &agrave; des petits tritons avec 4 membres, et poss&egrave;dent au d&eacute;part de leur vie une respiration branchiale, ainsi qu'une nageoire caudale. Elles sont facilement reconnaissables gr&acirc;ces &agrave; leur couleur jaune au niveau des pattes.<br>
<br><br> 
 
 La salamandre qui poss&egrave;de des poumons apr&egrave;s sa transformation, ne peut aller dans l'eau qu'&agrave; une seule condition : il faut qu'elle ait pied, pour ne pas se noyer !<br>
 <br><br>
 
 Petit &agrave; petit la m&eacute;tamorphose va se faire, les pattes et les poumons vont se d&eacute;velopper, et les larves vont se pr&eacute;parer pour sortir de l'eau et avoir une vie terrestre. La m&eacute;tamorphose dure de 2 &agrave; 6 mois, selon les r&eacute;gions et parfois plus en montagne. Une fois sortie de l'eau, notre salamandre n'y retournera que pour donner naissance &agrave; ses petits.<br>
<br><br>
<b>Ses moeurs</b><br>
<br>
 Elle aime surtout sortir la nuit, et apr&egrave;s les pluies orageuses. Elle passe la majeure partie de sa journ&eacute;e cach&eacute;e dans des endroits frais et humide, (sous une vielle souche d'arbre, pierre, caverne, etc...), elle y passe aussi l'hiver d'octobre &agrave; mars, o&ugrave; elle hiberne.<br>
On peut la rencontrer quelquefois le jour, lorsque pour mettre au monde ses petits, elle cherche un point d'eau.<br>
 <br><br>
 
 
 
 Bien que prot&eacute;g&eacute;e, elle est comme beaucoup d'animaux, en voie de disparition, le d&eacute;boisement, la pollution des eaux, sont en partie responsables, mais les voitures ont aussi leur part de responsabilit&eacute;.<br>
 Dans certaines r&eacute;gions des initiatives sont prises. Las de retrouver les salamandres, grenouilles et autres amphibiens &eacute;cras&eacute;s sur les routes, l'O.N.F et diverses associations ont am&eacute;nag&eacute; les bas-c&ocirc;t&eacute;s en barrages munies de seaux. Lorsque les amphibiens veulent traverser, ils longent la paroi, tombent dans un des seaux, et se trouvent pi&eacute;g&eacute;s. Le matin il suffit de r&eacute;cup&eacute;rer le seau avec tous ses occupants, et de traverser la route pour les y d&eacute;poser de l'autre cot&eacute;.
 Croyance<br>
 <br><br>
 
 Gr&acirc;ce au syst&egrave;me des barrages sur le bas-cot&eacute;, plusieurs milliers d'amphibiens &eacute;chappent &agrave; la mort chaque ann&eacute;e.<br>
 <br><br>
 
 
 Auparavant, on pensait que les salamandres &eacute;taient incombustibles et vivaient dans le feu.<br>
<br><br>
 <br>
<b>Description :</b><br>
<br>
<br><br> 

<b>Alimentation :</b><br>
<br>
 <br><br> 

<b>Habitat :</b><br>
<br>
 <br><br> 

<b>Port&eacute;e :</b><br>
<br>
Vers la fin de l'&eacute;t&eacute; ou au d&eacute;but du printemps, le m&acirc;le va venir &agrave; la rencontre de la femelle et se placer sous elle (elle se retrouve sur son dos) il n'y a pas de p&eacute;n&eacute;tration, juste un frottement. Le m&acirc;le, va &eacute;mettre des spermatozo&iuml;des regroup&eacute;s en spermatophore que la femelle va absorber avec son cloaque. L'accouplement dure entre 15 et 30 minutes et la f&eacute;condation est interne.<br>
 <br><br>
 <br><br> 

<b>Comportement :</b><br>
<br>

<br><br>  
</body>
</html>
