<html>
<body  background="../images/fondtexte2.jpg" text="black" vlink="black" border="0" >
<table>
<tr>
<td valign=top>

<a href="listemammiferes.html#m"target="description">Retour</a><br> 
<br>

<a href="vache1jpg.html"><IMG SRC="images/vache1.jpg" ALT="La vache" width="320" height="226" border=0</A><br> 
</td>
<td>
<pre>
<b>La vache</b><br>
<hr>

      Nom du m&acirc;le : le taureau
Nom de la femelle : la vache
 Nom de son petit : le veau
    Longueur maxi : 
       poids maxi :
        long&eacute;vit&eacute; :
              cri : elle beugle, meugle ou mugit. 
<hr>
</pre>
<br>
<a href="vache2jpg.html"><IMG SRC="images/vache2.jpg" ALT="La vache" width="123" height="82" border=0</A><br> 

 

</td>
</tr>
</table>
<br>
il existe encore 37 races de vaches diff&eacute;rentes &eacute;lev&eacute;es en France (la passion des français pour leurs fromages expliquant cel&agrave...). Parmis celles-ci, 5 races (la Prim'Holstein, la Charolaise, la Normande, la Montb&eacute;liarde et la Limousine) repr&eacute;sentent &agrave; elles seul 85% des 20 millions de vaches pr&eacute;sentent sur notre sol.<br>
<br><br> 
<b>Description :</b><br>
<br>
- La Prim'Holstein (championne mondiale des vaches &acirc; lait)<br>
<br>
Une robe noire et blanche, poitrail et mufle larges, membres robustes, t&ecirc;te courte, et bien s&ucirc;r mamelle volumineuse. (production moyenne de lait 8 470 litres/an et jusqu'&agrave; 10 000 l/an)<br>
<br>
- La Charolaise<br>
<br>
Une robe blanche uniforme, parfois cr&egrave;me, au poil &eacute;pais et court.<bR>
<br>
- La Normande<br>
<br>
Une robe tricolore, panach&eacute;e de blond, marron-fauve et blanc<br>
des cils blancs systématiquement mis en valeur par des tâches marrons autour des yeux. Un physique robuste, poitrail et hanches larges, et mamelle volumineuses. Ses muqueuses de couleur fonc&eacute;e, ses cornes sont blanches, courtes et recourb&eacute;es vers l'avant. Cette vache laiti&egrave;re est tr&egrave;s appr&eacute;ci&eacute;e pour sa rusticit&eacute; et sa facilit&eacute; de v&ecirc;lage.<br>
<br>
- La Montb&eacute;liarde<br>
<br> 
Une robe, aux taches bien d&eacute;limit&eacute;es, de couleur pie rouge (une variante de marron clair) sur fond blanc. Elle doit sa beaut&eacute; au fait que sa t&ecirc;te et ses membres restent la plupart du temps uniform&eacute;ment blancs.<bR>
Des cornes claires et coud&eacute;es vers l'avant.<br>
(production plus de 5 800 litres de lait par an)<br>
<bR>
- La Limousine (vache bouch&egrave;re)<br>
<br>
Une robe acajou uniforme, un mufle et des yeux cern&eacute;s d'aur&eacute;oles plus claires, tout comme le bout de sa queue. Son poil est tr&egrave;s &eacute;pais et compact. Un buste long, des cornes claires de taille moyenne tourn&eacute;es vers l'avant et des muqueuses claires.<br>
<br>
- La Salers<br>
<br>
- L'Aubrac<br>
<br> 

- La Bazadaise<br>
<br> 

- La Blonde d'Aquitaine<br>
<br> 

- La Bretonne Pie Noire<br>
<br>

- La Gasconne<br>
<br>
- L'Abondance<br>
<br>
- La Parthenaise<br>
<br>
- La Tarentaise<br>
<br>
- La Froment du L&eacute;on<br>
<br>
- La Vosgienne<br>
<br>
<br><br> 

<b>Alimentation :</b><br>
<br>
 <br><br> 

<b>Habitat :</b><br>
<br>
 <br><br> 

<b>Port&eacute;e :</b><br>
<br>
 <br><br> 

<b>Comportement :</b><br>
<br>

<br><br>  
</body>
</html>