<html>
<body background="../../images/fondgris2.jpg" text="black" link="darkblue" vlink=darkred border="0">
<a name="a"</a>
<a href="burkinafaso.html"target="description">Retour</a><br>
<br>
L'hymne national du Burkina Faso a &eacute;t&eacute; &eacute;crit par Thomas Sankara.<br>
<br><br>


<b>L'Hymne de la Victoire</b> (&eacute;galement appel&eacute; Une seule nuit)<br>

<pre>
Contre la f&eacute;rule humiliante il y a d&eacute;j&agrave; mille ans
La rapacit&eacute; venue de loin les asservir il y a cent ans
Contre la cynique malice m&eacute;tamorphos&eacute;e
En n&eacute;ocolonialisme et ses petits servants locaux
Beaucoup flanch&egrave;rent et certains r&eacute;sist&egrave;rent
Mais les &eacute;checs, les succ&egrave;s, la sueur, le sang
Ont fortifi&eacute; notre peuple courageux
Et fertilis&eacute; sa lutte h&eacute;ro&iuml;que.


Et une seule nuit a rassembl&eacute; en elle l'histoire de tout un peuple
Et une seule nuit a d&eacute;clench&eacute; sa marche triomphale
Vers l'horizon du bonheur une seule nuit a r&eacute;concili&eacute;
Notre peuple, avec tous les peuples du monde
&agrave; la conqu&ecirc;te de la libert&eacute; et du progr&egrave;s.
La Patrie ou la mort nous vaincrons.

Nourris &agrave; la source vive de la r&eacute;volution,
Les engag&eacute;s volontaires de la libert&eacute; et de la paix
Dans l'&eacute;nergie nocturne et salutaire du 4 ao&ucirc;t
N'avaient pas que les armes &agrave; la main mais aussi et surtout
La flamme au coeur pour l&eacute;gitimement lib&eacute;rer
Le Faso &agrave; jamais des fers de tous ceux qui,
&Ccedil;&agrave; et l&agrave;  en polluaient l'&acirc;me sacr&eacute;e
De l'ind&eacute;pendance de la souverainet&eacute;

Et une seule nuit a rassembl&eacute; en elle l'histoire de tout un peuple
Et une seule nuit a d&eacute;clench&eacute; sa marche triomphale
Vers l'horizon du bonheur une seule nuit a r&eacute;concili&eacute;
Notre peuple, avec tous les peuples du monde
&agrave; la conqu&ecirc;te de la libert&eacute; et du progr&egrave;s.
La Patrie ou la mort nous vaincrons.

Et s&eacute;ant d&eacute;sormais en sa dignit&eacute; recouvr&eacute;e
L'amour et l'honneur en partage avec l'humanit&eacute;
Le peuple de Burkina chante un hymne &agrave; la victoire
&Agrave; la gloire du travail lib&eacute;rateur, &eacute;mancipateur
A bas l'exploitation de l'homme par l'homme,
H&eacute; ! en avant pour le bonheur de tout homme
Par tous les hommes aujourd'hui et demain
Par tous les hommes ici et pour toujours.

Et une seule nuit a rassembl&eacute; en elle l'histoire de tout un peuple
Et une seule nuit a d&eacute;clench&eacute; sa marche triomphale
Vers l'horizon du bonheur une seule nuit a r&eacute;concili&eacute;
Notre peuple, avec tous les peuples du monde
&agrave; la conqu&ecirc;te de la libert&eacute; et du progr&egrave;s.
La Patrie ou la mort nous vaincrons.

R&eacute;volution populaire n&ocirc;tre, s&egrave;ve nourrici&egrave;re
Maternit&eacute; immortelle de progr&egrave;s &agrave; visage d'homme
Foyer &eacute;ternel de d&eacute;mocratie consensuelle
O&ugrave; enfin l'identit&eacute; nationale a droit de cit&eacute;
O&ugrave; pour toujours l'injustice perd ses quartiers
Et o&ugrave; des mains des b&acirc;tisseurs d'un monde radieux
M&ucirc;rissent partout les moissons des voeux patriotiques
Brillent les soleils infinis de joie.

Et une seule nuit a rassembl&eacute; en elle l'histoire de tout un peuple
Et une seule nuit a d&eacute;clench&eacute; sa marche triomphale
Vers l'horizon du bonheur une seule nuit a r&eacute;concili&eacute;
Notre peuple, avec tous les peuples du monde
&agrave; la conqu&ecirc;te de la libert&eacute; et du progr&egrave;s.
La Patrie ou la mort nous vaincrons.

</pre>
<A HREF="#a"<font color="#FF0000">haut de page</font> </A>
<br><br>
</body>
</html>