<html>
<head>
<title>SELFHTML: Editorial / Hinweise zum Dokument</title>
<meta name="description" content="(SELFHTML 7.0) Was Sie &uuml;ber diese Dokumentation wissen sollten">
<meta name="keywords" content="SELFHTML, Hinweise">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="ta.htm"><b>Editorial</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Hinweise zum Dokument</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>
<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Haftung</b></a> <br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Themenumfang</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>Zielgruppe und Ziel</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a4"><b>Copyright</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a5"><b>Versionenkontrolle</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a6"><b>Neu in Version 7.0</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a7"><b>SELFHTML im WWW</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a8"><b>Verwendeter HTML-Standard</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a9"><b>SELFHTML optisch an eigene Bed&uuml;rfnisse anpassen</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a10"><b>Technische Bedingungen</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a11"><b>Risiken und Nebenwirkungen</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a12"><b>Spenden</b></a>
</p>
</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="a1">Haftung</a></h2>

<p>Dieses Dokument ist keine Publikation einer offiziellen Stelle. Das 
Dokument erhebt weder den Anspruch auf Vollst&auml;ndigkeit noch auf 
Fehlerfreiheit. F&uuml;r Fehler in kommerziellen WWW-Seiten, die auf 
falsche oder falsch verstandene Beschreibungen in diesem Dokument 
zur&uuml;ckzuf&uuml;hren sind, &uuml;bernimmt der Autor keine Haftung.
</p>




<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2">Themenumfang</a></h2>

<p>Dieses Dokument beschreibt den Sprachstandard 4.0 von HTML, ferner die sog. &quot;Netscape-Extensions&quot; und die Microsoft-Erweiterungen zu HTML. Die Dokumentationen zu CSS Style-Sheets, JavaScript und CGI/Perl verstehen sich als Erg&auml;nzungen zu der HTML-Dokumentation. Neben der reinen Dokumentation enth&auml;lt das Dokument Hintergrundwissen rund um das Thema Web Publishing sowie Tips f&uuml;r Grafiken und zum Verwalten eigener WWW-Projekte.</p>

<p>Die Dokumentation ist eine Mischung aus Referenz und Tutorial. Es will den heute und in n&auml;chster Zukunft relevanten HTML-Sprachbestand und seine Erg&auml;nzungssprachen beschreiben. Einige Kapitel haben eher einf&uuml;hrenden Charakter, andere sind eher zum reinen Nachschlagen gedacht.</p>


<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a3">Zielgruppe und Ziel</a></h2>

<p>Zielgruppe sind alle Computer-Anwender, die einen WWW-Browser ihr eigen 
nennen, die m&ouml;glichst schon einige &quot;Surf&quot;-Erfahrungen 
im WWW gesammelt haben, und die nun wissen m&ouml;chten, wie man selbst solche 
Hypertext-Dateien erstellt. Vor allem aber Menschen, die sich privat, 
ehrenamtlich oder beruflich mit dem Erstellen von WWW-Seiten 
besch&auml;ftigen, sind angesprochen. Erkl&auml;rtes Ziel dieses 
Dokuments ist es, Menschen Mut zu machen, das, was sie zu sagen haben, 
selbst im WWW zu publizieren und dadurch aktiv an der World Wide Web 
Revolution teilzunehmen. Denn das Motto des WWW lautet: 
&quot;Everyone's a publisher&quot;.</p>


<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a4">Copyright</a></h2>

<p>Dieses Dokument ist <b>Freeware</b> im Sinne des Software-Lizenzrechts. Die Regeln im einzelnen:</p>
<ul>
<li>Das Kopieren und Weitergeben des Dokuments ist erlaubt.</li>
<li>Das Ver&ouml;ffentlichen auf WWW-Servern, Online-Diensten oder Mailboxen ist erlaubt.</li>
<li>Das Ver&ouml;ffentlichen auf Datentr&auml;gern wie CD-ROMs ist erlaubt, auch wenn diese Datentr&auml;ger kommerziell orientiert sind.</li>
<li>Das &Auml;ndern des Dokuments ist nicht erlaubt. Das gilt sowohl f&uuml;r den Inhalt als auch f&uuml;r das Dateiformat. Auch das Entfernen unliebsamer Passagen ist nicht erlaubt. Einzige Ausnahme: die Datei <b>wselfhtm.css</b> im Verzeichnis von SELFHTML darf f&uuml;r pers&ouml;nliche Zwecke editiert werden (siehe dazu <img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a9"><b>weiter unten</b></a>). Vor der Weitergabe mu&szlig; der Originalzustand dieser Datei wiederhergestellt werden.</li>
<li>Das w&ouml;rtliche &Uuml;bernehmen von einzelnen Textpassagen aus diesem Dokument in eigene Projekte ist in Form eines Zitats erlaubt. Das Zitat mu&szlig; die Quelle des Dokuments eindeutig benennen. Die Quellenangabe sollte den Dokumenttitel (SELFHTML) und die WWW-Adresse  <b>http://www.teamone.de/selfhtml/</b> enthalten.</li>
<li>Das Dokument mu&szlig; stets in der vorliegenden Form und vollst&auml;ndig kopiert, weitergegeben oder anderweitig ver&ouml;fftentlicht werden - das Kopieren, Weitergeben oder Ver&ouml;ffentlichen von Teilen des Dokuments ist nicht erlaubt.</li>
<li>Das Ver&ouml;ffentlichen des Dokuments auf WWW-Servern oder Datentr&auml;gern im Zusammenhang mit illegalem pornografischem Material oder nazistischem Gedankengut ist unerw&uuml;nscht und wird bei Entdeckung juristisch verfolgt.</li>
</ul>

<p>Bei Ver&ouml;ffentlichung auf CD-ROM oder vergleichbaren Datentr&auml;gern ist es eine feine Geste, dem Autor ein Belegexemplar zukommen zu lassen. Senden Sie dieses per Post an:<br>
<b>TeamOne, z.Hd. Stefan M&uuml;nz, Kistlerhofstr. 111, D-81379 M&uuml;nchen</b>.</p>


<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a5">Versionenkontrolle</a></h2>

<p>Version 1.0 (04.06.95)<br>
Version 2.0 (25.06.95)<br>
Version 2.11 (09.08.95)<br>
Version 2.12 (21.08.95)<br>
Version 3.0 (10.10.95)<br>
Version 3.11 (09.11.95)<br>
Version 3.2 (25.11.95)<br>
Version 3.3 (28.11.95)<br>
Version 3.4 (11.12.95)<br>
Version 4.0 (21.01.96)<br>
Version 5.0 (03.07.96)<br>
Version 5.1 (04.08.96)<br>
Version 6.0 (14.03.97)<br>
Version 6.1 (15.06.97)<br>
Version 7.0 (27.04.98)
</p>


<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a6">Neu in Version 7.0</a></h2>

<p>Die Version 7.0 enth&auml;lt gegen&uuml;ber der Vorg&auml;ngerversion 6.1 folgende Neuerungen:</p>

<ul>
<li>Die Dokumentation zu <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="td.htm"><b>CSS Style-Sheets</b></a>, die vorher nur in Ans&auml;tzen als Teil der HTML-Dokumentation existierte, wurde v&ouml;llig &uuml;berarbeitet und stellt jetzt ein eigenes Hauptkapitel dar.</li>
<li>Die Dokumentation zu JavaScript wurde &uuml;berarbeitet und aktualisiert, vor allem das Unterkapitel der <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tec.htm"><b>JavaScript Objektreferenz</b></a> wurde stark erweitert und ausf&uuml;hrlicher gestaltet. Auch neue <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="ted.htm"><b>JavaScript Anwendungsbeispiele</b></a> sind dazugekommen.</li>
<li>Die Einf&uuml;hrung in das Thema <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tf.htm"><b>Dynamisches HTML</b></a> ist neu dazugekommen.</li>
<li>Die Einf&uuml;hrung in das Thema <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="th.htm"><b>Internationalisierung</b></a> ist ebenfalls neu dazugekommen.</li>
<li>Die <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tc.htm"><b>HTML</b></a>-Dokumentation wurde dem HTML-Sprachstandard 4.0 angepa&szlig;t.</li>
<li>Die <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tb.htm"><b>Einf&uuml;hrung</b></a> wurde teilweise &uuml;berarbeitet und neu gegliedert. So sind etwa einf&uuml;hrende Texte zum Funktionieren des Internets hinzugekommen.</li>
<li>Die Abteilung <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tk.htm"><b>Kleine Helferlein</b></a> ist dazugekommen, ebenso die Abteilung <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tp.htm"><b>Wie fange ich an?</b></a></li>
<li>Die neue <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tq.htm"><b>Quickbar</b></a> soll das Nachschlagen einzelner Befehle beschleunigen.</li>
<li>Unz&auml;hlige kleine und nicht ganz so kleine Fehler und Buchstabendreher wurden korrigiert. In diesem Zusammenhang geb&uuml;hrt allen Lesern Dank, die mich auf Fehler hingewiesen haben. Daf&uuml;r gibt es jetzt nat&uuml;rlich mit Sicherheit wieder jede Menge neue Fehler...</li>
</ul>


<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a7">SELFHTML im WWW</a></h2>

<p>Dieses Dokument steht an mehr als 100 Stellen im WWW. Bitte haben Sie Verst&auml;ndnis daf&uuml;r, das nicht an jeder Adresse die neueste Dokumentversion steht. Der Autor selbst pflegt nur eine dieser Adressen. Deshalb finden Sie auch nur dort mit Sicherheit die jeweils neueste Version des Dokuments. Die offizielle Homepage von SELFHTML lautet:</p>

<p><img src="xdeu.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.teamone.de/selfhtml/"><b>http://www.teamone.de/selfhtml/</b></a></p>


<h3>SELFHTML aktuell</h3>

<p>Aktuelle Informationen rund um SELFHTML finden Sie auf der folgenden Adresse:</p>

<p><img src="xdeu.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.teamone.de/selfaktuell/"><b>http://www.teamone.de/selfaktuell/</b></a></p>

<p>Die aktuellen Seiten von SELFHTML sind mit Erscheinen der Version 7.0 neu eingerichtet worden. Dort finden Sie Informationen zu Standard-Themen rund um SELFHTML:</p>

<ul>
<li>SELFHTML als Buch</li>
<li>SELFHTML Download</li>
<li>SELFHTML neue Version</li>
</ul>

<p>Besuchen Sie einfach mal von Zeit zu Zeit die Seiten von &quot;SELFHTML aktuell&quot;, um sich &uuml;ber den aktuellen Stand der Dinge zu informieren.</p>




<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a8">Verwendeter HTML-Standard</a></h2>

<p>Diese Version von SELFHTML verwendet den HTML-Standard 4.0 zur Darstellung, ist jedoch auch problemlos mit WWW-Browsern zu lesen, die HTML 3.2 unterst&uuml;tzen (zum Beispiel Netscape 3.x). Bei &auml;lteren oder textbasierten Browsern k&ouml;nnen in einigen F&auml;llen Anzeigeprobleme auftreten, die meisten Informationen sollten jedoch auch mit solchen Browsern lesbar sein.</p> 

<p>Besondere Bedingungen gelten f&uuml;r die SELFHTML <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tq.htm" target="_parent"><b>Quickbar</b></a> und die <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tk.htm"><b>Kleinen Helferlein</b></a>. Dort wird JavaScript eingesetzt - Ihr Browser mu&szlig; JavaScript unterst&uuml;tzen, und JavaScript mu&szlig; aktiviert sein, damit die entsprechenden Seiten korrekt funktionieren.</p>


<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a9">SELFHTML optisch an eigene Bed&uuml;rfnisse anpassen</a></h2>

<p>Wenn Sie SELFHTML downgeloadet haben und lokal nutzen, d&uuml;rfen Sie individuelle Anpassungen in Bezug auf Schriftart, Schriftgr&ouml;&szlig;en usw. vornehmen. Das ist z.B. sinnvoll, wenn Ihnen Schriften zu klein oder zu schwer lesbar vorkommen.</p> 

<p>Rufen Sie dazu in dem Verzeichnis, in dem Sie SELFHTML abgelegt haben, die Datei <b>wselfhtm.css</b> mit einem Texteditor auf, unter MS Windows beispielsweise mit dem Notepad Editor. Die Datei enth&auml;lt zentrale Style-Sheet-Definitionen f&uuml;r SELFHTML. Die einzelnen Eintr&auml;ge sind auskommentiert. Um tiefer in die Materie der Style-Sheet-Definitionen einzusteigen, lesen Sie in SELFHTML das Kapitel &uuml;ber <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="td.htm"><b>CSS Style-Sheets</b></a>.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a10">Technische Bedingungen</a></h2>

<p>SELFHTML wurde durchweg mit dem HTML-Editor <b>HomeSite</b> (Versionen 2.5 und 3.0) unter MS Windows 95 erstellt. Das Dokument wurde auf zwei PCs erstellt, einem Pentium 90/16 MB/2 MB Grafik/15&quot;-Monitor(800x600) und einem Pentium 166/64 MB/2 MB Grafik/17&quot;-Monitor(10242x768). F&uuml;r Grafik kamen die Programme <b>Paintshop Pro</b> (Version 3.12 und Version 4.12) und <b>PhotoImpact</b> (Version 3.01) zum Einsatz. Die Grafiken wurden vorwiegend selbst erstellt oder entstammen der Doppel-CD-ROM &quot;Masterclips 35.000&quot;, zu beziehen &uuml;ber den IMSI-Verlag, Bayerwaldstra&szlig;e 46, D-81737 M&uuml;nchen, Tel. (++49) 89-637-3357.</p>


<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a11">Risiken und Nebenwirkungen</a></h2>

<p>Dieses Dokument hat bereits etlichen Lebensl&auml;ufen eine neue Richtung gegeben. Manche Menschen haben &uuml;ber Nacht ihren bisherigen Job geschmissen und sich ins Abenteuer &quot;Web-Publishing&quot; gest&uuml;rzt. Sicher war es niemals nur dieses Dokument allein - eine entsprechende innere Bereitschaft war und bleibt stets die Voraussetzung f&uuml;r entscheidende berufliche oder pers&ouml;nliche Ver&auml;nderungen. Doch die &quot;Initialz&uuml;ndung&quot;, die dieses Dokument bei vielen Menschen ausgel&ouml;st hat, soll zumindest nicht verschwiegen werden - nicht aus Autoreneitelkeit, sondern als gutgemeinte Warnung an allzu sensible und labile Gem&uuml;ter: werden Sie Web-Designer oder Provider, wenn Sie wollen. Aber lassen Sie sich Zeit dazu, und lernen und probieren Sie erst mal genug, bevor Sie ahnungslose Kunden mit unversch&auml;mten Angeboten &uuml;ber den Tisch zu ziehen versuchen. Machen Sie das World Wide Web nicht kaputt, nur weil Sie glauben, aus einem Dokument wie diesem ein Wissen ziehen zu k&ouml;nnen, mit dem Sie andere f&uuml;r dumm verkaufen k&ouml;nnen.</p>

<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a12">Spenden</a></h2>

<p>Hin und wieder wird der Autor gefragt, ob es m&ouml;glich sei, eine Spende als Gegenleistung f&uuml;r die Arbeit, die hinter diesem Dokument steckt, zu &uuml;berweisen. Falls Sie einen Geldbetrag &uuml;berweisen wollen, tun Sie das auf folgendes Konto:<br>
<b>Stefan M&uuml;nz, Volksbank M&uuml;nchen, BLZ: 701 900 00, Kontonr.: 63177</b>.<br>
Wenn Sie lieber einen Brief mit Geld &uuml;bersenden wollen, lautet die Empf&auml;ngeradresse:<br>
<b>TeomOne, z.H. Stefan M&uuml;nz, Kistlerhofstr. 111, D-81379 M&uuml;nchen</b>.</p>

<p>Beachten Sie, da&szlig; der Autor unabh&auml;ngig bleiben und keinerlei Verpflichtungen eingehen will, egal welchen Betrag Sie &uuml;berweisen.</p>  





<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tab.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF><img src="x3.gif" width=15 height=10 border=0> <a href="tab.htm"><b>Hinweise zum Arbeiten mit dem Dokument</b></a>
</td></tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="ta.htm"><b>Editorial</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>



</body>
</html>