<html>
<head>
<title>SELFHTML: Einf&uuml;hrung /  Internet, WWW und HTML / HTML-Versionen</title>
<meta name="description" content="(SELFHTML 7.0) Versionen des HTML-Sprachstandards">
<meta name="keywords" content="SELFHTML, Internet, HTML, Sprachversionen, HTML-Versionen">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tb.htm"><b>Einf&uuml;hrung</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tba.htm"><b>Internet, WWW und HTML</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>HTML-Versionen</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>HTML 1.0</b></a> <br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>HTML 2.0</b></a> <br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>HTML 3.2 </b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a4"><b>HTML 4.0 </b></a>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="a1">HTML 1.0</a></h2>

<p>Die erste Sprachversion von HTML gilt heute nicht mehr als erw&auml;hnenswert. Die Spezifikation zu dieser HTML-Version ist auf den Seiten des W3-Konsortiums, das f&uuml;r die Standardisierung von HTML verantwortlich ist, auch gar nicht mehr verf&uuml;gbar.</p>

<p>HTML 1.0 enthielt HTML-Befehle f&uuml;r Standard-Elemente wie &Uuml;berschriften, Textabs&auml;tze, f&uuml;r Grafikreferenzen und nat&uuml;rlich f&uuml;r Verweise.</p>

<p>Vermutlich h&auml;tte es zehn Jahre bis zur n&auml;chsten HTML-Version gedauert. Doch w&auml;hrend HTML gerade mal als Version 1.0 offiziell war, begann der Erfolg des WWW und von WWW-Browsern wie Mosaic und Netscape. Netscape 1.1 beherrschte bereits Tabellen in HTML, da war der Sprachstandard 2.0 noch nicht mal verabschiedet. Und selbst der sollte noch weit davon entfernt sein, Tabellen zum offiziellen Bestandteil von HTML zu erkl&auml;ren.</p>

<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2">HTML 2.0</a></h2>

<p>HTML 2.0 wurde im November 1995 offizieller Sprachstandard. Die Spezifikation f&uuml;r HTML ist beim W3-Konsortium noch verf&uuml;gbar:</p>

<p><img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.w3.org/MarkUp/html-spec/html-pubtext.html"><b>HTML 2.0 Spezifikation</b></a></p>

<p>Die Version 2.0 von HTML gilt heute als der allerkleinste gemeinsame Nenner. Ein WWW-Browser, der HTML 2.0 in seinen wesentlichen Befehlen nicht interpretiert, darf getrost als WWW-untauglich betrachtet werden. Allerdings enth&auml;lt HTML 2.0 durchaus Befehle, die bis auf den heutigen Tag nicht von den gro&szlig;en Browsern interpretiert werden, etwa das <tt>&lt;link&gt;</tt>-Tag.</p>

<p>HTML 2.0 wurde allgemein als Entt&auml;uschung empfunden, da gerade Netscape in seiner Entwicklung schon viel weiter war: so war HTML 2.0 Standard, als der Navigator in seiner &uuml;berw&auml;ltigenden Produktversion 2.0 auf den Markt kam. Darin waren bereits solche Dinge wie Frames (Mehrfenstertechnik) und JavaScript implementiert, die meilenweit &uuml;ber den offiziellen HTML-Standard hinausgingen.</p>

<p>Die meisten Ersteller von WWW-Seiten berauschten sich an den neuen M&ouml;glichkeiten von Netscape und hatten wenig Verst&auml;ndnis f&uuml;r die Restriktionen von HTML 2.0.</p>

<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a3">HTML 3.2</a></h2>

<p>HTML 3.2 wurde nach langen Diskussionen am 14.1.1997 offizieller Sprachstandard. Die Spezifikation zu HTML 3.2 ist auf den Seiten des W3-Konsortiums verf&uuml;gbar:</p>

<p><img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.w3.org/TR/REC-html32.html"><b>HTML 3.2 Spezifikation</b></a></p>

<p>Da&szlig; diese Version eine schwere Geburt war, l&auml;&szlig;t sich schon an der merkw&uuml;rdigen Versionsnummer erahnen. Das W3-Konsortium, von den Erfolgen eines Netscape-Browsers unbeeindruckt, entwickelte zun&auml;chst eine geplante Version 3.0. Die Vorschl&auml;ge zu HTML 3.0 enthielten zwar etliche interessante Bestandteile, die bis heute von den Browser-Herstellern ignoriert werden (zum Beispiel HTML-Befehle zur Darstellung mathematischer Formeln). Doch insgesamt liefen die Vorschl&auml;ge des W3-Konsortiums v&ouml;llig den neuen Realit&auml;ten im Web zuwider. In dieser Zeit begann die verst&auml;rkte Zusammenarbeit zwischen dem W3-Konsortium, das aus der Welt der akademischen Wissenschaften kommt, mit kommerziell orientierten Software-Herstellern. HTML 3.2 ist das Ergebnis einer v&ouml;lligen Umarbeitung der Vorschl&auml;ge zu dem niemals offiziell gewordenen HTML 3.0. Endlich wurden zumindest Tabellen offizieller Bestandteil von HTML und auch diverse Befehle zur physischen Textauszeichnung. Auf die Absegnung der ber&uuml;chtigten Frames aber warteten die Browser-Hersteller, zu denen mittlerweile auch Microsoft geh&ouml;rte, vergeblich.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a4">HTML 4.0</a></h2>

<p>HTML 4.0 wurde am 18.2.1998 als Sprachstandard verabschiedet. Die offizielle Spezifikation gibt es auf den Seiten des W3-Konsortiums:</p>

<p><img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.w3.org/TR/REC-html40/"><b>HTML 4.0 Spezifikation</b></a></p>

<p>Mit HTML 4.0 hat das W3-Konsortium gezeigt, da&szlig; es bereit ist, sich mit den kommerziellen Entwicklungen im WWW auseinanderzusetzen und seine Rolle als kooperatives Standardisierungs-Gremium im Milliardenmarkt WWW zu nutzen. F&uuml;r die eingefleischten Wissenschaftler war das sicher kein einfacher Schritt, aber es war ein ungemein wichtiger Schritt. Denn nur ein W3-Konsortium, das von Software-Herstellern ernstgenommen wird, hat eine Existenzberechtigung. Heute erkennen immer mehr Aktive im WWW die Bedeutung dieses unabh&auml;ngigen Gremiums angesichts vielf&auml;ltiger Versuche einzelner Hersteller, eigene Entwicklungen durch die Verbreitung eigener Browser als Pseudo-Standard durchzuboxen.</p>

<p>HTML 4.0 segnet neben Frames auch die Einbindung von CSS Style Sheets und von Scriptsprachen in HTML ab. Damit sind eigentlich fast alle heute weit verbreiteten Erg&auml;nzungs-Technologien f&uuml;r HTML offizieller Standard oder zumindest im Standard vorgesehen.</p>




<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tbba.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF><img src="x3.gif" width=15 height=10 border=0> <a href="tbba.htm"><b>CSS (Cascading Style-Sheets)</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tbae.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tbae.htm"><b>Eigenschaften von HTML</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tb.htm"><b>Einf&uuml;hrung</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tba.htm"><b>Internet, WWW und HTML</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>