<html>
<head>
<title>SELFHTML: Einf&uuml;hrung /  Erg&auml;nzungen und Alternativen zu HTML / CSS Style-Sheets</title>
<meta name="description" content="(SELFHTML 7.0) CSS Style-Sheets als Erg&auml;nzungssprache zu HTML - einf&uuml;hrende Bemerkungen.">
<meta name="keywords" content="SELFHTML, CSS, Style Sheets, Style-Sheets, Cascading">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tb.htm"><b>Einf&uuml;hrung</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tbb.htm"><b>Erg&auml;nzungen und Alternativen zu HTML</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>CSS Style-Sheets</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Formatierung f&uuml;r HTML-Elemente</b></a>
</p>


</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="a1">Formatierung f&uuml;r HTML-Elemente</a></h2>

<p>HTML ist eine &quot;logische&quot; Sprache. Mit HTML definieren Sie den grunds&auml;tzlichen Aufbau Ihrer WWW-Seiten, die Elemente, die Strukturen, die Verweise, die referenzierten Elemente wie Grafiken, Multimedia usw. Aber HTML ist eigentlich nicht dazu gedacht, um exakt anzugeben, wie ein Element genau aussehen soll. So k&ouml;nnen Sie in HTML eine &Uuml;berschrift definieren und dabei angeben, da&szlig; es sich um eine &Uuml;berschrift 1. Ordnung handeln soll. Sie k&ouml;nnen innerhalb von HTML aber nicht bestimmen, wie gro&szlig;, in welcher Schriftart usw. die &Uuml;berschrift dargestellt werden soll. Das &uuml;bernimmt der WWW-Browser bei der Anzeige. Er benutzt dabei eine Mischung aus Grundeinstellungen, die der Anwender vornehmen kann, und fest programmierten Darstellungen einzelner HTML-Elemente.</p>

<p>In den Zeiten des ersten gro&szlig;en Erfolgs von HTML wurde die Sprache dann f&uuml;r allerlei physische Formatierungen &quot;mi&szlig;braucht&quot;. So tauchte pl&ouml;tzlich ein HTML-Befehl zur Darstellung von blinkendem Text auf, und sp&auml;ter wurde ein Befehl beliebt, mit dessen Hilfe sich die Schriftart, die Schriftgr&ouml;&szlig;e (in 7 relativen Stufen) und die Schriftfarbe bestimmen lassen. Doch all diese Implmentierungen in HTML sind letztlich St&uuml;ckwerk und inkonsequent.</p>

<p>An diesem Punkt setzen die Cascading Style Sheets (CSS) ein. Es handelt sich dabei um eine unmittelbare Erg&auml;nzungssprache, die extra f&uuml;r HTML entwickelt wurde. Sie klinkt sich nahtlos in HTML ein und erlaubt das beliebige Formatieren einzelner HTML-Elemente. Mit Hilfe von CSS Style-Sheets k&ouml;nnen Sie beispielsweise festlegen, da&szlig; alle &Uuml;berschriften 1. Ordnung 24 Punkt gro&szlig; sind, in roter Helvetica-Schrift, mit einem Nachabstand von 16 Punkt und mit einer gr&uuml;nen doppelten Rahmenlinie oberhalb dargestellt werden. Sie k&ouml;nnen aber genauso gut auch f&uuml;r einen beliebigen Text festlegen, da&szlig; nur dieser Text 3 Zentimeter gro&szlig; sein soll und eine gelbe Hintergrundfarbe erh&auml;lt. Daneben enth&auml;lt die CSS-Sprache auch Befehle zum punktgenauen Plazieren von Elementen am Bildschirm und f&uuml;r andere Ausgabemedien wie Druck oder Audio-Systeme. Durch die CSS Style-Sheets erf&auml;hrt HTML deshalb einen gewaltigen Vorw&auml;rtsschub.</p>


<p>Die CSS-Sprache ist genauso wie HTML eine offiziell normierte Sprache. Sie wird wie HTML vom W3-Konsortium gepflegt und weiterentwickelt. Mittlerweile interpretieren die neueren Browser-Versionen von Netscape und Microsoft die Style-Sheets auch.</p>


<p>Wegen der k&uuml;nftigen Bedeutung der CSS Style-Sheets wird diese Sprache innerhalb von SELFHTML ausf&uuml;hrlich dokumentiert. Lesen Sie dazu das Kapitel &uuml;ber <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="td.htm"><b>CSS Style-Sheets</b></a>. Mit Style-Sheets sollten Sie sich neben HTML auf jeden Fall besch&auml;ftigen.</p>





<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tbbb.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF><img src="x3.gif" width=15 height=10 border=0> <a href="tbbb.htm"><b>JavaScript</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tbaf.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tbaf.htm"><b>HTML-Versionen</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tb.htm"><b>Einf&uuml;hrung</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tbb.htm"><b>Erg&auml;nzungen und Alternativen zu HTML</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>