<html>
<head>
<title>SELFHTML: Einf&uuml;hrung /  Erg&auml;nzungen und Alternativen zu HTML / XML</title>
<meta name="description" content="(SELFHTML 7.0) XML als Definitionssprache f&uuml;r eigene Auszeichnungssprachen - einf&uuml;hrende Bemerkungen.">
<meta name="keywords" content="SELFHTML, XML">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tb.htm"><b>Einf&uuml;hrung</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tbb.htm"><b>Erg&auml;nzungen und Alternativen zu HTML</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>XML (Extensible Markup Language)</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Allgemeines zu XML</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Infos im WWW</b></a>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="a1">Allgemeines zu XML</a></h2>

<p>Stellen Sie sich vor, irgendjemand h&auml;tte irgendwann f&uuml;r ein weit verbreitetes Textverarbeitungsprogramm wie MS Word eine bestimmte Dokumentvorlage erstellt. Stellen Sie sich weiter vor, diese Dokumentvorlage w&uuml;rde sich irgendwie immer mehr verbreiten, jeder Word-Anwender h&auml;tte sie, und jeder Word-Anwender w&uuml;rde seine Dokumente fortan nur noch mit dieser einen Dokumentvorlage erstellen.</p>

<p>Genau das ist im grunde bei HTML der Fall. HTML ist eine Sprache, die mit Hilfe von SGML definiert wird und eine Reihe von festen Befehlen enth&auml;lt. Es ist zwar eine Sprache, die eigentlich alle wichtigen Befehle enth&auml;lt, die ein Web-Autor heute so braucht, doch es gibt keine M&ouml;glichkeit, einfach eigene Befehle zu erfinden.</p>

<p>Das ist der Unterschied zwischen HTML und XML. XML wird auch mit Hilfe von SGML, der Mutter aller Auszeichnungssprachen, definiert. Doch es ist keine &quot;SGML-Anwendung&quot;, so wie HTML, sondern ein &quot;SGML-Profil&quot;. Das ist eine Stufe abstrakter, man spricht dabei auch von &quot;generalized markup&quot;, also von &quot;verallgemeinerter Auszeichnung&quot;.</p>

<p>Mit Hilfe von XML k&ouml;nnen Sie eigene, neue Sprachen &quot;erfinden&quot;. Davon wird auch schon Gebrauch gemacht. Das Channel Definition Format (CDF), mit dessen Hilfe der MS Internet Explorer ab Version 4.x seine Channels, also abonnierbare Broadcasting-Dienste im WWW, verwaltet, ist beispielsweise eine Sprache, die mit Hilfe von XML definiert wurde.</p>

<p>Es ist jedoch bei XML nicht so, da&szlig; Sie einfach draufloslegen k&ouml;nnen und in einer neuen Datei einfach die Namen Ihrer Ex-Freund(innen) als Befehle verwenden k&ouml;nnen. XML selbst ist nur dazu da, um eigene Auszeichnungssprachen zu definieren. Eine solche eigene Auszeichnungssprache mu&szlig; bestimmte Grundkonventionen einhalten. Die Befehle der Sprache m&uuml;ssen nach einem vorgeschriebenen Schema in XML definiert werden. Dabei k&ouml;nnen Sie durchaus eigene Namen vergeben. So k&ouml;nnen Sie zum Beispiel Befehle schaffen, um Bereiche eines Dokuments als Lexikonartikel auszuzeichnen oder als geographische Ortsbezeichnung oder als Prozedurbeschreibung in einer Bedienungsanleitung. Sie m&uuml;ssen bei der Definition der Befehle jedoch exakt festlegen, welche Eigenschaften ein solcher Befehl hat, zum Beispiel, innerhalb welcher anderen Befehle der Sprache er vorkommen kann und innnerhalb welcher nicht.</p>

<p>Wenn Sie dann ein XML-Dokument mit der Definition einer eigenen Sprache erstellt haben, k&ouml;nnen Sie Dateien in der eigenen Sprache erstellen, die im Dateikopf mit Hilfe eines Bezugsbefehls angeben, zu welchem XML-Dokumenttyp sie geh&ouml;ren. Interpretierende Software kann Dateien in der entsprechenden Sprache nur interpretieren, wenn Sie zugleich auf den referenzierten XML-Dokumenttyp zugreifen kann. Denn nur dort erf&auml;hrt die Software, welche Regeln beim Interpretieren der abgeleiteten Sprache gelten. Das kann nat&uuml;rlich auch ein zentraler Zugriff im Internet oder in einem Intranet sein.</p>

<p>XML selbst ist wie HTML eine logische Sprache. Mit XML k&ouml;nnen Sie Befehle und deren grunds&auml;tzliche Eigenschaften definieren, aber Sie k&ouml;nnen nicht angeben, wie genau eine interpretierende Software einen Befehl bei der Darstellung formatieren soll. Dazu gibt es, genau wie bei HTML, eine erg&auml;nzende Style-Sheet-Sprache. Diese Sprache hei&szlig;t XSL (XML Style Language). XSL ist nicht so einfach wie die CSS Style-Sheets, aber daf&uuml;r noch leistungsf&auml;higer.</p>

<h3>Anwendungsbereiche</h3>

<p>F&uuml;r normales Homepage-Design ist XML relativ uninteressant. HTML und CSS sind daf&uuml;r l&auml;ngst zu leistungsf&auml;hig und angesichts ihrer Verbreitung kaum noch zu verdr&auml;ngen. Aber im professionellen Bereich gibt es gen&uuml;gend F&auml;lle, in denen XML eine bessere Wahl darstellt als HTML. Dazu geh&ouml;ren beispielsweise gro&szlig;e Dokumentationsprojekte, gro&szlig;e Werkeditionen oder Lexikonprojekte. Auch im Bereich der Datenbanken k&ouml;nnte XML eine interessante moderne Alternative zu herk&ouml;mmlichen Formaten wie etwa dem dBase-Format werden.</p>

<p>Das W3-Konsortium, da&szlig; sowohl f&uuml;r die Standardisierung von HTML als auch f&uuml;r die Standardisierung von XML verantwortlich ist, betont ausdr&uuml;cklich, das XML nicht als HTML-Nachfolger gedacht ist, sondern da&szlig; beide Sprachen parallel weiterentwickelt werden, um f&uuml;r die vielf&auml;ltigen Bed&uuml;rfnisse der modernen EDV moderne, software-unabh&auml;ngige Datenformate anzubieten.</p>

<p>HTML, so zeichnet sich dabei ab, wird die Brot-und-Butter-Sprache f&uuml;r alle einfachen, unabh&auml;ngigen Dokumente und Hypertext-Projekte sein. XML wird die Sprache f&uuml;r den speziellen Bedarf und f&uuml;r zusammenh&auml;ngende Projekte werden. So kann XML beispielsweise besser als HTML dazu beitragen, in gro&szlig;en Firmen oder Organisationen das hauseigene Corporate Design konsequenter einzuhalten, weil sich mit Hilfe von XML eben eine eigene &quot;Corporate-Language&quot; definieren l&auml;&szlig;t.</p>

<h3>Hinweis</h3>

<p>Der Autor der vorliegenden Dokumentation hat durchaus vor, sich auch mit XML zu besch&auml;ftigen und daraus bei gr&ouml;&szlig;erem Interesse wieder eine Dokumentation zu machen. Wann und in welcher Form diese Dokumentation Wirklichkeit wird, ist zur Zeit aber noch nicht absehbar.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2">Infos im WWW</a></h2>


<p><img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.w3.org/TR/REC-xml"><b>XML 1.0</b></a><br>
Offizielle Spezifikation des W3-Konsortiums</p>

<p><img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.sil.org/sgml/xml.html"><b>Extensible Markup Language (XML)</b></a><br>
&Uuml;bersichts- und Einstiegsseite zum Thema mit vielen Verweisen</p>

<p><img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://webreview.com/xml/"><b>XML Reference Guide</b></a><br>
XML-Dokumentation auf den Seiten von WebReview</p>

<p><img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.microsoft.com/xml/default.htm"><b>Microsoft &amp; XML</b></a><br>
Einstiegsseite f&uuml;r die Pl&auml;ne, wie von Microsoft XML integrieren will</p>

<p><img src="xdeu.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://members.aol.com/xmldoku/"><b>XML-Dokumentation</b></a><br>
Verst&auml;ndliche Einf&uuml;hrung ins Thema</p>








<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tbbh.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF><img src="x3.gif" width=15 height=10 border=0> <a href="tbbh.htm"><b>Plugins (beliebige Browser-Erweiterungen)</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tbbf.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tbbf.htm"><b>VRML (Virtual Reality Modeling Language)</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tb.htm"><b>Einf&uuml;hrung</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tbb.htm"><b>Erg&auml;nzungen und Alternativen zu HTML</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>