<html>
<head>
<title>SELFHTML: Einf&uuml;hrung /  Bemerkungen / HTML ist Hypertext</title>
<meta name="description" content="(SELFHTML 7.0) Was Sie sich hinter die Ohren schreiben sollten, wenn Sie HTML einsetzen.">
<meta name="keywords" content="SELFHTML, HTML, Hypertext">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tb.htm"><b>Einf&uuml;hrung</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tbd.htm"><b>Pers&ouml;nliche Bemerkungen</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>HTML ist Hypertext</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Hypertext</b></a><br>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="a1">Hypertext</a></h2>

<p>Das <b>HT</b> in <b>HTML</b> steht f&uuml;r &quot;Hypertext&quot;. Wenn Sie HTML-Dateien selbst erstellen wollen, sollten Sie sich ruhig mal Gedanken dar&uuml;ber machen, warum die Sprache, mit der Sie da arbeiten, eigentlich so hei&szlig;t wie sie hei&szlig;t.</p>

<h3>Wirklichkeit, Medien, Bewegung, Komplexit&auml;t</h3>

<table align=left width=50% bgcolor=#EEEEEE style="margin-right:10px"><tr><td>
<p><i>Das Medium &quot;Buch&quot; mit der linearen Anordnung eines in diesem Falle zirka 1,9 Kilometer langen Buchstaben-Bandwurms ist, wie letztlich die Sprache &uuml;berhaupt, nur bedingt geeignet f&uuml;r das Thema, das ich mir hier vorgenommen habe. Der Versuch, ein Gesamtbild der vernetzten Wirklichkeit zu geben, die eigentlich nur simultan erfa&szlig;t werden kann, mu&szlig; daher zwangsl&auml;ufig unvollkommen bleiben.</i></p>
<p>aus: Frederic Vester, Das Neuland des Denkens</p>
</td></tr></table>
<p>Das simultane Erfassen der gesamten <b>Wirklichkeit</b> ist dem Menschen im normalen Zustand wohl nicht m&ouml;glich. Solange er begreifen will, wie die Wirklichkeit funktioniert, mu&szlig; er die Wirklichkeit erforschen, sei es wissenschaftlich methodisch oder einfach nur allt&auml;glich durch Erfahrung.</p>

<p>Die daraus gewonnenen Ergebnisse sind nat&uuml;rlich ziemlich umfangreich. Deshalb machen die Menschen auch viel von der M&ouml;glichkeit Gebrauch, einmal gewonnene Ergebnisse mit Hilfe von <b>Medien</b> an andere Menschen weiterzugeben. Vieles, was in unseren K&ouml;pfen drin ist, haben wir nicht selbst entdeckt oder erfahren, sondern es ist uns durch Medien vermittelt worden.</p>

<p>Damit der Mensch Informationen, die ihm durch Medien vermittelt werden, verarbeiten kann, mu&szlig; er sich in den vermittelten Inhalten <b>bewegen</b> k&ouml;nnen. Denn genausowenig, wie sich die Wirklichkeit simultan erfassen l&auml;&szlig;t, l&auml;&szlig;t sich die durch Medien vermittelte Information auf einen Schlag erfassen. Ein brauchbares Medium mu&szlig; Information deshalb irgendwie so vermitteln, da&szlig; man sich darin bewegen kann, sich die pers&ouml;nlich erforderliche Zeit nehmen kann, um die Information zu verarbeiten (weshalb, nebenbei bemerkt, etwa das Fernsehen ein unglaublich mieses Medium ist, weil es dem Menschen eine bestimmte Verarbeitungszeit aufzwingt, die er meistens nicht erreicht). Die einfachste Form des Bewegens ist die Bewegung in eine vorgegebene Richtung: &quot;immer geradeaus&quot;. Diesem Prinzip folgt das Medium Buch. Ein Buch besteht zwar aus einzelnen Seiten, aber in Wirklichkeit ist es nur eine neuere Form der alten Papyrus-Rollen. Die Buchseiten sind dazu gedacht, der Reihe nach gelesen zu werden.</p>

<p>Hypertext, ein neues Medium, das erst durch Computer sinnvoll nutzbar wird, ist dagegen Bewegen in mehrere Richtungen. Oberfl&auml;chlich gesehen kindischer: mehr Herumh&uuml;pfen und Ausprobieren. Andersherum gesehen aber n&auml;her an dem Versuch, der <b>Komplexit&auml;t</b> der Wirklichkeit gerecht zu werden. Hypertext tut nicht mehr so, als ob die Wirklichkeit einen Anfang und ein Ende oder ein Oben und Unten habe. Die Wirklichkeit, so wissen wir heute, hat zwar jede Menge Strukturen und Ordnungsgef&uuml;ge, aber sie l&auml;&szlig;t sich nicht von vorne bis hinten beschreiben. Deshalb ist es nur konsequent, wenn auch die Medien sich ver&auml;ndern. Hypertext ist letztlich die ad&auml;quate Ausdrucksform eines Bewu&szlig;tseins, da&szlig; sich von der jahrhundertelangen Zwangsvorstellung befreit hat, die Welt in ein System zu pressen.</p>


<h3>Navigation und Vernetzung</h3>

<p>Als Hypertext-Anwender sollen Sie nicht mehr sklavisch einem bestimmten Lesepfad folgen, sondern Sie sollen spontan ausw&auml;hlen, was Sie lesen m&ouml;chten. Au&szlig;erdem sollen Sie sich jederzeit neu orientieren k&ouml;nnen und von einzelnen Informationseinheiten zu verwandten oder das Thema vertiefenden Informationseinheiten springen k&ouml;nnen. Ein guter Hypertext hat die Aufgabe, Ihnen als Anwender all das zu bieten: eine nachvollziehbare Navigationsstruktur, eine Aufteilung der Information in &uuml;berschaubare, in sich abgeschlossene Informationseinheiten und eine intelligente Vernetzung der Informationseinheiten durch Verweise (Hyperlinks). Dazu m&uuml;ssen sowohl die Hypertext-Autoren als auch die Browser-Hersteller mitwirken. Ein Hypertext-Autor mu&szlig; projektspezifisch eine angemessene Navigationsstruktur zur Verf&uuml;gung stellen, und die benutzte Hypertext-Software, der Browser, mu&szlig; Funktionen enthalten, die das Navigieren erleichtern, etwa Bookmark-Funktionen, History-Funktionen usw.</p>

<h3>Hypertext ist nichts Neues</h3>

<p>Nat&uuml;rlich gibt es Textsorten, bei denen ein Aufsplitten des Gesamttextes in kleine Einheiten mit anschlie&szlig;ender Vernetzung keinen Sinn macht. Einen Abenteuerroman etwa m&ouml;chte man lieber von vorn bis hinten lesen, und eigentlich auch gar nicht an einem heute &uuml;blichen Bildschirm. Aber bei jeder Art von Sachtext ist Hypertext eine sinnvolle Alternative zum herk&ouml;mmlichen Buchmedium. Denn Sachb&uuml;cher enthalten eigentlich alles, was ein Hypertext auch braucht: Kapitel, Abschnitte, Inhaltsverzeichnis, Stichwortverzeichnis, Querverweise. Das Problem ist nur, da&szlig; niemand Lust hat, in einem Buch dauernd von einer Stelle zu einer ganz anderen zu springen, weil das Suchen und Bl&auml;ttern dann so viel Energie in Anspruch nimmt, da&szlig; die Konzentration leidet. Der &uuml;bliche Weg, ein solches Buch zu lesen, bleibt daher das Lesen Seite f&uuml;r Seite. Anders bei den anklickbaren Verweisen eines Hypertextes: hier k&ouml;nnen Sie, je nachdem, wie gut die Navigationsstrukturen sind, ebenfalls seitenweise durch die angebotenen Informationseinheiten bl&auml;ttern. Gleichzeitig ist es jedoch viel einfacher, sich neu zu orientieren oder Querverweisen zu folgen. Denn an die Stelle des Bl&auml;tterns tritt reine Rechenzeit.</p>

<h3>Hypertext und weltweite Vernetzung</h3>

<p>Noch deutlicher werden die Unterschiede, wenn man ein Buch mit weltweitem Online-Hypertext wie dem World Wide Web vergleicht. Viele B&uuml;cher enthalten Verzeichnisse mit weiterf&uuml;hrender Literatur. Wenn Sie sich f&uuml;r eines der anderen B&uuml;cher interessieren, m&uuml;ssen Sie das Buch kaufen gehen  oder in eine Bibliothek rennen und m&ouml;glicherweise wochenlang auf eine Fernleihe warten. Beim Klick auf einen Verweis kommen Sie sofort an die gew&uuml;nschte Information, auch wenn diese auf einem Internet-Hostrechner liegt, der viele tausend Kilometer weit von Ihnen entfernt ist. Sie bekommen die Information in dem Moment, wo Sie sich daf&uuml;r interessieren. Das ist ein &quot;intellektueller Mehrwert&quot;, dessen Tragweite noch gar nicht recht erkannt worden ist.</p>

<h3>Hypertext ist mehr als Text</h3>

<p>Moderne Computer-Anwender wollen allerdings noch mehr als nur auf Hyperlinks klicken. Sie wollen auch keine ellenlangen Texte lesen. Informationsdarstellung am Bildschirm mu&szlig; auch noch andere Darstellungsformen bieten als es in B&uuml;chern &uuml;blich ist. Anwender, die mit einem Computer in einem Informationsangebot navigieren, wollen sich etwa Information individuell auf einer Seite zusammenstellen, um beispielsweise Angebote miteinander zu vergleichen. Wenn etwas erkl&auml;rt wird, wollen sie auf Wunsch eine grafische oder akustische Animation aufrufen, die Zusammenh&auml;nge oder Vorgehensweisen demonstriert. Oder sie wollen einfach eine Runde spielen, sei es zur Entspannung oder um &quot;spielend&quot; etwas zu lernen. Es spricht nichts dagegen, auch solche Dinge unter dem Begriff &quot;Hypertext&quot; zusammenzufassen. Insofern sind auch neuere Techniken wie Dynamisches HTML in Verbindung mit Scriptsprachen waschechte Hypertext-Features.</p>

<h3>Medienumbr&uuml;che tun weh</h3>

<p>Medien haben viel mit Gewohnheit zu tun. An B&uuml;cher sind wir alle gew&ouml;hnt, von fr&uuml;hesten Kindertagen an sind wir mit Bilderb&uuml;chern konfrontiert worden, in der Schule hatten wir Schulb&uuml;cher. Deshalb reagiert die Mehrheit der Menschen mit heftigem Widerstand, wenn man ihnen erz&auml;hlen will, da&szlig; elektronischer und weltweit vernetzter Hypertext in vielen Bereichen das Zeug hat, B&uuml;cher zu ersetzen.</p>

<p>Es hat wohl auch wenig Sinn, zu predigen - aus dem Predigerzeitalter sind wir n&auml;mlich auch raus. Wer sich f&uuml;r das neue Medium, f&uuml;r Hypertext, begeistern kann, und wer Lust hat, in diesem Medium Information weiterzugeben, sollte dies aber ber&uuml;cksichtigen: nur wenn die eigenen Hypertext-Projekte so gut, so praktisch sind, da&szlig; man schon verbohrt sein mu&szlig;, um sich ihnen zu verweigern - nur so kann sich Hypertext leichter durchsetzen. HTML und seine Erg&auml;nzungssprachen sind das interessanteste Werkzeug, das wir derzeit f&uuml;r diese Zwecke haben.</p>

<p>Weitere Informationen zum Thema Hypertext und HTML finden Sie im Abschnitt <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcah.htm"><b>Informationsverteilung und Dateiorganisation</b></a>.</p>



<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tbdb.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF><img src="x3.gif" width=15 height=10 border=0> <a href="tbdb.htm"><b>Das Logische, das Physische und das Dynamische</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tbcf.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tbcf.htm"><b>FTP-Programme</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tb.htm"><b>Einf&uuml;hrung</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tbd.htm"><b>Pers&ouml;nliche Bemerkungen</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>



</body>
</html>