<html>
<head>
<title>SELFHTML: Einf&uuml;hrung /  Bemerkungen / Das Logische, das Physische und das Dynamische</title>
<meta name="description" content="(SELFHTML 7.0) Der Trinit&auml;tsgedanke in Sachen Web-Publishing.">
<meta name="keywords" content="SELFHTML, HTML, Logik, Physis, Dynamik">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tb.htm"><b>Einf&uuml;hrung</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tbd.htm"><b>Pers&ouml;nliche Bemerkungen</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Das Logische, das Physische und das Dynamische</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>HTML, CSS und JavaScript</b></a><br>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="a1">HTML, CSS und JavaScript</a></h2>

<p>Am Anfang war HTML - und deshalb ist es zur Gewohnheit geworden, Web-Publishing im wesentlichen mit der Beherrschung der HTML-Sprache gleichzusetzen.</p>

<p>Doch mittlerweile sind einfach viel zu viele W&uuml;nsche ge&auml;u&szlig;ert worden, die HTML nicht befriedigen kann. Es stellte sich heraus, da&szlig; HTML eine wichtige Basis ist, aber keine Allround-L&ouml;sung. So ist beispielsweise eine &Uuml;berschrift 1. Ordnung in HTML schnell notiert, aber wie zum Teufel sagt man dem Browser, da&szlig; er die &Uuml;berschrift in einer anderen als der voreingestellten Schrift darstellen und bittesch&ouml;n etwas mehr Abstand zum Text davor lassen soll? Und warum kann man in HTML zwar eine Grafik einbinden, aber nicht bewirken, da&szlig; diese sich optisch ver&auml;ndert, wenn der Anwender mit der Maus dar&uuml;ber f&auml;hrt.</p>

<h3>Nur logisch, nur statisch</h3>

<p>Kleinigkeiten sind das, wenn Sie so wollen. Aber versuchen Sie es mal so zu sehen: HTML hat zwei charakteristische Eigenschaften, die zugleich Defizite darstellen. HTML ist erstens eine logische Sprache und keine Formatiersprache, und zweitens ist HTML eine statische Auszeichnungssprache und keine Programmiersprache, in der man Abl&auml;ufe oder Interaktionen mit dem Anwender programmieren kann. Mit HTML kann man Dokumentstrukturen, also Elemente wie &Uuml;berschriften, Abs&auml;tze, Listen, Tabellen, Grafikreferenzen oder Formulare definieren. Aber man kann weder genau angeben, wie diese Elemente genau aussehen und wie genau sie positioniert werden sollen, noch kann man angeben, wie sich diese Elemente etwa durch Anwenderereignisse wie Mausaktionen ver&auml;ndern k&ouml;nnen.</p>

<p>Genau das sind aber Probleme, mit denen viele aktive Anwender, die selbst Web-Seiten erstellen wollen, zu k&auml;mpfen haben. Web-Seiten, die in  kreativen K&ouml;pfen vor dem inneren Auge entstehen, bestehen nicht nur aus Strukturen, sondern auch aus Farben und Formen, aus Elementen, die sich bewegen, und aus Dingen, die durch Interaktion mit dem Anwender passieren. Solche W&uuml;nsche m&uuml;ssen auf die Dauer befriedigt werden, wenn HTML nicht wieder ins Abseits der EDV-Geschichte geraten will.</p>

<h3>Weiter auf der Klartext-Schiene</h3>

<p>Bevor Technologien wie ActiveX oder auch Java-basierte L&ouml;sungen, die nur noch Programmierern zug&auml;nglich sind, zum Standard f&uuml;r Web-Seiten werden, ist es besser, Sprachen &auml;hnlich wie HTML zu entwickeln, die kein Geheimnis aus ihrem Quelltext machen und gerade durch die &quot;Abguckm&ouml;glichkeit&quot; zur weltweiten Know-How-Verbreitung beitragen. Denn nur durch die Verbreitung des Know-Hows sind unabh&auml;ngige Sprachen wie HTML die heute einzige ernstzunehmende Alternative zu firmenspezifischen L&ouml;sungen von Gro&szlig;konzernen wie Microsoft.</p>

<p>Mittlerweile zeichnen sich entsprechende L&ouml;sungen auch ab. Wichtig ist jetzt nur, da&szlig; sie auch zum Einsatz kommen.</p>

<h3>Die physische Erg&auml;nzung</h3>

<p>Diese Erg&auml;nzung zu HTML ist mittlerweile etabliert und standardisiert: mit Hilfe der CSS Style-Sheets k&ouml;nnen Sie HTML-Elementen sagen, wie diese genau auszusehen haben. Der Erg&auml;nzungseffekt, den die CSS-Sprache leistet, kann gar nicht untersch&auml;tzt werden: erst dadurch wird HTML &quot;erwachsen&quot; und befreit sich aus dem permanenten Gestaltungsnotstand, den es unter Web-Designern lange Zeit verursachte. Erst durch die CSS Style-Sheets kann HTML ernsthaft mit herk&ouml;mmlichen Textverarbeitungs- und DTP-Formaten konkurrieren.</p>

<h3>Die dynamische Erg&auml;nzung</h3>

<p>Die Ehre der Erfindung einer Programmiersprache, die sich direkt in HTML einbinden l&auml;&szlig;t und es erlaubt, Web-Seiten zu kontrollieren und w&auml;hrend der Anzeige zu ver&auml;ndern, geb&uuml;hrt Netscape. Mit der Version 2.0 des Netscape-Browsers kam JavaScript auf den Markt. Leider hat es Netscape jedoch vers&auml;umt, die Sprache fr&uuml;hzeitig auf alle Elemente einer HTML-Datei anwendbar zu machen. Genau das aber ist der einzige Sinn und Zweck einer solchen Sprache. Mittlerweile ist dies erkannt worden. Noch gibt es viele Probleme mit dem Erstellen echter dynamischer Web-Seiten, doch es zeichnet sich ab, da&szlig; es auch daf&uuml;r bald einen Standard geben wird.</p>


<h3>Parallelen</h3>

<p>Wenn Sie Hegel kennen oder den Trinit&auml;tsgedanken der christlichen Lehre verinnerlicht haben, werden Sie feststellen, da&szlig; es Parallelen zu dem Dreigestirn aus HTML, CSS und Scriptsprachen gibt. Falls Sie sich nicht trauen, diese Parallelen anzuerkennen, dann trauen Sie sich doch einfach mal! Das ist keine Abwertung abendl&auml;ndischer Werte, sondern eine moderne Form, sich mit Archetypen des Denkens auseinanderzusetzen. Denn was zur Zeit in der ganzen Hektik rund um k&uuml;nftige Standards des Web-Publishings passiert, l&auml;&szlig;t sich durchaus mit &quot;alten Gedanken&quot; in Verbindung bringen. Das, was wir uns vorstellen, was dann noch fehlt und was wir uns schlie&szlig;lich als das Perfekte w&uuml;nschen, folgt nun mal immer den gleichen Grundmustern.</p>



<br clear=all>
<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tbdc.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF><img src="x3.gif" width=15 height=10 border=0> <a href="tbdc.htm"><b>Web-KnowHow und Karriere</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tbda.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tbda.htm"><b>HTML ist Hypertext</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tb.htm"><b>Einf&uuml;hrung</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tbd.htm"><b>Pers&ouml;nliche Bemerkungen</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>