<html>
<head>
<title>SELFHTML: Einf&uuml;hrung /  Bemerkungen / Web-Know-How und Karriere</title>
<meta name="description" content="(SELFHTML 7.0) &Uuml;ber Web-Designer, Provider, Genies und Scharlatane.">
<meta name="keywords" content="SELFHTML, Web-Designer, Provider, Beruf">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tb.htm"><b>Einf&uuml;hrung</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tbd.htm"><b>Pers&ouml;nliche Bemerkungen</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Web-Know-How und Karriere</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Kommerzielles Publizieren in neuen Medien</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Leben und leben lassen</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>Erfolg und Mi&szlig;erfolg</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a4"><b>Infos im WWW</b></a>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="a1">Kommerzielles Publizieren in neuen Medien</a></h2>

<p>Viele Firmen, die einen professionellen &quot;Auftritt&quot; im World Wide Web brauchen, wenden sich erst mal an Werbeagenturen, weil sie das schon immer so gemacht haben, wenn es um Firmenpr&auml;sentation ging. Nichts gegen Werbeagenturen - aber die verstehen meistens das neue Medium WWW nicht. Perfekte Grafik, auch das n&ouml;tige Know-How in HTML und Erg&auml;nzungssprachen ist zwar meistens vorhanden. Aber was fehlt, ist eine Beratung, welche Inhalte f&uuml;r das WWW geeignet sind, und wie man die Seiten sinnvollerweise strukturieren k&ouml;nnte. Kein Wunder, denn das sind Aufgaben, die nicht in das Metier der Werbegrafiker geh&ouml;ren.</p>

<p>&quot;Web-Design&quot; - der Oberbegriff f&uuml;r das Publizieren im WWW, umfa&szlig;t Layout-Design einerseits, aber auch Content-Design, Navigations-Design, Hypertext-Design und Applikations-Design. F&uuml;r eine private Homepage reicht es aus, was der Ersteller kann und f&uuml;r gut und richtig befindet. Aber wenn man sich das Chaos auf den Web-Seiten mancher Firmen ansieht, kann man nur mit dem Kopf sch&uuml;tteln. Da arbeiten h&auml;ufig einzelne Abteilungen gegeneinander, setzen unterschiedliche Mitarbeiter oder Agenturen f&uuml;r die Seitenerstellung ein und haben nur das Ziel, sich selber zu profilieren. Der Dumme ist der Anwender, der diese Hintergr&uuml;nde nicht kennt und sich einfach sich auf einem solchen Server zurechtfinden und gezielt nach Informationen suchen will.</p>

<p>Das Problem liegt auch darin, da&szlig; viele Dienstleistungsanbieter nicht bereit sind zuzugeben, da&szlig; Sie nur einen Teil des Spektrums abdecken k&ouml;nnen. Hier m&uuml;ssen alle Beteiligten ehrlicher sein. Und Firmen, die gro&szlig;e, umfangreiche Web-Projekte anbieten wollen, tun gut daran, sogenannte &quot;Development Partnerships&quot; ins Leben zu rufen, also koordiniertes Einsetzen von Know-How-Tr&auml;gern aus den verschiedenen Bereichen, die es unter einen Hut zu bringen gilt: Redakteure, Grafiker, Programmierer.</p>

<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2">Leben und leben lassen</a></h2>

<p>Als Einzelk&auml;mpfer hat man es mittlerweile schwer, sich als Rundum-Anbieter im Bereich Web-Publishing erfolgreich zu verkaufen. Denn eine Einzelperson kann kaum noch genug Know-How und Zeitkapazit&auml;t aufbringen, um lukrative Web-Projekte im Alleingang auf die Beine zu stellen. Es ist zwar kein Problem, als &quot;Freelancer&quot; im Bereich des Web-Publishings zu arbeiten. Doch als Einzelperson sollte man weniger versuchen, direkt an Auftr&auml;ge von &quot;gro&szlig;en&quot; Auftraggebern heranzukommen, die Web-Seiten brauchen, sondern eher, als Sub-Unternehmer f&uuml;r Agenturen zu arbeiten, die solche Auftr&auml;ge in der Regel erhalten.</p>

<p>Wer selbst eine Agentur f&uuml;r Web-Design gr&uuml;nden will, braucht &uuml;berdurchschnittliche Mitarbeiter. Die bekommt er einerseits nur, wenn er gute Auftr&auml;ge an Land zieht, so da&szlig; er die Mitarbeiter angemessen zahlen kann. Andererseits mu&szlig; er bedenken, da&szlig; in diesem jungen Marktsegment Individualisten dominieren. Mit althergebrachten unternehmerischen F&uuml;r-Dumm-Verkaufungsstrategien ist hier nichts mehr zu holen. Wer in diesem Bereich als Arbeitnehmer anheuert, ist selten ein Gewerkschaftsmitglied, aber daf&uuml;r jemand mit eigenen Ideen und eigenem Kopf. Und das ist f&uuml;r althergebrachtes Unternehmerdenken viel gef&auml;hrlicher als die &uuml;blichen Forderungen der Gewerkschaften.</p>

<p>Kurzum: das neue Medium f&ouml;rdert auch neue Formen von Arbeitsverh&auml;ltnissen. Springen Sie einfach mal &uuml;ber Ihren Schatten - sei es aus arbeitgeberischer oder aus arbeitnehmerischer Sicht. Verkriechen Sie sich nicht mehr hinter Positionen. Arbeiten Sie als Arbeitnehmer auch mal umsonst, und schenken Sie als Unternehmer denen, die so etwas tun, auch mal ungew&ouml;hnliche Freiheiten. Leben und leben lassen. Neues Medium, neue Hoffnungen. Sie k&ouml;nnen das alles f&uuml;r Spinnerei halten, aber untersch&auml;tzen Sie nicht, wie viel Erstaunliches sich in diesem Marktsegement tut, das in keine der Kategorien pa&szlig;t, von denen die Tretm&uuml;hlen der Massenmedien immer wieder berichten.</p>


<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a3">Erfolg und Mi&szlig;erfolg</a></h2>

<p>Nicht wenige junge Menschen saugen Dokumentationen wie diese hier in sich hinein, nat&uuml;rlich nur das, was sie gerade brauchen, basteln ein paar Wochen lang wild an Ihrer Homepage herum und versuchen anschlie&szlig;end sofort, als Web-Designer, oder, viel schlimmer noch, als Provider ihre Dienste anzupreisen. Dann schreiben sie verzweifelte bis wichtigtuerische E-Mails an den Autor dieser Dokumentation mit Fragen von der Sorte, wie man in HTML einen Pa&szlig;wortschutz programmiert oder in Java einen Firewall einrichtet. Nein, so funktioniert das nicht, so ist Mi&szlig;erfolg vorprogrammiert.</p>

<p>Bevor Sie nicht alle grunds&auml;tzlichen Zusammenh&auml;nge verstanden haben, nicht zwischen Client und Server, zwischen den Aufgaben von HTML, JavaScript, Java, Server-Typen und Server-Schnittstellen wie CGI unterscheiden k&ouml;nnen, hat es keinen Sinn, eigene Dienste anzupreisen. Erfolg stellt sich dann ein, wenn Sie bestimmte Bereiche wirklich beherrschen und dadurch in Vorbesprechungen zu Auftr&auml;gen auch kompetente Aussagen machen k&ouml;nnen. Dazu geh&ouml;ren auch mal Aussagen wie  &quot;geht so nicht&quot; oder &quot;geht, kann ich Ihnen aber nicht anbieten&quot;.</p>

<p>Um solche Aussagen machen zu k&ouml;nnen, m&uuml;ssen Sie nat&uuml;rlich erst mal wissen, was Sie tats&auml;chlich anbieten k&ouml;nnen und was nicht, und mit welchen Mitteln Kundenw&uuml;nsche &uuml;berhaupt realisierbar sind. Solches Know-How erreichen Sie nicht in zwei Wochen. Lassen Sie sich da nicht von schnellen Lernerfolgen in HTML t&auml;uschen.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a4">Infos im WWW</a></h2>

<p><img src="xdeu.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.dmmv.de/"><b>Deutscher Multimedia Verband (DMMV)</b></a><br>
Multimedia-Lobby</p>

<p><img src="xdeu.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.dmmv.de/pgs/awbildadr.htm"><b>Ausbildungs&uuml;bersicht</b></a><br>
Adressen von Weiterbildungsinstituten im Bereich EDV/Neue Medien</p>

<p><img src="xdeu.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.multimedia.de/"><b>Multimedia.de</b></a><br>
Sammelstelle f&uuml;r neue Medien</p>

<p><img src="xdeu.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.dino-online.de/stellen.html"><b>Internet-Stellenm&auml;rkte</b></a><br>
Verweis-Seite von DINO-Online</p>

<p><img src="xdeu.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.jobs.zeit.de/edv.html"><b>Multimedia- und EDV-Stellenm&auml;rkte</b></a><br>
Verweis-Seite der ZEIT</p>

<p><img src="xdeu.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.1ateam.com/"><b>1ATeam</b></a><br>
Pool freier und selbst&auml;ndiger Web-Autoren, Beitritt m&ouml;glich</p>


<p><img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.hwg.org/"><b>HTML Writer's Guild</b></a><br>
Internationale Lobby der Web-Autoren</p>




<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tbdd.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF><img src="x3.gif" width=15 height=10 border=0> <a href="tbdd.htm"><b>Offene Standard-Formate gegen Firmenformate</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tbdb.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tbdb.htm"><b>Das Logische, das Physische und das Dynamische</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tb.htm"><b>Einf&uuml;hrung</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tbd.htm"><b>Pers&ouml;nliche Bemerkungen</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>