<html>
<head>
<title>SELFHTML: Einf&uuml;hrung /  Bemerkungen / Offene Standard-Formate gegen Firmenformate</title>
<meta name="description" content="(SELFHTML 7.0) Warum offene, standardisierte Klartextformate so viel wichtiger sind als jede Art von Software mit propriet&auml;ren Dateiformaten.">
<meta name="keywords" content="SELFHTML, Software, Standards">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tb.htm"><b>Einf&uuml;hrung</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tbd.htm"><b>Pers&ouml;nliche Bemerkungen</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Offene Standard-Formate gegen Firmenformate</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Ein Pl&auml;doyer f&uuml;r software-unabh&auml;ngige Klartextformate</b></a>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="a1">Ein Pl&auml;doyer f&uuml;r software-unabh&auml;ngige Klartextformate</a></h2>

<img src="xdforms.gif" width=218 height=700 alt="Dateiformate" align=left border=0 style="margin-right:15px"><p>Ganz fr&uuml;her, in der Zeit, bevor die PCs aufkamen, gab es in der EDV eigentlich nur Individual-Software, also Software, die f&uuml;r einen bestimmten Nutzer und einen bestimmten Zweck geschrieben war. F&uuml;r die Daten, die man mit einer solchen Software verwalten konnte, dachten sich die Programmierer eigene Dateiformate aus. Das funktionierte prima - bis der Programmierer pl&ouml;tzlich nach Australien auswanderte. Dann war die Katastrophe oft da. Niemand war in der Lage, die Software und das zugeh&ouml;rige Datenformat weiterzupflegen. Neu angeheuerte Programmierer mu&szlig;ten oft mit unendlicher M&uuml;he versuchen, hinter die Quellcodes ihrer Vorg&auml;nger zu steigen.</p>

<p>Mit den PCs kam eine neue Art Software auf - die Standardsoftware. Das war wie der &Uuml;bergang von geschneiderter Kleidung zu Kleidung von der Stange. Zwar hatte jedes dieser Softwareprodukte ein eigenes Dateiformat, doch es wurde als gro&szlig;er Fortschritt empfunden, Daten mit anderen Leuten austauschen zu k&ouml;nnen, die die gleiche Software besa&szlig;en. Mit Textverarbeitungsprogrammen wie MS Word fing es an, in der Macintosh-Welt setzten sich vor allem DTP- und Grafikprogramme durch. Andere Typen von Standard-Software f&uuml;r Datenbanken und Tabellenkalkulation kamen im Laufe der Zeit hinzu.</p>

<p>Die Entwicklung geht jedoch weiter. Im Internet, wo viele unterschiedliche Rechner verkehren, lernten die beteiligten Anwender schon fr&uuml;h, sich auf gemeinsame, software-unabh&auml;ngige Standards zu einigen. Eine &quot;Erfindung&quot; wie HTML pa&szlig;te deshalb ganz folgerichtig in die Bedingungen der vernetzten Rechnerwelt. Mit dem Vordringen des Internets in den Bereich der Heim- und Arbeitsplatz-Computer gelangen solche software-unabh&auml;ngigen Dateiformate heute immer mehr ins Bewu&szlig;tsein der Anwender.</p>

<p>Derzeit str&auml;uben sich noch viele Anwender, auf solche neuen, unabh&auml;ngigen Dateiformate zu setzen. Schlie&szlig;lich hat man sich so sch&ouml;n gew&ouml;hnt an die allj&auml;hrlich neuen Word- und Excel-Versionen. Es gab keine Diskussionen, welche Software man f&uuml;r die entsprechenden Dateitypen verwenden sollte, und die Software beherrschte ihr eigenes Dateiformat perfekt. Man brauchte nur den Umgang mit der Software erlernen, und dann konnte man arbeiten.</p>

<p>Aber ganz so einfach ist es eben doch nicht. Man mu&szlig;te sich oft in neue Software-Versionen einarbeiten, und h&auml;ufig genug mu&szlig;ten Daten von einer Software in eine andere &uuml;bertragen werden, und es wurden im Gro&szlig;en gesehen viele, viele Mannjahre investiert, um von Zeit zu Zeit gro&szlig;e Datenbest&auml;nde in ein neueres, besseres Software-Produkt zu konvertieren, mit all der meistens erforderlichen h&auml;ndischen Nachbearbeitung. Software-Firmen, die einst f&uuml;hrende Produkte herstellten, verschwanden in der Versenkung, es gab keine Produkt-Updates und keinen ordentlichen Support mehr. Fast jeder, der gro&szlig;e Datenbest&auml;nde pflegt, mu&szlig;te schon ein oder mehrere Male die leidvolle Erfahrung machen, was es bedeutet, auf eine bestimmte Software gesetzt zu haben.</p>

<p>Denn glauben Sie ja nicht, die Tageb&uuml;cher, die Sie heute mit MS Word, QuarkExpress oder Lotus WordPro erstellen, k&ouml;nnen Sie in 15 Jahren noch elektronisch lesen! Bis dahin wird es ganz andere Betriebssysteme geben, und die Wahrscheinlichkeit, da&szlig; es keine R&uuml;ckw&auml;rtskompatibilit&auml;t mehr gibt, ist mehr als wahrscheinlich. Selbst wenn Sie sagen: &quot;ich brauche ja kein neues Betriebssystem&quot; - vergessen Sie das. In ein paar Jahren ist Ihr PC kaputt, dann brauchen Sie einen neuen, und die alten Modelle, auf denen Ihre Software l&auml;uft, wird es nicht mehr geben.</p>

<p>An dieser Stelle setzen die neuen, aus dem Internet kommenden, standardisierten Sprachen an, wie HTML und CSS oder XML und XLS. Sie sind allesamt nicht nur plattformunabh&auml;ngig, sondern auch software-unabh&auml;ngig. Der Grund ist, da&szlig; es alles Klartextsprachen sind. Dateien in diesen Sprachen enthalten keine Steuerzeichen, es gibt keine Dateibereiche, die bin&auml;r interpretiert werden m&uuml;ssen, keine block-orientierten Formate usw. Klartextsprachen sind so ersonnen, da&szlig; sowohl Computer als auch Menschen mit ihren Befehlen klarkommen k&ouml;nnen. Zum Editieren solcher Sprachen kann jeder noch so einfache, reine Texteditor herhalten.</p>

<p>Nat&uuml;rlich kann es in der fortgeschrittenen EDV-Welt keine L&ouml;sung sein, seine Daten jetzt pl&ouml;tzlich wieder mit einem Programm wie dem Windows Notepad-Editor zu bearbeiten. Das ist modernen Anwendern nicht zumutbar. Die Software-Schmieden basteln deshalb ja auch eifrig an Programmen, die das Editieren der neuen, unabh&auml;ngigen Dateiformate dem modernen Arbeitsstil anpassen sollen.</p>

<p>Bei den standardisierten Klartextsprachen bestimmen die Software-Hersteller aber nur noch das Outfit und die Handhabung der Software, aber nicht mehr das Format dessen, worauf es letztlich ankommt: n&auml;mlich auf Ihre Daten!</p>

<p>Die neuen Sprachen entwickeln sich nat&uuml;rlich auch weiter, und die Wahrscheinlichkeit, da&szlig; man in zwanzig Jahren noch mit HTML arbeitet, ist ebenfalls eher gering. Doch wer heute sauberen Code in HTML erzeugt, wird es in Zukunft leichter haben, auf erweiterte Sprachen oder neuere Sprachversionen umzusteigen. Denn da es sich um durchdachte, offen dokumentierte Sprachen handelt, ist ein computergest&uuml;tztes Umsetzen in andere, &auml;hnliche Sprachen oder neuere Standards relativ einfach.</p>

<p>Wir k&ouml;nnen heute noch nicht wissen, wie die EDV-Welt in einem halben Jahrhundert aussehen wird. Aber wir k&ouml;nnen zumindest schon einsehen, da&szlig; die Klartextsprachen, von denen hier die Rede ist, die vertrauensw&uuml;rdigsten Dateiformate sind, &uuml;ber die wir heute verf&uuml;gen.</p>

<br clear=all>

<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tcaa.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF><img src="x3.gif" width=15 height=10 border=0> <a href="tcaa.htm"><b>Tags (Steuerbefehle in HTML)</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tbdc.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tbdc.htm"><b>Web-KnowHow und Karriere</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tb.htm"><b>Einf&uuml;hrung</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tbd.htm"><b>Pers&ouml;nliche Bemerkungen</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>