<html>
<head>
<title>SELFHTML: HTML /  Allgemeine Regeln / Informationsverteilung und Dateiorganisation</title>
<meta name="description" content="(SELFHTML 7.0) Wie Sie Ihre Information auf mehrere Dateien verteilen und was Sie beachten sollten, um bei vielen Dateien nicht den &Uuml;berblick zu verlieren.">
<meta name="keywords" content="SELFHTML, HTML, Hypertext, Informationsverteilung, Dateiorganisation">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tc.htm"><b>HTML</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tca.htm"><b>Allgemeine Regeln</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Informationsverteilung und Dateiorganisation</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Hypertext schreiben - Information verteilen</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Dateiorganisation</b></a><br>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>





<h2 class="Sh2"><a class="an" name="a1">Hypertext schreiben - Information verteilen</a></h2>

<p>Dieses Thema liegt dem Autor des vorliegenden Dokuments besonders am Herzen. Deshalb hat er dazu auch ein eigenes Dokument geschrieben: <img src="xdeu.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.teamone.de/hypertext/"><b>Hypertext</b></a>.</p>

<p>HTML steht f&uuml;r <b>H</b>yper<b>t</b>ext <b>M</b>arkup <b>L</b>anguage. Die Sprache ist ausgelegt f&uuml;r hypertext-gerechte Informationsverteilung. Der Anwender soll zwischen Informationen &quot;navigieren&quot;, die ihn interessieren.</p>

<p>Dazu ist es n&ouml;tig, da&szlig; die angebotene Information auf kleine, in sich abgeschlossene Informationseinheiten verteilt wird, die untereinander auf eine nachvollziehbare und einsichtige Weise vernetzt sind.</p>

<p>Wenn Sie beispielsweise Ihren Fu&szlig;ballverein im WWW pr&auml;sentieren wollen, geh&ouml;rt dazu die &uuml;bliche Einstiegsseite mit Verweisen zu den Unterseiten. Die Unterseiten sollten jeweils an gleicher Stelle einen R&uuml;ckverweis auf die Einstiegsseite enthalten. Je eine Unterseite k&ouml;nnten Sie in diesem Beispiel etwa f&uuml;r die Geschichte, f&uuml;r die Vereinsberichte, f&uuml;r die aktuellen Tabellenst&auml;nde, und f&uuml;r die derzeitigen Spieler spendieren. Die Seite f&uuml;r Spieler k&ouml;nnte nochmals Verweise zu Seiten enthalten, auf denen jeweils ein einzelner der Spieler vorgestellt wird. Bei solchen Unter-Unter-Seiten ist ein R&uuml;ckverweis zur n&auml;chsth&ouml;heren Ebene wie auch zur Einstiegsseite angebracht. Wichtig sind auch die Querverweise. Wenn ein Spieler bereits lange dabei ist, findet sich bestimmt auch ein Querverweis zu einem wichtigen Ereignis der Vereinsgeschichte. Bei den Erl&auml;uterungen zu dem aktuellen Tabellenst&auml;nde sind wiederum Querverweise zu den besten Torsch&uuml;tzen usw. denkbar.<br>
So entsteht ein sinnvolles Netz aus Einzelinformationen. Zus&auml;tzliche Verlinkungen sollten die Navigationsm&ouml;glichkeiten erg&auml;nzen. So ist es in vielen F&auml;llen sinnvoll, sogenannte Guided Tours anzubieten, also eine Abfolge von Seiten, die der Anwender bequem durchbl&auml;ttern kann.<br>
Egal welche Art von Projekt sie in Angriff nehmen: immer sollten Sie den hier skizzierten Blick f&uuml;r die Strukturierung und Vernetzung der Information im Auge behalten.</p>

<p>Was hier als &quot;Seite&quot; oder &quot;Unterseite&quot; bezeichnet wird, sollte in einem WWW-Projekt eine einzelne HTML-Datei sein. Schrecken Sie nicht vor der Anzahl der entstehenden Dateien zur&uuml;ck. Die saubere Strukturierung der Information sollte oberstes Gebot sein.</p>

<p>Die Technik der Vernetzung zwischen Projektdateien wird im Abschnitt &uuml;ber <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tcf.htm"><b>Verweise</b></a> beschrieben. Weitere Tips f&uuml;r die Konzeption Ihres WWW-Projekts erhalten Sie bei der <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tja.htm"><b>Checkliste f&uuml;r die Projektplanung</b></a>.</p>


<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2">Dateiorganisation</a></h2>

<p>Bei jedem etwas gr&ouml;&szlig;eren Projekt werden Sie schnell feststellen, wie viele HTML-, Grafik- und andere Dateien sich dabei ansammeln. Um den &Uuml;berblick zu behalten, sollten Sie sich entweder ein sinnvolles Dateinamenschema &uuml;berlegen, oder Sie legen Unterverzeichnisse an, etwa f&uuml;r Dateien zu einem Themengebiet, oder f&uuml;r Grafiken usw. Wenn Sie Ihr Projekt im WWW ver&ouml;ffentlichen wollen, m&uuml;ssen Sie beim Einsatz von Unterverzeichnissen vorher kl&auml;ren, ob Sie auf dem WWW-Server, wo das Projekt einmal abgelegt werden soll, die Berechtigung bzw. M&ouml;glichkeit haben, Unterverzeichnisse anzulegen. Denn Sie werden in diesem Fall auf dem Server-Rechner die gleiche Verzeichnisstruktur erstellen m&uuml;ssen, die Sie lokal beim Erstellen gew&auml;hlt haben, damit alle Verweise und Referenzen funktionieren.</p>





<br>&#160;
<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tcai.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF><img src="x3.gif" width=15 height=10 border=0> <a href="tcai.htm"><b>Guter HTML-Stil</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tcag.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tcag.htm"><b>Konventionen f&uuml;r Dateinamen</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tc.htm"><b>HTML</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tca.htm"><b>Allgemeine Regeln</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>