<html>
<head>
<title>SELFHTML: HTML /  Allgemeine Regeln / Guter HTML-Stil</title>
<meta name="description" content="(SELFHTML 7.0) Was Sie beim Erstellen von HTML-Dateien beachten sollten, um sauberen, internet-gerechten Code zu schreiben.">
<meta name="keywords" content="SELFHTML, HTML, Stil, Knigge">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tc.htm"><b>HTML</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tca.htm"><b>Allgemeine Regeln</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Guter HTML-Stil</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Allgemeine Hinweise</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Nicht f&uuml;r bestimmten Browser schreiben</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>Tags nicht zweckentfremden</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a4"><b>Regeln f&uuml;r Sonderzeichen beachten</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a5"><b>Start- und End-Tags verwenden</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a6"><b>Ehrliche und aussagekr&auml;ftige Verweistexte verwenden</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a7"><b>Grafiken sinnvoll einsetzen</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a8"><b>Grafiken mit Gr&ouml;&szlig;enangaben und Alternativtext versehen</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a9"><b>Nicht f&uuml;r bestimmte Bildschirmaufl&ouml;sung schreiben</b></a><br>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>





<h2 class="Sh2"><a class="an" name="a1">Allgemeine Hinweise</a></h2>

<p>Definitive Richtlinien f&uuml;r &quot;richtiges&quot; HTML gibt es nicht. Denn HTML ist in st&auml;ndiger Weiterentwicklung begriffen. Es hat daher keinen Sinn, an dieser Stelle den Gebrauch irgendwelcher HTML-Tags zu verdammen oder vorzuschreiben. Insgesamt ist es auf jeden Fall empfehlenswert, sich so weit wie m&ouml;glich an den HTML-Sprachstandards des W3Konsortiums zu orientieren.</p> 

<p>Eigentlich ist es viel besser zu beschreiben, wie man es auf keinen Fall machen sollte. Dazu gibt eine wunderbare Anleitung im WWW: die <img src="xdeu.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.karzauninkat.com/Goldhtml/"><b>Goldenen Regeln f&uuml;r schlechtes HTML</b></a> von Stefan Karzauninkat.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2">Nicht f&uuml;r bestimmten Browser schreiben</a></h2>

<p>Wenn Sie Dateien im WWW plazieren wollen, sollten Sie zum Testen Ihrer Dateien mehr als einen WWW-Browser verwenden. Verwenden Sie die weit verbreiteten Produkte wie Netscape und den MS Internet Explorer, wenn es irgendwie geht auch in mehreren Versionen (beim MS Internet Explorer leider nicht m&ouml;glich), aber auch mal ein m&auml;&szlig;igeres Produkt wie etwa Mosaic. Wenn Sie die M&ouml;glichkeit haben, auf mehreren Plattformen (MS-Windows, Macintosh, Sun usw.) zu testen, machen Sie unbedingt Gebrauch davon.</p>

<p>Nun kann Ihnen niemand verbieten, HTML-Dateien zu schreiben, die nur von Netscape oder nur vom MS Internet Explorer korrekt interpretiert werden (wie das viele Leute tun, vor allem im kommerziellen Bereich, wo es um Outfit geht). In diesem Fall ist es jedoch angebracht, einen Hinweis einzubauen, da&szlig; die betreffenden Seiten f&uuml;r den Leistungsumfang eines bestimmten WWW-Browsers erstellt wurden. Versuchen Sie aber im Normalfall, einen Mittelweg zu erw&auml;gen.</p> 



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a3">Tags nicht zweckentfremden</a></h2>

<p>Besonders die logischen Tags von HTML sollten Sie nicht benutzen, um bestimmte Formatier-Effekte zu erzielen. So verwenden einige Leute z.B. das <tt>&lt;blockquote&gt;</tt>-Tag, um Abs&auml;tze einzur&uuml;cken, nur weil die Mehrzahl der Browser den Text, der in <tt>&lt;blockquote&gt;</tt> ... <tt>&lt;/blockquote&gt;</tt> eingeschlossen ist, als eigenen, einger&uuml;ckten Absatz darstellen. Das <tt>&lt;blockquote&gt;</tt>-Tag ist jedoch f&uuml;r Zitate gedacht, und sollte auch nur daf&uuml;r verwendet werden.</p>

<p>Noch h&auml;ufiger wird mit &Uuml;berschriften Schindluder getrieben. &Uuml;berschriften sind nicht dazu da, um Text gro&szlig; und fett zu machen, sondern dazu, logische Hierarchieverh&auml;ltnisse zwischen Textabschnitten zu markieren. Wenn Sie Text formatieren wollen, dann benutzen Sie <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="td.htm"><b>CSS Style-Sheets</b></a>.</p>




<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a4">Regeln f&uuml;r Sonderzeichen beachten</a></h2>

<p>Viele Browser stellen <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcad.htm"><b>deutsche Umlaute, scharfes S und andere Sonderzeichen</b></a> korrekt am Bildschirm dar, auch wenn die Zeichen nicht vorschriftsgem&auml;&szlig; maskiert wurden und eine Angabe zum <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="thd.htm#a1"><b>benutzten Zeichensatz</b></a> fehlt. Das h&auml;ngt jedoch damit zusammen, da&szlig; der Browser, wenn er auf Sonderzeichen st&ouml;&szlig;t, einfach auf den Zeichensatz zugreift, den Ihr Rechner verwendet (unter MS-Windows z.B. den Ansi-Zeichensatz). Sobald eine solche Datei jedoch auf einem Rechner angezeigt werden soll, der einen anderen Zeichensatz verwendet, oder mit einem Browser, der nicht so tolerant ist, werden W&ouml;rter unsch&ouml;n verst&uuml;mmelt.</p>


<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a5">Start- und End-Tags verwenden</a></h2>

<p>Moderne Browser verf&uuml;gen &uuml;ber relativ ausgereifte Algorithmen, um HTML-Dateien entsprechend der notierten Tags anzuzeigen. Bei Netscape und einigen anderen Browsern gen&uuml;gt es in vielen F&auml;llen, nur ein Start-Tag zu notieren, z.B. <tt>&lt;dl&gt;</tt>, ohne das zugeh&ouml;rige <tt>&lt;/dl&gt;</tt> anzugeben. Nicht alle Browser sind jedoch so tolerant. Fehlende End-Tags (meist aus Schreibfaulheit weggelassen), 
werden dort mit Anzeigefehlern bestraft.</p>

<p>Da HTML immer umfangreicher und komplexer werden wird, wird es zuk&uuml;nftig sogar wahrscheinlich sein, da&szlig; die unbedingte Einhaltung von Anfangs- und End-Tag auch f&uuml;r Elemente wie <tt>&lt;p&gt;</tt> gefordert wird. Auch im Hinblick auf die Einhaltung der Grundregeln der ISO-normierten Sprache SGML ist das durchg&auml;ngige Verwenden von Start- und End-Tags wichtig.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a6">Ehrliche und aussagekr&auml;ftige Verweistexte verwenden</a></h2>

<p>Generell gilt: das Ziel eines Verweises sollte das halten, was der Verweis 
verspricht. Das bedeutet beim Setzen des Verweises: der Verweistext sollte 
weder zu viel noch zu wenig versprechen. Wenn Sie beispielsweise Information 
&uuml;ber ein Software-Produkt anbieten, ohne es zum Download anzubieten, ist es unfair, dem Anwender mit einem Verweis auf die Information zu suggerieren, er k&ouml;nne das Produkt auch gleich downloaden.</p>

<p>Verweise k&ouml;nnen in HTML an jeder beliebigen Stelle im Text stehen. Wenn Sie jedoch einmal Text lesen, in dem jedes zweite Wort ein Verweis ist, werden Sie schnell merken, da&szlig; dies den Leseflu&szlig; ungemein st&ouml;rt. Der Grund daf&uuml;r ist, da&szlig; Verweise immer gleich die Aufmerksamkeit auf sich ziehen und den Leser von seiner eigentlichen Aufgabe, dem geistigen Erfassen des im Text Gemeinten, ablenken. Um so wichtiger ist es, da&szlig; Verweise innerhalb des Flie&szlig;textes dem Anwender keine R&auml;tsel aufgeben, sondern sofort erfa&szlig;bar 
sind.</p>

<p><a name="hier" class="an">Verwenden</a> Sie einen Verweis innerhalb des Flie&szlig;textes also nur dann, wenn der Verweistext sinnvoll ist. Und formulieren Sie S&auml;tze, in denen verweis-sensitiver Text vorkommt, so, da&szlig; der Verweistext aussagekr&auml;ftig ist.</p>

<p>Schreiben Sie z.B. nicht:<br>
&quot;F&uuml;r weitere Information klicken Sie <a href="#hier">hier</a>&quot;,<br>
sondern: <br>
&quot;<a href="#hier">Weitere Information</a> ist ebenfalls verf&uuml;gbar&quot;.</p>




<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a7">Grafiken sinnvoll einsetzen</a></h2>

<p>Wenn Sie nicht gerade eine virtuelle Kunstausstellung in HTML programmieren, sollten Sie sich mit gro&szlig;en Grafikdateien zur&uuml;ckhalten. Bedenken Sie bei Dateien, die Sie f&uuml;rs WWW erstellen, da&szlig; viele Anwender einen volumenabh&auml;ngigen Internet-Zugang haben, d.h. sie zahlen daf&uuml;r, wieviel Daten sie in den Arbeitsspeicher ihres Rechners laden. Zwar erlauben die meisten Browser, das Laden von Grafiken auszuschalten, doch falls der Anwender keinen Gebrauch von dieser Funktion macht, hei&szlig;t das noch lange nicht, da&szlig; er bereit ist, ohne Ank&uuml;ndigung eine 1-Megabyte-Grafik zu laden.</p>

<p>Versuchen Sie es daher lieber mit kleinen, wohlplazierten Grafiken. Oft gen&uuml;gen 16 Farben statt 256 oder gar 16,7 Mio. Das macht die Grafiken deutlich kleiner.</p>

<p>Andererseits sollten Sie keinesfalls auf den Einsatz von Grafiken verzichten. 
Reiner Text ist am Bildschirm n&auml;mlich wesentlich erm&uuml;dender zu lesen als in Printmedien. Deshalb sollten Sie l&auml;ngere Texte m&ouml;glichst reichhaltig strukturieren und auflockern. Dazu geh&ouml;rt auch die Verwendung von Grafiken.</p>

<p>Ideal sind kleine Grafiken in Icon-Gr&ouml;&szlig;e. Die sind schnell geladen, und Sie k&ouml;nnen bedenkenlos mehrere davon pro HTML-Datei referenzieren.</p>

<p>Kleine Grafiken k&ouml;nnen auch bestimmte Corporate-Identity-Funktionen oder Orientierungsfunktionen &uuml;bernehmen. Der Vorteil solcher mehrfach verwendeter Grafiken ist, da&szlig; die meisten Browser sie nur einmal laden und dann im Speicher halten.</p>




<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a8">Grafiken mit Gr&ouml;&szlig;enangaben und Alternativtext versehen</a></h2>

<p>WWW-Seiten werden von modernen Browsern deutlich schneller und sauberer aufgebaut, wenn bei jeder referenzierten Grafik die genauen Angaben zu <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcgb.htm#a1"><b>Breite und H&ouml;he der Grafik</b></a> notieren. Au&szlig;erdem lassen die Browser entsprechend gro&szlig;e Platzhalter frei, wenn die Grafik gar nicht oder nicht vollst&auml;ndig &uuml;bertragen wird, und die &uuml;brige Seite wird dadurch nicht &quot;zerhauen&quot;.<br>
Bei Grafiken sollten Sie sich auch angew&ouml;hnen, <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcga.htm#a4"><b>Alternativtexte</b></a> zu notieren. Der Anteil der Netzteilnehmer, der mit nicht-grafikf&auml;higen Browsern unterwegs ist, wird zwar immer verschwindender. Doch viele Anwender schalten angesichts der oft schlechten &Uuml;bertragungsraten im WWW die Anzeige von Grafiken in ihrem WWW-Browser aus. Besonders bei WWW-Seiten, die hautps&auml;chlich aus Grafiken bestehen, geh&ouml;ren Alternativtexte deshalb zum guten Ton.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a9">Nicht f&uuml;r bestimmte Bildschirmaufl&ouml;sung schreiben</a></h2>

<p>Sie wissen erstens nicht, welche Bildschirmaufl&ouml;sung die Besucher Ihrer Seiten haben, und zweitens wissen Sie nicht, ob die Anwender ihren Browser im Vollbildmodus laufen lassen. Deshalb hat es normalerweise wenig Sinn, &uuml;ber die &quot;wahrscheinlichste&quot; Bildschirmaufl&ouml;sung beim Anwender zu mutma&szlig;en. Verwenden Sie bei Tabellen oder Frames tendenziell eher prozentuale Breiten und H&ouml;henangaben. Absolute Pixelangaben haben nur dort einen Sinn, wo beispielsweise die erste Spalte einer blinden Tabelle &uuml;ber einem farblich zweigeteilten Hintergrundbild liegen soll. Ansonsten sollten Sie sich nicht zu sehr auf solche Vorstellungen wie die versteifen, da&szlig; eine Grafik oder ein Absatz bei jedem Anwender genau 10,8 cm vom linken Rand entfernt beginnt. Wenn das bei Ihnen gut aussieht, bedeutet das noch lange nicht, da&szlig; es bei jemand anderem gut aussieht, und in einigen F&auml;llen k&ouml;nnte es auch ausgesprochen schlecht aussehen.</p>




<br>&#160;
<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tcba.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF><img src="x3.gif" width=15 height=10 border=0> <a href="tcba.htm"><b>Titel einer HTML-Datei</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tcah.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tcah.htm"><b>Informationsverteilung und Dateiorganisation</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tc.htm"><b>HTML</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tca.htm"><b>Allgemeine Regeln</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>