<html>
<head>
<title>SELFHTML: HTML /  Allgemeine Angaben zur Datei / Meta-Angaben f&uuml;r Suchdienste und Browser</title>
<meta name="description" content="(SELFHTML 7.0) Wie Sie Angaben zu einer HTML-Datei notieren k&ouml;nnen, die f&uuml;r Suchmaschinen gedacht sind oder den WWW-Brwoser zu bestimmten Aktionen oder Interpretationen der HTML-Datei veranlassen.">
<meta name="keywords" content="SELFHTML, HTML, Meta-Angaben, Autor, Stichworte, Stichw&ouml;rter, Beschreibung, Sprache, Zeichensatz, automatische Weiterleitung, Robots, Refresh">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tc.htm"><b>HTML</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tcb.htm"><b>Allgemeine Angaben zur Datei</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Meta-Angaben f&uuml;r Suchdienste und Browser</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Allgemeines zu Meta-Angaben</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>F&uuml;r Suchprogramme: Beschreibung, Autor, Stichworte, Datum</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>F&uuml;r Suchprogramme: Meta-Angaben nach Dublin-Core</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a4"><b>F&uuml;r Suchprogramme: Auslesen erlauben/verbieten</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a5"><b>F&uuml;r Suchprogramme: Sprache bei Stichw&ouml;rtern</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a6"><b>F&uuml;r Browser: Angaben zu PICS</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a7"><b>F&uuml;r Browser: Angaben zu Default-Sprachen</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a8"><b>F&uuml;r Browser: Datei von Originaladresse laden</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a9"><b>F&uuml;r Browser: Automatische Weiterleitung zu anderer Adresse</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a10"><b>Meta-Angaben in separater Datei (Profil)</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a11"><b>Schema zu einer Meta-Angabe</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a12"><b>Diverse Meta-Angaben</b></a><br>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>





<h2 class="Sh2"><a class="an" name="a1">Allgemeines zu Meta-Angaben</a></h2>

<p>In Meta-Angaben k&ouml;nnen Sie verschiedene n&uuml;tzliche Anweisungen f&uuml;r WWW-Server, WWW-Browser und automatische Suchprogramme im Internet (&quot;Robots&quot;) notieren. Meta-Angaben k&ouml;nnen Angaben zum Autor und zum Inhalt der Datei enthalten. Sie k&ouml;nnen aber auch HTTP-Befehle absetzen, zum Beispiel zum automatischen Weiterleiten des WWW-Browsers zu einer anderen Adresse.</p>

<p>Meta-Angaben sind <b>nicht</b> f&uuml;r pers&ouml;nliche Anmerkungen oder Kommentare zum Quelltext der HTML-Datei gedacht. F&uuml;r solche Angaben k&ouml;nnen Sie einen <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcaf.htm#a1"><b>Kommentar</b></a> definieren.</p>

<p>Leider ist die Situation zum Gebrauch von Meta-Angaben derzeit ziemlich un&uuml;bersichtlich, da zwar allerortens flei&szlig;ig an L&ouml;sungsans&auml;tzen gebastelt wird, ein wirklich verbindlicher Standard aber noch aussteht. Ein solcher Standard, der dann auch tats&auml;chlich von WWW-Autoren eingehalten wird, ist vor allem deshalb dringend erforderlich, damit die Qualit&auml;t von Suchdiensten im Internet besser wird.</p>

<h3>HTML-Standard und Meta-Angaben</h3>

<p>Der aktuelle HTML-Standard 4.0 schreibt keine konkrete Meta-Angaben mehr vor, sondern definiert lediglich den grunds&auml;tzlichen Aufbau einer Meta-Angabe. Zur Standardisierung von Meta-Angaben arbeitet das W3-Konsortium stattdessen an einer Sprache namens Resource Description Framework (RDF). Auf den WWW-Seiten des W3-Konsortiums finden Sie <img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.w3.org/RDF/"><b>Informationen zum Resource Description Framework</b></a>.</p>


<h3>Hinweis</h3>

<p>Mit Meta-Angaben wird leider auch viel Mi&szlig;brauch getrieben. Da viele Meta-Befehle keine unmittelbar nachvollziehbare Wirkung am Bildschirm haben und andererseits mit Suchdiensten zu tun haben, regen sie offenbar magisch die Phantasie mancher Geister an, die meinen, mit einem Mammutaufgebot irgendwo aufgeschnappter Meta-Angaben w&uuml;rden sie &uuml;ber Nacht zum Superstar, da ihre Homepage dann immer ganz oben bei den Suchtreffern eines Suchdienstes erscheint. Dazu nur so viel: Homepages werden nicht durch Meta-Angaben erfolgreich, sondern durch Inhalt. Zu einer sauber gemachten Homepage geh&ouml;rt aber auch der sinnvolle Einsatz von Meta-Angaben.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2"><img src="xhtml32.gif" width=30 height=30 border=0 alt="HTML3.2"> F&uuml;r Suchprogramme: Beschreibung, Autor, Stichworte, Datum</a></h2>

<p>Die hier beschriebenen Meta-Angaben sind am verbreitetsten, werden von Suchmaschinen in der Regel erkannt und in der HTML-Spezifikation erw&auml;hnt.</p>

<p>Sie k&ouml;nnen f&uuml;r Suchprogramme Ihre Autorenschaft, eine Kurzbeschreibung des Inhalts, charakteristische Stichw&ouml;rter und das Publikationsdatum einer HTML-Datei als Meta-Angabe im Kopf der HTML-Datei notieren.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;head&gt;
&lt;meta name=&quot;description&quot; content=&quot;Dieser Beschreibungstext soll einem 
Anwender im Suchdienst bei Auffinden dieser Datei erscheinen&quot;&gt;
&lt;meta name=&quot;author&quot; content=&quot;Ihr Name&quot;&gt;
&lt;meta name=&quot;keywords&quot; content=&quot;HTML, Meta-Informationen, 
Suchprogramme, HTTP-Protokoll&quot;&gt;
&lt;meta name=&quot;date&quot; content=&quot;1998-04-30T08:49:37+00:00&quot;&gt;
... andere Angaben im Dateikopf ...
&lt;/head&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Mit <tt>&lt;meta name=&quot;description&quot; content=&quot;Beschreibungstext&quot;&gt;</tt> bestimmen Sie einen Beschreibungstext (<i>meta = &quot;&uuml;ber&quot;, name = Name, description = Beschreibung,  content = Inhalt</i>).</p>

<p>Mit <tt>&lt;meta name=&quot;author&quot; content=&quot;Autorenname&quot;&gt;</tt> teilen Sie den Namen des Autors (d.h.: des inhaltlich Verantwortlichen) f&uuml;r die HTML-Datei mit (<i>author = Autor</i>).</p>

<p>Mit <tt>&lt;meta name=&quot;keywords&quot; content=&quot;[Wortliste]&quot;&gt;</tt> bestimmen Sie Stichw&ouml;rter f&uuml;r ein Suchprogramm. Ein Anwender, der in der Suchdatenbank des Suchprogramms nach einem dieser Stichw&ouml;rter sucht, soll die aktuelle HTML-Datei als Suchtreffer angezeigt bekommen, da das Stichwort in dieser Datei ein zentrales Thema ist (<i>keywords = Schl&uuml;sselw&ouml;rter</i>).</p> 

<p>Mit <tt>&lt;meta name=&quot;date&quot; content=&quot;[Datum/Uhrzeit]&quot;&gt;</tt> geben Sie an, wann die Datei publiziert wurde. Im obigen Beispiel ist 1998 die Jahreszahl, 04 der Monat (Mai), 30 der Tag, 08 die Stunden, 49 die Minuten und 37 die Sekunden. die Angabe 00:00 hinter dem Pluszeichen ist die Abweichung der Zeit von der Greenwich-Zeit in Stunden und Minuten, im Beispiel keine Abweichung. Wenn Sie nur das Datum, aber keine Uhrzeit angeben wollen, notieren Sie nur den Teil der Datumsangabe bis vor dem gro&szlig;en T (für <i>Time</i>).</p>

<p>Alle Angaben hinter den Istgleichzeichen m&uuml;ssen in Anf&uuml;hrungszeichen stehen. Trennen Sie bei den Schl&uuml;sselw&ouml;rtern die einzelnen W&ouml;rter durch Kommata. Sie k&ouml;nnen alle drei Angaben notieren, aber auch nur eine oder zwei davon. Deutsche Umlaute und Sonderzeichen sollten Sie entweder wie &uuml;blich <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcad.htm#a1"><b>maskieren</b></a>.</p>





<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a3">F&uuml;r Suchprogramme: Meta-Angaben nach Dublin Core</a></h2>

<p>Eine internationale Gruppe von Experten, unter dem Namen <b>Dublin Core</b> vereint, hat ein System f&uuml;r Meta-Angaben ver&ouml;ffentlicht. Das System ist einfach zu handhaben und ber&uuml;cksichtigt alle wichtigen Angaben, die zu einem Dokument gemacht werden k&ouml;nnen. Die Meta-Angaben von Dublin-Core werden auch vom W3-Konsortium begr&uuml;&szlig;t. Einer Verwendung steht also nichts im Wege.</p> 

<p>Die meisten heutigen Suchmaschinen bieten allerdings noch gar keine Suche nach hier beschriebenen Kategorien wie Autor, Herausgeber oder Textsorte an. Das System ist eher an der Zukunft orientiert.</p>

<p>Im WWW finden Sie Informationen zu <img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://purl.org/metadata/dublin_core"><b>Dublin Core Metadata</b></a>.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;head&gt;
&lt;meta name=&quot;DC.Title&quot; content=&quot;SELFHTML/Meta-Angaben&quot;&gt;
&lt;meta name=&quot;DC.Creator&quot; content=&quot;Stefan M&amp;uuml;nz&quot;&gt;
&lt;meta name=&quot;DC.Subject&quot; content=&quot;Meta-Angaben&quot;&gt;
&lt;meta name=&quot;DC.Description&quot; 
      content=&quot;Heute bekannte Meta-Angaben in HTML&quot;&gt;
&lt;meta name=&quot;DC.Publisher&quot; content=&quot;TeamOne&quot;&gt;
&lt;meta name=&quot;DC.Contributor&quot; content=&quot;Wolfgang Nefzger&quot;&gt;
&lt;meta name=&quot;DC.Date&quot; content=&quot;1998-04-30&quot;&gt;
&lt;!-- &lt;meta name=&quot;DC.Type&quot; content=&quot;&quot;&gt; --&gt;
&lt;!-- &lt;meta name=&quot;DC.Format&quot; content=&quot;&quot;&gt; --&gt;
&lt;meta name=&quot;DC.Identifier&quot; content=&quot;http://www.teamone.de/selfhtml/&quot;&gt;
&lt;meta name=&quot;DC.Source&quot; content=&quot;HTML-Referenz&quot;&gt;
&lt;meta name=&quot;DC.Language&quot; content=&quot;de&quot;&gt;
&lt;!-- &lt;meta name=&quot;DC.Relation&quot; content=&quot;&quot;&gt; --&gt;
&lt;meta name=&quot;DC.Coverage&quot; content=&quot;Munich&quot;&gt;
&lt;meta name=&quot;DC.Rights&quot; content=&quot;Alle Rechte liegen beim Autor&quot;&gt;
... andere Angaben im Dateikopf ...
&lt;/head&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Bei Meta-Angaben, die einem bestimmten &ouml;ffentlichen System angeh&ouml;ren, so wie hier dem System von Dublin Core, wird dem Namen einer Meta-Angabe eine Kurzbezeichnung f&uuml;r den Herausgeber der Meta-Angaben vorangestellt. Bei Dublin Core sind das die Initialen DC. Dahinter folgt, durch einen Punkt getrennt, der Name der Meta-Angabe. Der Zuweisungswert erfolgt in dem Attribut <tt>content=</tt>.</p>

<p>Mit <tt>&lt;meta name=&quot;DC.Title&quot; content=&quot;Titel&quot;&gt;</tt> k&ouml;nnen Sie einen Titel f&uuml;r die Datei angeben, &auml;hnlich wie im <tt>&lt;title&gt;</tt>-Tag (<i>title = Titel</i>).</p>

<p>Mit <tt>&lt;meta name=&quot;DC.Creator&quot; content=&quot;Name&quot;&gt;</tt> weisen Sie den geistigen Urheber des Inhalts der Datei aus (<i>Creator = Ersteller</i>).</p>

<p>Mit <tt>&lt;meta name=&quot;DC.Subject&quot; content=&quot;Text&quot;&gt;</tt> geben Sie das Thema an, das in der Datei behandelt wird (<i>Sucject = Thema</i>).</p>

<p>Mit <tt>&lt;meta name=&quot;DC.Description&quot; content=&quot;Text&quot;&gt;</tt> k&ouml;nnen Sie eine Kurzbeschreibung des Dateiinhalts notieren (<i>Description = Beschreibung</i>).</p>

<p>Mit <tt>&lt;meta name=&quot;DC.Publisher&quot; content=&quot;Name&quot;&gt;</tt> k&ouml;nnen Sie angeben, wer f&uuml;r die Publikation der Datei verantwortlich ist. Das kann der Autor selbst sein, aber auch etwa ein Verlag oder der Nachfahre eines verstorbenen Autors (<i>Publisher = Ver&ouml;ffentlicher</i>).</p>

<p>Mit <tt>&lt;meta name=&quot;DC.Contributer&quot; content=&quot;Name&quot;&gt;</tt> k&ouml;nnen Sie Co-Autoren oder Personen angeben, die neben dem Hauptautor ma&szlig;geblich am Inhalt beteiligt sind, z.B. Grafiker, Musiker, &Uuml;bersetzer (<i>Contributer = Beitragender</i>). Falls Sie mehrere Angaben dazu machen, trennen Sie die Namen durch Kommata.</p>

<p>Mit <tt>&lt;meta name=&quot;DC.Date&quot; content=&quot;Datum/Uhrzeit&quot;&gt;</tt> k&ouml;nnen Sie angeben, wann die Datei publiziert wurde. Im obigen Beispiel ist 1998 die Jahreszahl, 04 der Monat (Mai) und 30 der Tag.</p>

<p>Mit <tt>&lt;meta name=&quot;DC.Type&quot; content=&quot;Typ&quot;&gt;</tt> k&ouml;nnen Sie die Textsorte bzw. den Dokumententyp angeben, dem sich der Inhalt der Datei zuordnen l&auml;&szlig;t. Dazu soll es eine Liste erlaubter Angaben geben, die zum Redaktionsschlu&szlig; dieses Dokuments noch nicht vorlag. Deshalb steht die Angabe im obigen Beispiel in einem Kommentar.</p>

<p>Mit <tt>&lt;meta name=&quot;DC.Format&quot; content=&quot;Typ&quot;&gt;</tt> k&ouml;nnen Sie das Datenformat bzw. den Medientyp angeben, f&uuml;r den der Inhalt der Datei gedacht ist. Dazu soll es eine Liste erlaubter Angaben geben, die zum Redaktionsschlu&szlig; dieses Dokuments noch nicht vorlag. Deshalb steht die Angabe im obigen Beispiel in einem Kommentar.</p>

<p>Mit <tt>&lt;meta name=&quot;DC.Identifier&quot; content=&quot;Wert&quot;&gt;</tt> k&ouml;nnen Sie eine eindeutige Nummer oder Bezugsadresse f&uuml;r die Datei angeben  (<i>Identifier = eindeutiger Bezeichner</i>). Bei WWW-Seiten ist das beispielsweise die Original-URL-Adresse.</p>

<p>Mit <tt>&lt;meta name=&quot;DC.Source&quot; content=&quot;Quelle&quot;&gt;</tt> k&ouml;nnen Sie eine Quelle nennen, von der die aktuelle Datei abgeleitet ist (<i>Source = Quelle</i>). Das kann beispielsweise der Fall sein, wenn eine HTML-Datei Ausz&uuml;ge aus einem Buch beinhaltet. In diesem Fall k&ouml;nnen Sie das Buch als Quelle angeben.</p>

<p>Mit <tt>&lt;meta name=&quot;DC.Language&quot; content=&quot;xx&quot;&gt;</tt> k&ouml;nnen Sie die Landessprache angeben, in der der Inhalt der Datei verfa&szlig;t ist (<i>Language = Sprache</i>). Als Angabe ist beispielsweise ein zweistelliges Landesk&uuml;rzel m&ouml;glich, z.B. <tt>de</tt> f&uuml;r deutsch, <tt>en</tt> f&uuml;r englisch, <tt>fr</tt> f&uuml;r franz&ouml;sisch, <tt>it</tt> f&uuml;r italienisch oder <tt>es</tt> f&uuml;r spanisch. Mehr &uuml;ber die standardisierten Landesk&uuml;rzel im Internet in der <img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://rfc.fh-koeln.de/rfc/html/rfc1766.html"><b>RFC 1766</b></a>.</p>

<p>Mit <tt>&lt;meta name=&quot;DC.Relation&quot; content=&quot;Quelle&quot;&gt;</tt> k&ouml;nnen Sie angeben, welche Beziehung zwischen der aktuellen Datei und einem zugeh&ouml;rigen Editionsprojekt bestehen (<i>Relation = Bezug</i>). Dazu soll es eine Liste erlaubter Angaben geben, die zum Redaktionsschlu&szlig; dieses Dokuments noch nicht vorlag. Deshalb steht die Angabe im obigen Beispiel in einem Kommentar.</p>

<p>Mit <tt>&lt;meta name=&quot;DC.Coverage&quot; content=&quot;Text&quot;&gt;</tt> k&ouml;nnen Sie einen zeitlichen oder geografischen Bezugspunkt f&uuml;r den Inhalt der Datei angeben (<i>Coverage = Erfassung, Berichterstattung</i>). Das kann bei geografischen Angaben etwa ein Ort, eine L&auml;ngen-/Breitengradangabe oder eine Region sein, bei zeitlichen Angaben ein Datum oder ein Zeitalter.</p>

<p>Mit <tt>&lt;meta name=&quot;DC.Rights&quot; content=&quot;Text&quot;&gt;</tt> k&ouml;nnen Sie eine Angabe zum Copyright des Dateiinhalts machen (<i>Rights = Rechte</i>). Sie k&ouml;nnen dabei aber auch eine Internet-Adresse angeben, auf der die genauen Copyright-Angaben genannt werden.</p>


<h3 class="inf">Beachten Sie:</h3>

<p>Ein inoffizielles Dokument mit Vorschl&auml;gen zur Klassifizierung von Angaben zu DC.Type, DC.Format usw. finden Sie im WWW unter dem Titel <img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.roads.lut.ac.uk/Metadata/DC-Qualifiers.html"><b>Dublin Core Qualifiers</b></a>. Der Der Deutsche Bildungs-Server (DBS) hat das Modell von Dublin Core um eigene Angaben erweitert. Rufen Sie bei Interesse die Informationen zu <img src="xdeu.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://dbs.schule.de/bonsai/metatags.html"><b>Meta-Tags</b></a> auf. Auch Anbieter von Such-Robots ver&ouml;ffentlichen Meta-Tags, die der eigene Such-Robot ausliest. Ein Beispiel dazu finden Sie bei der <img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://vancouver-webpages.com/VWbot/VW96-schema.html"><b>VW96 schema description</b></a>, der Beschreibung zu Meta-Tags, die ein bestimmter Such-Robot namens <img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://vancouver-webpages.com/VWbot/"><b>VWbot</b></a> ausliest.</p>






<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a4">F&uuml;r Suchprogramme: Auslesen erlauben/verbieten</a></h2>

<p>Die folgenden Angaben sind zwar nicht &quot;hoch-offiziell&quot;, werden jedoch von den meisten Suchmaschinen ber&uuml;cksichtigt.</p>

<p>Wenn Sie eine HTML-Datei zwar im Internet anbieten, aber trotzdem verhindern m&ouml;chten, da&szlig; die Datei &uuml;ber &ouml;ffentliche Suchdienste auffindbar sein soll, k&ouml;nnen Sie eine entsprechende Anweisung als Meta-Information f&uuml;r automatische Suchprogramme notieren. Sie k&ouml;nnen solchen Suchprogrammen aber auch mit einer entsprechenden Eingabe signalisieren, da&szlig; Sie ein Auslesen der Datei und aller Dateien, die darin &uuml;ber Verweise erreichbar sind, ausdr&uuml;cklich w&uuml;nschen.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;head&gt;
&lt;meta name=&quot;robots&quot; content=&quot;noindex&quot;&gt;
... andere Angaben im Dateikopf ...
&lt;/head&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Mit <tt>&lt;meta name=&quot;robots&quot; content=&quot;noindex&quot;&gt;</tt> verbieten Sie einem Suchprogramm, Inhalte aus der HTML-Datei an seine Suchdatenbank zu &uuml;bermitteln (<i>robots = Suchprogramme, content =  Inhalt, noindex = keine Indizierung</i>). Anstelle von <tt>noindex</tt> k&ouml;nnen Sie auch <tt>none</tt> notieren (<i>none = keine</i>).</p>

<p>Daneben sind folgende weitere Angaben m&ouml;glich:</p>

<p><tt>&lt;meta name=&quot;robots&quot; content=&quot;index&quot;&gt;</tt>. Damit erlauben Sie einem Suchprogramm ausdr&uuml;cklich, Inhalte aus der aktuellen HTML-Datei an seine Suchdatenbank zu &uuml;bermitteln (<i>index = Indizierung</i>).<br>
<tt>&lt;meta name=&quot;robots&quot; content=&quot;nofollow&quot;&gt;</tt>. Damit erlauben Sie einem Suchprogramm, Inhalte aus der aktuellen HTML-Datei an seine Suchdatenbank zu &uuml;bermitteln (<i>nofollow = nicht folgen</i>). Sie verbieten dem Suchprogramm jedoch, untergeordnete Dateien Ihres Projekts, zu denen Verweise f&uuml;hren, zu besuchen.<br>
<tt>&lt;meta name=&quot;robots&quot; content=&quot;follow&quot;&gt;</tt>. Damit erlauben Sie einem Suchprogramm ausdr&uuml;cklich, Inhalte aus der aktuellen HTML-Datei und aus untergeordneten Dateien Ihres Projekts, zu denen Verweise f&uuml;hren, zu besuchen und an seine Suchdatenbank zu &uuml;bermitteln (<i>follow = folgen</i>).</p>






<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a5"><img src="xhtml4.gif" width=30 height=30 border=0 alt="HTML4.0"> F&uuml;r Suchprogramme: Sprache bei Stichw&ouml;rtern</a></h2>

<p>F&uuml;r Meta-Angaben zu Stichw&ouml;rtern (bei solchen zur Kurzbeschreibung des Inhalts sollte es auch funktionieren) k&ouml;nnen Sie mehrere gleichartige Meta-Angaben notieren und dabei zwischen Landessprachen trennen.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;meta name=&quot;keywords&quot; lang=&quot;de&quot; 
content=&quot;Ferien, Griechenland, Sonnenschein&quot;&gt;
&lt;meta name=&quot;keywords&quot; lang=&quot;en-us&quot; 
content=&quot;vacation, Greece, sunshine&quot;&gt;
&lt;meta name=&quot;keywords&quot; lang=&quot;en&quot; 
content=&quot;holiday, Greece, sunshine&quot;&gt;
&lt;meta name=&quot;keywords&quot; lang=&quot;fr&quot; 
content=&quot;vacances, Gr&amp;egrave;ce, soleil&quot;&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Im Beispiel werden die gleichen Stichw&ouml;rter in den Sprachen Deutsch, US-Englisch, Britisch-Englisch und Franz&ouml;sisch definiert. Dabei wird das Attribut <tt>lang=</tt> benutzt, um die Sprache anzugeben. Als Angabe ist ein zweistelliges Landesk&uuml;rzel erlaubt (Ausnahme: en-us), z.B. <tt>de</tt> f&uuml;r deutsch, <tt>en</tt> f&uuml;r englisch, <tt>fr</tt> f&uuml;r franz&ouml;sisch, <tt>it</tt> f&uuml;r italienisch oder <tt>es</tt> f&uuml;r spanisch. Mehr &uuml;ber die standardisierten Landesk&uuml;rzel im Internet in der <img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://rfc.fh-koeln.de/rfc/html/rfc1766.html"><b>RFC 1766</b></a>.</p>

<h3 class="inf">Beachten Sie:</h3>

<p>Das Attribut <tt>lang=</tt> geh&ouml;rt zu den <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tcm.htm"><b>Universalattributen</b></a> in HTML.</p>




<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a6"><img src="xhtml4.gif" width=30 height=30 border=0 alt="HTML4.0"> F&uuml;r Browser: Angaben zu PICS</a></h2>

<p>PICS steht f&uuml;r &quot;Platform for Internet Content Selection&quot;. Es handelt sich dabei um ein standardisiertes Schema zum Bezeichnen von Internet-Inhalten. Das Schema wurde ins Leben gerufen, um jugendfeie Internet-Inhalte als solche auszuzeichnen. Es gibt sogenannte PICS-Labels, also Auszeichnungen. Anbieter von WWW-Seiten k&ouml;nnen ihre WWW-Seiten entweder freiwillig und nach eigenem Ermessen mit einem PICS-Label versehen, oder - und das ist wohl eher Sinn der Sache - sie nehmen einen unabh&auml;ngigen PICS-Service in Anspruch, der PICS-Zertifikate f&uuml;r Inhalte ausstellt.</p>

<p>Auf Einzelheiten des PICS-Systems wird hier nicht n&auml;her eingegangen. Informationen im WWW finden Sie auf der <img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.w3.org/PICS/"><b>PICS-Seite des W3-Konsortiums</b></a>. Moderne Browser k&ouml;nnen PICS-Inhalte erkennen. Dazu lassen sich software-seitig Einstellungen vornehmen, zum Beispiel durch Eltern von surfenden Kindern. So kann der Browser bei Seiten mit PICS-Labeln durch Vergleichen der Konfiguration mit dem Label erkennen, ob der Inhalt angezeigt werden darf oder nicht.</p>


<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;meta http-equiv=&quot;PICS-Label&quot; content='
 (PICS-1.1 &quot;http://www.gcf.org/v2.5&quot;
  labels on &quot;1994.11.05T08:15-0500&quot;
  until &quot;1995.12.31T23:59-0000&quot;
  for &quot;http://w3.org/PICS/Overview.html&quot;
  ratings (suds 0.5 density 0 color/hue 1))'&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Durch die Angabe <tt>http-equiv=&quot;PICS-Label&quot;</tt> in einem <tt>&lt;meta&gt;</tt>-Tag k&ouml;nnen Sie eine PICS-Auszeichnung f&uuml;r eine HTML-Datei notieren. Hinter <tt>content=</tt> folgt die PICS-Auszeichnung. Die gesamte Auszeichnung wird in einfache Anf&uuml;hrungszeichen gesetzt. Die Syntax der PICS-Auszeichnung wird innerhalb davon in runde Klammern eingeschlossen. Innerhalb der runden Klammern stehen zun&auml;chst die Pflichtangabe zur PICS-Version und die Angabe der URL-Adresse, auf der die Inhaltskategorisierung definiert wird, auf die hier Bezug genommen wird. Die Angaben <tt>labels on</tt>, <tt>until</tt> und <tt>for</tt> sind optional. Entscheidend ist aber auf jeden Fall die Angabe <tt>ratings</tt>, in der die eigentliche Inhaltskategosisierung notiert wird. Die Kategorisierung wird dabei nochmals in runde Klammern eingeschlossen. Die einzelnen Befehle und ihre Bedeutung muß der PICS-Service bereitstellen, der die PICS-Zertifikate 
verteilt.</p>




<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a7"><img src="xhtml4.gif" width=30 height=30 border=0 alt="HTML4.0"> F&uuml;r Browser: Angaben zu Default-Sprachen</a></h2>

<p>Sie k&ouml;nnen mit Hilfe einer Meta-Angabe ausdr&uuml;cklich bestimmen, welchen Zeichensatz Sie innerhalb der HTML-Datei verwenden. F&uuml;r HTML-Erg&auml;nzungssprachen wie Style-Sheets und Scripts k&ouml;nnen Sie bestimmen, welche Sprachen Sie innerhalb der HTML-Datei verwenden.</p>

<p>Diese Angaben helfen dem WWW-Browser, die Inhalte der HTML-Datei im Zweifelsfall korrekter zu interpretieren. Vor allem die Angabe zum Zeichensatz ist wichtig, falls Sie innerhalb der HTML-Datei Umlaute usw. nicht maskieren.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;head&gt;
&lt;meta http-equiv=&quot;content-type&quot; content=&quot;text/html; charset=iso-8859-1&quot;&gt;

&lt;meta http-equiv=&quot;Content-Script-Type&quot; content=&quot;text/javascript&quot;&gt;
&lt;meta http-equiv=&quot;Content-Style-Type&quot; content=&quot;text/css&quot;&gt;
... andere Angaben im Dateikopf ...
&lt;/head&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Der Befehl zur Angabe eines bestimmen Zeichensatzes mu&szlig; die Angabe <tt>http-equiv=&quot;content-type&quot;</tt> enthalten sowie das Attribut <tt>content=</tt>. Hinter <tt>content=</tt> geben Sie in Anf&uuml;hrungszeichen zun&auml;chst den <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcjj.htm"><b>Mime-Type</b></a> an, der f&uuml;r HTML-Dateien immer <tt>text/html</tt> lautet. Dahinter folgt, durch einen Strichpunkt getrennt, die Angabe des Zeichensatzes. Im obigen Beispiel wird der Zeichensatz iso-8559-1 definiert (das ist der normale Zeichensatz f&uuml;r westeurop&auml;ische Sprachen). Mehr zu diesen Themen finden Sie in den Abschnitten <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="thb.htm"><b>Zeichens&auml;tze</b></a> sowie <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="thd.htm"><b>Zeichens&auml;tze und Unicodes in HTML</b></a>.</p>

<p>Die Befehle zum Bestimmen der Default-Scriptsprache und der Default-Stylesprache haben einen einheitlichen Aufbau. Die Angabe zur bevorzugten Scriptsprache leiten Sie mit <tt>&lt;meta http-equiv=&quot;Content-Script-Type&quot;</tt> ein, die Angabe zur bevorzugten Stylesprache mit <tt>http-equiv=&quot;Content-Style-Type&quot;</tt>. Bei dem Attribut <tt>content=</tt> m&uuml;ssen Sie dann den Mime-Type der gew&uuml;nschten Sprache angeben. Beispiele sind <tt>text/css</tt> f&uuml;r <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="td.htm"><b>CSS Style-Sheets</b></a> und <tt>text/javascript</tt> f&uuml;r <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="te.htm"><b>JavaScript</b></a>.</p>





<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a8"><img src="xhtml32.gif" width=30 height=30 border=0 alt="HTML3.2"> F&uuml;r Browser: Datei von Originaladresse laden</a></h2>

<p>H&auml;ufig abgerufene WWW-Seiten werden im WWW auf sogenannten Proxy-Servern zwischengespeichert. Das ist dann ein sogenannter Proxy-Cache. Auch Browser speichern aufgerufene Seiten, und zwar lokal auf dem Rechner des Anwenders. Dabei spricht man vom Browser-Cache. Die Cache-Speicher sparen in vielen F&auml;llen Leitungswege und Ressourcen. Ein Nachteil ist jedoch, da&szlig; dem Anwender m&ouml;glicherweise Daten angezeigt werden, die gar nicht mehr aktuell sind, weil auf der Original-Adresse mittlerweile neue Daten liegen. Sie k&ouml;nnen mit Hilfe einer Meta-Information erzwingen, da&szlig; der Server-Rechner dem WWW-Browser befiehlt, sich die Daten nicht aus einem Cache-Speicher zu holen, sondern vom Original-Server. Das ist allerdings nur dann zu empfehlen, wenn Sie die Daten einer HTML-Datei h&auml;ufig &auml;ndern und neu ins WWW hochladen.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;head&gt;
&lt;meta http-equiv=&quot;expires&quot; content=&quot;0&quot;&gt;
... andere Angaben im Dateikopf ...
&lt;/head&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Mit <tt>&lt;meta http-equiv=&quot;expires&quot; content=&quot;0&quot;&gt;</tt> veranlassen Sie den Server-Rechner, einem aufrufenden WWW-Browser zu befehlen, diese HTML-Datei in jedem Fall von der Original-Adresse auf dem Server-Rechner zu laden (<i>http-equiv = http equivalent = gem&auml;&szlig; HTTP-Befehl, expires = f&auml;llig werden</i>).</p>

<h3 class="inf">Beachten Sie:</h3>

<p>Bei <tt>content=</tt> k&ouml;nnen Sie anstelle der <tt>0</tt> in diesem Zusammenhang auch ein bestimmtes Datum und eine bestimmte Uhrzeit angeben. Dadurch bewirken Sie, da&szlig; der WWW-Browser bis zu dem definierten Zeitpunkt die Daten auch von einem Proxy-Server holen darf, danach aber vom Original-Server holen mu&szlig;. Datum und Uhrzeit m&uuml;ssen Sie im internationalen Format angeben. Beispiel: <tt>content=&quot;Sat, 14 Dec 1998 12:00:00 GMT&quot;</tt>. Notieren Sie den Zeitpunkt so wie im Beispiel mit allen Leerzeichen, Doppelpunkten zwischen Stunden, Minuten und Sekunden sowie der Angabe <tt>GMT</tt> am Ende. Als Wochentagsnamen sind erlaubt <tt>Mon</tt> (Montag), <tt>Tue</tt> (Dienstag), <tt>Wed</tt> (Mittwoch), <tt>Thu</tt> (Donnerstag), <tt>Fri</tt> (Freitag), <tt>Sat</tt> (Samstag) und <tt>Sun</tt> (Sonntag). Als Monatsnamen sind erlaubt <tt>Jan</tt> (Januar), <tt>Feb</tt> (Februar), <tt>Mar</tt> (M&auml;rz), <tt>Apr</tt> (April), <tt>May</tt> (Mai), <tt>Jun</tt> (Juni), <tt>Jul</tt> (Juli), <tt>Aug</tt> (August), <tt>Sep</tt> (September), <tt>Oct</tt> (Oktober), <tt>Nov</tt> (November) und <tt>Dec</tt> (Dezember).</p>

<p>Anstelle der <tt>0</tt> k&ouml;nnen Sie auch eine Zahl angeben. Diese Zahl bedeutet dann die Anzahl Sekunden, nach deren Ablauf der WWW-Browser eine Datei, die er im Cache hat, auf jeden Fall wieder vom Server l&auml;dt. Mit <tt>content=43200</tt> stellen Sie beispielsweise einen Wert von 12 Stunden ein.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a9"><img src="xhtml4.gif" width=30 height=30 border=0 alt="HTML4.0"> F&uuml;r Browser: Automatische Weiterleitung zu anderer Adresse</a></h2>

<p>Zum Beispiel f&uuml;r das automatische Weiterleiten eines Anwenders von einer alten Adresse Ihres Projekts zu der neuen Adresse k&ouml;nnen Sie das automatische Laden einer anderen Datei veranlassen. Wenn die HTML-Datei dann aufgerufen wird, ruft der WWW-Browser sofort oder nach einem frei w&auml;hlbaren Timeout eine andere gew&uuml;nschte Datei auf.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;head&gt;
&lt;meta http-equiv=&quot;refresh&quot; content=&quot;5; URL=http://www.teamone.de/selfhtml/&quot;&gt;
... andere Angaben im Dateikopf ...
&lt;/head&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Mit <tt>&lt;meta http-equiv=&quot;refresh&quot; content=&quot;...&quot;&gt;</tt> veranlassen Sie den Start einer anderen Datei. Mit <tt>content=&quot;5;</tt> bestimmen Sie die Anzeigedauer der Datei in Sekunden. Die 5 im Beispiel bedeutet also, da&szlig; die Datei 5 Sekunden lang angezeigt wird. Danach wird die n&auml;chste Datei aufgerufen,
die mit <tt>url=...&quot;</tt> spezifiziert wird. Notieren Sie den gesamten Befehl inclusive der etwas ungewohnten Stellung der Anf&uuml;hrungszeichen so wie im Beispiel oben angegeben. Setzen Sie jeweils Ihre gew&uuml;nschte Anzeigedauer und den Namen der n&auml;chsten aufzurufenden Datei ein. F&uuml;r die Adressierung der Datei gelten die gleichen Regeln wie bei <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tcf.htm"><b>Verweisen</b></a>. Bei einem Timeout von <tt>0</tt> wird die angegebene n&auml;chste Datei sofort geladen.</p>

<h3 class="inf">Beachten Sie:</h3>

<p>Dieser HTML-Befehl funktioniert auch ohne HTTP-Protokoll, also lokal auf jedem Rechner.</p>

<p>Verlassen Sie sich nicht darauf, da&szlig; dieser Befehl in jedem Browser funktioniert. Wenn Sie etwa eine Weiterleitung zu einer neuen Adresse eingeben, notieren Sie am besten auf der gleichen Seite zur Sicherheit noch einen normalen Verweis zu der neuen Adresse. So finden auch Anwender, bei denen die Meta-Angabe nicht funktioniert, den Weg zu Ihrer neuen Heimat.</p>




<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a10"><img src="xhtml4.gif" width=30 height=30 border=0 alt="HTML4.0"> Meta-Angaben in separater Datei (Profil)</a></h2>

<p>Sie k&ouml;nnen ein &quot;Profil&quot; f&uuml;r Meta-Angaben angeben, an das Sie sich halten. Das Profil sollte sowohl f&uuml;r Browser als auch f&uuml;r Suchdienste aufrufbar sein, d.h. eine Datei mit eigener http-Adresse sein.</p>

<p>Es kann sich dabei um allgemein bekannte Profile handeln, die bestimmte Internet-Adressen als Heimat haben. Denkbar ist eine solche Adresse beispielsweise f&uuml;r <img src="xgoup.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>Dublin Core</b></a>. Ebenso ist es aber auch m&ouml;glich, eine eigene Datei mit eigenen Meta-Definitionen anzugeben. In der HTML-4.0-Spezifikation hat man sich zu weiteren Einzelheiten jedoch ausgeschwiegen, wie ein Profil genau aussehen sollte.</p>


<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;head profile=&quot;http://meine.org/profil.rdf&quot;&gt;
 &lt;meta name=&quot;Kategorie&quot; content=&quot;A.1.B&quot;&gt;
&lt;/head&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Um ein Profil einzubinden, notieren Sie im einleitenden <tt>&lt;head&gt;</tt>-Tag das Attribut <tt>profile=</tt>. Als Angabe notieren Sie dazu in Anf&uuml;hrungszeichen die Adresse, wo die Profildatei abgelegt ist.</p>

<p>In dem Beispiel wird ein Profil zugrunde gelegt, da&szlig; auf der Internet-Adresse http://meine.org/profil.rdf abgelegt ist. Es wird angenommen, da&szlig; in dem Profil eine Meta-Angabe mit dem Namen <tt>Kategorie</tt> definiert wird. Diese Meta-Angabe kann dann innerhalb des Dateikopfes benutzt werden.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a11"><img src="xhtml4.gif" width=30 height=30 border=0 alt="HTML4.0"> Schema f&uuml;r eine Meta-Angabe</a></h2>

<p>Wenn Sie eigene Meta-Angaben in einem <img src="xgoup.gif" width=14 height=10 border=0>&nbsp;<a href="#a10"><b>Profil</b></a> definieren, k&ouml;nnen Sie dort auch Schemata f&uuml;r bestimmte Daten festlegen. So k&ouml;nnen Sie beispielsweise bestimmen, wie Sie Datum und Uhrzeit angeben, oder wie eine ISBN-Nummer aufgebaut ist. Innerhalb einer Meta-Angabe k&ouml;nnen Sie ein solches Schema dann benutzen.</p>


<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;head profile=&quot;http://meine.org/profil.rdf&quot;&gt;
 &lt;meta name=&quot;Kategorie&quot; scheme=&quot;Klasse3&quot; content=&quot;A.1.B&quot;&gt;
&lt;/head&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>In dem Beispiel wird ein Profil zugrunde gelegt, da&szlig; auf der Internet-Adresse http://meine.org/profil.rdf abgelegt ist. Es wird angenommen, da&szlig; in dem Profil eine Meta-Angabe mit dem Namen <tt>Kategorie</tt> definiert wird. Diese Meta-Angabe kann dann innerhalb des Dateikopfes benutzt werden. Dort wird aber auch noch ein Schema namens <tt>Klasse3</tt> definiert. Innerhalb einer Meta-Angabe k&ouml;nnen Sie dieses Schema dann benutzen.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a12"> Diverse Meta-Angaben</a></h2>

<p>Die folgenden Meta-Angaben sind verstreute &quot;Sammlerst&uuml;cke&quot;. Es gibt noch viel mehr davon. Hier nur ein paar:</p>

<p><tt>&lt;meta http-equiv=&quot;content-language&quot; content=&quot;de&quot;&gt;</tt><br>
Sprache des Dateiinhalts (HTTP 1.0 und RFC1766)</p>

<p><tt>&lt;meta name=&quot;generator&quot; content=&quot;MS Frontpage 2.0&quot;&gt;</tt><br>
<tt>&lt;meta name=&quot;generator&quot; content=&quot;Netscape Composer&quot;&gt;</tt><br>
Wird von HTML-Editoren, vor allem von Wysiwyg-Editoren ohne Wissen des Autors eingef&uuml;gt. Software-Hersteller k&ouml;nnen so prima das Web durchsuchen und feststellen, wo und wieviel mit ihrer Software gearbeitet wird</p>

<p><tt>&lt;meta http-equiv=&quot;ext-cache&quot; 
content=&quot;name=/some/path/index.db; instructions=user instructions&quot;&gt;</tt><br>
Anweisung an den Netscape-Browser: nicht den normalen lokalen Browser-Cache benutzen, sondern den angegebenen externen Cache.</p>

<p><tt>&lt;meta http-equiv=&quot;set-cookie&quot; 
content=&quot;cookievalue=xxx;expires=friday, 31-dec-99 23:59:59 gmt; path=/;&quot;&gt;</tt><br>
Cookie setzen (Netscape)</p>

<p><tt>&lt;meta http-equiv=&quot;pragma&quot; content=&quot;no-cache&quot;&gt;</tt><br>
An Proxy-Agenten: Datei bitte nicht auf Proxy-Server speichern!</p>

<p><tt>&lt;meta name=&quot;revisit-after&quot; content=&quot;20 days&quot;&gt;</tt><br>
An Such-Robot: bitte nach 20 Tagen erneut vorbeikommen und Datei neu auslesen!</p>




<br>&#160;
<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tcbd.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF><img src="x3.gif" width=15 height=10 border=0> <a href="tcbd.htm"><b>Logische Beziehungen einer HTML-Datei</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tcbb.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tcbb.htm"><b>Adre&szlig;basis und Zielfensterbasis</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tc.htm"><b>HTML</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tcb.htm"><b>Allgemeine Angaben zur Datei</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>