<html>
<head>
<title>SELFHTML: HTML / Absatztypen und Textgestaltung / Mehrspaltiger Textflu&szlig; / definieren</title>
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>


<h2 class="Sh2"><a class="an" name="a1"><img src="xnetsi3.gif" width=30 height=30 border=0 alt="Netscape 3.0"> Mehrspaltigen Textflu&szlig; definieren</a></h2>

<p><img src="xshow.gif" width=33 height=14 border=0 alt="Beschreibung"><br>
<a href="tcdn.htm#a1"><b>Beschreibung: so wird's gemacht</b></a></p>


<multicol cols=3>
<p>Lesen des folgenden Textes kann zum Verlust der Faszination der Zauberei führen! Erkl&auml;rungen nur nach Betrachten der Illusionen lesen!</p>
<h3>D.C. err&auml;t Graffiti im voraus</h3>
<p>Der Trick, bei dem DC und Claudia Schiffer sich kennengelernt haben: bei der Premiere in Berlin war sie die Freiwillige (obwohl sie eine halbe Stunde versp&auml;tet kam).</p>
<p>DC f&uuml;hrt eine Mauer auf Rollen auf die B&uuml;hne. Er erkl&auml;rt, da&szlig; er Graffiti vorausahnen kann. Er  zeigt einen Umschlag, welcher an einer Laterne aufgeh&auml;ngt wird. Er l&auml;&szlig;t sich durch Zuschauer diverse Namen und Zahlen zurufen, welche er durch eine Zuschauerin auf die Mauer spr&uuml;hen l&auml;&szlig;t. Schlie&szlig;lich l&auml;&szlig;t er die Zuschauerin die Spraydosen zur&uuml;cklegen (Ordnung mu&szlig; sein). Er pr&auml;sentiert den Umschlag der Zuschauerin. Dort ist ein Tuch, auf dem (bis auf eine lustige Abweichung) genau das steht, was auf der Mauer war.</p>
<p>Es gibt keine Hellseher, und die verschiedenen Zuschauer wurden auf eine mir glaubw&uuml;rdige Weise ausgew&auml;hlt. Ein genauer Vergleich der Mauer mit dem Tuch zeigt geringf&uuml;gige Abweichungen, ein carbon copy kommt also nicht in Frage (au&szlig;erdem ist ja die lustige Abweichung vorhanden). Die Erkl&auml;rung: W&auml;hrend die Zuschauerin die Spraydosen aufr&auml;umt, gelangt irgendwie das Tuch, welches durch einen Mitarbeiter erstellt wurde, in den hoch und heilig verschlossenen Umschlag. Dies geschieht zu dem Zeitpunkt, wo DC den Umschlag an die Mauer h&auml;lt, um den Brief&ouml;ffner zu greifen, der oben in der Mauer steckt.</p>
<p>Das Tuch wird dann hinter dem Umschlag herausgeholt. Dies geschieht z.B. mit Hilfe eines Schlitzes, so da&szlig; auch eine echte Zuschauerin nichts bemerkt. Auf dem Video ist au&szlig;erdem zu sehen da&szlig; er mit seinem K&ouml;rper den Vorgang teilweise verdeckt. Das dummy-Tuch bleibt im Umschlag zur&uuml;ck.</p>
<p>Eine unterschiedliche Version dieses Tricks wurde in der Sendung Upn Swutsch gezeigt. Da war es eine Kiste, welche hoch und heilig verschlossen war. Deshalb mu&szlig;te auch ein Assistent kommen, der die Kiste &ouml;ffnete, wobei er hinter der Kiste stand. Auch hier gab es also eine Manipulationsm&ouml;glichkeit.</p>
<p>aus:<br>
<img src="xdeu.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.inx.de/~tilman/zauber/"><b>Tilman Hausherr: Zaubertricks</b></a>
</multicol>




&#160;
</body>
</html>