<html>
<head>
<title>SELFHTML: HTML / Tabellen / Farbige Tabellen / Hintergrundfarbe f&uuml;r einzelne Zeilen oder Zellen</title>
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<h2 class="Sh2"><a class="an" name="a1"><img src="xhtml4.gif" width=30 height=30 border=0 alt="HTML4.0"> Hintergrundfarbe f&uuml;r einzelne Zeilen oder Zellen</a></h2>

<p><img src="xshow.gif" width=33 height=14 border=0 alt="Beschreibung"><br>
<a href="tcef.htm#a2"><b>Beschreibung: so wird's gemacht</b></a></p>


<table border cellpadding=4>
      <tr bgcolor=#CCCCCC>
        <th align=left>&#160;</th>
        <th align=left valign=top>Uranus
        <th align=left valign=top>Merkur
      </tr>
      <tr>
        <th align=left valign=top bgcolor=#FFCCFF>Allgemeines
        <td align=left valign=top bgcolor=#CCFFCC>
Der erstaunlichste aller Planeten unseres Sonnensystems ist Uranus, der, von der Sonne her gez&auml;hlt, siebte Planet. Uranus liegt ungef&auml;hr in einem 90-Grad-Winkel zur Sonne, so da&szlig; einer seiner Pole w&auml;hrend der Rotation ununterbrochen praktisch direkt auf die Sonne gerichtet ist. Um so mehr erstaunt es, da&szlig; die Temperatur an beiden Polen fast gleich hoch ist.
        </td>
        <td align=left valign=top bgcolor=#CCFFFF>
Der Planet Merkur ist nach dem flinken Boten der r&ouml;mischen G&ouml;tter benannt und besitzt eine schwindelerregende Umlaufgeschwindigkeit von 48 Kilometern pro Sekunde. Dadurch dauert ein Merkur-Jahr nur 88 Erdentage. Im Gegensatz dazu dauert eine Drehung um die eigene Achse - das hei&szlig;t ein Tag - fast 59 Erdentage.
        </td>
      </tr>
      <tr>
        <th align=left valign=top bgcolor=#FFCCFF>Atmosph&auml;re
        <td align=left valign=top bgcolor=#CCFFCC>
Uranus ist ein Planet ohne feste Erde, dessen Oberfl&auml;che vollst&auml;ndig von einem hei&szlig;en Ozean bedeckt ist. Eine dichte Atmosph&auml;re, die vorwiegend aus Hydgrogen und Helium besteht, bildet einen Druck, der das Wasser auf mehrere tausend Grad erhitzt und es dennoch vor Verdampfung bewahrt. Umgekehrt verhindern die hohen Temperaturen, da&szlig; sich das Wasser in seine Bestandteile spaltet.
        </td>
        <td align=left valign=top bgcolor=#CCFFFF>
Merkur besitzt keine Atmosph&auml;re im &uuml;blichen Sinne - das hei&szlig;t keine gasf&ouml;rmige H&uuml;lle, die Wolken und Wetter bildet oder die die Oberfl&auml;che des Planeten vor sch&auml;dlicher Sonnenstrahlung sch&uuml;tzt. Das schwache Magnetfeld auf Mars zieht nur kaum wahrnehmbare Spuren von geladenen Partikeln von der Sonne an.
        </td>
      </tr>
  </table>




&#160;
</body>
</html>