<html>
<head>
<title>SELFHTML: HTML / Grafik / Verweis-sensitive Grafiken (Image Maps)</title>
<meta name="description" content="(SELFHTML 7.0) Wie Sie Grafiken mit verweis-sensitiven Fl&auml;chen definieren k&ouml;nnen, soda&szlig; Teile der rafik als Verweise fungieren.">
<meta name="keywords" content="SELFHTML, HTML, Grafik, GIF, JPG, JPEG, Verweise, Hyperlinks, Image Maps, verweis-sensitiv">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tc.htm"><b>HTML</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tcg.htm"><b>Grafik in HTML</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Verweis-sensitive Grafiken (Image Maps)</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Verweis-sensitive Grafiken</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Verweis-sensitive Grafiken (server-sided)</b></a><br>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>





<h2 class="Sh2"><a class="an" name="a1"><img src="xhtml32.gif" width=30 height=30 border=0 alt="HTML3.2"> Verweis-sensitive Grafiken</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tcgha.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Verweis-sensitive Grafiken sind Grafiken, in denen der Anwender mit der Maus auf ein Detail klicken kann. Daraufhin wird ein Verweis ausgef&uuml;hrt. Auf diese Weise kann der Anwender in einigen F&auml;llen wesentlich intuitiver und schneller zu Information gelangen als durch lange verbale Verweislisten.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;map name="Testbild"&gt; 
&lt;area shape=rect coords=&quot;1,1,249,49&quot; href=&quot;#Anker&quot;&gt; 
&lt;area shape=rect coords=&quot;1,51,149,299&quot; href=&quot;datei.htm&quot;&gt;
&lt;area shape=rect coords=&quot;251,1,399,399&quot; href=&quot;../datei.htm&quot;&gt;
&lt;area shape=rect coords=&quot;151,51,249,299&quot; href=&quot;http://www.nix.de/&quot;&gt; 
&lt;area shape=rect coords=&quot;1,301,249,399&quot; nohref&gt; 
&lt;/map&gt;
&lt;img src=&quot;hypgraph.gif&quot; usemap=&quot;#Testbild&quot; border=0&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Mit <tt>&lt;map name=&gt;</tt> leiten Sie die Definition der verweis-sensitiven Fl&auml;chen einer Grafik ein. Hinter dem Istgleichzeichen vergeben Sie einen Namen f&uuml;r die verweis-sensitive Grafik. Dieser Name mu&szlig; nichts mit dem Dateinamen der Grafik zu tun haben. Es handelt sich vielmehr um einen Ankernamen, der die gleiche Bedeutung hat wie der Name in einem <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcfb.htm#a1"><b>Verweisanker innerhalb einer HTML-Datei</b></a>. Vergeben Sie keine zu langen Namen. Namen d&uuml;rfen keine Leerzeichen und keine deutschen Umlaute enthalten. Benutzen Sie als Sonderzeichen h&ouml;chstens den Unterstrich &quot;_&quot;. Der Name mu&szlig; in Anf&uuml;hrungszeichen stehen. 
Hinter dem Namen endet das einleitende <tt>&lt;map&gt;</tt>-Tag mit <tt>&gt;</tt>.</p>

<p>Die <tt>&lt;map&gt;</tt>-Anweisung kann an einer beliebigen Stelle innerhalb des K&ouml;rpers einer HTML-Datei (also zwischen Die <tt>&lt;body&gt;</tt> und
<tt>&lt;/body&gt;</tt>) stehen. Die Angaben dieser Anweisung erzeugen keine
Bildschirmausgabe. Es empfiehlt sich jedoch, die Anweisung an einer markanten,
gesonderten Stelle innerhalb der Datei zu notieren, z.B am Anfang oder am Ende
des Dateik&ouml;rpers.</p>

<p>Zwischen dem einleitenden <tt>&lt;map...&gt;</tt> und dem abschlie&szlig;enden <tt>&lt;/map&gt;</tt> definieren Sie die verweis-sensitiven Fl&auml;chen. Mit <tt>&lt;area...&gt;</tt> definieren Sie einzelne verweis-sensitive Fl&auml;chen einer bestimmten Grafik, die Sie an einer anderen Stelle einbinden.</p>

<p>Durch die Angabe <tt>shape=rect</tt> bestimmen Sie eine viereckige
Fl&auml;che, mit <tt>shape=circle</tt> einen Kreis, und mit <tt>shape=polygon</tt> k&ouml;nnen Sie ein beliebiges Vieleck als verweis-sensitiv definieren.</p>

<p>Bei <tt>coords=</tt> geben Sie die Koordinaten der verweis-sensitiven Fl&auml;chen an. Die Pixelangaben bedeuten absolute Werte innerhalb
der Grafik, die verweis-sensitiv sein soll. Die Angaben sollten in Anf&uuml;hrungszeichen stehen. Trennen Sie alle Pixelwerte durch Kommata.</p>

<ul>
<li>Ein <b>Viereck</b> (<tt>shape=rect</tt>) definieren Sie mit den Koordinaten f&uuml;r x1,y1,x2,y2<br>
wobei bedeuten:<br>
x1 = linke obere Ecke, Pixel von links<br>
y1 = linke obere Ecke, Pixel von oben<br>
x2 = rechte untere Ecke, Pixel von links<br>
y2 = rechte untere Ecke, Pixel von oben</li>
<li>Einen <b>Kreis</b> (<tt>shape=circle</tt>) definieren Sie mit den Koordinaten f&uuml;r x,y,r<br>
wobei bedeuten:<br>
x = Mittelpunkt, Pixel von links<br>
y = Mittelpunkt, Pixel von oben<br>
r = Radius in Pixel</li>
<li>Ein <b>Polygon</b> (<tt>shape=polygon</tt>) definieren Sie mit den
Koordinaten x1,y1,x2,y2 ... 
x<small><sub>n</sub></small>,y<small><sub>n</sub></small>&quot;</b><br>
wobei bedeuten:<br>
x = Pixel einer Ecke von links<br>
y = Pixel einer Ecke von oben<br>
Sie k&ouml;nnen so viele Ecken definieren wie Sie wollen. Von der letzten definierten Ecke m&uuml;ssen Sie sich eine Linie zur ersten definierten Ecke hinzudenken. Diese schlie&szlig;t das Polygon.</li>
</ul>

<p>Mit dem Attribut <tt>href=</tt> bestimmen Sie das Ziel, also die Datei, die aufgerufen werden soll, wenn der Anwender die verweis-sensitive Fl&auml;che anklickt. Dabei gelten die gleichen Regeln wie bei <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tcf.htm"><b>Verweisen</b></a>. Wenn Sie eine Fl&auml;che explizit als nicht anklickbar ausweisen wollen, k&ouml;nnen Sie dies mit dem Attribut <tt>nohref</tt> tun. Wenn Sie solche Angaben weglassen, sind Fl&auml;chen, die nicht durch <tt>href=</tt> abgedeckt sind, allerdings automatisch nicht anklickbar.</p>

<p>Die Grafik, die verweis-sensitive Fl&auml;chen haben soll, referenzieren Sie
auf herk&ouml;mmliche Weise mit Hilfe des <tt>&lt;img&gt;</tt>-Tags (mehr
hierzu siehe unter <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcga.htm"><b>Grafiken einbinden</b></a>). Um 
die Grafik als verweis-sensitiv zu kennzeichnen, m&uuml;ssen Sie das Attribut <tt>usemap=</tt> (siehe obiges Beispiel) notieren. Hinter dem Istgleichzeichen geben Sie den Namen an, den Sie bei der Definition der verweis-sensitiven Fl&auml;chen im einleitenden <b>&lt;map&gt;</b>-Tag vergeben haben. Der Name mu&szlig; in Anf&uuml;hrungszeichen stehen und ein 
<tt>#</tt> vorangestellt bekommen.</p>

<h3 class="inf">Beachten Sie:</h3>

<p>Um die gew&uuml;nschten Pixelkoordinaten f&uuml;r verweis-sensitive Fl&auml;chen einer Grafik zu erhalten, k&ouml;nnen Sie beispielsweise ein Grafikprogramm benutzen, bei dem Sie mit der Maus in der angezeigten Grafik herumfahren k&ouml;nnen und dabei die genauen Pixelkoordinaten des Mauszeigers angezeigt bekommen.</p>

<p>Sie k&ouml;nnen die verweis-sensitiven Fl&auml;chen auch in einer anderen HTML-Datei definieren als in derjenigen, in der Sie die Grafik referenzieren. Dann m&uuml;ssen Sie in der Grafikreferenz bei <tt>usemap=</tt> den
Dateinamen und das Sprungziel innerhalb der Datei angeben, wo die verweis-
sensitiven Fl&auml;chen definiert werden. Das funktioniert genauso wie bei <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tcf.htm"><b>Verweisen</b></a>.</p>

<p>Um beim &Uuml;berfahren einer verweissensitiven Fl&auml;che mit der Maus ein kleines Fenster (&quot;Tooltip&quot;-Fenster) anzuzeigen, k&ouml;nnen Sie in den <tt>&lt;area&gt;</tt>-Tags jeweils das <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcma.htm"><b>Universalattribut</b></a> <tt>title=&quot;Mein angezeigter Text&quot;</tt> verwenden. Dies wird vom MS Internet Explorer ab Version 4.x interpretiert. Netscape kennt diese Angabe in seiner Version 4.x noch nicht.</p>

<p>Innerhalb eines jeden <tt>&lt;area&gt;</tt>-Tags ist auch das Attribut <tt>tabindex=</tt> erlaubt. Die Wirkung ist die gleiche wie bei der <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcfk.htm#a1"><b>Tabulator-Reihenfolge bei Verweisen</b></a> und wird dort n&auml;her beschrieben. Ebenfalls erlaubt ist das Attribut <tt>accesskey=</tt>. Dies funktioniert genau wie bei <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcfk.htm#a2"><b>Tastaturk&uuml;rzeln f&uuml;r Verweise</b></a> und wird dort n&auml;her beschrieben</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2"><img src="xok.gif" width=30 height=30 border=0 alt="HTML2.0"> Verweis-sensitive Grafiken (server-sided)</a></h2>

<p>Bei dieser Methode ist zum Verwalten von verweis-sensitiven Grafiken eine Kommunikation zwischen WWW-Browser und Server-Rechner erforderlich. Das bedeutet, da&szlig; verweis-sensitive Grafiken mit dieser Mehtode nur online im WWW realisierbar sind (also nicht auf dem lokalen Rechner), und 
da&szlig; Sie in jedem Fall mit Ihrem Provider die genaue Vorgehensweise kl&auml;ren m&uuml;ssen. Der Vorteil ist, da&szlig; solche verweis-sensitiven Grafiken auch mit &auml;lteren WWW-Browsern ausf&uuml;hrbar sind. Der Nachteil ist die umst&auml;ndliche Handhabung. Das W3-Konsortium r&auml;t mittlerweile von dieser Form verweis-sensitiver Grafiken ab, weil sie unn&ouml;tig die Netzlast erh&ouml;ht.</p>

<p>Das Prinzip funktioniert folgenderma&szlig;en: aufgrund eines HTML-Befehls wei&szlig; der WWW-Browser, da&szlig; es sich bei einer Grafik um eine verweis-sensitive Grafik handelt. Wenn der Anwender dann irgendwo auf die angezeigte Grafik klickt, &uuml;bertr&auml;gt der WWW-Browser die Pixelkoordinaten des Mausklicks (relativ zur oberen linken Ecke der Grafik) an eine spezielle &quot;Imagemap&quot;-Software auf dem Server-Rechner. Diese Software ermittelt, ob die Pixelkoordinaten innerhalb einer als verweis-sensitiv definierten Fl&auml;che der Grafik liegen. Wenn ja, ermittelt die Software, welcher Verweis dieser sensitiven Fl&auml;che zugeordnet ist. Die entsprechende Verweisadresse wird dem WWW-Browser gesendet. Dieser f&uuml;hrt den Verweis dann aus.</p>

<p>Wenn Sie eine verweis-sensitive Grafik nach diesem Schema einsetzen m&ouml;chten, fragen Sie bei Ihrem Provider nach, welche Software zum Verarbeiten verweis-sensitiver Grafiken auf diesem Server im Einsatz ist, und was genau Sie brauchen. In der Regel brauchen Sie eine sog. &quot;Map-Datei&quot; und einen Eintrag in einer Konfigurationsdatei. In der Map-Datei ordnen Sie verweis-sensitive Fl&auml;chen und 
gew&uuml;nschte Verweise einander zu. In der Konfigurationsdatei ist ein Eintrag f&uuml;r die Server-Software n&ouml;tig.</p>

<p>Bei der Syntax der Map-Dateien gibt es mehrere Varianten. Fragen Sie ggfs. Ihren Provider nach Beispieldateien und nach Dokumentation zu der von ihm angebotenen Variante.</p>

<p>Das folgende Beispiel zeigt den Teil, den Sie in der HTML-Datei notieren m&uuml;ssen.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;a href=&quot;MapName&quot;&gt;&lt;img src=&quot;datei.gif&quot; ismap>&lt;/a&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>


<p>In der Mitte des Befehls zur Verarbeitung einer verweis-sensitiven Grafik steht der HTML-Befehl zum <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcga.htm"><b>Einbinden einer Grafik</b></a>. Im Beispiel wird die Datei &quot;datei.gif&quot; eingebunden. Der Befehl mu&szlig; au&szlig;er dem Attribut <tt>src=</tt> noch das Attribut <tt>ismap</tt> enthalten. Hierdurch wird dem Server-Rechner mitgeteilt, da&szlig; es sich um eine verweis-sensitive Grafik handelt.</p>

<p>Das ganze Konstrukt ist eine <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcgg.htm"><b>Grafik als Verweis</b></a>. Dabei steht der Befehl f&uuml;r die Grafikeinbindung an der Stelle, wo bei einem normalen Textverweis der Text steht, der dem Anwender als Verweistext angeboten wird.</p>

<p>Das Ziel des Verweises ist jedoch keine Datei, sondern ein symbolischer Name, der zuvor in der oben angesprochenen Konfigurationsdatei des Server-Rechners vergeben wurde. Im Beispiel ist das der symbolische Name <tt>&quot;MapName&quot;</tt>.</p>










<br>&#160;
<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tcgi.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF><img src="x3.gif" width=15 height=10 border=0> <a href="tcgi.htm"><b>Browser-interne Grafik-Ressourcen</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tcgg.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tcgg.htm"><b>Grafiken als Verweise</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tc.htm"><b>HTML</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tcg.htm"><b>Grafik in HTML</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>