<html>
<head>
<title>SELFHTML: HTML / Formulare / Formulare definieren</title>
<meta name="description" content="(SELFHTML 7.0) Wie Sie in HTML Formulare definieren, und wozu Formulare da sind.">
<meta name="keywords" content="SELFHTML, HTML, Formulare">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tc.htm"><b>HTML</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tch.htm"><b>Formulare</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Formulare definieren</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Allgemeines zu Formularen</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Formular definieren</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>Zielfenster f&uuml;r Server-Antwort bei Frames</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a4"><b>Weitere M&ouml;glichkeiten</b></a><br>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>





<h2 class="Sh2"><a class="an" name="a1">Allgemeines zu Formularen</a></h2>

<p>HTML stellt die M&ouml;glichkeit zur Verf&uuml;gung, mit Hilfe spezieller Befehle Formulare zu erstellen. In Formularen kann der Anwender Eingabefelder ausf&uuml;llen, in mehrzeiligen Textfeldern Text eingeben, aus Listen Eintr&auml;ge ausw&auml;hlen und Buttons anklicken. Wenn das Formular fertig ausgef&uuml;llt ist, kann der Anwender auf einen Button klicken, um das Formular abzusenden.</p>

<p>Dazu geben Sie beim Erstellen eines Formulars an, was mit den Daten des ausgef&uuml;llten Formulars passieren soll. Sie k&ouml;nnen sich die ausgef&uuml;llten Daten beispielsweise per E-Mail zuschicken lassen oder von einem CGI-Programm auf dem Server-Rechner weiterverarbeiten lassen.</p>

<p>Formulare k&ouml;nnen sehr unterschiedliche Aufgaben haben. So werden sie zum Beispiel eingesetzt:</p>

<ul>
<li>um bestimmte, gleichartig strukturierte Ausk&uuml;nfte von Anwendern einzuholen,</li>
<li>um Anwendern das Suchen in Datenbanken zu erm&ouml;glichen,</li>
<li>um Anwendern die M&ouml;glichkeit zu geben, selbst Daten f&uuml;r eine Datenbank beizusteuern,</li>
<li>um dem Anwender die M&ouml;glichkeit individueller Interaktion zu bieten, etwa um aus einer Produktpalette etwas Bestimmtes zu bestellen.</li>
</ul>

<p>Ein Software-Hersteller k&ouml;nnte z.B. ein Formular zur Verf&uuml;gung stellen, in dem der Anwender angeben kann, welche Produkte der Firma er besitzt, wie er Kenntnis von den Produkten erhalten hat, welchen Beruf er aus&uuml;bt, auf welchem Rechnertyp die Software bei ihm l&auml;uft usw. Auf diese Weise k&ouml;nnte er gleichartig strukturiertes und daher gut vergleichbares Feedback von Anwendern einholen.</p>

<p>Viele Suchdienste im Internet bieten dem aufrufenden WWW-Browser in HTML geschriebene Eingabe-Formulare an, in denen der Anwender seinen Suchwunsch spezifizieren kann. Ohne solche Formulare w&auml;re das Durchsuchen gar nicht m&ouml;glich. Die meisten Suchdienste bieten dar&uuml;ber hinaus auch die M&ouml;glichkeit an, eigene Internet-Adressen in die Datenbank einzuspeisen. Das Einholen der dazu n&ouml;tigen Information geschieht ebenfalls mit Hilfe von Formularen.</p>

<p>Immer zahlreicher werden auch die Bestell-Services im Internet. Egal ob Tickets, Pizza oder Unterw&auml;sche - um solche Bestell-Services zu realisieren, sind Formulare erforderlich, in denen der Anwender seine Bestellw&uuml;nsche genau angeben kann.</p>

<p>Wenn Sie dem Anwender auf Ihren WWW-Seiten einfach nur eine M&ouml;glichkeit anbieten wollen, direkt mit Ihnen in Kontakt zu treten, gen&uuml;gt allerdings auch ein einfacher <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcff.htm"><b>E-Mail-Verweis</b></a> an die eigene Email-Adresse.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2"><img src="xok.gif" width=30 height=30 border=0 alt="HTML2.0"> Formular definieren</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tchaa.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Sie k&ouml;nnen an einer beliebigen Stelle innerhalb des Dateik&ouml;rpers einer HTML-Datei ein Formular definieren.</p>

<h3 class="xmp">Beispiel 1:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;form action=&quot;mailto:muenz@csi.com&quot; method=post enctype=&quot;text/plain&quot;&gt;
... Elemente des Formulars wie Eingabefelder, Auswahllisten, Buttons usw. ...
&lt;/form&gt;
</pre></td></tr></table>
<h3 class="xmp">Beispiel 2:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;form action=&quot;/cgi-bin/auswert.pl&quot; method=get&gt;
... Elemente des Formulars wie Eingabefelder, Auswahllisten, Buttons usw. ...
&lt;/form&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Mit <tt>&lt;form ...&gt;</tt> definieren Sie ein Formular (<i>form = Formular</i>). Alles, was zwischen diesem einleitenden Tag und dem abschlie&szlig;enden Tag <tt>&lt;/form&gt;</tt> steht, geh&ouml;rt zum Formular. Das sind haupts&auml;chlich Elemente des Formulars wie Eingabefelder, Auswahllisten oder Buttons. Um die Elemente zu plazieren, brauchen Sie jedoch auch <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcdb.htm"><b>Textabs&auml;tze</b></a> (Absatzschaltungen) und <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcdc.htm#a1"><b>erzwungene Zeilenumbr&uuml;che</b></a>. Dar&uuml;ber hinaus k&ouml;nnen Sie zwischen <tt>&lt;form...&gt;</tt> und <tt>&lt;/form&gt;</tt> auch Text eingeben und diesen Text wie &uuml;blich mit HTML-Befehlen formatieren. Auch Grafiken, Verweise, Tabellen, Multimedia-Elemente sind mitten im Formular erlaubt. So k&ouml;nnen Sie Ihr Formular optisch aufwerten und mit erkl&auml;rendem Text usw. versehen.</p>

<p>Im einleitenden <tt>&lt;form&gt;</tt>-Tag geben Sie mit <tt>action=</tt> an, was mit den ausgef&uuml;llten Formulardaten passieren soll, wenn der Anwender das Formular abschickt (<i>action = Aktion</i>). Die Angabe sollte in Anf&uuml;hrungszeichen stehen.</p>

<p>Die Angabe bei <tt>action=</tt> ist entweder eine E-Mail-Adresse (normalerweise Ihre eigene) mit vorangestelltem <tt>mailto:</tt> - so wie im ersten der obigen Beispiele (<i>mailto = sende an</i>). Dann werden die ausgef&uuml;llten Formulardaten an diese E-Mail-Adresse geschickt.<br>
Oder Sie rufen ein Programm auf dem Server-Rechner, meistens ein CGI-Programm, auf, das die Daten weiterverarbeitet - so wie im zweiten der obigen Beispiele. Bei der Adressierung des CGI-Programms gelten die gleichen Regeln wie bei <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tcf.htm"><b>Verweisen</b></a>.<br>
Weitere Hinweise hierzu in den Abschnitten <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tchl.htm#a1"><b>Formulare als E-Mail</b></a> und <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tchl.htm#a2"><b>Formulare und CGI</b></a>.<br>
Allgemeines zum Thema CGI finden Sie au&szlig;erdem im Abschnitt <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tbbc.htm"><b>CGI - Common Gateway Interface</b></a>. Und schlie&szlig;lich enth&auml;lt dieses Dokument eine einf&uuml;hrende <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tg.htm"><b>CGI/Perl</b></a>-Dokumentation.</p>

<p>Bei der Formulardefinition m&uuml;ssen Sie als n&auml;chstes die &Uuml;bertragungsmethode angeben. Dabei gibt es zwei M&ouml;glichkeiten:</p>

<ul>
<li>Wenn Sie <tt>method=get</tt> w&auml;hlen, werden die Daten des ausgef&uuml;llten Formulars auf WWW-Servern mit installiertem HTTP-Protokoll in der <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgbd.htm"><b>CGI-Umgebungsvariablen</b></a> QUERY_STRING gespeichert (<i>method = Methode, get = bekommen</i>). Das CGI-Programm mu&szlig; den Inhalt dieser Umgebungsvariablen auslesen und verarbeiten.</li> 
<li>Wenn Sie <tt>method=post</tt> w&auml;hlen, werden die Daten des augef&uuml;llten Formulars auf dem Server-Rechner von &quot;stdin&quot; zur Verf&uuml;gung gestellt, und das CGI-Programm mu&szlig; sie behandeln wie eine Benutzereingabe, die auf der Kommandozeile gemacht wurde (<i>post = verschicken</i>). Da in diesem Fall kein EndOfFile-Signal (EOF) gesendet wird, mu&szlig; das CGI-Programm die CGI-Umgebungsvariable CONTENT_LENGTH auslesen, um die L&auml;nge der &uuml;bermittelten Daten und damit deren Ende zu ermitteln.</li>
</ul>

<p>Wenn Sie sich Formulardaten per E-Mail zuschicken lassen, benutzen Sie immer <tt>method=post</tt>. Au&szlig;erdem sollten Sie bei E-Mail-Empfang von Formulardaten immer die Angabe <tt>enctype=&quot;text/plain&quot;</tt> mit angeben. Denn Formulardaten sind normalerweise nach einem bestimmten Schema formatiert, das f&uuml;r auswertende Programme recht gut geeignet ist, aber f&uuml;r Menschen keine Freude zu lesen ist. Mit der genannten Angabe erhalten Sie zumindest von Anwendern, die Ihr Formular mit einem modernen WWW-Browser ausf&uuml;llen, ordentlich formatierte E-Mails.</p>


<h3 class="inf">Beachten Sie:</h3>

<p>Nicht alle Browser beherrschen das Versenden von Formularen per E-Mail (mehr dazu siehe <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tchl.htm"><b>Formulare auswerten</b></a>).</p>




<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a3"><img src="xhtml4.gif" width=30 height=30 border=0 alt="HTML4.0"> Zielfenster f&uuml;r Server-Antwort bei Frames</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tchab.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Wenn Sie mit <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tci.htm"><b>Frames</b></a> arbeiten und in einem Frame-Fenster ein Formular haben, nach dessen Absenden die Server-Antwort (zum Beispiel die Ausgabe eines CGI-Scripts) in einem anderen Frame-Fenster angezeigt werden soll, k&ouml;nnen Sie das Zielfenster f&uuml;r die Server-Antwort angeben.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;form action=&quot;/cgi-bin/auswert.pl&quot; method=post target=&quot;Daten&quot;&gt;
... Elemente des Formulars wie Eingabefelder, Auswahllisten, Buttons usw. ...
&lt;/form&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Mit dem Attribut <tt>target=</tt> k&ouml;nnen Sie im einleitenden <tt>&lt;form&gt;</tt>-Tag den Namen des Frame-Fensters angeben, in dem die Server-Antwort ausgegeben werden soll. Sowohl Netscape als auch der MS Internet Explorer interpretieren diese Angabe.</p>




<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a4"><img src="xhtml4.gif" width=30 height=30 border=0 alt="HTML4.0"> Weitere M&ouml;glichkeiten</a></h2>


<p>Mit Hilfe von <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="td.htm"><b>JavaScript</b></a> k&ouml;nnen Sie Eingaben in Formularen steuern und kontrollieren. Bereits im einleitenden <tt>&lt;form&gt;</tt>-Tag ist der JavaScript-<img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tdbj.htm"><b>Event-Handler</b></a> <tt>onSubmit=</tt> erlaubt. Beachten Sie dabei auch das JavaScript-Anwendungsbeispiel <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tedf.htm"><b>Formulareingaben &uuml;berpr&uuml;fen</b></a>, bevor das Formular abgesendet wird.</p>

<p>Das <tt>&lt;form&gt;</tt>-Tag kann <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tcm.htm"><b>Universalattribute</b></a> enthalten.</p>

<p>Wenn Sie HTML bereits etwas besser kennen, probieren Sie auch mal die M&ouml;glichkeiten aus, die Ihnen <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="td.htm"><b>CSS Style-Sheets</b></a> bieten. Damit k&ouml;nnen Sie Formulare zus&auml;tzlich formatieren. Zun&auml;chst m&uuml;ssen Sie dazu wissen, wie man <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tdb.htm"><b>Style-Sheets definieren</b></a> kann. Anschlie&szlig;end sind Sie in der Lage, Style-Sheet-Angaben anzuwenden. Interessant sind im hier beschriebenen Zusammenhang beispielsweise folgende Style-Sheet-Angaben:<br>
<img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tdcc.htm"><b>Abst&auml;nde, R&auml;nder, Ausrichtung</b></a><br>
<img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tdcd.htm"><b>Rahmen und Innenabst&auml;nde</b></a><br>
<img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tdce.htm"><b>Hintergrundfarben und -bilder</b></a>
</p>



<br>&#160;
<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tchb.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF><img src="x3.gif" width=15 height=10 border=0> <a href="tchb.htm"><b>Einzeilige Eingabefelder</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tcgi.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tcgi.htm"><b>Browser-interne Grafik-Ressourcen</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tc.htm"><b>HTML</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tch.htm"><b>Formulare</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>