<html>
<head>
<title>SELFHTML: HTML / Formulare / Formulare verarbeiten</title>
<meta name="description" content="(SELFHTML 7.0) Wie Sie HTML-Formulare als E-Mail oder mit CGI verarbeiten.">
<meta name="keywords" content="SELFHTML, HTML, Formulare, verarbeiten, E-Mail, CGI">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tc.htm"><b>HTML</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tch.htm"><b>Formulare</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Formulare verarbeiten</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Formulare als E-Mail</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Formulare und CGI</b></a><br>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>





<h2 class="Sh2"><a class="an" name="a1">Formulare als E-Mail</a></h2>


<p>Viele Anwender, die von gro&szlig;en Discount-Anbietern wie CompuServe, AOL oder T-Online Speicherplatz f&uuml;r eigene WWW-Seiten erhalten, haben keine M&ouml;glichkeit, eigene CGI-Scripts zur Datenverarbeitung auf dem Server-Rechner einzusetzen. Dazu kommt, da&szlig; die meisten modernen Seitenanbieter keine Informatiker sind, die sich in Programmiersprachen, fremde Betriebssystemumgebungen, Umgebungsvariablen und Daten&uuml;bertragungsprotokolle einarbeiten m&ouml;chten. Dennoch m&ouml;chten viele Seitenanbieter die M&ouml;glichkeit nutzen, mit Hilfe von HTML-Formularen gezielte und einheitlich strukturierte Daten von Besuchern ihrer WWW-Seiten einzuholen. Zu diesem Zweck besteht die M&ouml;glichkeit, sich ausgef&uuml;llte Formulare als E-Mail zuschicken zu lassen.</p>

<p>Ein Problem stellen bei dieser L&ouml;sung WWW-Browser dar, die nicht in der Lage sind, mailto-Formulare zu verschicken. Dazu geh&ouml;ren der MS Internet Explorer 3.0, aber etwa auch Netscape 4.0x in der reinen Browser-Version ohne integriertes Mail-Programm. Um dieses Problem zu umgehen, k&ouml;nnen Sie einen &ouml;ffentlichen CGI-Service wie den <img src="xdeu.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://mailservice.cwak.com/"><b>CWAK Mailservice</b></a> in Anspruch nehmen. Dort werden die Formulardaten von einem CGI-Programm verarbeitet und Ihnen dann als E-Mail zugeschickt.</p>

<p>Ein anderes Problem besteht darin, da&szlig; die Formulardaten beim Abschicken per Voreinstellung nach einem bestimmten <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcjj.htm"><b>Mime-Type</b></a> kodiert werden, dem Mime-Typ <tt>application/x-www-form-urlencoded</tt>. Dabei werden alle Leerzeichen, verschiedene Sonderzeichen und Umlaute durch spezielle Zeichenfolgen ersetzt. So lautet beispielsweise der Satz <tt>Danke f&uuml;r die Hilfe!</tt> nach der Umwandlung: <tt>Danke+f%FCr+die+Hilfe%21</tt>. F&uuml;r Menschen ist das ziemlich ungenie&szlig;barer Lesestoff. Um die Kodierung zu verhindern, k&ouml;nnen Sie im einleitenden <tt>&lt;form&gt;</tt>-Tag zwar die Angabe <tt>enctype=&quot;text/plain&quot;</tt> angeben. Von Anwendern, deren WWW-Browser diese Angabe jedoch nicht interpretiert, werden Sie dennoch kodierte Formulardaten erhalten. Um als Anwender kodierte Formulardaten nachtr&auml;glich in lesbaren Text zu dekodieren, k&ouml;nnen Sie ein Hilfsprogramm wie <img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://users.aol.com:80/informatik/webparse.html"><b>WebParse f&uuml;r Windows</b></a> verwenden.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2">Formulare und CGI</a></h2>


<p>Viele Anwendungsf&auml;lle f&uuml;r Formulare in HTML ben&ouml;tigen eine Datenverarbeitung auf dem Server-Rechner im WWW. Wenn Sie beispielsweise Ihr gesamtes WWW-Projekt nach einem Begriff durchsuchbar machen wollen, k&ouml;nnen Sie dem Anwender ein Formular anbieten, in dem er den Suchbegriff eingeben kann. Nach dem Abschicken des Formulars mu&szlig; ein Programm auf dem Server-Rechner alle Dateien des Projekts nach dem gew&uuml;nschten Begriff absuchen und eine dynamische HTML-Datei erzeugen, in der Verweise auf alle Seiten enthalten sind, die den Suchbegriff enthalten.</p> 

<p>F&uuml;r solche F&auml;lle, aber auch f&uuml;r Anwendungsf&auml;lle wie automatische G&auml;steb&uuml;cher, Diskussionsforen, elektronische Einkaufsk&ouml;rbe usw. ben&ouml;tigen Sie ein Programm auf dem Server-Rechner, das die in einem Formular eingegebenen oder ausgew&auml;hlten Daten sofort verarbeitet und dem Anwender echte Interaktion bietet.</p>

<p>Die Standard-Programmierschnittstelle auf WWW-Servern hierf&uuml;r ist CGI (Common Gateway Interface). Manche WWW-Server haben - je nach installierter HTTP-Software - auch noch andere Programmierschnittstellen. Der Provider, bei dem Sie Ihre WWW-Seiten speichern, mu&szlig; Ihnen Zugriff auf diese Programmierschnittstelle erlauben, damit Sie solche Anwendungen selbst realisieren k&ouml;nnen. Viele Discount-Provider wie CompuServe oder T-Online erlauben ihren Mitgliedern keinen solchen Zugriff.</p> 

<p>Die meist verwendete Programmiersprache f&uuml;r CGI-Scripts ist Perl. Fragen Sie jedoch vor dem Programmieren eines eigenen CGI-Scripts Ihren Provider, welche Art von Programmen auf dem Server ausf&uuml;hrbar sind. Wenn Sie in Perl programmieren wollen, fragen Sie den Provider, ob der Server &uuml;ber einen Perl-Interpreter verf&uuml;gt, und wo genau der Interpreter auf dem Server liegt. In diesem Dokument finden Sie eine <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tg.htm"><b>Dokumentation: CGI/Perl</b></a>.</p> 







<br>&#160;
<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tcia.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF><img src="x3.gif" width=15 height=10 border=0> <a href="tcia.htm"><b>Frame-Sets und Frames definieren</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tchk.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tchk.htm"><b>Buttons zum Absenden oder Abbrechen</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tc.htm"><b>HTML</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tch.htm"><b>Formulare</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>