<html>
<head>
<title>SELFHTML: HTML / Multimedia / Daten und Programme als Objekt einbinden</title>
<meta name="description" content="(SELFHTML 7.0) Wie Sie in HTML Daten und Programme als Objekt einbinden einbinden, welche Dateitypen daf&uuml;r in Frage kommen, und worauf Sie achten sollten.">
<meta name="keywords" content="SELFHTML, HTML, Multimedia, Sound, Video, VRML, Shockwave, Java, ActiveX, Objekte">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tc.htm"><b>HTML</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tcj.htm"><b>Multimedia</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Daten und Programme als Objekt einbinden</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Objekte in HTML</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Datendateien als Objekt einbinden</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>Verweis-sensitive Grafiken als Objekt einbinden</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a4"><b>Java-Applets als Objekt einbinden</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a5"><b>ActiveX-Controls als Objekt einbinden</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a6"><b>Rahmen um Objekte</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a7"><b>Namen f&uuml;r Objekte</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a8"><b>Weitere M&ouml;glichkeiten</b></a><br>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>





<h2 class="Sh2"><a class="an" name="a1">Objekte in HTML</a></h2>


<p>Unter &quot;Objekt&quot; wird hier jede Art von Datei verstanden, die sich au&szlig;erhalb einer HTML-Datei befindet und in diese HTML-Datei eingebunden werden soll. Es kann sich um eine Datendatei handeln, also etwa um eine Excel-Tabelle, eine AutoCad-Zeichnung oder eine Midi-Musikdatei. Es kann sich aber auch um eine vom WWW-Browser ausf&uuml;hrbare Datei handeln, also um ein Programm. Das k&ouml;nnen zum Beispiel Java-Applets oder ActiveX-Controls sein.</p>

<p>Damit nicht f&uuml;r jede neue Form der Einbindung anderer Ressourcen ein neues HTML-Tag entsteht, wird es in Zukunft nur noch ein m&auml;chtiges HTML-Tag f&uuml;r alle Multimedia- und Fremdprogrammreferenzen geben: das <tt>&lt;object&gt;</tt>-Tag. Das <tt>&lt;object&gt;</tt>-Tag kann zwar nicht das Problem l&ouml;sen, wie eine beliebige Datei beim Anwender angezeigt werden kann, aber es bietet zumindest eine einheitliche Syntax und tr&auml;gt dadurch zur Vereinfachung von HTML bei.</p> 

<p>Das <tt>&lt;object&gt;</tt>-Tag wird noch nicht vollst&auml;ndig von den WWW-Browsern unterst&uuml;tzt. Es wird deshalb noch eine Weile dauern, bis die Mehrzahl der Anwender einen WWW-Browser besitzt, der den neuen Befehl in allen Varianten richtig interpretiert. Das <tt>&lt;object&gt;</tt>-Tag ist jedoch so ausgelegt, da&szlig; es herk&ouml;mmliche Befehle zum Einbinden von Fremddateien alternativ erm&ouml;glicht.</p>


<h3 class="inf">Beachten Sie:</h3>

<p>Wenn Sie mit Versuchen, das <tt>&lt;object&gt;</tt>-Tag zu verwenden, keinen Erfolg haben, probieren Sie folgende herk&ouml;mmlichen M&ouml;glichkeiten:</p>

<p><img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcjg.htm"><b>Multimedia einbinden (Netscape)</b></a><br>
<img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcjh.htm"><b>Videos einbinden (Microsoft)</b></a><br>
<img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcji.htm"><b>Java-Applets einbinden</b></a></p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2"><img src="xhtml4.gif" width=30 height=30 border=0 alt="HTML4.0"> Datendateien als Objekt einbinden</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tcjaa.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Sie k&ouml;nnen eine beliebige Datendatei als Objekt in eine HTML-Datei einbinden. 
Ein WWW-Browser wie Netscape kann solche Dateien anzeigen, wenn der Anwender ein entsprechendes <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tbbh.htm"><b>Plugin</b></a> installiert hat. Wenn das Plugin installiert ist, kann der WWW-Browser die Datei so in seinem Anzeigefenster pr&auml;sentieren, wie sie von dem Ursprungsprogramm erstellt wurde. Bei Abspielvorg&auml;ngen, etwa von Videos oder Sound, wird ein entsprechender Player angezeigt - je nachdem, wie das Plugin beschaffen ist.</p>

<p>Wenn dem Browser eine Verkn&uuml;pfung zwischen dem Datentyp und einem Fremdprogramm bekannt ist, kann er das Fremdprogramm mit der betreffenden Datei starten.</p>


<h3 class="xmp">Beispiel 1:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;object data=&quot;hochzeit.avi&quot; type=&quot;video/x-msvideo&quot;&gt; 
 &lt;img src=&quot;hochzeit.jpg&quot;&gt; 
&lt;/object&gt;
</pre></td></tr></table>
<h3 class="xmp">Beispiel 2:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;object data=&quot;hochzeit.avi&quot; type=&quot;video/x-msvideo&quot;&gt; 
 &lt;embed src=&quot;hochzeit.avi&quot;&gt; 
&lt;/object&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Mit <tt>&lt;object ...&gt;</tt> leiten Sie die Referenz ein.</p> 

<p>Mit dem Attribut <tt>data=</tt> referenzieren Sie die gew&uuml;nschte Datei (<i>data = Daten</i>). Die Angabe mu&szlig; in Anf&uuml;hrungszeichen stehen. In den obigen Beispielen wird vorausgesetzt, da&szlig; sich die Datei im gleichen Verzeichnis befindet wie die HTML-Datei, in der sie referenziert wird. Die Datei kann sich jedoch auch in einem beliebigen anderen Verzeichnis oder auf einem anderen Internet-Server befinden. In solchen F&auml;llen gelten die gleichen Regeln wie beim <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcga.htm"><b>Einbinden von Grafiken</b></a> (dort mit der Angabe <tt>src=</tt>).</p>

<p>Im Zusammenhang mit dem <tt>&lt;object&gt;</tt>-Tag k&ouml;nnen Sie den <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcjj.htm"><b>Mime-Type</b></a> der Datei angeben. Bei Datendateien, die mit <tt>data=</tt> referenziert werden, notieren Sie dazu die Angabe <tt>type=</tt>. Dahinter folgt, in Anf&uuml;hrungszeichen, ein g&uuml;ltiger Mime-Type. Die Angabe des Mime-Types sollte in Anf&uuml;hrungszeichen stehen. Wenn Sie den Mime-Typ nicht kennen, lassen Sie die Angabe <tt>type=</tt> weg. Wenn Sie den Mime-Type kennen und angeben, helfen Sie dem WWW-Browser durch die Angabe, schneller zu reagieren.</p>

<p>Eine <tt>&lt;object&gt;</tt>-Referenz ben&ouml;tigt ein abschlie&szlig;endes <tt>&lt;/object&gt;</tt>. Zwischen <tt>&lt;object&gt;</tt> und <tt>&lt;/object&gt;</tt> k&ouml;nnen verschiedene Angaben stehen. Im ersten der obigen Beispiele steht dort eine gew&ouml;hnliche <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcga.htm"><b>Grafikreferenz</b></a>. Diese Grafik wird angezeigt, falls die bei <tt>&lt;object...&gt;</tt> angegebene Datei nicht angezeigt werden kann, bzw. wenn der WWW-Browser das <tt>&lt;object&gt;</tt>-Tag nicht kennt. Im zweiten der obigen Beispiele wird an dieser Stelle die gleiche Datei referenziert wie im <tt>&lt;object&gt;</tt>-Tag selbst, jedoch nach der herk&ouml;mmlichen <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcjg.htm"><b>Netscape-Methode zum Einbinden von Multimedia</b></a>. Mit einem  Konstrukt wie im zweiten der obigen Beispiele stellen Sie sicher, da&szlig; auch &auml;ltere Netscape-Versionen den gew&uuml;nschten Befehl erkennen.</p>


<h3 class="inf">Beachten Sie:</h3>

<p>Wenn der WWW-Browser trotz installiertem Plugin Schwierigkeiten bei der Anzeige einer Multimedia-Datei macht, zum Beispiel bei Videos oder VRML-Dateien, dann geben Sie <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcjb.htm#a1"><b>Breite und H&ouml;he der Anzeige</b></a> explizit an.</p>

<p>Wenn Sie bei <tt>type=</tt> den Mime-Type <tt>text/html</tt> und bei <tt>data=</tt> eine HTML-Datei angeben, k&ouml;nnen Sie eine andere HTML-Datei als eingebettetes Objekt innerhalb der aktuellen HTML-Datei anzeigen.</p>




<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a3"><img src="xhtml4.gif" width=30 height=30 border=0 alt="HTML4.0"> Verweis-sensitive Grafiken als Objekt einbinden</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tcjab.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Es gibt bereits Methoden, <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcgh.htm"><b>Grafiken mit verweis-sensitiven Fl&auml;chen</b></a> in HTML einzubinden. Die hier beschriebene Methode folgt dem Ansatz, zuk&uuml;nftig alle Fremddateien nur noch als Objekt einzubinden. Ob sich dies bei Grafiken mit verweis-sensitiven Fl&auml;chen und bei Grafiken allgemein jedoch so bald durchsetzen wird, ist angesichts der Verbreitung des <tt>&lt;img&gt;</tt>-Tags eher zweifelhaft.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;object data=&quot;hypgraph.gif&quot; shapes&gt;
 &lt;a href=&quot;#Anker&quot; shape=rect coords=&quot;1,1,249,49&quot;&gt;Verweistext&lt;/a&gt; 
 &lt;a href=&quot;datei.htm&quot; shape=rect coords=&quot;1,51,149,299&quot;&gt;Verweistext&lt;/a&gt; 
 &lt;a href=&quot;../datei.htm&quot; shape=rect coords=&quot;251,1,399,399&quot;&gt;Verweistext&lt;/a&gt; 
 &lt;a href=&quot;http://www.nix.de/&quot; shape=rect coords=&quot;151,51,249,299&quot;&gt;Verweistext&lt;/a&gt;  
&lt;/object&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Mit <tt>&lt;object ...&gt;</tt> leiten Sie die Referenz ein.</p> 

<p>Mit der Angabe <tt>data=</tt> referenzieren Sie die gew&uuml;nschte Grafikdatei (<i>data = Daten</i>). Die Angabe mu&szlig; in Anf&uuml;hrungszeichen stehen. Beim Referenzieren aus anderen Verzeichnissen oder von anderen WWW-Adressen gelten die gleichen Regeln wie beim <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcga.htm"><b>Einbinden von Grafiken</b></a> (dort mit der Angabe <tt>src=</tt>).</p>

<p>Um das Objekt als Grafik mit verweis-sensitiven Fl&auml;chen kenntlich zu machen, m&uuml;ssen Sie im einleitenden <tt>&lt;object&gt;</tt>-Tag au&szlig;erdem die Angabe <tt>shapes</tt> notieren (<i>shapes = Schablonen</i>).</p>

<p>Zwischen dem einleitenden <tt>&lt;object&gt;</tt> und dem abschlie&szlig;enden <tt>&lt;/object&gt;</tt> definieren Sie die gew&uuml;nschten verweis-sensitven Fl&auml;chen. Mit <tt>&lt;a href=&gt;</tt> bestimmen Sie, wohin ein Verweis f&uuml;hren soll, wenn der Anwender auf den definierten Bereich in der Grafik klickt. Dabei gilt das <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcfa.htm#a2"><b>Schema f&uuml;r Verweise in HTML</b></a>.</p>

<p>Im einleitenden <tt>&lt;a&gt;</tt>-Tag bestimmen Sie mit <tt>shape=</tt> und <tt>coords=</tt> die verweis-sensitiven Fl&auml;chen der Grafik. Dabei gelten die gleichen Regeln wie bei herk&ouml;mmlichen verweis-sensitiven Grafiken.</p>


<h3 class="inf">Beachten Sie:</h3>

<p>Der Verweistext, den Sie zwischen <tt>&lt;a href= shape= coords=&gt;</tt> und <tt>&lt;/a&gt;</tt> angeben, wird dem Anwender angezeigt, wenn der WWW-Browser den Befehl zum Einbinden der verweis-sensitiven Grafik als Objekt nicht kennt, oder falls die Grafik nicht angezeigt werden kann.</p>

<p>Innerhalb der <tt>&lt;a&gt;</tt>-Tags ist auch das Attribut <tt>tabindex=</tt> erlaubt. Die Wirkung ist die gleiche wie bei der <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcfk.htm#a1"><b>Tabulator-Reihenfolge bei Verweisen</b></a> und wird dort n&auml;her beschrieben.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a4"><img src="xhtml4.gif" width=30 height=30 border=0 alt="HTML4.0"> Java-Applets als Objekt einbinden</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tcjac.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Java-Applets sind ausf&uuml;hrbare Programme, deren Bildschirmausgaben
ein WWW-Browser innerhalb seines Anzeigefensters darstellen kann. Applets k&ouml;nnen z.B. bewegte Animationen (Tricksequenzen) enthalten, Echtzeitabl&auml;ufe in bewegten Grafiken darstellen (Stichwort: B&ouml;rsenticker), oder Interaktionen mit dem Anwender austauschen (kleine Spiele wie Hangman oder Mastermind, Taschenrechner, grafische Simulationen aufgrund eingebbarer Parameter usw.).</p>

<p>Java-Programme m&uuml;ssen in compilierter Form vorliegen, um bei der Referenzierung in einer HTML-Datei ausgef&uuml;hrt werden zu k&ouml;nnen. Normalerweise haben compilierte Java-Applets die Dateinamenerweiterung <tt>.class</tt>.</p>


<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;object classid=&quot;java:animation&quot; &quot;codebase=../java/&quot; codetype=&quot;application/java-vm&quot;&gt;
 &lt;param name=animation_text value=&quot;Mein animierter Text&quot;&gt;
&lt;/object&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Mit <tt>&lt;object ...&gt;</tt> leiten Sie die Referenz ein.</p> 

<p>Mit der Angabe <tt>classid=</tt> referenzieren die Programmdatei (<i>classid = class identifier = Klassenbezeichner</i>). Die Angabe mu&szlig; in Anf&uuml;hrungszeichen stehen.</p> 

<p>Die Angabe besteht aus der festen Zeichenfolge <tt>java:</tt> - gefolgt von dem Namen der .class-Datei (also der ausf&uuml;hrbaren Java-Programmdatei), jedoch ohne Angabe der Endung .class. Im obigen Beispiel wird auf diese Weise die Datei <tt>animation.class</tt> in der Form <tt>classid=&quot;java:animation&quot;</tt> eingebunden.</p>

<p>Wenn sich die Programmatei in einem anderen Verzeichnis befindet als die HTML-Datei, in der sie referenziert wird, oder auf einem anderen Internet-Server, dann m&uuml;ssen Sie den Pfad bzw. die Adresse des Server-Rechners und das Verzeichnis angeben, wo sich die Programmdatei befindet (nur das Verzeichnis, nicht mehr den Namen der Programmdatei). Dazu verwenden Sie die Angabe <tt>codebase=</tt>. Die Angabe mu&szlig; in Anf&uuml;hrungszeichen stehen. F&uuml;r die Angaben gelten die gleichen Regeln wie beim <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcga.htm"><b>Einbinden von Grafiken</b></a> (dort mit der Angabe <tt>src=</tt>). Die Angabe von <tt>codebase=</tt> kann in einigen F&auml;llen auch erforderlich sein, um Teile eines Java-Applets von einem bestimmten Internet-Server nachzuladen.</p> 

<p>&Auml;hnlich wie f&uuml;r Datendateien gibt es auch f&uuml;r ausf&uuml;hrbare Programmdateien <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcjj.htm"><b>Mime-Typen</b></a>. Wenn Sie den Mime-Typ eines Programms kennen, k&ouml;nnen Sie mit <tt>codetype=</tt> den Typ angeben. Dadurch helfen Sie dem WWW-Browser, schneller zu reagieren.</p>

<p>Eine <tt>&lt;object&gt;</tt>-Referenz ben&ouml;tigt ein abschlie&szlig;endes <tt>&lt;/object&gt;</tt>. Zwischen <tt>&lt;object&gt;</tt> und <tt>&lt;/object&gt;</tt> k&ouml;nnen  Sie im Zusammenhang mit Java-Applets Aufrufparameter notieren. Viele Java-Applets erwarten einen oder mehrere solche Parameter beim Aufruf. Jeder Parameter wird durch <tt>&lt;param name= value=&gt;</tt> angegeben. Hinter <tt>name=</tt> geben Sie den Namen des Parameters an. Hinter <tt>value=</tt> geben Sie den gew&uuml;nschten Wert des Parameters an, der dem Programm &uuml;bergeben werden soll. Zahlen werden ohne Anf&uuml;hrungszeichen, Zeichenketten mit Anf&uuml;hrungszeichen angegeben.</p> 


<h3 class="inf">Beachten Sie:</h3>

<p>Bei Java-Programmen, die aus mehreren ausf&uuml;hrbaren Dateien bestehen, m&uuml;ssen Sie die Datei angeben, die den Programmstart enth&auml;lt. N&auml;heres dazu entnehmen Sie der Dokumentation, die solchen Java-Programmen beigef&uuml;gt sein sollte. Auch die genauen Anweisungen zum Einbinden eines Java-Applets finden Sie normalerweise in der Dokumentation zu dem Java-Applet.</p> 

<p>Wenn der WWW-Browser Schwierigkeiten bei der Anzeige eines Java-Applets macht, dann geben Sie <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcjb.htm#a1"><b>Breite und H&ouml;he der Anzeige</b></a> explizit an.</p>




<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a5"><img src="xhtml4.gif" width=30 height=30 border=0 alt="HTML4.0"> ActiveX-Controls als Objekt einbinden</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tcjad.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>ActiveX-Controls k&ouml;nnen &auml;hnliche Aufgaben wahrnehmen wie Java-Applets. Jedoch sind sie st&auml;rker als Java-Applets in der Windows-Welt und der Welt von Microsoft verankert und werden nur vom Microsoft Internet Explorer interpretiert.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;object &quot;classid=clsid:663C8FEF-1EF9-11CF-A3DB-080036F12502&quot; 
data=&quot;clock.stm&quot; codebase=&quot;http://www.acme.com/ole/&quot;&gt;
&lt;/object&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Mit <tt>&lt;object ...&gt;</tt> leiten Sie die Referenz ein.</p> 

<p>Mit der Angabe <tt>classid=</tt> referenzieren das ActiveX-Control (<i>classid = class identifier = Klassenbezeichner</i>). Die Angabe mu&szlig; in Anf&uuml;hrungszeichen stehen. Die Angabe besteht aus der festen Zeichenfolge <tt>clsid:</tt> - gefolgt von der Bezeichner-ID. Diese ID m&uuml;ssen Sie kennen.</p>

<p>ActiveX-Controls ben&ouml;tigen in einigen F&auml;llen Initialisierungsdaten, die in einer entsprechenden Datei stehen. Die Datei mit solchen Initialisierungsdaten k&ouml;nnen Sie mit <tt>data=</tt> angeben. Die Angabe mu&szlig; in Anf&uuml;hrungszeichen stehen. Dabei gelten die gleichen Regeln wie beim <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcga.htm"><b>Einbinden von Grafiken</b></a> (dort mit der Angabe <tt>src=</tt>).</p>

<p>Mit der Angabe <tt>codebase=</tt> geben Sie die Internet-Adresse an, von der das ActiveX-Control geladen werden kann, wenn der WWW-Browser es auf dem Rechner des Anwenders nicht findet (ActiveX-Controls werden nach dem Laden normalerweise in einem Windows-Unterverzeichnis abgespeichert - Dateien *.ocx - und beim erneuten Aufruf auch wieder von dort geladen.</p>






<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a6"><img src="xhtml4.gif" width=30 height=30 border=0 alt="HTML4.0"> Rahmen um Objekte</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tcjae.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Sie k&ouml;nnen festlegen, da&szlig; der Browser einen Rahmen um ein eingebundenes Objekt zeichnet. Diese Angabe ist jedoch nur von Bedeutung, wenn die Anzeige mit Hilfe eines Plugins erfolgt und direkt im Anzeigefenster des WWW-Browsers m&ouml;glich ist.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;object data=&quot;hochzeit.avi&quot; border=5&gt; 
&lt;/object&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Durch das Attribut <tt>border=</tt> innerhalb des einleitenden <tt>&lt;object&gt;</tt>-Tags wird ein Rahmen um das Objekt definiert (<i>border = Rand</i>). Die Angabe erfolgt in Pixeln und bedeutet die Rahmendicke.</p>






<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a7"><img src="xhtml4.gif" width=30 height=30 border=0 alt="HTML4.0"> Namen f&uuml;r Objekte</a></h2>

<p>Sie k&ouml;nnen einen Namen f&uuml;r ein Objekt vergeben.</p>


<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;object data=&quot;hochzeit.avi&quot; type=&quot;video/x-msvideo&quot; name="Hochzeitsvideo"&gt; 
 &lt;img src=&quot;hochzeit.jpg&quot;&gt; 
&lt;/object&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Mit <tt>name=</tt> innerhalb der Objektreferenz vergeben Sie einen Namen f&uuml;r das Objekt. Der Name mu&szlig; in Anf&uuml;hrungszeichen stehen, sollte nicht zu lang sein und darf keine Leerzeichen, Sonderzeichen oder deutsche Umlaute enthalten. Nur der Buchstaben, Ziffern und der Unterstrich &quot;_&quot; sind erlaubt.</p>





<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a8"><img src="xhtml4.gif" width=30 height=30 border=0 alt="HTML4.0"> Weitere M&ouml;glichkeiten</a></h2>

<p>Das <tt>&lt;object&gt;</tt>-Tag kann <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tcm.htm"><b>Universalattribute</b></a> enthalten.</p>

<p>Es ist durchaus auch erlaubt, <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="td.htm"><b>CSS Style-Sheets</b></a> auf Multimedia-Objekte anzuwenden. Dazu m&uuml;ssen Sie zun&auml;chst wissen, wie man <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tdb.htm"><b>Style-Sheets definieren</b></a> kann. Anschlie&szlig;end sind Sie in der Lage, Style-Sheet-Angaben anzuwenden. Auf das  <tt>&lt;object&gt;</tt>-Tag k&ouml;nnen Sie beispielsweise folgende Style-Sheet-Angaben anwenden:<br>
<img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tdcc.htm"><b>Abst&auml;nde, R&auml;nder, Ausrichtung</b></a><br>
<img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tdcd.htm"><b>Rahmen und Innenabst&auml;nde</b></a><br>
<img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tdce.htm"><b>Hintergrundfarben und -bilder</b></a><br>
<img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tdch.htm"><b>Elemente positionieren</b></a>
</p>





<br>&#160;
<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tcjb.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF><img src="x3.gif" width=15 height=10 border=0> <a href="tcjb.htm"><b>Breite und H&ouml;he von Objekten</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tcie.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tcie.htm"><b>Tips zum Umgang mit Frames</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tc.htm"><b>HTML</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tcj.htm"><b>Multimedia</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>