<html>
<head>
<title>SELFHTML: HTML / Multimedia / Multimedia einbinden (Netscape)</title>
<meta name="description" content="(SELFHTML 7.0) Wie Sie Multimedia-Objekte nach der Plugin-Technologie von Netscape einbinden k&ouml;nnen.">
<meta name="keywords" content="SELFHTML, HTML, Multimedia, Sound, Video, VRML, Shockwave, Java, ActiveX, Objekte, Plugins">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tc.htm"><b>HTML</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tcj.htm"><b>Multimedia</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Multimedia einbinden (Netscape)</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Multimedia-Datei einbinden</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Weitere Angaben zum Multimedia-Inhalt</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>Alternativer Inhalt</b></a><br>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="a1"><img src="xnetsi2.gif" width=30 height=30 border=0 alt="Netscape2.0"><img src="xmsie3.gif" width=30 height=30 border=0 alt="MS IE3.0"> Multimedia-Datei einbinden</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tcjga.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Unter Multimedia ist hier zu verstehen: Datendateien, die in Fremdformaten vorliegen und Ausgaben erzeugen, die &uuml;ber Text und www-gerechte Grafik hinausreichen. Also zum Beispiel Sound, Video, Animation, Tabellen, Pr&auml;sentations,- Vektor- und CAD-Grafik, 3D-Grafik, VRML-Dateien usw.</p>

<p>Ein WWW-Browser wie Netscape kann solche Dateien anzeigen, wenn der Anwender ein entsprechendes <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tbbh.htm"><b>Plugin</b></a> installiert hat. Wenn das Plugin installiert ist, kann der WWW-Browser die Datei so in seinem Anzeigefenster pr&auml;sentieren, wie sie von dem Ursprungsprogramm erstellt wurde. Bei Abspielvorg&auml;ngen, etwa von Videos oder Sound, wird ein entsprechender Player angezeigt - je nachdem, wie das Plugin beschaffen ist.</p>

<p>Wenn dem Browser eine Verkn&uuml;pfung zwischen der Dateiendung und einem Fremdprogramm bekannt ist, kann er das Fremdprogramm mit der betreffenden Datei starten.</p>



<h3 class="xmp">Beispiele:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;embed src=&quot;tabelle.xls&quot;&gt;
&lt;embed src=&quot;../video.avi&quot;&gt;
&lt;embed src=&quot;multimedia/virtuelleWelt.wrl&quot;&gt;
&lt;embed src=&quot;http://www.teamone.de/selfhtml/yrag.mid&quot;&gt;
&lt;embed src=&quot;file://localhost/c:/windows/progman.hlp&quot;&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Mit <tt>&lt;embed src=&gt;</tt> definieren Sie Plugin-Referenz (<i>embed = einbetten, src = source = Quelle</i>). Hinter dem Istgleichzeichen notieren Sie die gew&uuml;nschte Datei. Die Angabe mu&szlig; in Anf&uuml;hrungszeichen stehen. Sie k&ouml;nnen auch Dateien in anderen Verzeichnissen und weltweit auf anderen Internet-Servern einbinden. Dabei gelten die gleichen Regeln wie beim <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcga.htm"><b>Einbinden von Grafiken</b></a>.</p>

<h3 class="inf">Beachten Sie:</h3>

<p>Ob und wie die Datei letztendlich beim Anwender &quot;angezeigt&quot; wird, h&auml;ngt von vielen Faktoren ab, zum Beispiel von der Art der Datei, von den Hardware-Voraussetzungen des Anwenders, von den installierten Plugins und von vorhandenen, dem Browser bekannten Fremdprogrammen. Binden Sie Multimedia-Dateien daher niemals kommentarlos in Ihre HTML-Dateien ein, sondern weisen Sie den Anwender darauf hin, um welche Art von Daten es sich handelt, und unter welchen Voraussetzungen eine korrekte Anzeige m&ouml;glich ist.</p>

<p>Viele Multimedia-Dateien, vor allem Videos und 3D-Grafiken, sind vom Umfang her ungeeignet f&uuml;r die heutige &uuml;blichen &Uuml;bertragungsraten im WWW. Wenn Sie gr&ouml;&szlig;ere Dateien einbetten, weisen Sie den Anwender im umgebenden Text auf die Gr&ouml;&szlig;e der Datei hin.</p>

<p>Bei Dateitypen, zu denen der Netscape-Browser ein Plugin kennt, fragt er den Anwender, falls dieser das Plugin nicht hat, ob er das Plugin haben m&ouml;chte, und ruft auf Wunsch die &Uuml;bersichtsseiten auf dem Netscape-WWW-Server auf, von wo aus der Anwender sich das Plugin downloaden kann.</p>

<p>Wenn der WWW-Browser die Datei nicht verarbeiten kann, sollte er eine Fehlermeldung ausgeben und anstelle der Datei ein Symbol f&uuml;r nicht darstellbare Daten anzeigen.</p>

<p>Wenn Netscape auf einen Dateityp st&ouml;&szlig;t, den er nicht unmittelbar verarbeiten kann, zu dem er aber eine Verkn&uuml;pfung mit einem Fremdprogramm kennt, wird im Anzeigefenster an der Stelle, wo die Datei angezeigt werden soll, zun&auml;chst ein Icon des Fremdprogramms dargestellt, das beim Doppelklick das Programm mit der eingebundenen Datei startet.</p>

<p>Sie k&ouml;nnen auch <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcfg.htm#a2"><b>Verweise auf beliebige Dateien</b></a> setzen. Der Unterschied ist, da&szlig; die Datei bei einem Verweis erst nach dem Anklicken des Verweises separat aufgerufen wird, w&auml;hrend sie beim Einbinden der Multimedia-Datei so gut wie m&ouml;glich direkt in die Bildschirmanzeige einer HTML-Datei integriert wird.</p>




<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2"><img src="xnetsi2.gif" width=30 height=30 border=0 alt="Netscape2.0"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape4.0"><img src="xmsie3.gif" width=30 height=30 border=0 alt="MS IE3.0">  Weitere Angaben zum Multimedia-Inhalt</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tcjgb.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Es gibt verschiedende Attribute, um n&auml;here Angaben zur eingebundenen Datei zu machen bzw. um das Anzeige- oder Abspielverhalten zu steuern. Nicht alle Browser interpretieren alle diese Angaben.</p>

<h3 class="xmp">Beispiele:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;embed src=&quot;video.avi&quot; width=240 height=160&gt;
&lt;embed src=&quot;musik.wav&quot; autostart=true&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Mit <tt>width=</tt> [Pixel/Prozent] bestimmen Sie die Anzeigebreite des eingebundenen Objkets, mit <tt>height=</tt> die H&ouml;he (<i>width = Breite, height = H&ouml;he</i>). Die Wirkungsweise ist die gleiche wie bei der Angabe von <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcjb.htm"><b>Breite und H&ouml;he eines Objekts</b></a>. Als Besonderheit k&ouml;nnen Sie f&uuml;r Netscape 4.0 noch die Angabe <tt>units=pixels</tt> notieren, damit die Breite bzw. H&ouml;he als Pixel interpretiert werden, oder <tt>units=en</tt>, damit Breite bzw. H&ouml;he in der Ma&szlig;einheit &quot;en&quot; interpretiert werden.</p>

<p>Mit <tt>align=</tt> [Pixel] k&ouml;nnen Sie ein eingebundenes Objekt beschriften oder Text um das Objekt flie&szlig;en lassen. Mit <tt>align=top</tt> richten Sie einen nachfolgenden Text obenb&uuml;ndig zu dem Objekt aus, mit <tt>align=middle</tt> mittig, und mit <tt>align=bottom</tt> untenb&uuml;ndig. Mit <tt>align=left</tt> k&ouml;nnen Sie nachfolgende Elemente rechts um das Objekt flie&szlig;en lassen, mit <tt>align=right</tt> richten Sie das Objekt rechtsb&uuml;ndig aus und nachfolgende Elemente flie&szlig;en links um das Objekt. Diese Angaben haben die gleiche Wirkung wie die entsprechenden Angaben, die <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcjc.htm"><b>Objekte beschriften</b></a> bzw. <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcjd.htm"><b>Text um Objekte flie&szlig;en lassen</b></a>.</p>

<p>Mit <tt>hspace=</tt> [Pixel] bestimmen Sie den horizontalen Abstand des eingebundenen Objkets zu seiner Umgebung, mit <tt>vspace=</tt> {Pixel/Prozent] den vertikalen Abstand (<i>hspace = horizontal space = horizontaler Abstand, vspace = vertical space = vertikaler Abstand</i>). Die Wirkungsweise ist die gleiche wie bei der Angabe von <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcje.htm"><b>Abstand zwischen Objekt und Umgebung</b></a>.</p>

<p>Mit <tt>border=</tt> [Pixel] wird ein Rahmen von der angegebenen Dicke um das Objekt gezogen. Die Wirkungsweise ist die gleiche wie bei der Angabe zu <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcja.htm#a6"><b>Rahmen um Objekte</b></a>.</p>

<p>Mit <tt>type=</tt> k&ouml;nnen Sie den <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcjj.htm"><b>Mime-Type</b></a> der eingebundenen Datei angeben. Die Angabe des Mime-Types sollte in Anf&uuml;hrungszeichen stehen. Wenn Sie den Mime-Typ nicht kennen, lassen Sie die Angabe <tt>type=</tt> weg.</p>

<p>Mit <tt>pluginurl=</tt> k&ouml;nnen Sie eine URL-Adresse im Internet bestimmen, die ein Plugin zum Anzeigen oder Abspielen der eingebundenen Datei bereitstellt. Es mu&szlig; sich um eine Java-Archivdatei (Dateien *.jar) handeln. Diese Angabe startet den in Netscape 4.0 integrierten JAR-Installationsmanager (JIM). Der Anwender kann das Plugin online von der angegebenen URL-Adresse installieren. Netscape f&uuml;hrt die Installation durch und kann anschlie&szlig;end sofort die eingebundene Multimedia-Datei anzeigen. Das Attribut <tt>pluginurl=</tt> ist erst seit Netscape 4.0 verf&uuml;gbar.<br>
Mit <tt>pluginspage=</tt> k&ouml;nnen Sie eine URL-Adresse im Internet bestimmen, die Installationshinweise f&uuml;r ein Plugin enth&auml;lt, das die eingebundene Multimedia-Datei anzeigen bzw. abspielen kann. Dies ist nicht ganz so elegant wie die Technik, die hinter <tt>pluginurl=</tt> steckt. Aber wenn das Plugin in einem anderen Format als dem Java-Archivformat vorliegt, sollten Sie die Angabe <tt>pluginspage=</tt> w&auml;hlen, sofern Ihnen eine Internet-Adresse mit einem geeigneten Plugin bekannt ist.</p>

<p>Mit <tt>hidden=&quot;true&quot;</tt> k&ouml;nnen Sie die sichtbare Anzeige des eingebundenen Objekts verhindern. Das kann zum Beispiel sinnvoll sein, wenn Sie einen Sound abspielen wollen, aber keinen Sound-Player anzeigen wollen.</p>

<p>Mit <tt>autostart=&quot;true&quot;</tt> k&ouml;nnen Sie erzwingen, da&szlig; eine abspielbare Datei, also etwa ein Sound oder ein Video, sofort abgespielt werden, ohne da&szlig; der Anwender in der Abspiel-Software eine Funktion zum Start der Wiedergabe w&auml;hlen mu&szlig;. Diese Angabe ist jedoch bei Netscape nicht mehr offiziell dokumentiert und wird von Netscape 4.x auch nicht mehr interpretiert (in &auml;lteren Versionen dagegen schon).</p>

<p>Mit <tt>loop=&quot;true&quot;</tt> k&ouml;nnen Sie erzwingen, da&szlig; eine abspielbare Datei endlos wiederholt wird. Diese Angabe ist jedoch bei Netscape nicht mehr offiziell dokumentiert.</p>

<p>Mit <tt>palette=&quot;foreground&quot;</tt> k&ouml;nnen Sie erzwingen, da&szlig; das Plugin bei der Anzeige die Vordergrundfarben des Anwenderrechners benutzt, mit <tt>palette=&quot;background&quot;</tt> erzwingen Sie, da&szlig; das Plugin die eingestellten Hintergrundfarbe benutzt. Diese Angabe ist laut Netscape nur f&uuml;r MS-Windows-Systeme interessant.</p>





<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a3"><img src="xnetsi2.gif" width=30 height=30 border=0 alt="Netscape2.0"><img src="xmsie3.gif" width=30 height=30 border=0 alt="MS IE3.0"> Alternativer Inhalt</a></h2>

<p>Sie k&ouml;nnen einen Bereich definieren, der nur von Browsern angezeigt wird, die das <tt>&lt;embed&gt;</tt>-Tag nicht kennen. Netscape, der das <tt>&lt;embed&gt;</tt>-Tag interpretiert, ignoriert einen solchen Bereich.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;noembed&gt;
&lt;img src=&quot;video.jpg&quot;&gt;
&lt;/noembed&gt;
&lt;embed src=&quot;video.avi&quot;&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Mit <tt>&lt;noembed&gt;</tt>...<tt>&lt;/noembed&gt;</tt> definieren Sie einen Bereich, der von Netscape ab Version 2.0 nicht angezeigt wird, wohl aber von Browsern, die das <tt>&lt;embed&gt;</tt>-Tag nicht kennen. Diese Browser kennen zwar auch das <tt>&lt;noembed&gt;</tt>-Tag nicht, aber sie stellen einfach alles dar, was dazwischen notiert ist.</p>

<p>Im obigen Beispiel wird ein Video (<tt>video.avi</tt>) eingebunden. F&uuml;r Browser, die den Befehl nicht kennen, wird mit Hilfe eines <tt>&lt;noembed&gt;</tt>-Bereichs eine alternative Grafik angeboten.</p>




<br>&#160;
<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tcjh.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF><img src="x3.gif" width=15 height=10 border=0> <a href="tcjh.htm"><b>Videos einbinden (Microsoft)</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tcjf.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tcjf.htm"><b>Zus&auml;tzliche Angaben zum Objekt</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tc.htm"><b>HTML</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tcj.htm"><b>Multimedia</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>