<html>
<head>
<title>SELFHTML: HTML /  Layer / Layer definieren und positionieren</title>
<meta name="description" content="(SELFHTML 7.0) Wie Sie in HTML Netscape-Layer definieren k&ouml;nnen.">
<meta name="keywords" content="SELFHTML, HTML, Layer, flie&szlig;ende Layer, Positionierung">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tc.htm"><b>HTML</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tck.htm"><b>Layer - positionierbare Elemente</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Layer definieren und positionieren</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Allgemeines zu Layern</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Layer definieren</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>Inline-Layer definieren</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a4"><b>Anzeigebereich von Layern beschneiden</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a5"><b>Layer mit Inhalt aus anderer Datei</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a6"><b>Layer verschachteln</b></a><br>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>





<h2 class="Sh2"><a class="an" name="a1"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape4.0"> Allgemeines zu Layern</a></h2>

<p>Layer (<i>Schichten</i>) sind ein Sprachelement von HTML, das Netscape mit der Version 4.0 seines Browsers einf&uuml;hrte. Mit Hilfe der beiden HTML-Tags, die dazugeh&ouml;ren, ist es m&ouml;glich, beliebige Bereiche einer HTML-Datei als exakt positionierte Bereiche auszuzeichnen. So k&ouml;nnen Sie zum Beispiel eine &Uuml;berschrift, eine Grafik und erkl&auml;renden Text dazu als Layer definieren. Diese definierte Einheit lassen Sie 100 Pixel von links und 50 Pixel von oben - gemessen am Anzeigefenster des Browsers - beginnen. F&uuml;r die gesamte Einheit definieren Sie eine maximale Breite, zum Beispiel 200 Pixel.</p>

<p>In HTML allein haben die Layer jedoch nicht allzuviel Bedeutung, sieht man einmal von der M&ouml;glichkeit der absoluten Positionierung von Elementen ab. Der eigentliche Zweck der Layer ist es, die HTML-Grundlage f&uuml;r <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tf.htm"><b>Dynamisches HTML</b></a> zu bilden. Beim <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tfbe.htm"><b>Dynamischen Positionieren</b></a>, dem Ansatz f&uuml;r Dynamisches HTML nach Netscape, lassen sich Layer-Bereiche mit Hilfe von <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="te.htm"><b>JavaScript</b></a> auf vielf&auml;ltige Weise ver&auml;ndern. So k&ouml;nnen Layer-Bereiche &uuml;ber den Bildschirm wandern, auf-/zuklappen, anderen Inhalt annehmen usw.</p>

<p>Sie k&ouml;nnen beliebig viele Layer innerhalb einer HTML-Datei definieren. Layer k&ouml;nnen sich dabei auch &uuml;berlappen. Wenn Sie beispielsweise zwei &Uuml;berschriften mit anschlie&szlig;ender Grafik und erkl&auml;rendem Text zu je einem Layer zusammenfassen, k&ouml;nnen beide Layer die gleichen Pixelpositionen erhalten. Mit Hilfe von JavaScript k&ouml;nnen Sie dann dynamisch einen der Layer ausschalten und den anderen einschalten. Sie k&ouml;nnen aber auch beide Layer gleichzeitig anzeigen und bestimmen, welcher &uuml;ber dem anderen liegen soll.</p>

<p>Layer k&ouml;nnen eigene Hintergrundfarben und sogar eigene Hintergrundbilder (Wallpapers) haben. Dadurch ergeben sich viele zus&auml;tzliche Gestaltungsm&ouml;glichkeiten beim Verteilen von Farben und Formen am Bildschirm.</p>

<p>Wenn Sie eine GIF-Grafik mit transparentem Hintergrund als eigenen Layer definieren, k&ouml;nnen Sie diese Grafik &uuml;ber oder unter Texte oder andere Grafiken legen und dadurch faszinierende Effekte erzeugen.</p>

<p>Das einzige Problem mit den Layern ist: sie kamen zu sp&auml;t. Das W3-Konsortium hatte sich bereits darauf eingeschossen, die M&ouml;glichkeit des absoluten Positionierens nicht in HTML, sondern in den <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="td.htm"><b>CSS Style-Sheets</b></a> zu verankern. Auch f&uuml;r ein HTML-Tag, das vor allem f&uuml;r das Behandeln mit JavaScript gedacht ist, zeigte man dort wenig Verst&auml;ndnis. In den HTML-Sprachstandard 4.0 fanden die hier vorgestellten Befehle deshalb keinen Einla&szlig;. Angesichts der Tatsache, da&szlig; die neuen <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tdch.htm"><b>CSS-Befehle zum Positionieren von Elementen</b></a> offizieller Standard sind und sowohl von Netscape als auch vom MS Internet Explorer interpretiert werden, ist die Layer-Technik in HTML ins Abseits geraten. Wegen der starken Verkn&uuml;pfung zwischen Layer-Technik und Dynamischem HTML ist dadurch freilich auch der gesamte Netscape-Ansatz f&uuml;r Dynamisches HTML wackelig geworden.</p>




<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape4.0"> Fest positionierte Layer definieren</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tckaa.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Sie k&ouml;nnen innerhalb des K&ouml;rpers einer HTML-Datei (siehe <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcab.htm"><b>Grundger&uuml;st einer HTML-Datei</b></a>) fest positionierte Layer definieren. Solche Layer haben eine definierte obere linke Ecke im Anzeigefenster. Au&szlig;erdem k&ouml;nnen Sie eine bestimmte Breite erzwingen.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;layer id=&quot;Beispiel&quot; left=300 top=250 width=150 height=400&gt;
&lt;h1&gt;Eine &amp;Uuml;berschrift&lt;/h1&gt;
&lt;img src=&quot;datei.gif&quot; alt=&quot;Ein Bild&quot;&gt;
&lt;/layer&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Mit <tt>&lt;layer ...&gt;</tt> leiten Sie die Definition eines Layer-Bereichs innerhalb einer HTML-Datei ein (<i>layer = Schicht</i>). Mit der Angabe <b>name=</b> k&ouml;nnen Sie einen Namen f&uuml;r den definierten Bereich vergeben.</p>

<p>Mit der Angabe <tt>left=</tt> bestimmen Sie die Anzahl Pixel vom linken Rand des Anzeigefensters, mit <tt>top=</tt> die Anzahl Pixel vom oberen Rand des Anzeigefensters (<i>left = links, top = oben</i>). Mit <tt>width=</tt> k&ouml;nnen Sie eine Anzeigebreite f&uuml;r den Layer-Bereich erzwingen, mit <tt>height=</tt> die H&ouml;he (<i>width = Breite, height = H&ouml;he</i>). Elemente innerhalb des Layers werden dann so umgebrochen, da&szlig; die angegebene Breite eingehalten wird.</p>

<p>Mit <tt>id=</tt> k&ouml;nnen Sie einen Namen f&uuml;r den Layer-Bereich vergeben. Unter diesem Namen k&ouml;nnen Sie den Layer in JavaScript mit Hilfe des Objekts <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tecbbf.htm"><b>layers</b></a> ansprechen. Neben <tt>id=</tt> wird bei Layern auch die Angabe <tt>name=</tt> f&uuml;r diesen Zweck interpretiert.</p>

<p>Zwischen dem einleitenden <tt>&lt;layer ...&gt;</tt> und dem erforderlichen, abschlie&szlig;enden <tt>&lt;/layer&gt;</tt> k&ouml;nnen Sie beliebige andere Elemente einer HTML-Datei notieren, also zum Beispiel &Uuml;berschriften, Textabs&auml;tze, Tabellen, Grafik- oder Multimedia-Referenzen, Verweise usw. Alle Elemente, die Sie innerhalb eines Layers definieren, verhalten sich entsprechend der Eigenschaften, die Sie f&uuml;r den entsprechenden Layer definieren. Den Layer selbst m&uuml;ssen Sie sich dabei vorstellen wie ein eigenes Anzeigefenster ohne sichtbare Umrandungen, das in das normale Anzeigefenster des WWW-Browsers eingebettet ist.</p>

<h3 class="inf">Beachten Sie:</h3>

<p>Neben den Angaben zu <tt>left=</tt> und <tt>top=</tt> gibt es auch noch die &auml;hnlichen Angaben <tt>pagex=</tt> (wirkt im Normalfall wie <tt>left=</tt>) und <tt>pagey=</tt> (wirkt im Normalfall wie <tt>top=</tt>). Der Unterschied ist, da&szlig; <tt>left=</tt> und <tt>top=</tt> sich genaugenommen am Dokumentrand orientieren und nicht am Fensterrand. Der Unterschied macht sich dann bemerkbar, wenn Sie <img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a6"><b>Layer verschachteln</b></a>. Dort wird der Unterschied der Atrribute n&auml;her beschrieben.</p>

<p>Wenn Sie mit Layern arbeiten und diese absolut im Anzeigebereich positionieren, wird es in den meisten F&auml;llen sinnvoll sein, innerhalb einer HTML-Datei alle anzuzeigenden Elemente innerhalb von fest positionierten Layern zu notieren. Denn andernfalls ger&auml;t Ihnen die Anzeige leicht au&szlig;er Kontrolle.</p>

<p>Wenn es der Inhalt erfordert, werden Angaben zur Breite au&szlig;er kraft gesetzt. Wenn beispielsweise eine Grafik oder eine Tabelle mehr Platz in Anspruch nimmt als die angegebene Breite, wird die Grafik bzw. die Tabelle in jedem Fall in voller Breite angezeigt. Dies k&ouml;nnen Sie allerdings verhindern - siehe <img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a4"><b>Anzeigebereich von Layern beschneiden</b></a>.</p>

<p>Die Angaben zu linker und oberer Ecke sowie zur Breite sind zwar in den meisten F&auml;llen erw&uuml;nscht, jedoch nicht zwingend erforderlich. Wenn Sie keine Angaben dazu machen, beginnt der Layer einfach oben links, so wie das erste Element im Dateik&ouml;rper der HTML-Datei.</p>

<p>Wenn Layer nichts anderes enthalten als <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tie.htm"><b>GIF-Grafiken mit transparentem Hintergrund</b></a>, k&ouml;nnen Sie diese Grafiken mit Hilfe der Layer beliebig &uuml;bereinanderschichten und dadurch interessante Effekte erzeugen.</p>


<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a3"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape4.0"> Inline-Layer definieren</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tckab.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Inline-Layer beginnen relativ an der Stelle, an der sie innerhalb der HTML-Datei stehen. Solche Layer erzeugen keinen eigenen Absatz im Flie&szlig;text. Ansonsten k&ouml;nnen sie aber alle Eigenschaften von Layern haben, also beispielsweise eine eigene Hintergrundfarbe.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
Das ist &lt;ilayer&gt;Layer-Text&lt;/ilayer&gt; mitten im Text.
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Mit <tt>&lt;ilayer ...&gt;</tt> leiten Sie die Definition eines Inline-Layer-Bereichs ein (<i>ilayer = inline layer</i>). Mit der Angabe <tt>name=</tt> k&ouml;nnen Sie einen Namen f&uuml;r den definierten Bereich vergeben.</p>

<p>So wie im obigen Beispiel definiert, bewirkt ein <tt>&lt;ilayer&gt;</tt>-Bereich rein gar nichts. Erst durch Angaben zu Hintergrundfarben und Hintergrundbild lassen sich dabei interessante Effekte erzielen.</p>

<p>Sie k&ouml;nnen auch Attribute wie <tt>top=</tt> oder <tt>left=</tt> auf einen <tt>&lt;ilayer&gt;</tt>-Bereich anwenden. Die Angaben werden dann jedoch nicht als Werte gemessen vom Fensterrand interpretiert, sondern als Werte gemessen von der normalen Position des Inline-Layers. So k&ouml;nnen Sie beispielsweise mitten in einem Text eine Anweisung notieren wie:<br>
<tt>Dieses &lt;ilayer top=3&gt;Wort&lt;/ilayer&gt; erscheint um genau 3 Pixel tiefer als der &uuml;brige Text</tt></p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a4"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape4.0"> Anzeigebereich von Layern beschneiden</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tckac.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Sie k&ouml;nnen einen Bereich erzwingen, innerhalb dessen der Inhalt eines Layers angezeigt werden mu&szlig;. Wenn der Inhalt mehr Platz in Anspruch nimmt (z.B. weil eine Grafik breiter ist), wird er abgeschnitten. Mit diesem Merkmal k&ouml;nnen Sie Effekte erzeugen, da&szlig; der Inhalt eines Layers wie durch ein Fenster gesehen erscheint, wobei beim Blick durch das Fenster nur ein Ausschnitt des Inhalts sichtbar ist.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;layer name=&quot;Beispiel&quot; left=30 top=20 width=260 clip=&quot;20,30,200,300&quot;&gt;
&lt;h1&gt;Eine &amp;Uuml;berschrift&lt;/h1&gt;
&lt;img src=&quot;datei.gif&quot; alt=&quot;Ein Bild&quot;&gt;
&lt;/layer&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Mit dem Attribut <tt>clip=</tt> k&ouml;nnen Sie einen Anzeigebereich erzwingen (<i>clip = Ausschnitt</i>). Hinter dem Istgleichzeichen notieren Sie zwei oder vier Zahlenwerte zum Bestimmen des gew&uuml;nschten Bereichs. Die Angabe mu&szlig; in Anf&uuml;hrungszeichen stehen. Trennen Sie die Zahlenwerte durch Kommata.</p>

<p>Wenn Sie vier Zahlenwerte angeben, bedeuten die Zahlen die Koordinaten des gew&uuml;nschten Rechtecks (in dieser Reihenfolge):<br>
<tt>clip=&quot;Pixel f&uuml;r links, Pixel f&uuml;r oben, Pixel f&uuml;r rechts, Pixel f&uuml;r unten&quot;</tt><br>
und zwar relativ zur oberen linken Ecke des Layers. Wenn also im ersten der obigen Beispiele etwa durch <tt>left=30</tt> und <tt>top=20</tt> eine absolute obere linke Ecke f&uuml;r den Layer definiert wird, so bedeutet etwa die erste Angaben bei <tt>clip=</tt> - 20 - so viel wie: der erzwungene Anzeigebereich beginnt 20 Pixel links vom linken Rand des Layers (der bei 30 Pixeln liegt), absolut gesehen also bei 50 Pixeln.</p>

<p>Wenn Sie zwei Zahlenwerte angeben, bedeuten die Zahlen die Breite und H&ouml;he des gew&uuml;nschten Rechtecks (in dieser Reihenfolge):<br>
<tt>clip=&quot;Pixel f&uuml;r Breite, Pixel f&uuml;r H&ouml;he&quot;</tt><br>
und zwar beginnend bei der oberen linken Ecke des Layers. Wenn Sie etwa wie im zweiten der obigen Beispiele mit <tt>width=</tt> eine bestimmte Breite des Layers erzwingen und sicherstellen wollen, da&szlig; die Breite auch eingehalten wird, wenn der Inhalt des Layers breiter ist, k&ouml;nnen Sie mit <tt>clip=&quot;200,H&ouml;he&quot;</tt> erzwingen, da&szlig; die Breite eingehalten wird.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a5"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape4.0"> Layer mit Inhalt aus anderer Datei</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tckad.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Es ist m&ouml;glich, innerhalb eines Layers eine andere HTML-Datei anzuzeigen.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;layer src=&quot;news.htm&quot; top=150 left=200&lt;/layer&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Mit dem Attribut <tt>src=</tt> k&ouml;nnen Sie eine andere HTML-Datei in einen Layer einbinden. Die Datei nimmt dabei den &uuml;blichen Raum im Anzeigefenster ein, beginnend bei den angegebenen Positionen zu <tt>top=</tt> und <tt>left=</tt>. Angaben zu <tt>width=</tt> und <tt>height=</tt> werden nur eingehalten, wenn der Inhalt der Datei in Breite und H&ouml;he weniger Platz in Anspruch nimmt.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a6"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape4.0"> Layer verschachteln</a></h2>

<p>Sie k&ouml;nnen innerhalb von Layer-Bereichen andere Layer definieren.</p>

<h3 class="xmp">Beispiel 1:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;layer top=100 left=100&gt;
  &lt;layer top=100 left=100&gt;
     &lt;img src=&quot;bild1.gif&quot;&gt;
  &lt;/layer&gt;
&lt;/layer&gt;
</pre></td></tr></table>
<h3 class="xmp">Beispiel 2:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;layer top=100 left=100&gt;
  &lt;layer pagey=100 pagex=100&gt;
     &lt;img src=&quot;bild1.gif&quot;&gt;
  &lt;/layer&gt;
&lt;/layer&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Innerhalb eines Layers k&ouml;nnen Sie andere Layer definieren.</p> 

<p>Wichtig ist dabei die unterschiedliche Wirkung der Positionsangaben. Im obigen Beispiel 1 erh&auml;lt der innere Layer die gleichen Angaben zu <tt>left=</tt> und <tt>top=</tt> wie der &auml;u&szlig;ere Layer. Der &auml;u&szlig;ere Layer ist dabei der Bezugspunkt f&uuml;r die Startposition des inneren Layers, nicht das Anzeigefenster! Der innere Layer beginnt im Beispiel also 100 Pixel von oben und 100 Pixel von links, gemessen an der linken oberen Ecke des &auml;u&szlig;eren Layers.</p>

<p>Ganz anders dagegen im obigen Beispiel 2. Dort erh&auml;lt der innere Layer die Angaben <tt>pagey=100</tt> und <tt>pagex=100</tt> (<i>pagex = page x = Seite x-Wert, pagey = page y = Seite y-Wert</i>). Diese Angaben bewirken, da&szlig; als Bezugspunkt das Anzeigefenster und nicht der &uuml;bergeordnete Layer verwendet wird. Im obigen Beispiel 2 hat das zur Folge, da&szlig; der &auml;u&szlig;ere und der innere Layer genau an der gleichen Position beginnen. Da der &auml;u&szlig;ere Layer im Beispiel keinen anderen Inhalt als den inneren Layer hat, ist am Bildschirm nur der innere Layer zu sehen.</p>



<br>&#160;
<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tckb.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF><img src="x3.gif" width=15 height=10 border=0> <a href="tckb.htm"><b>Hintergrund von Layern</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tcjj.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tcjj.htm"><b>Mime-Typen f&uuml;r Dateiformate</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tc.htm"><b>HTML</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tck.htm"><b>Layer - positionierbare Elemente</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>