<html>
<head>
<title>SELFHTML: CSS /  Style-Sheets und HTML</title>
<meta name="description" content="(SELFHTML 7.0) Wie CSS Style-Sheets und HTML in Zusammenhang stehen">
<meta name="keywords" content="SELFHTML, CSS, Style Sheets, Style-Sheets, HTML">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="td.htm"><b>CSS Style-Sheets</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Style-Sheets und HTML</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Sinn und Zweck von Style-Sheets</b></a> <br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Style-Sheet-Sprachen, Versionen und Informationen</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>Style-Sheets und WWW-Browser</b></a>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="a1">Sinn und Zweck von Style-Sheets</a></h2>

<p>Style-Sheets sind eine unmittelbare Erg&auml;nzung zu HTML. Es handelt sich dabei um eine Sprache zur Definition von Formateigenschaften einzelner HTML-Befehle. Mit Hilfe von Style-Sheets k&ouml;nnen Sie beispielsweise bestimmen, da&szlig; &Uuml;berschriften 1. Ordnung eine Schriftgr&ouml;&szlig;e von 18 Punkt haben, in der Schriftart Helvetica, aber nicht fett erscheinen, und mit einem Abstand von 1,75 Zentimeter zum darauffolgenden Absatz versehen werden. Angaben dieser Art sind mit herk&ouml;mmlichem HTML nicht m&ouml;glich.</p>

<p>Das ist aber nur der Anfang. Style-Sheets bieten noch viel mehr M&ouml;glichkeiten. So k&ouml;nnen Sie beliebige Bereiche einer HTML-Datei mit einer eigenen Hintergrundfarbe, einem eigenen Hintergrundbild (Wallpaper) oder mit diversen Rahmen versehen. Sie k&ouml;nnen beliebige Elemente, sei es eine Grafik, ein Textabsatz, eine Tabelle oder ein Bereich aus mehreren solcher Elemente, pixelgenau im Anzeigefenster des WWW-Browsers positionieren. F&uuml;r Drucklayouts stehen Befehle zur Definition eines Seitenlayouts bereit. F&uuml;r die akustische Wiedergabe von HTML-Dateien gibt es ein ganzes Arsenal an Befehlen, um k&uuml;nstliche Sprachausgabesysteme feinzusteuern. Spezielle Filter schlie&szlig;lich, die derzeit allerdings noch rein Microsoft-spezifisch sind, erlauben Grafik-Effekte bei normalen Texten, die aus Grafikprogrammen wie PhotoShop bekannt sind.</p>

<p>Ein weiteres wichtiges Leistungsmerkmal von Style-Sheets ist es, da&szlig; Sie Definitionen zentral angeben k&ouml;nnen. So k&ouml;nnen Sie beispielsweise im Kopf einer HTML-Datei zentrale Definitionen zum Aussehen einer Tabellenzelle notieren. Alle Tabellenzellen der entsprechenden HTML-Datei erhalten dann die Formateigenschaften, die einmal zentral definiert sind. Das spart Kodierarbeit und macht die HTML-Dateien kleiner. Sie k&ouml;nnen Ihre Style-Sheet-Definitionen sogar in separaten Dateien notieren. Solche Style-Sheet-Dateien k&ouml;nnen Sie in beliebig vielen HTML-Dateien referenzieren. Auf diese Weise k&ouml;nnen Sie f&uuml;r gro&szlig;e Projekte einheitliche Layouts entwerfen. Mit ein paar kleinen &Auml;nderungen in einer zentralen Style-Sheet-Datei k&ouml;nnen Sie dann f&uuml;r hunderte von HTML-Dateien ein anderes Layout bewirken.</p>

<p>Style-Sheets unterst&uuml;tzen also erstens die professionelle Gestaltung beim Web-Design, und zweitens helfen sie beim Corporate Design f&uuml;r gro&szlig;e Projekte oder f&uuml;r firmenspezifsche Layouts.</p>

<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2">Style-Sheet-Sprachen, Versionen und Informationen</a></h2>

<p>Es gibt mehrere Sprachen zum Definieren von Style-Sheets. Die bekannteste ist die CSS-Sprache. CSS steht f&uuml;r &quot;Cascading Style Sheets&quot;. Diese Sprache wird vom <img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.w3.org/"><b>W3-Konsortium</b></a>, das auch f&uuml;r die Normierung von HTML zust&auml;ndig ist, vorgeschlagen. Die CSS-Sprache ist optimal auf HTML abgestimmt. In diesem Kapitel wird deshalb auch ausschlie&szlig;lich die CSS-Sprache behandelt.</p>

<p>Genau so, wie es HTML-Sprachversionen gibt, gibt es auch CSS-Sprachversionen. Die erste Version 1.0 enstand 1996. Seit M&auml;rz 1998 gibt es die Version 2.0. In diesem Kapitel werden folgende Symbole verwendet, um die CSS-Versionen zu kennzeichnen:</p>

<table>
<tr>
<td valign=middle><img src="xcss1.gif" width=30 height=30 alt="CSS1.0" border="0"></td>
<td valign=middle>Das beschriebene Leistungsmerkmal geh&ouml;rt zur Version 1.0 der CSS-Sprache.</td>
</tr>
<tr>
<td valign=middle><img src="xcss2.gif" width=30 height=30 alt="CSS2.0" border="0"></td>
<td valign=middle>Das beschriebene Leistungsmerkmal geh&ouml;rt zur Version 2.0 der CSS-Sprache.</td>
</tr>
</table>

<p>Informationen zu Style-Sheets erhalten Sie im Internet an folgenden Stellen:</p>

<p><img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.w3.org/Style/"><b>Einstiegsseite zu Style-Sheets beim W3-Konsortium</b></a><br>
<img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.w3.org/TR/REC-CSS1-961217"><b>Spezifikation der CSS-Version 1.0</b></a><br>
<img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.w3.org/TR/PR-CSS2/"><b>Spezifikation der CSS-Version 2.0</b></a><br>
<img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.w3.org/Style/Activity"><b>Aktuelles vom W3-Konsortium zum Thema Style-Sheets</b></a></p>





<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a3">Style-Sheets und WWW-Browser</a></h2>

<p>Netscape 4.x interpretiert fast den vollen Sprachumfang der CSS-Version 1.0 und einen Teil der Befehle der CSS-Version 2.0. Der MS Internet Explorer kennt die CSS-Version 1.0 bereits seit seiner Produktversion 3.0. In der Version 4.0 interpretiert er einen Teil der CSS-Version 2.0 und einige spezielle, von Microsoft eingef&uuml;hrte Style-Sheet-Angaben.</p>

<p>Wenn Sie WWW-Seiten gestalten, m&uuml;ssen Sie daraus Ihre eigenen Konsequenzen ziehen. Style-Sheets erlauben Ihnen v&ouml;llig neue M&ouml;glichkeiten beim Webseiten-Layout. Je intensiver Sie Ihre Layouts jedoch von Style-Sheet-Effekten abh&auml;ngig machen, desto langweiliger, entt&auml;uschender und evtl. auch fehlerhaft wirken die Seiten bei Anwendern, die keinen Style-Sheet-f&auml;higen Browser benutzen. Da Netscape 3.x immer noch als wichtige Me&szlig;latte f&uuml;r die Anzeigequalit&auml;t von WWW-Seiten gilt, in dieser Version aber noch keine Style-Sheets kennt, werden Style-Sheets bislang noch vorsichtig eingesetzt. Allm&auml;hlich mu&szlig; man sich jedoch nicht mehr entschuldigen, wenn man Style-Sheets einsetzt. Zumindest gegen den Einsatz der Befehle der CSS-Version 1.0 ist eigentlich nichts mehr einzuwenden - die Lynx-Militanten sind sowieso gegen alles, was nicht in ein 24x80-Zeichenraster pa&szlig;t. Neuere Befehle sollten Sie dagegen noch mit Vorsicht anwenden. In jedem Fall sollten Sie Ihre &quot;gestylten&quot; Web-Seiten immer auch mal mit Netscape 3.x testen.</p>



<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tdba.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF><img src="x3.gif" width=15 height=10 border=0> <a href="tdba.htm"><b>Style-Sheets in HTML einbinden</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tcmb.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tcmb.htm"><b>Event-Handler</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tc.htm"><b>Dokumentation: HTML</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tck.htm"><b>Style-Sheets - eigene Formate</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>