<html>
<head>
<title>SELFHTML: CSS /  Style-Sheets in HTML einbinden</title>
<meta name="description" content="(SELFHTML 7.0) Wie CSS Style-Sheets in HTML-Dateien integriert oder darin referenziert werden k&ouml;nnen">
<meta name="keywords" content="SELFHTML, CSS, Style-Sheets">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="td.htm"><b>CSS Style-Sheets</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tdb.htm"><b>Style-Sheets definieren</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Style-Sheets in HTML einbinden</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Style-Sheets in einer HTML-Datei definieren</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Style-Sheets in separater Datei definieren</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>Style-Sheet-Dateien f&uuml;r unterschiedliche Ausgabemedien</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a4"><b>Style-Sheet-Definitionen f&uuml;r unterschiedliche Ausgabemedien</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a5"><b>Kommentare innerhalb von Style-Sheet-Bereichen</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a6"><b>Style-Sheet-Sprache ausdr&uuml;cklich festlegen</b></a>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>





<h2 class="Sh2"><a class="an" name="a1"><img src="xcss1.gif" width=30 height=30 border=0 alt="CSS1.0"><img src="xmsie3.gif" width=30 height=30 border=0 alt="MS IE3.0"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape 4.0"> Style-Sheets in einer HTML-Datei definieren</a></h2>

<p>Sie k&ouml;nnen innerhalb einer HTML-Datei einen Bereich f&uuml;r Style-Sheet-Angaben definieren.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;Titel der Datei&lt;/title&gt;
&lt;style type=&quot;text/css&quot;&gt;
&lt;!--
/*  ... Style-Sheet-Angaben ... */
//--&gt;
&lt;/style&gt;
&lt;/head&gt;
&lt;body&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3>Erl&auml;uterung:</h3>

<p>Mit dem Befehl <tt>&lt;style...&gt;</tt> ... <tt>&lt;/style&gt;</tt> im Kopf der HTML-Datei definieren Sie einen Bereich f&uuml;r Style-Sheet-Angaben (<i>style = Stil, Format</i>). Im einleitenden <tt>&lt;style&gt;</tt>-Tag m&uuml;ssen Sie den Typ der Formatdefinition angeben. Das geschieht bei allen hier beschriebenen Formatierm&ouml;glichkeiten durch die Angabe <tt>type=&quot;text/css&quot;</tt>. Zwischen dem einleitenden Tag und dem abschlie&szlig;enden <tt>&lt;/style&gt;</tt> k&ouml;nnen Sie dann die eigentlichen Style-Sheet-Angaben definieren. Lesen Sie dazu den Abschnitt <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tdbb.htm"><b>Formate definieren</b></a>.</p>

<h3 class="inf">Beachten Sie:</h3>

<p>Damit WWW-Browser, die keine Style-Sheets kennen, die Style-Sheet-Angaben nicht irrt&uuml;mlich als anzuzeigenden Text interpretieren, k&ouml;nnen Sie den Bereich der eigentlichen Style-Sheet-Angaben in einen mehrzeiligen <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcaf.htm#a1"><b>HTML-Kommentar</b></a> <tt>&lt;!--</tt> ... <tt>//--&gt;</tt> einbinden, so wie im obigen Beispiel.</p>

<p>Die Style-Sheet-Angaben, die Sie auf diese Weise im Kopf einer HTML-Datei definieren, sind f&uuml;r diese eine HTML-Datei g&uuml;ltig.</p>

<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2"><img src="xcss1.gif" width=30 height=30 border=0 alt="CSS1.0"><img src="xmsie4.gif" width=30 height=30 border=0 alt="MS IE4.0"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape 4.0"> Style-Sheets in separater Datei definieren</a></h2>

<p>In vielen F&auml;llen werden Sie einheitliche Formate f&uuml;r alle HTML-Dateien Ihres Projekts haben wollen. In diesem Fall brauchen Sie die Angaben nicht in jeder Datei zu wiederholen. Stattdessen k&ouml;nnen Sie die Style-Sheet-Angaben in einer separaten Textdatei notieren und diese Datei einfach in jeder gew&uuml;nschten HTML-Datei einbinden. Wenn Sie die Angaben in der separaten Datei &auml;ndern, wirken sich die &Auml;nderungen einheitlich auf alle Dateien aus, in denen diese separate Datei eingebunden ist.</p>


<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;Titel der Datei&lt;/title&gt;
&lt;link rel=stylesheet type=&quot;text/css&quot; href=&quot;formate.css&quot;&gt;
&lt;style type=&quot;text/css&quot;&gt;
&lt;!--
  ... Extra-Style-Sheet-Angaben ...
//--&gt;
&lt;/style&gt;
&lt;/head&gt;
&lt;body&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3>Erl&auml;uterung:</h3>

<p>Im Dateikopf einer HTML-Datei k&ouml;nnen Sie mit einem HTML-Befehl des Typs <tt>&lt;link...&gt;</tt> eine Datei referenzieren, die Style-Sheet-Angaben enth&auml;lt (<i>link = Verweis</i>). Innerhalb dieses Befehls sollten immer die Angaben <tt>rel=stylesheet type=&quot;text/css&quot;</tt> stehen (<i>rel = relation = Bezug, type = Typ</i>). Bei der Angabe <tt>href=</tt> k&ouml;nnen Sie die gew&uuml;nschte Datei angeben (<i>href = hyper reference = Hypertext-Referenz</i>). Die Angabe mu&szlig; in Anf&uuml;hrungszeichen stehen. Wenn sich die CSS-Datei in einem anderen Verzeichnis oder auf einem anderen Server befindet, m&uuml;ssen Sie mit relativen Pfadangaben oder absoluten URL-Adressen arbeiten. Das funktioniert genauso wie etwa beim <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcga.htm"><b>Einbinden von Grafiken</b></a>.</p>

<p>Bei der referenzierten Datei mu&szlig; es sich um eine reine Textdatei handeln, die die Endung <b>.css</b> haben sollte. Die Datei sollte nichts anderes als <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tdbb.htm"><b>Formatdefinitionen</b></a> enthalten, also auch keine HTML-Befehle. Eine solche Datei k&ouml;nnen Sie mit jedem einfachen Texteditor erstellen. In SELFHTML wird so eine separate Style-Sheet-Datei f&uuml;r alle Dokumentdateien verwendet. Sie k&ouml;nnen diese <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="wselfhtm.txt"><b>Datei als Beispieldatei</b></a> aufrufen (der Verweis f&uuml;hrt zu einer Datei namens <i>wselfhtm.txt</i>, damit die Datei in jedem Fall im Browser angezeigt wird - die Style-Sheet-Datei hei&szlig;t eigentlich <i>wselfhtml.css</i>).</p>

<h3 class="inf">Beachten Sie:</h3>

<p>Wenn Sie mit <tt>&lt;link...&gt;</tt> eine Datei mit Style-Sheet-Angaben referenzieren, brauchen Sie keinen Bereich <tt>&lt;style...&gt;</tt>...<tt>&lt;/style&gt;</tt>. Im obigen Beispiel wird dennoch ein solcher Bereich definiert. Das soll zeigen, da&szlig; Sie beide Arten, Style-Sheet-Angaben zu definieren, durchaus kombinieren k&ouml;nnen. Wenn Sie beide Arten benutzen, haben Formate, die direkt innerhalb von <tt>&lt;style...&gt;</tt>...<tt>&lt;/style&gt;</tt> definiert werden, im Konfliktfall Vorrang vor den referenzierten Formaten. So k&ouml;nnen Sie etwa immer wieder verwendete Formate importieren und einige davon mit dateispezifischen Formaten &uuml;berschreiben.</p>

<p>Die Syntax mit <tt>&lt;link...&gt;</tt> zum Einbinden einer separaten Style-Sheet-Datei ist die HTML-Syntax zum Einbinden von Style-Sheets. Daneben gibt es auch noch eine CSS-Syntax, die den gleichen Zweck hat.

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;Titel der Datei&lt;/title&gt;
href=&quot;formate.css&quot;&gt;
&lt;style type=&quot;text/css&quot;&gt;
&lt;!--
 @import url(formate.css);
//--&gt;
&lt;/style&gt;
&lt;/head&gt;
&lt;body&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3>Erl&auml;uterung:</h3>

<p>Eine CSS-spezifische Einbindung einer separaten CSS-Datei m&uuml;ssen Sie innerhalb eines <tt>&lt;style&gt;</tt>-Bereichs im Dateikopf notieren. Mit einem Klammeraffenzeichen <tt>@import url</tt> starten Sie den Befehl zum Einbinden einer CSS-Datei. In Klammern notieren Sie den Dateinamen der separaten CSS-Datei. Auch dabei sind die gleichen Angaben m&ouml;glich wie etwa beim <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcga.htm"><b>Einbinden von Grafiken</b></a>. Am Ende des Befehls sollte ein Strichpunkt stehen.</p>

<h3 class="inf">Beachten Sie:</h3>

<p>Die HTML-Syntax mit <tt>&lt;link...&gt;</tt> ist bei den Browsern derzeit sicherer als die CSS-Syntax.</p>




<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a3"><img src="xcss2.gif" width=30 height=30 border=0 alt="CSS2.0"><img src="xmsie4.gif" width=30 height=30 border=0 alt="MS IE4.0"> Style-Sheet-Dateien f&uuml;r unterschiedliche Ausgabemedien</a></h2>


<p>Bildschirm und Drucker beispielsweise sind sehr unterschiedliche Ausgabemedien f&uuml;r ansprechend gestaltete Daten. Beide Ausgabemedien haben ihre eigenen Gesetze. W&auml;hrend am Bildschirm etwa helle Schriften auf dunklen Hintergr&uuml;nden attraktiv aussehen, ist das f&uuml;r die Ausgabe am Drucker keine gute L&ouml;sung. Bei der Druckerausgabe sehen dagegen Absatzeinz&uuml;ge von mindestens 2cm besser aus, w&auml;hrend durch entsprechende Angaben am Bildschirm m&ouml;glicherweise kostbarer Pr&auml;sentationsraum verschenkt wird. Deshalb k&ouml;nnen Sie f&uuml;r verschiedene Ausgabemedien verschiedene Style-Sheet-Dateien einbinden. Beachten Sie zu diesem Thema auch die <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tdcj.htm"><b>Style-Sheet-Angaben zu Seitenlayout und Seitenumbruch</b></a> f&uuml;r druckorientierte Dokumente.</p>

<h3 class="xmp">Beispiel 1 (in separaten Dateien nach HTML-Syntax):</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;Titel der Datei&lt;/title&gt;
&lt;link rel=stylesheet media=&quot;screen&quot; href=&quot;website.css&quot;&gt;
&lt;link rel=stylesheet media=&quot;print&quot; href=&quot;printer.css&quot;&gt;
&lt;link rel=stylesheet media=&quot;aural&quot; href=&quot;speaker.css&quot;&gt;
&lt;/head&gt;
&lt;body&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3>Erl&auml;uterung:</h3>

<p>Um Style-Sheets f&uuml;r verschiedene Ausgabemedien bereitzustellen, k&ouml;nnen Sie diese in unterschiedlichen <img src="xgoup.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Style-Sheet-Angaben in separaten Dateien notieren</b></a>. Legen Sie f&uuml;r jedes Ausgabemedium eine Textdatei mit der Endung <tt>.css</tt> an, die nichts anderes als die gew&uuml;nschten Style-Sheet-Definitionen enth&auml;lt. In einer HTML-Datei k&ouml;nnen Sie alle erstellten Style-Sheet-Dateien wie im obigen Beispiel einbinden. Wichtig ist dabei die Angabe <tt>media=</tt>. Durch diese Angabe bestimmen Sie, f&uuml;r welches Ausgabemedium die Datei verwendet werden soll, die Sie bei der Angabe <tt>href=</tt> einbinden. <a class="an" name="a3a">Derzeit sind bei <tt>media=</tt> folgende Angaben bekannt:</a><br>
<tt>media=&quot;screen&quot;</tt> f&uuml;r Style-Sheets, die bei der Bildschirmpr&auml;sentation wirksam sein sollen.<br>
<tt>media=&quot;print&quot;</tt> f&uuml;r Style-Sheets, die bei der Ausgabe &uuml;ber Drucker wirksam sein sollen.<br>
<tt>media=&quot;aural&quot;</tt> f&uuml;r Style-Sheets, die wirksam sein sollen, wenn der Inhalt der HTML-Datei per Sprachausgabe &uuml;ber Lautsprecher erfolgt.<br>
<tt>media=&quot;projection&quot;</tt> f&uuml;r Style-Sheets, die wirksam sein sollen, wenn der Inhalt der HTML-Datei per Diaprojektor oder Overhead-Projektor erfolgt.<br>
<tt>media=&quot;braille&quot;</tt> f&uuml;r Style-Sheets, die wirksam sein sollen, wenn der Inhalt der HTML-Datei &uuml;ber taktile Braille-Medien erfolgt.<br>
<tt>media=&quot;tv&quot;</tt> f&uuml;r Style-Sheets, die wirksam sein sollen, wenn der Inhalt der HTML-Datei &uuml;ber Fernsehtechnik erfolgt.<br>
<tt>media=&quot;handheld&quot;</tt> f&uuml;r Style-Sheets, die wirksam sein sollen, wenn der Inhalt der HTML-Datei &uuml;ber Handys, Palmtops oder &auml;hnliche Ger&auml;te mit kleinem Display erfolgt.<br>
<tt>media=&quot;all&quot;</tt> f&uuml;r Style-Sheets, die in allen Medientypen wirksam sein sollen.</p>

<h3 class="inf">Beachten Sie:</h3>

<p>Bislang interpretiert der MS Internet Explorer diese Angaben ab der Software-Version 4.0 zu einem gewissen Teil. Netscape 4.0 findet zwar die richtige Style-Sheet-Datei f&uuml;r die Bildschirmformate, ignoriert jedoch beispielsweise Style-Sheet-Dateien mit Formaten f&uuml;r den Druck.</p>

<p>Die Syntax mit <tt>&lt;link...&gt;</tt> zum Einbinden separater Style-Sheet-Dateien f&uuml;r unterschiedliche Ausgabemedien ist HTML-Syntax. Daneben gibt es auch noch eine CSS-Syntax, die den gleichen Zweck hat.

<h3 class="xmp">Beispiel 2 (in separaten Dateien nach CSS-Syntax):</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;Titel der Datei&lt;/title&gt;
href=&quot;formate.css&quot;&gt;
&lt;style type=&quot;text/css&quot;&gt;
&lt;!--
@import url(druck.css) print;
@import url(multimedia.css) projection, tv;
//--&gt;
&lt;/style&gt;
&lt;/head&gt;
&lt;body&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3>Erl&auml;uterung:</h3>

<p>Eine CSS-spezifische Einbindung m&uuml;ssen Sie innerhalb eines <tt>&lt;style&gt;</tt>-Bereichs im Dateikopf notieren. Mit einem Klammeraffenzeichen <tt>@import url</tt> starten Sie den Befehl. In Klammern notieren Sie den Dateinamen der separaten CSS-Datei. Hinter der Dateiangabe notieren Sie, durch ein Leerzeichen getrennt, das gew&uuml;nschte Ausgabemedium. Dabei sind die gleichen Medientypen erlaubt wie bei der HTML-Syntax. Am Ende des Befehls sollte ein Strichpunkt stehen.</p>


<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a4"><img src="xcss2.gif" width=30 height=30 border=0 alt="CSS2.0"> Style-Sheet-Definitionen f&uuml;r unterschiedliche Ausgabemedien</a></h2>

<p>Neben der M&ouml;glichkeit, <img src="xgoup.gif" width=14 height=10 border=0>&nbsp;
<a href="#a3"><b>Style-Sheet-Dateien f&uuml;r unterschiedliche Ausgabemedien</b></a> in HTML einzubinden, steht auch noch die M&ouml;glichkeit zur Verf&uuml;gung, direkt innerhalb eines Style-Sheet-Bereichs zwischen unterschiedlichen Ausgabemedien zu unterscheiden.</p>


<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;Titel der Datei&lt;/title&gt;
href=&quot;formate.css&quot;&gt;
&lt;style type=&quot;text/css&quot;&gt;
&lt;!--
@media print
{
  ... Style-Sheet-Angaben zum Drucken ...
}
@media screen, pojection
{
  ... Style-Sheet-Angaben zur Bildschirmausgabe ...
}
//--&gt;
&lt;/style&gt;
&lt;/head&gt;
&lt;body&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3>Erl&auml;uterung:</h3>


<p>Mit <tt>@media</tt> definieren Sie innerhalb eines Style-Sheet-Bereichs einen Bereich f&uuml;r ein bestimmtes Ausgabemedium. F&uuml;r jede Mediensorte, die Sie unterscheiden wollen, k&ouml;nnen Sie einen solchen Befehl notieren. Hinter dem Befehl <tt>@media</tt> folgt, durch ein Leerzeichen getrennt, das <img src="xgoup.gif" width=14 height=10 border=0>&nbsp;
<a href="#a3a"><b>gew&uuml;nschte Ausgabemedium</b></a>. Sie k&ouml;nnen auch mehrere Ausgabemedien durch Kommata getrennt in Folge notieren, so wie im obigen Beispiel bei <tt>@media screen, pojection</tt>. Die Style-Sheet-Angaben gelten dann f&uuml;r alle aufgez&auml;hlten Medien.</p>

<p>Im Anschlu&szlig; an den <tt>@media</tt>-Befehl m&uuml;ssen Sie geschweifte Klammern <tt>{</tt> und <tt>}</tt> notieren. Alle Style-Sheet-Angaben, die Sie innerhalb dieser geschweiften Klammern definieren, sind dann nur f&uuml;r das oder die angegebenen Medien g&uuml;ltig.</p>

<h3 class="inf">Beachten Sie:</h3>

<p>Diese Befehle werden vom MS Internet Explorer und von Netscape in den 4er-Versionen noch nicht interpretiert.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a5"><img src="xcss1.gif" width=30 height=30 border=0 alt="CSS1.0"><img src="xmsie4.gif" width=30 height=30 border=0 alt="MS IE4.0"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape 4.0"> Kommentare innerhalb von Style-Sheet-Bereichen</a></h2>

<p>Um Ihre Formatdefinitionen intern auszukommentieren, steht eine spezielle, an die Programmiersprache C angelehnte Syntax zur Verf&uuml;gung.</p>


<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;Titel der Datei&lt;/title&gt;
&lt;style type=&quot;text/css&quot;&gt;
&lt;!--
  p { color:blue; } /* Format f&uuml;r blauen Text, kreiert am 4.1.1998 */
//--&gt;
&lt;/style&gt;
&lt;/head&gt;
&lt;body&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3>Erl&auml;uterung:</h3>

<p>Innerhalb von <tt>&lt;style...&gt;</tt>...<tt>&lt;/style&gt;</tt> k&ouml;nnen Sie mit <tt>/*</tt> - also einem Schr&auml;gstrich und einem Sternzeichen in Folge - einen Kommentar einleiten. Mit der umgekehrten Zeichenfolge - also mit <tt>*/</tt> - beenden Sie den Kommentar. Anfang und Ende des Kommentars m&uuml;ssen in der gleichen Zeile stehen.</p>






<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a6"><img src="xhtml4.gif" width=30 height=30 border=0 alt="HTML4.0"> Style-Sheet-Sprache ausdr&uuml;cklich festlegen</a></h2>

<p>Sie k&ouml;nnen dem Browser in einer HTML-Datei mit Hilfe einer <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcbc.htm"><b>Meta-Angabe</b></a> ausdr&uuml;cklich mitteilen, da&szlig; diese Datei Style-Sheet-Definitionen in einer bestimmten Definitionssprache enth&auml;lt. Die Angabe ist in der gegenw&auml;rtigen Praxis und f&uuml;r die CSS-Sprache nicht zwingend erforderlich. Die Angabe dient dazu, um dem Client (also dem WWW-Browser) und dem WWW-Server einen Befehl zur Verf&uuml;gung zu stellen, der beiden Seiten helfen soll, sich vor dem Interpretieren der Datei &uuml;ber die zu verwendende Style-Sheet-Syntax zu einigen.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;head&gt;
&lt;meta http-equiv=&quot;Content-Style-Type&quot; content=&quot;text/css&quot;&gt;
&lt;/head&gt;
</pre></td></tr></table>

<h3>Erl&auml;uterung:</h3>

<p>Mit <tt>&lt;meta http-equiv=&quot;Content-Style-Type&quot; content=&quot;text/css&quot;&gt;</tt> im Kopf einer HTML-Datei erzwingen Sie die CSS-Syntax als verbindlich f&uuml;r Style-Sheet-Definitionen innerhalb dieser Datei. Wenn Sie eine andere Style-Sheet-Sprache als CSS verwenden wollen, m&uuml;ssen Sie anstelle von &quot;text/css&quot; den Mime-Type der betreffenden Formatdefinitionssprache angeben.</p>






<br>&#160;
<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tdbb.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF><img src="x3.gif" width=15 height=10 border=0> <a href="tdbb.htm"><b>Zentrale Formate definieren</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tda.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tda.htm"><b>Style-Sheets und HTML</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="td.htm"><b>CSS Style-Sheets</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tdb.htm"><b>Style-Sheets definieren</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>