<html>
<head>
<title>SELFHTML: CSS /  Style-Sheets definieren / Zentrale Formate definieren</title>
<meta name="description" content="(SELFHTML 7.0) Wie Sie HTML-Tags mit Hilfe Style-Sheets zentral formatieren, beispielsweise mit genauen Angaben f&uuml;r Schriftart, Schriftg&ouml;&szlig;e oder Hintergrundfarbe">
<meta name="keywords" content="SELFHTML, HTML, Dynamic">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="td.htm"><b>CSS Style-Sheets</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tdb.htm"><b>Style-Sheets definieren</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Zentrale Formate definieren</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Formate f&uuml;r HTML-Tags definieren</b></a> <br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Format-Unterklassen definieren</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>Formate f&uuml;r verschachtelte HTML-Tags definieren</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a4"><b>Unabh&auml;ngige Formate definieren</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a5"><b>Pseudo-Formate definieren</b></a>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="a1"><img src="xcss1.gif" width=30 height=30 border=0 alt="CSS1.0"><img src="xmsie3.gif" width=30 height=30 border=0 alt="MS IE3.0"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape 4.0"> Formate f&uuml;r HTML-Tags definieren</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tdbba.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>


<p>Sie k&ouml;nnen f&uuml;r gew&ouml;hnliche HTML-Tags, zum Beispiel f&uuml;r HTML-Tags zu <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tcd.htm"><b>Absatztypen und Textgestaltung</b></a> oder f&uuml;r <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tce.htm"><b>Tabellen</b></a>, mit Hilfe von Style-Sheet-Angaben Formate definieren. Wenn Sie das entsprechende HTML-Tag dann in der HTML-Datei verwenden, werden alle Formate angewendet, die Sie f&uuml;r das betreffende HTML-Tag definiert haben. So k&ouml;nnen Sie beispielsweise f&uuml;r &Uuml;berschriften 1. Ordnung, definieren, da&szlig; diese in der Schriftart Helvetica, 20 Punkt, rot, fett und kursiv mit einem Absatznachabstand von 16 Punkt angezeigt werden. Wenn Sie dann im Text der HTML-Datei eine &Uuml;berschrift 1. Ordnung wie gewohnt definieren, werden die definierten  Formateigenschaften bei der Anzeige im WWW-Browser ber&uuml;cksichtigt.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;Titel der Datei&lt;/title&gt;
&lt;style type=&quot;text/css&quot;&gt;
&lt;!--
h1 { font-size:48pt; color:#FF0000; font-style:italic; }
p,li  { font-size:12pt;
     line-height:14pt; 
     font-family:Helvetica,Arial; 
     letter-spacing:0.2mm;
     word-spacing:0.8mm; }
//--&gt;
&lt;/style&gt;
&lt;/head&gt;
&lt;body&gt;
&lt;h1&gt;&Uuml;berschrift 1. Ordnung&lt;/h1&gt;
&lt;p&gt;ein normaler Textabsatz&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Ein Listenpunkt
&lt;li&gt;Ein anderer Listenpunkt
&lt;/ul&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>An erlaubten Stellen k&ouml;nnen Sie Style-Sheets in HTML einbinden (siehe <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tdba.htm"><b>Style-Sheets in HTML einbinden</b></a>).</p>

<p>Dazu notieren Sie zuerst das gew&uuml;nschte HTML-Tag, und zwar ohne spitze Klammern. Im obigen Beispiel werden die HTML-Tags <tt>h1</tt> (&Uuml;berschrift 1. Ordnung), <tt>p</tt> (Textabsatz) und <tt>li</tt> (Listeneintrag) auf diese Weise notiert. Wenn Sie gleichartige Formate f&uuml;r mehrere HTML-Tags definieren wollen, geben Sie alle gew&uuml;nschten Tags an und trennen Sie diese durch Kommata, so wie im obigen Beispiel <tt>p,li</tt>.</p>

<p>Es bedeutet also das gleiche, wenn Sie notieren:<br>
<tt>h1 { font-family:Helvetica }</tt><br>
<tt>h2 { font-family:Helvetica }</tt><br>
oder wenn Sie notieren:<br>
<tt>h1, h2 { font-family: Helvetica }</tt>
</p>

<p>Dahinter folgen die dazugeh&ouml;rigen, gew&uuml;nschten Formatdefinitionen, und zwar in geschweiften Klammern <tt>{</tt> und <tt>}</tt>. Innerhalb solcher geschweifter Klammern k&ouml;nnen Sie eine oder mehrere Formateigenschaften definieren. Jede Eigenschaftszuweisung besteht aus einem Namen, z.B. <tt>color</tt> und einem Wert, z.B. <tt>#FF0000</tt>, getrennt durch einen Doppelpunkt. Schlie&szlig;en Sie jede Formatdefinition jeweils durch einen Strichpunkt ab. Nur bei der letzten Formatdefinition vor der abschlieﬂenden geschweiften Klammer darf der Strichpunkt entfallen.</p>

<p><b>Wichtig:</b> Zwar sind innerhalb einer Formatdefinition durchaus Leerzeichen erlaubt, aber der Netscape-Browser hat sich dabei als sehr empfindlich erwiesen - kurz gesagt, er ignoriert die Angaben. Obwohl es nicht so gut lesbar ist, ist es deshalb vorl&auml;ufig auf jeden Fall besser, keine Leerzeichen innerhalb einer Formatdefinition zu verwenden.</p>

<p>Im obigen Beispiel wird dem HTML-Tag f&uuml;r &Uuml;berschriften 1. Ordnung eine Schriftgr&ouml;&szlig;e von 48 Punkt (<tt>font-size:48pt;</tt>), die Schriftfarbe rot (<tt>color:#FF0000;</tt>) und der Schriftstil kursiv (<tt>font-style:italic;</tt>) zugewiesen. Wenn Sie das betreffende HTML-Tag dann innerhalb der Datei verwenden, so wie im obigen Beispiel, werden die definierten Formate darauf angewendet.</p>

<p>Zu den einzelnen Formateigenschaften und ihren m&ouml;glichen Werten siehe <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tdc.htm"><b>Style-Sheet-Angaben</b></a>.</p>

<h3 class="inf">Beachten Sie:</h3>

<p>Style-Sheet-Angaben f&uuml;r HTML-Tags wie <tt>&lt;p&gt;</tt> oder <tt>&lt;li&gt;</tt> werden m&ouml;glicherweise nur interpretiert, wenn Sie ein einleitendes und ein abschlie&szlig;endes Tag notieren.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2"><img src="xcss1.gif" width=30 height=30 border=0 alt="CSS1.0"><img src="xmsie3.gif" width=30 height=30 border=0 alt="MS IE3.0"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape 4.0"> Format-Unterklassen definieren</a></h2>


<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tdbbb.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>


<p>Sie k&ouml;nnen mit Hilfe von Style-Sheets Unterklassen von gew&ouml;hnlichen HTML-Tags definieren. Das ist vor allem f&uuml;r HTML-Tags zu <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tcd.htm"><b>Absatztypen und Textgestaltung</b></a> oder f&uuml;r solche zu <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tce.htm"><b>Tabellen</b></a> sinnvoll. So k&ouml;nnen Sie beispielsweise vom HTML-Tag f&uuml;r &Uuml;berschriften 1. Ordnung zwei Varianten erzeugen, etwa eine mit schwarzer und eine mit roter Schrift. Dazu vergeben Sie Namen f&uuml;r die entsprechenden Unterklassen.</p>



<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;Titel der Datei&lt;/title&gt;
&lt;style type=&quot;text/css&quot;&gt;
&lt;!--
p.normal { font-size:10pt; color:black; }
p.gross { font-size:12pt; color:black; }
p.klein { font-size:8pt; color:black; }
all.rot { color:red; }
.blau { color:blue; }
//--&gt;
&lt;/style&gt;
&lt;/head&gt;
&lt;body&gt;
&lt;p class=&quot;normal&quot;&gt;Normaler Textabsatz mit Schrift 10 Punkt schwarz&lt;/p&gt;
&lt;p class=&quot;gross&quot;&gt;Textabsatz mit Schrift 12 Punkt schwarz&lt;/p&gt;
&lt;p class=&quot;klein&quot;&gt;Textabsatz mit Schrift 8 Punkt schwarz&lt;/p&gt;
&lt;p class=&quot;rot&quot;&gt;roter Textabsatz&lt;/p&gt;
&lt;address class=&quot;rot&quot;&gt;roter Absatz f&uuml;r Adressen&lt;/address&gt;
&lt;blockquote class=&quot;blau&quot;&gt;blaues Zitat&lt;/blockquote&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>An erlaubten Stellen k&ouml;nnen Sie Style-Sheets in HTML einbinden (siehe <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tdba.htm"><b>Style-Sheets in HTML einbinden</b></a>).</p>

<p>Unterklassen von HTML-Tags bilden Sie dort, indem Sie zuerst das Tag notieren, im obigen Beispiel <tt>p</tt>. Dahinter folgt ein Punkt und dahinter ein Name f&uuml;r die Unterklasse.</p>

<p>Anstelle eines bestimmten HTML-Tags k&ouml;nnen Sie auch das Schl&uuml;sselwort <tt>all</tt> (=alle) notieren. Dadurch definieren Sie eine Unterklasse mit Formatierungen, die Sie anschlie&szlig;end auf irgendein HTML-Tag anwenden k&ouml;nnen. Es ist auch erlaubt, Schl&uuml;sselwort <tt>all</tt> wegzulassen. In diesem Fall beginnt die Formatdefinition mit einem Punkt. Dahinter folgt der Name der Unterklasse. Im obigen Beispiel wird die Unterklasse <tt>blau</tt> auf diese Weise definiert.</p>

<p>Die Namen hinter dem Punkt k&ouml;nnen Sie frei vergeben. Die Namen sollten nicht zu lang sein und keine Leerzeichen und keine deutschen Umlaute enthalten.</p>

<p>Innerhalb des Dateik&ouml;rpers k&ouml;nnen Sie definierte Unterklassen anwenden. Dazu notieren Sie im einleitenden HTML-Tag die Angabe <tt>class=</tt> und dahinter den Namen der Unterklasse, den Sie zuvor vergeben haben. Im obigen Beispiel werden zun&auml;chst drei Varianten des normalen Flie&szlig;textabsatzes <tt>&lt;p&gt;</tt> notiert. In den beiden Zeilen darunter k&ouml;nnen Sie die Wirkung des Schl&uuml;sselwortes <tt>all</tt> sehen. Verschiedene HTML-Tags (im Beispiel <tt>&lt;p&gt;</tt> und <tt>&lt;address&gt;</tt>) k&ouml;nnen die gleiche Unterklasse von Formaten benutzen.</p>

<p>Zu den einzelnen Formateigenschaften und ihren m&ouml;glichen Werten siehe <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tdc.htm"><b>Style-Sheet-Angaben</b></a>.</p>

<h3 class="inf">Beachten Sie</h3>

<p>Es ist durchaus erlaubt, f&uuml;r mehrere HTML-Tags den gleichen Klassennamen zu vergeben. So k&ouml;nnen Sie beispielsweise Unterklassen wie <tt>p.gross</tt>, <tt>h1.gross</tt> und <tt>li.gross</tt> definieren.</p> 

<p>Um <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tdcl.htm"><b>gr&ouml;&szlig;eren Textabschnitten</b></a>, die z.B. aus &Uuml;berschriften, Flie&szlig;text und Listen bestehen, bestimmte Formateigenschaften zuzuweisen, definieren Sie am besten gew&uuml;nschte Unterklassen f&uuml;r das HTML-Tag <tt>&lt;div&gt;...&lt;/div&gt;.</tt> So k&ouml;nnen Sie beispielsweise eine Unterklasse <tt>div.rot {color:red; }</tt> definieren. Wenn Sie dann gr&ouml;&szlig;ere Textabschnitte in das <tt>&lt;div&gt;</tt>-Tag einschlie&szlig;en, erhalten alle Absatztypen innerhalb dieses Abschnitts die Textfarbe rot.</p>

<p>Wenn Sie mit dem Schl&uuml;sselwort <tt>all</tt> arbeiten, k&ouml;nnen Angaben wie <tt>font-size:10pt</tt> unter Umst&auml;nden wenig Sinn machen. Wenn Sie beispielsweise <tt>all.Meine { font-size:10pt;}</tt> angeben und im Text dann <tt>&lt;h1 class=&quot;Meine&quot;&gt;</tt> notieren, wird auch die &Uuml;berschrift 1. Ordnung mit 10 Punkt dargestellt. Sinnvoller ist in diesem Fall das Arbeiten mit prozentualen Angaben, die in Style-Sheets ebenfalls erlaubt sind. So k&ouml;nnten Sie beispielsweise eine allgemeing&uuml;ltige Unterklasse <tt>all.Meine { font-size:150%;}</tt> definieren. Wenn Sie diese Unterklasse dann einem HTML-Tag zuweisen, wird der darin enthaltene Text einfach in 1&frac12;facher Gr&ouml;&szlig;e dargestellt, und zwar in Bezug auf die sonst &uuml;bliche Gr&ouml;&szlig;e.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a3"><img src="xcss1.gif" width=30 height=30 border=0 alt="CSS1.0"><img src="xmsie4.gif" width=30 height=30 border=0 alt="MS IE4.0"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape 4.0"> Formate f&uuml;r verschachtelte HTML-Tags definieren</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tdbbc.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>


<p>Wenn Sie nichts anderes angeben, &uuml;bernimmt ein HTML-Tag innerhalb eines anderen HTML-Tags dessen Eigenschaften und f&uuml;gt seine eigenen Eigenschaften nur hinzu. Wenn Sie beispielsweise f&uuml;r &Uuml;berschriften 1. Ordnung die Schriftart Times und die Farbe rot definieren, erscheint Text, der innerhalb einer solchen &Uuml;berschrift mit <tt>&lt;i&gt;...&lt;/i&gt;</tt> formatiert wird, ebenfalls rot und in Times, aber zus&auml;tzlich kursiv.</p>

<p>Sie k&ouml;nnen aber mit Hilfe von Style-Sheets auch bestimmen, da&szlig; ein HTML-Tag bestimmte Eigenschaften nur dann hat, wenn es innerhalb eines bestimmten anderen HTML-Tags vorkommt. So k&ouml;nnen Sie etwa bestimmen, da&szlig; <tt>&lt;i&gt;...&lt;/i&gt;</tt> innerhalb von &Uuml;berschriften nicht kursiv, stattdessen aber in blauer Farbe dargestellt wird, w&auml;hrend der gleiche Befehl innerhalb anderer HTML-Tags nach wie vor nichts anderes als eine kursive Darstellung bewirkt.</p>



<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;Titel der Datei&lt;/title&gt;
&lt;style type=&quot;text/css&quot;&gt;
&lt;!--
h1 { color:red; }
h1 i { color:blue; font-weight:normal; }
//--&gt;
&lt;/style&gt;
&lt;/head&gt;
&lt;body&gt;
&lt;h1&gt;Wir lernen &lt;i&gt;Style-Sheets&lt;/i&gt;&lt;/h1&gt;
&lt;p&gt;Wir lernen &lt;i&gt;Style-Sheets&lt;/i&gt;&lt;/p&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>An erlaubten Stellen k&ouml;nnen Sie Style-Sheets in HTML einbinden (siehe <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tdba.htm"><b>Style-Sheets in HTML einbinden</b></a>).</p>

<p>Im obigen Beispiel wird dort festgelegt, da&szlig; Textabschnitte, die mit dem Tag <tt>&lt;i&gt;</tt> ... <tt>&lt;/i&gt;</tt> formatiert sind, nicht wie sonst &uuml;blich kursiv, sondern normal, stattdessen aber mit blauer Farbe dargestellt werden. Aber nur dann, wenn dieser Textbereich innerhalb einer &Uuml;berschrift 1. Ordnung vorkommt. Dazu notieren Sie zuerst das &uuml;bergeordnete Tag, im Beispiel <tt>h1</tt>, und dahinter, durch ein Leerzeichen getrennt, das untergeordnete Tag, im Beispiel <tt>i</tt>.</p>

<p>In der ersten Zeile innerhalb des <tt>&lt;body&gt;</tt>-Bereichs im obigen Beispiel kommt diese spezielle Definition zum Tragen. In der zweiten Zeile dagegen, wo das Tag <tt>&lt;i&gt;...&lt;/i&gt;</tt> innerhalb eines anderen Tags vorkommt, hat es die &uuml;bliche Wirkung.</p>

<p>Zu den einzelnen Formateigenschaften und ihren m&ouml;glichen Werten siehe <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tdc.htm"><b>Style-Sheet-Angaben</b></a>.</p>


<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a4"><img src="xcss1.gif" width=30 height=30 border=0 alt="CSS1.0"><img src="xmsie4.gif" width=30 height=30 border=0 alt="MS IE4.0"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape 4.0"> Unabh&auml;ngige Formate definieren</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tdbbd.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Sie k&ouml;nnen Formate vordefinieren, die Sie anschlie&szlig;end auf beliebige geeignete HTML-Tags anwenden k&ouml;nnen. So k&ouml;nnen Sie z.B. ein unabh&auml;ngiges Format mit der Eigenschaft fett/kursiv definieren. Dieses unabh&auml;ngige Format k&ouml;nnen Sie dann innerhalb von HTML-Tags zus&auml;tzlich zu anderen Formaten anwenden, die f&uuml;r das betreffende Tag definiert sind.</p>


<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;Titel der Datei&lt;/title&gt;
&lt;style type=&quot;text/css&quot;&gt;
&lt;!--
p,li,dd,dt,blockquote { color:red;font-family:Times; margin-top:1cm; margin-left:1cm; }
#fettkursiv { font-weight:bold; font-style:italic; }
//--&gt;
&lt;/style&gt;
&lt;/head&gt;
&lt;body&gt;
&lt;p id=&quot;fettkursiv&quot;&gt;Extra-Formatierung&lt;/p&gt;
&lt;p&gt;Das ist formatierter Text mit &lt;em id=&quot;fettkursiv&quot;&gt;Extra-Formatierung&lt;/em&gt;&lt;/p&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>An erlaubten Stellen k&ouml;nnen Sie Style-Sheets in HTML einbinden (siehe <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tdba.htm"><b>Style-Sheets in HTML einbinden</b></a>).</p>

<p>Im Beispiel wird f&uuml;r Flie&szlig;text-Standard-Tags wie <tt>&lt;p&gt;</tt>, <tt>&lt;li&gt;</tt>, <tt>&lt;dt&gt;</tt>, <tt>&lt;dd&gt;</tt> und <tt>&lt;blockquote&gt;</tt> ein einheitliches Format mit verschiedenen Angaben definiert. Ferner wird ein unabh&auml;ngiges Format mit dem Namen <tt>fettkursiv</tt> definiert. Namen von unabh&auml;ngigen Formaten m&uuml;ssen ein Gatterzeichen <tt>#</tt> vorangestellt bekommen. F&uuml;r die Namen gelten die gleichen Regeln wie f&uuml;r Namen von <img src="xgoup.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Unterklassen</b></a>. Im obigen Beispiel werden dem unabh&auml;ngigen Format mit dem Namen <tt>fettkursiv</tt> die beiden Style-Sheet-Angaben zugewiesen, die einen Text fett und kursiv machen.</p> 

<p>Im Dateik&ouml;rper k&ouml;nnen Sie freie Formate innerhalb von HTML-Tags anwenden. Dazu notieren Sie im einleitenden HTML-Tag die Angabe <tt>id=</tt> und dahinter, in Anf&uuml;hrungszeichen, den Namen des unabh&auml;ngigen Formats ohne Gatterzeichen (<i>id = identifier = Bezeichner</i>). Dadurch werden dem Inhalt zwischen dem einleitenden und seinem abschlie&szlig;enden Tag die Eigenschaften des definierten unabh&auml;ngigen Formats zugewiesen. Im obigen Beispiel wird das unabh&auml;ngige Format <tt>fettkursiv</tt> einmal innerhalb eines einleitenden <tt>&lt;p&gt;</tt>-Tags und einmal innerhalb eines einleitenden <tt>&lt;em&gt;</tt>-Tags angegeben. Daraus k&ouml;nnen Sie ersehen, wie unabh&auml;ngige Formate einsetzbar sind, und wie sie andere Formate additiv erg&auml;nzen.</p>

<p>Zu den einzelnen Formateigenschaften und ihren m&ouml;glichen Werten siehe <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tdc.htm"><b>Style-Sheet-Angaben</b></a>.</p>

<h3 class="inf">Beachten Sie:</h3>

<p>Unabh&auml;ngige Formate wirken normalerweise additiv, d.h. sie &uuml;bernehmen das vorhandene Format und f&uuml;gen ihre eigenen Eigenschaften lediglich hinzu. Unabh&auml;ngige Formate haben jedoch im Konfliktfall Vorrang vor anderen Formatierungen. Wenn Sie beispielsweise f&uuml;r &Uuml;berschriften 1. Ordnung eine rote Farbe definieren und einer solchen &Uuml;berschrift ein unabh&auml;ngiges Format zuweisen, in dem die Farbe blau definiert wird, dann wird die &Uuml;berschrift blau.</p>






<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a5"><img src="xcss1.gif" width=30 height=30 border=0 alt="CSS1.0"><img src="xmsie4.gif" width=30 height=30 border=0 alt="MS IE4.0"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape 4.0"> Pseudo-Formate definieren</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tdbbe.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>


<p>Pseudo-Elemente sind Elemente innerhalb einer HTML-Datei, die sich jedoch nicht durch ein eindeutiges HTML-Tag ausdr&uuml;cken lassen, z.B. ein &quot;noch nicht besuchter Verweis&quot; oder der erste Buchstabe eines Absatzes. Zum Definieren solcher Pseudo-Elemente gibt es eine bestimmte Syntax innerhalb der Style-Sheet-Sprache CSS.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;Titel der Datei&lt;/title&gt;
&lt;style type=&quot;text/css&quot;&gt;
    a:link { color:#FF0000; font-weight:bold }
    a:visited { color:#990000; }
    a:active { color:#0000FF; font-style:italic }
&lt;/style&gt;
&lt;/head&gt;
&lt;body&gt;
&lt;a href=&quot;selfhtml.htm&quot;&gt;Verweis&lt;/a&gt;&lt;/p&gt;
&lt;/body&gt;
&lt;/html&gt;

</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Bei Style-Sheet-Definitionen von Pseudo-Elementen notieren Sie zuerst das betroffene HTML-Tag, im Beispiel das <tt>&lt;a&gt;</tt>-Tag f&uuml;r Verweise. Dahinter folgt ein Doppelpunkt und dahinter eine erlaubte Angabe, im Beispiel etwa <tt>link</tt> oder <tt>visited</tt>. Beachten Sie, da&szlig; dies keine frei w&auml;hlbaren Namen sind, sondern feste Schl&uuml;sselw&ouml;rter.</p>

<p>F&uuml;r die eigentlichen Formatdefinitionen innerhalb der geschweiften Klammern gelten die gleichen Regeln wie beim <img src="xgoup.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Definieren von Formaten f&uuml;r HTML-Tags</b></a>.</p>

<p>Zu den einzelnen erlaubten Angaben siehe auch: <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tdcg.htm"><b>Style-Sheet-Angaben: Pseudo-Formate</b></a>.</p>


<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tdbc.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF><img src="x3.gif" width=15 height=10 border=0> <a href="tdbc.htm"><b>Schnellformatierung im Text</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tdba.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tdba.htm"><b>Style-Sheets in HTML einbinden</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="td.htm"><b>CSS Style-Sheets</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tdb.htm"><b>Style-Sheets definieren</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>