<html>
<head>
<title>SELFHTML: CSS / Formate definieren / Formate f&uuml;r verschachtelte HTML-Tags definieren</title>
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
<style type="text/css">
<!--
  blockquote { text-transform:uppercase; color:#FF77CC; font-size:18pt; }
  blockquote i { color:#CC0000; font-style:normal; }
//-->
</style>
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>


<h2 class="Sh2"><a class="an" name="a1"><img src="xcss1.gif" width=30 height=30 border=0 alt="CSS1.0"><img src="xmsie3.gif" width=30 height=30 border=0 alt="MS IE3.0"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape 4.0"> Formate f&uuml;r verschachtelte HTML-Tags definieren</a></h2>

<p><img src="xshow.gif" width=33 height=14 border=0 alt="Beschreibung"><br>
<a href="tdbb.htm#a3"><b>Beschreibung: so wird's gemacht</b></a></p>

<p>Wenn Ihr WWW-Browser Style-Sheets unterst&uuml;zt, wird der folgende Text auff&auml;llig formatiert dargestellt. Es handelt sich um ein umdefiniertes mit <tt>&lt;blockquote&gt;</tt>-Tag. Der Text ist mit 18 Punkt Schriftgr&ouml;&szlig;e, Gro&szlig;buchstaben und Farbe rosa definiert. Kursiver Text, der mit <tt>&lt;i&gt;</tt>...<tt>&lt;/i&gt;</tt> formatiert wurde und innerhalb eines solchen Bereichs vorkommt, wird rot statt rosa dargestellt und nicht wie &uuml;blich kursiv, sondern normal.</p>

<blockquote>Man mu&szlig; ja nicht gleich die ganze WWW-Seite schwarz einf&auml;rben, nur weil mal wieder ein bayerischer Staatsanwalt oder ein fern&ouml;stlicher Potentat der Meinung ist, dem weltweiten Netz seine jeweiligen und gesellschaftsbedingten Vorstellungen von Erlaubtem und Nicht-Erlaubtem aufdr&auml;ngen zu m&uuml;ssen. <i>Viel besser ist es, solche Inhalte - nach ihrer Verfielf&auml;ltigung auf etlichen WWW-Servern, versteht sich - zus&auml;tzlich noch sch&ouml;n auff&auml;llig zu formatieren. So sind sie besser sichtbar.</i> Wir k&ouml;nnen das nat&uuml;rlich auch alles bleiben lassen. Dann bleibt vom Internet in wenigen Jahren nur noch das &uuml;brig, <i>was &uuml;berall auf der Welt erlaubt bzw. nirgendwo verboten ist</i>: n&auml;mlich <i>nichts</i>! </blockquote>


&#160;
</body>
</html>