<html>
<head>
<title>SELFHTML: CSS /  Style-Sheet-Angaben / Schriftartendatei</title>
<meta name="description" content="(SELFHTML 7.0) &Uuml;bersicht zu CSS-Style-Sheet-Angaben, um Text bzw. Schrift individuell zu formatieren, und zwar unter Angabe bestimmter Schriftartendateien">
<meta name="keywords" content="SELFHTML, CSS, Style-Sheets">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="td.htm"><b>CSS Style-Sheets</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tdc.htm"><b>Style-Sheet-Angaben</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Style-Sheet-Angaben: Schriftformatierung mit Schriftartendatei</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Schriftformatierung mit Schriftartendatei</b> (@font-face, src, font-family)</a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Schriftformate eingrenzen</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>Unicode-Bereich eingrenzen</b> (unicode-range)</a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a4"><b>Weitere Angaben zur Schriftquelle</b></a>
</p>


</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="a1"><img src="xcss2.gif" width=30 height=30 border=0 alt="CSS2.0"><img src="xmsie4.gif" width=30 height=30 border=0 alt="MS IE4.0"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape 4.0"> Schriftformatierung mit Schriftartendatei (@font-face, src, font-family)</a></h2>

<p>Mit dieser Angabe k&ouml;nnen Sie eine Schriftart erzwingen, &auml;hnlich wie mit <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tdca.htm#a2"><b>Schriftart</b> (font-family:)</a>. Der Unterschied ist jedoch, da&szlig; Sie mit der hier beschriebenen Angabe direkt die Daten-Ressourcen bestimmter Schriftarten ansprechen, also bestimmte Schriftartendateien, oder zumindest mit Hilfe spezieller Befehle die Charakteristika der gew&uuml;nschten Schriftart exakt beschreiben.</p>


<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;Titel&lt;/title&gt;
&lt;style type=&quot;text/css&quot;&gt;
 @font-face { font-family:Garamond; src:url(garamond.eot), url(garamond.pfr); }
&lt;/style&gt;
&lt;/head&gt;
&lt;body&gt;
&lt;p style=&quot;font-family:Garamond&quot;&gt;Text in Garamond&lt;/p&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Mit <tt>@font-face</tt> starten Sie die Angabe einer exakten Schriftart. Dahinter folgen, in geschweiften Klammern, die Daten. Die beiden wichtigsten sind der Schriftartenname <tt>font-family</tt> und die URL-Adresse der Schriftartendatei <tt>src:url(Datei)</tt>.</p>

<p>Den Schriftartennamen vergeben Sie mit der Angabe <tt>font-family:</tt> innerhalb des <tt>@font-face</tt>-Bereichs. Unter diesem Namen k&ouml;nnen Sie die Schriftart in HTML verwenden. Im obigen Beispiel gibt es einen Textabsatz, der mit Hilfe einer Style-Sheet-Angabe die zuvor definierte Schriftart erzwingt.</p>

<p>Die Schriftartendatei, die Sie f&uuml;r die zugeh&ouml;rigen <tt>font-family</tt>-Angaben bestimmen, geben Sie mit <tt>src:url(Datei)</tt> an. Wenn sich die Schriftartendatei im gleichen Verzeichnis befindet wie die HTML-Datei, gen&uuml;gt die Angabe des Dateinamens. Andernfalls m&uuml;ssen Sie die genaue Lage der Schriftartendatei entweder durch eine relative Pfadangabe oder durch eine absolute Adressierung vom Typ <tt>http://...</tt> angeben.</p>

<p>Im obigen Beispiel sehen Sie, da&szlig; gleich zwei URL-Angaben notiert sind. Einmal wird eine Endung eot-Datei als Schriftartenquelle angegeben, einmal eine pfr-Datei. Beide Formate sind browser-spezifisch: eot-Dateien sind Schriftartendateien, die der MS Internet Explorer (ab Version 4.0) als Web-Schriftarten erkennt; pfr-Dateien sind Schriftartendateien, die Netscape (ab Version 4.0) erkennt. Wenn Sie Ihre gew&uuml;nschte Schriftart in beiden Formaten anbieten k&ouml;nnen, k&ouml;nnen Sie beide Formate so einbinden wie im obigen Beispiel.</p>

<p>Einzelheiten zu eot- und pfr-Schriftarten und wie Sie diese selbst erstellen k&ouml;nnen, finden Sie im Kapitel &uuml;ber <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tcl.htm"><b>Internationalisierung</b></a> im Abschnitt <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="thf.htm"><b>Downloadbare Schriftarten</b></a>.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2"><img src="xcss2.gif" width=30 height=30 border=0 alt="CSS2.0"> Schriftformate eingrenzen</a></h2>

<p>Wenn Sie eine Schriftart mit einer Schriftartendatei definieren, k&ouml;nnen Sie bei der Definition auch Angaben zu den m&ouml;glichen Formateigenschaften der Schrift machen, wie z.B. zu <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcda.htm#a3"><b>Schriftstil</b> (font-style)</a>, <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcda.htm#a4"><b>Schriftvariante</b> (font-variant)</a>, <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcda.htm#a5"><b>Schriftgr&ouml;&szlig;e</b> (font-size)</a> oder <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcda.htm#a6"><b>Schriftgewicht</b> (font-weight)</a>. So k&ouml;nnen Sie dem WWW-Browser bereits in der HTML-Datei mitteilen, welche Formateigenschaften die Schriftartendatei unterst&uuml;tzt. Der Browser &uuml;bertr&auml;gt die Schriftartendatei in desem Fall nur dann zum Anwender, wenn Formatierungen in der HTML-Datei die &Uuml;bertragung sinnvoll machen.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;Titel&lt;/title&gt;
&lt;style type=&quot;text/css&quot;&gt;
 @font-face { font-family:Garamond; src:url(garamond.eot); font-size:10pt,12pt,14pt; }
 @font-face { font-family:Garamond; src:url(garamond.pfr); font-size:10pt,12pt,14pt; } 
&lt;/style&gt;
&lt;/head&gt;
&lt;body&gt;
&lt;p style=&quot;font-family:Garamond; font-size:48pt&quot;&gt;Text&lt;/p&gt;
&lt;!-- Datei wird nicht &uuml;bertragen --&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Mit den daf&uuml;r &uuml;blichen Style-Sheet-Befehlen k&ouml;nnen Sie bei der Definition einer Schriftart mit Schriftartendatei einschr&auml;nkende Angaben zur Schrift machen.</p>

<p>Folgende Besonderheiten sollten Sie dabei beachten:<br>
Bei <tt>font-style</tt> k&ouml;nnen Sie auch mehrere erlaubte Angaben machen. Trennen Sie diese Angaben durch Kommata, also beispielsweise: <tt>font-style:normal,italic;</tt>.<br> 
Bei <tt>font-variant</tt> k&ouml;nnen Sie auch mehrere erlaubte Angaben machen. Trennen Sie diese Angaben durch Kommata, also beispielsweise: <tt>font-style:normal,small-caps;</tt>.<br>
Bei <tt>font-weight</tt> sind die Angaben <tt>bolder</tt> und <tt>lighter</tt> nicht zul&auml;ssig. Au&szlig;erdem k&ouml;nnen Sie auch mehrere erlaubte Angaben machen. Trennen Sie diese Angaben durch Kommata, also beispielsweise: <tt>font-weight:normal,bold,900;</tt>.<br>
Bei <tt>font-size</tt> sind nur absolute Gr&ouml;&szlig;enangaben erlaubt, wie etwa <tt>font-size:18pt</tt>. Relative Gr&ouml;&szlig;enangaben wie Prozentangaben oder em-Angaben sind nicht erlaubt. Au&szlig;erdem k&ouml;nnen Sie auch mehrere Angaben machen. Trennen Sie diese Angaben durch Kommata, also beispielsweise: <tt>font-size:12pt,14pt,16pt;</tt>.
</p>




<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a3"><img src="xcss2.gif" width=30 height=30 border=0 alt="CSS2.0"> Unicode-Bereich eingrenzen (unicode-range)</a></h2>

<p>Wenn Sie eine Schriftart mit einer Schriftartendatei definieren, k&ouml;nnen Sie bei der Definition den Zeichenbereich einschr&auml;nken. So k&ouml;nnen Sie dem WWW-Browser bereits in der HTML-Datei mitteilen, welchen Zeichenbereich die Schriftart unterst&uuml;tzt. Der Browser &uuml;bertr&auml;gt die Schriftartendatei in desem Fall nur dann zum Anwender, wenn alle Zeichen eines Textes, der mit der Schriftart formatiert wird, innerhalb des definierten Unicode-Bereichs liegen. Dabei gilt das <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="thc.htm"><b>Unicode-System</b></a> als Grundlage.</p>


<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;Titel&lt;/title&gt;
&lt;style type=&quot;text/css&quot;&gt;
 @font-face { font-family:System; src:url(system.eot); unicode-range:U+0000-007F; }
 @font-face { font-family:System; src:url(system.pfr); unicode-range:U+0000-007F; } 
&lt;/style&gt;
&lt;/head&gt;
&lt;body&gt;
&lt;tt style=&quot;font-family:System&quot;&gt;Text mit &szlig; und &Uuml;&lt;/tt&gt;
&lt;!-- Datei wird nicht &uuml;bertragen --&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Mit <tt>unicode-range:</tt> k&ouml;nnen Sie den Zeichenbereich der Schriftartendatei vor dem Download bekannt machen. Im obigen Beispiel wird der Bereich U+0000-007F definiert. Das entspricht dem ASCII-Zeichensatz. Wenn nun in einem Bereich, der diese Schriftart benutzt, beispielsweise Umlaute oder andere Zeichen vorkommen, die nicht im ASCII-Zeichensatz vorkommen, wird die Schriftartendatei nicht downgeloadet.</p>

<p>Unicode-Angaben beginnen immer mit <tt>U+</tt>. Dahinter folgt eine Angabe des gew&uuml;nschten Zeichenwerts in hexadezimaler Form. Um einen Bereich zu definieren, der aus mehreren Unicode-Zeichen besteht, k&ouml;nnen Sie als Platzhalterzeichen (Wildcard) ein Fragezeichen <tt>?</tt> benutzen. Bei einer Angabe wie <tt>unicode-range:U+00??</tt> bewirken die zwei hintereinanderstehenden Fragezeichen am Ende der Angabe, da&szlig; der gew&uuml;nschte Unicode-Bereich 16 hoch 2, also 256 Zeichen ab dem Zeichen <tt>U+00</tt> betr&auml;gt. Da laut Unicode-System bei <tt>U+0000</tt> die Zeichen des sogenannten Western-Latin-1-Zeichensatzes beginnen, der aus 256 Zeichen besteht, deckt die Angabe in dem Beispiel genau diesen Zeichensatz ab. Wenn Sie einen beliebigen, Unicode-Bereich bestimmen m&ouml;chten, k&ouml;nnen Sie dies mit einer Angabe tun wie z.B. <tt>U+AC00-D7FF</tt></p>.



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a4"><img src="xcss2.gif" width=30 height=30 border=0 alt="CSS2.0"> Weitere Angaben zur Schriftquelle</a></h2>

<p>Die Version 2.0 der CSS-Sprache stellt einige Style-Sheet-Angaben bereit, um Schriftartenquellen m&ouml;glichst vielf&auml;ltig definierbar und auffindbar zu machen.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;style type=&quot;text/css&quot;&gt;
 @font-face { font-family:Kino; src:local(Kino MT), url(kino.ttf) format(TrueType); }
 @font-face { font-family:MeineArt; url(http://www.xy.de/cgi-bin/myfont.pl) format(intellifont) }
 @font-face { font-family:Alabama; url(alab.fon); panose-1: 2 4 5 2 5 4 5 9 3 3; }
&lt;/style&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Sie k&ouml;nnen bewirken, da&szlig; der WWW-Browser zuerst auf dem Rechner des Anwenders nach der gew&uuml;nschten Schriftart sucht und eine auf dem Server bereit liegende Schriftart nur dann downloadet, wenn die Schriaftart lokal nicht verf&uuml;gbar ist. Dazu notieren Sie bei der Quellenangabe der Schriftartendatei (<tt>src:</tt>) zuerst <tt>local</tt> und dahinter in Klammern den gew&uuml;nschten Schriftartennamen. F&uuml;r den Fall, da&szlig; der Browser diese Schriftart beim Anwender nicht findet, k&ouml;nnen Sie, durch ein Komma getrennt, dahinter die Schriftartendatei angeben, die Sie auf Ihren WWW-Seiten mit anbieten - im Beispiel <tt>url(kino.ttf)</tt>.</p>

<p>Sie k&ouml;nnen ferner Angaben zum Format der Schriftart machen. Der WWW-Browser l&auml;dt die Schriftartendatei in diesem Fall nur, wenn sie auf dem Rechner des Anwenders ausf&uuml;hrbar ist. Dazu notieren Sie, durch ein Leerzeichen getrennt von den Angaben zu <tt>src:local()</tt> und/oder <tt>src:url()</tt>, die Angabe <tt>format()</tt>. Innerhalb der Klammern k&ouml;nnen Sie das Format der Schriftartendatei angeben. Im obigen Beispiel wird eine TrueType-Schriftart angegeben. Dieses Schriftartenformat ist nur in der Windows-Welt verbreitet. Anwender, die z.B. einen Macintosh oder einen Amiga-Rechner einsetzen, haben von einer solchen Datei nichts. Ein WWW-Browser, der diese Angaben kennt, braucht also eine solche Datei nicht downzuloaden.</p>

<p>Es gibt weitere M&ouml;glichkeiten, die Schriftart genau einzugrenzen:</p>

<p>Mit <tt>panose-1:</tt>, gefolgt von 10 durch Leerzeichen getrennten Zahlen, k&ouml;nnen Sie eine Schriftart nach dem Panose-1-System bestimmen. Beispiel: <tt>panose-1: 2 4 5 2 5 4 5 9 3 3;</tt><br>
Mit <tt>stemv:</tt> und <tt>stemh:</tt> k&ouml;nnen Sie die vertikale und horizontale Stammbreite der Glyphen angeben.<br>
Mit <tt>units-per-em:</tt> k&ouml;nnen Sie die Anzahl der Einheiten pro em-Ma&szlig;einheit angeben. &Uuml;blich sind die Werte 250 (bei Intellifont), 1000 (bei Type-1) oder 2048 (bei TrueType). Wenn Sie <tt>stemv:</tt> und/oder <tt>stemh:</tt> angeben, m&uuml;ssen Sie auch <tt>units-per-em:</tt> angeben.<br> 
Mit <tt>slope:</tt> k&ouml;nnen Sie den vertikalen Winkel der Glyphen angeben.<br> 
Mit <tt>cap-height:</tt> k&ouml;nnen Sie die H&ouml;he der Gro&szlig;buchstaben der Glyphen angeben.<br> 
Mit <tt>x-height:</tt> k&ouml;nnen Sie die H&ouml;he der Kleinbuchstaben der Glyphen angeben.<br> 
Mit <tt>ascent:</tt> k&ouml;nnen Sie die maximale H&ouml;he der akzentlosen Glyphen angeben.<br> 
Mit <tt>descent:</tt> k&ouml;nnen Sie die maximale Tiefe der akzentlosen Glyphen angeben.<br> 
Mit <tt>definition-src:url()</tt> k&ouml;nnen Sie eine Datei mit Schriftartendefinitionen angeben.<br> 
Mit <tt>definition-src:url()</tt> k&ouml;nnen Sie eine Datei mit Schriftartendefinitionen angeben.<br> 
Mit <tt>baseline:</tt> k&ouml;nnen Sie die untere Grundlinie der Glyphen angeben.<br> 
Mit <tt>centerline:</tt> k&ouml;nnen Sie die zentrale Grundlinie der Glyphen angeben.<br> 
Mit <tt>mathline:</tt> k&ouml;nnen Sie die mathematische Grundlinie der Glyphen angeben.<br> 
Mit <tt>topline:</tt> k&ouml;nnen Sie die obere Grundlinie der Glyphen angeben.
</p>




<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tdcc.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF><img src="x3.gif" width=15 height=10 border=0> <a href="tdcc.htm"><b>Style-Sheet-Angaben: Abst&auml;nde, R&auml;nder, Ausrichtung</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tdca.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tdca.htm"><b>Style-Sheet-Angaben: Schriftformatierung</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="td.htm"><b>CSS Style-Sheets</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tdc.htm"><b>Style-Sheet-Angaben</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>