<html>
<head>
<title>SELFHTML: CSS / Style-Sheet-Angaben / Mehrspaltiger Textflu&szlig; / Trennstrich (allgemein)</title>
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>


<h2><img src="xcss2.gif" width=30 height=30 border=0 alt="CSS2.0"> Trennstrich (allgemein)</h2>

<p><img src="xshow.gif" width=33 height=14 border=0 alt="Beschreibung"><br>
<a href="tdci.htm#a7"><b>Beschreibung: so wird's gemacht</b></a></p>

<div style="columns:3; column-rule:3mm double #CC00CC;">
<h3>Dreispaltiger Text</h3>
<p>Neben der Plaza Mayor, dem Hauptplatz einer Ortschaft, wo sich die Menschen allabendlich zum Plausch im Stehen oder Hocken treffen, sind die Bars die wichtigsten Kommunikationszentren Spaniens. Auf unseren Etappen haben wir sie - neben den Tankstellen - auch als wichtige Versorgungszentren sch&auml;tzen gelernt. In der Regel haben sie von fr&uuml;h morgens bis sp&auml;t abends ge&ouml;ffnet, und bieten von Wasser, Kaffee, Bier, Snacks so ziemlich alles an, was zum Leben und &Uuml;berleben wichtig ist. Meist sind sie sehr einfach eingerichtet. Konsumiert (und kommuniziert) wird an der Theke. F&uuml;r den Fall, da&szlig; es einmal nichts zu beratschen gibt, l&auml;uft allzeit der Fernseher in der Ecke, der das spanische Volk vor allem mit Fu&szlig;ball (span. &quot;F&uacute;tbol&quot;) versorgt.</p>
<p>Zum Bier werden in der Regel kleine H&auml;ppchen gereicht, Oliven, Pistazien, Fleischst&uuml;ckchen usw. Schalen, Essensreste, Verpackungen usw. l&auml;&szlig;t man einfach unter sich fallen, das machen alle so. Es ist kein guter Stil, so etwas in Aschenbecher oder auf leere Teller zu tun.<br>
In den kleineren und l&auml;ndlicheren Orten werden die Bars nur von M&auml;nnern aufgesucht. Frauen d&uuml;rfen h&ouml;chstens bedienen oder M&auml;nner abholen. In gr&ouml;&szlig;eren Orten hat da mittlerweile ein Wandel in Richtung Mitteleuropa stattgefunden.</p>
</div>


<br>&#160;
</body>
</html>