<html>
<head>
<title>SELFHTML: Dynamisches HTML /  JavaScript in HTML</title>
<meta name="description" content="(SELFHTML 7.0) Der Zusammenhang zwischen HTML und JavaScript und wie Sie JavaScript in HTML einbinden k&ouml;nnen.">
<meta name="keywords" content="SELFHTML, JavaScript, ECMAScript, JScript, HTML">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="te.htm"><b>JavaScript</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>JavaScript in HTML</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>JavaScript und HTML</b></a> <br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>JavaScript, JScript, ECMAScript, Sprachversionen</b></a> <br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>Hinweise f&uuml;r die Praxis</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a4"><b>JavaScript-Bereiche in HTML definieren</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a5"><b>JavaScript-Elemente in HTML-Tags</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a6"><b>JavaScripts in separaten Dateien</b></a><br>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>


<h2 class="Sh2"><a class="an" name="a1">JavaScript und HTML</a></h2>

<p>JavaScript ist kein direkter Bestandteil von HTML, sondern eine eigene Programmiersprache. Diese Sprache wurde jedoch eigens zu dem Zweck geschaffen, HTML-Autoren ein Werkzeug in die Hand zu geben, mit dessen Hilfe sich WWW-Seiten optimieren lassen.</p>

<p>JavaScript-Programme werden wahlweise direkt in der HTML-Datei oder in separaten Dateien notiert. Sie werden nicht - wie etwa Java-Programme - compiliert, sondern als Quelltext zur Laufzeit interpretiert, also &auml;hnlich wie Batchdateien bzw. Shellscripts. Dazu besitzen moderne WWW-Browser wie Netscape oder Microsoft Internet Explorer entsprechende Interpreter-Software.</p> 

<p>In einer Programmiersprache wie JavaScript gibt es f&uuml;r Anf&auml;nger viele verwirrende Elemente: Sonderzeichen, Variablen, Wenn-Dann-Anweisungen, Schleifen, Funktionen, Methoden, Parameter, Objekte, Eigenschaften und anderes mehr. Um mit diesen Elementen richtig umgehen zu k&ouml;nnen, m&uuml;ssen Sie lernen sich vorzustellen, was im Computer passiert, wenn der Programmcode ausgef&uuml;hrt wird. Das ist ein langwieriger Lernproze&szlig;, den Anf&auml;nger nur durch viel &Uuml;bung bew&auml;ltigen. JavaScript ist dazu allerdings hervorragend geeignet, weil es eine vergleichsweise einfache Sprache ist, bei der viele Aufgabenbereiche einer &quot;gro&szlig;en&quot; Programmiersprache fehlen, z.B. Dinge wie Arbeitsspeicherverwaltung oder Dateioperationen. Au&szlig;erdem setzt JavaScript auf einer bestimmten Umgebung auf, n&auml;mlich auf einer anzuzeigenden oder angezeigten WWW-Seite.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2">JavaScript, JScript, ECMA-262, Sprachversionen</a></h2>

<p><b>JavaScript</b> ist eine Scriptsprache, die von Netscape eingef&uuml;hrt wurde und von Netscape lizenziert ist. Deshalb beherrschen die jeweils neuen Versionen des Netscape-Browsers auch immer etwas mehr JavaScript als die Konkurrenz, die nur abwarten kann, was Netscape an Neuigkeiten implementiert.</p>

<p>Netscape 2.0 interpretiert den seinerzeit eingef&uuml;hrten JavaScript-Sprachstandard 1.0. Der MS Internet Explorer versteht diesen Sprachstandard weitgehend seit der Version 3.0.<br>
Netscape interpretiert seit Version 3.0 den JavaScript-Standard 1.1. Der MS Internet Explorer interpretiert diesen Sprachumfang von JavaScript weitgehend seit der Produktversion 4.0.<br>
Netscape interpretiert seit Version 4.0 den JavaScript-Standard 1.2. Einige Befehle dieser Sprachversion werden auch vom MS Internet Explorer 4.0 interpretiert.<br>
Weiterhin unterscheiden sich Netscape und der MS Internet Explorer in der Interpretation einzelner Objekteigenschaften. So funktionieren beispielsweise Cookies (ein bekanntes JavaScript-Feature) bei Netscape auch lokal, w&auml;hrend der MS Internet Explorer, zumindest in der Version 3.x, eine HTTP-Verbindung voraussetzt, um Cookies zu unterst&uuml;tzen. Auch bei internen Abl&auml;ufen, etwa bei vielfach zu durchlaufenden Schleifen, gibt es Unterschiede zwischen einzelnen Browsern und Browser-Versionen.</p>

<p>Der MS Internet Explorer 4.x interpretiert zwar JavaScript, daneben aber auch die Microsoft-eigene Sprachvariante <b>JScript</b>, die spezielle Befehle f&uuml;r die Betriebssystemerweiterungen des MS Internet Explorers bereitstellt.</p>

<p>Sowohl Netscape als auch Microsoft betonen, da&szlig; sie sich mit ihren Sprachinterpretern am Standard f&uuml;r Internet-Scriptsprachen, an <b>ECMA-262</b>, orientieren. Das ECMA-Kommittee, dem verschiedene Software-Hersteller, unter anderem Microsoft und Netscape, angeh&ouml;ren, ist bem&uuml;ht, auch im Bereich der Scriptsprachen einen allgemeing&uuml;ltigen Standard zu definieren, so wie es bei HTML oder CSS Style Sheets der Fall ist.</p>

<p>Im WWW k&ouml;nnen Sie sich &uuml;ber Scriptsprachen, Standards, Versionen usw. an folgenden Adressen schlau machen:</p>

<p>
<img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://developer.netscape.com/docs/manuals/"><b>Netscape Library Documentation</b></a>.<br>
Entwickler-Dokumentation von Netscape. Zu JavaScript im Frame-Set der Seite auf den Verweis &quot;JavaScript&quot; klicken.
</p>
<p>
<img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.microsoft.com/scripting/"><b>Microsoft Scripting</b></a>.<br>
Einstiegsseite zu allen Script-Technologien, die der MS Internet Explorer beherrscht.
</p>
<p>
<img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.ecma.ch/stand/ecma-262.htm"><b>ECMAScript-262 Spezifikation</b></a>.<br>
Die Spezifikation f&uuml;r Bestandteile einer standardisierten Scriptsprache f&uuml;r WWW-Seiten
</p>

<p>Zur Kennzeichnung der Sprachversionen werden in der vorliegenden Dokumentation folgende Symbole verwendet:</p>

<table>
<tr>
<td valign=top><img src="xjavs10.gif" width=30 height=30 alt="JavaScript1.0" border="0"></td>
<td valign=top>JavaScript-Sprachstandard 1.0.</td>
</tr>
<tr>
<td valign=top><img src="xjavs11.gif" width=30 height=30 alt="JavaScript1.1" border="0"></td>
<td valign=top>JavaScript-Sprachstandard 1.1.</td>
</tr>
<tr>
<td valign=top><img src="xjavs12.gif" width=30 height=30 alt="JavaScript1.2" border="0"></td>
<td valign=top>JavaScript-Sprachstandard 1.2.</td>
</tr>
<tr>
<td valign=top><img src="xmsjs.gif" width=30 height=30 alt="MS JavaScript/JScript" border="0"></td>
<td valign=top>Von Microsoft eingef&uuml;hrter Sprachbestandteil. Solche Bestandteile werden in der Regel nur vom MS Internet Explorer ab V4.x interpretiert; es wurden nur einige wichtige solcher Elemente in die <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tec.htm"><b>Objekt-Referenz</b></a> mit aufgenommen, n&auml;mlich solche, die eine Grundlage f&uuml;r Dynamisches HTML nach dem Ansatz des MS Internet Explorers darstellen.</td>
</tr>
</table>
<br>&#160;



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a3">Hinweise f&uuml;r die Praxis</a></h2>

<p>Bevor Sie daran gehen, neuen, eigenen JavaScript-Code zu programmieren, m&uuml;ssen Sie sich exakt dar&uuml;ber im klaren sein, welches Problem Sie damit l&ouml;sen wollen. Dazu m&uuml;ssen Sie erst einmal wissen, was man mit HTML selbst alles machen kann, und wo die Grenzen von HTML liegen. Von JavaScript m&uuml;ssen Sie dann so viel wissen, da&szlig; Sie entscheiden k&ouml;nnen, ob das Problem mit JavaScript &uuml;berhaupt l&ouml;sbar ist. Mit  JavaScript k&ouml;nnen Sie z.B. <b>nicht</b> die typischen Aufgaben von <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tg.htm"><b>CGI-Scripts</b></a> l&ouml;sen!</p> 

<p>Ferner sollten Sie sich im WWW umsehen, ob es nicht schon frei verf&uuml;gbare JavaScript-Beispiele gibt, die genau Ihr Problem l&ouml;sen. Denn es ist immer besser, auf Code zur&uuml;ckzugreifen, der sich in der Praxis bereits bew&auml;hrt hat, als neuen Code zu erstellen, dessen &quot;heimliche T&uuml;cken&quot; einem noch nicht bekannt sind. In vielen F&auml;llen gen&uuml;gt es, vorhandene JavaScripts den eigenen Erfordernissen anzupassen. Eine gute Einstiegsadresse f&uuml;r die Suche nach JavaScripts ist das WWW-Angebot <img src="xdeu.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://javascript.seite.net/"><b>Kakao und Kekse</b></a> von Johannes Gamperl. Bei vorhandenen JavaScripts m&uuml;ssen Sie allerdings so viel von der Sprache verstehen, da&szlig; Sie genau wissen, welche Variablen oder festen Werte Sie ver&auml;ndern oder welche Funktion Sie erg&auml;nzen wollen.</p>

<p>Wenn Sie JavaScript f&uuml;r wichtige WWW-Seiten verwenden wollen, sollten Sie auf jeden Fall mehrere Browser zum Testen einsetzen. Denn leider sind die JavaScript-Interpreter der beiden JavaScript-f&auml;higen WWW-Browser Netscape und MS Internet Explorer sehr unterschiedlich in ihrer Leistung.</p> 

<p>Stellen Sie keine WWW-Seiten mit ungepr&uuml;ftem JavaScript-Code ins WWW. F&uuml;r einen Anwender ist es sehr &auml;rgerlich, wenn er Fehlermeldungen des JavaScript-Interpreters am Bildschirm erh&auml;lt und in schlimmeren F&auml;llen einen Programmabsturz des WWW-Browsers oder gar einen Systemabsturz hat, was bei Online-Sitzungen besonders unangenehm ist.</p>





<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><img src="xjavs10.gif" width=30 height=30 alt="JavaScript 1.0" border="0"><img src="xnetsi2.gif" width=30 height=30 alt="Netscape2.0" border="0"><img src="xmsie3.gif" width=30 height=30 alt="MS IE3.0" border="0"> <a class="an" name="a4">JavaScript-Bereiche in HTML definieren</a></h2>

<p>F&uuml;r JavaScript-Programmabschnitte k&ouml;nnen Sie in HTML Bereiche definieren.</p>

<h3 class="xmp">Beispiel:</h3>

<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;&lt;head&gt;&lt;title&gt;Test&lt;/title&gt;
&lt;script language=&quot;JavaScript&quot;&gt;
&lt;!--
 alert(&quot;Hallo Welt!&quot;);
//--&gt;
&lt;/script&gt;
&lt;/head&gt;&lt;body&gt;
&lt;/body&gt;&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Mit <tt>&lt;script language=&quot;JavaScript&quot;&gt;</tt> leiten Sie einen Bereich f&uuml;r JavaScript innerhalb einer HTML-Datei ein (<i>script = Quelltext, language = Sprache</i>). Dahinter - am besten in der n&auml;chsten Zeile - sollten Sie mit <tt>&lt;!--</tt> einen <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcaf.htm#a1"><b>Kommentar</b></a> einleiten. Dadurch erreichen Sie, da&szlig; &auml;ltere WWW-Browser, die JavaScript nicht kennen, den folgenden JavaScript-Code ignorieren und nicht irrt&uuml;mlich als Text innerhalb der HTML-Datei interpretieren.</p>

<p>Im obigen Beispiel wird mit Hilfe von JavaScript ein Meldungsfenster mit dem Text &quot;Hallo Welt!&quot; am Bildschirm ausgegeben.</p>

<p>Am Ende eines JavaScript-Bereichs schlie&szlig;en Sie mit <tt>//--&gt;</tt> den Kommentar und mit <tt>&lt;/script&gt;</tt> den Bereich f&uuml;r den Programmcode.</p> 

<h3 class="inf">Beachten Sie:</h3>

<p>Es gibt keine festen Vorschriften daf&uuml;r, an welcher Stelle einer HTML-Datei ein JavaScript-Bereich definiert werden mu&szlig;. Es ist unter JavaScript-Programmierern zur Gewohnheit geworden, einen solchen Bereich im Kopf der HTML-Datei, also zwischen <tt>&lt;head&gt;</tt> und <tt>&lt;/head&gt;</tt> zu definieren. Dadurch ist am ehesten sichergestellt, da&szlig; der Code vom WWW-Browser bereits eingelesen ist und zur Verf&uuml;gung steht, wenn er ausgef&uuml;hrt werden soll.</p>

<p>JavaScript-Code kann automatisch beim Einlesen der HTML-Datei ausgef&uuml;hrt werden. Das ist dann der Fall, wenn JavaScript-Befehle in einem JavaScript-Bereich au&szlig;erhalb jeder <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tebd.htm#a1"><b>selbst definierten Funktion</b></a> stehen, so wie im obigen Beispiel. In solchen F&auml;llen ist es manchmal auch erforderlich, den Script-Bereich innerhalb des HTML-Dateik&ouml;rpers, also innerhalb von <tt>&lt;body&gt;</tt>...<tt>&lt;/body&gt;</tt>, zu notieren. Zum Beispiel, wenn Sie am Ende der Datei mit JavaScript dynamisch Datum und Uhrzeit der letzten &Auml;nderung an der Datei schreiben wollen.</p> 






<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><img src="xjavs10.gif" width=30 height=30 alt="JavaScript 1.0" border="0"><img src="xnetsi2.gif" width=30 height=30 alt="Netscape2.0" border="0"><img src="xmsie3.gif" width=30 height=30 alt="MS IE3.0" border="0"> <a class="an" name="a5">JavaScript-Elemente in HTML-Tags</a></h2>

<p>JavaScript kann auch innerhalb herk&ouml;mmlicher HTML-Tags vorkommen. Das ist dann kein komplexer Programmcode, sondern in der Regel nur der Aufruf bestimmter Methoden, Funktionen, Objekte, Eigenschaften. F&uuml;r den Aufruf gibt es sogenannte <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tebj.htm"><b>Event-Handler</b></a>. Das sind JavaScript-eigene Attribute in HTML-Tags. F&uuml;r jeden der m&ouml;glichen Event-Handler ist festgelegt, in welchen HTML-Tags er vorkommen darf.</p>


<h3 class="xmp">Beispiel:</h3>

<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;JavaScript-Test&lt;/title&gt;
&lt;script language=&quot;JavaScript&quot;&gt;
&lt;!--
 function Quadrat(Zahl)
  {
   Ergebnis = Zahl * Zahl;
   alert(&quot;Das Quadrat von &quot; + Zahl + &quot; = &quot; + Ergebnis);
  }
//--&gt;
&lt;/script&gt;
&lt;/head&gt;
&lt;body&gt;
&lt;form&gt;
&lt;input type=button value=&quot;Quadrat von 6 errechnen&quot; onClick=&quot;Quadrat(6)&quot;&gt;
&lt;/form&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Das obige Beispiel zeigt eine komplette HTML-Datei. Im Dateikopf ist ein <img src="xgoup.gif" width=14 height=10 border=0>&nbsp;<a href="#a4"><b>
JavaScript-Bereich</b></a> definiert. Innerhalb dieses Bereichs steht eine <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tebd.htm#a1"><b>selbst definierte Funktion</b></a>, die Funktion mit dem Namen <tt>Quadrat(x)</tt>. Die Funktion bekommt beim Aufruf eine Zahl x &uuml;bergeben. Sie errechnet das Quadrat dieser Zahl und gibt das Ergebnis in einem Meldungsfenster aus. Dieser JavaScript-Code wird aber nur ausgef&uuml;hrt, wenn die Funktion explizit aufgerufen wird. Im obigen Beispiel erfolgt der Aufruf mit Hilfe eines <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tchf.htm#a1"><b>Klick-Buttons</b></a>. Wenn der Anwender auf den Button klickt, wird die Funktion ausgef&uuml;hrt.</p>

<h3 class="inf">Beachten Sie:</h3>

<p>Bei den <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tebj.htm"><b>Event-Handlern</b></a> wird beschrieben, was solche Angaben wie <tt>onClick=</tt> (wie im obigen Beispiel) bedeuten, und in welchen HTML-Tags sie vorkommen d&uuml;rfen.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><img src="xjavs11.gif" width=30 height=30 alt="JavaScript 1.1" border="0"><img src="xnetsi3.gif" width=30 height=30 alt="Netscape3.0" border="0"><img src="xmsie4.gif" width=30 height=30 alt="MS IE4.0" border="0"> <a class="an" name="a6">JavaScripts in separaten Dateien</a></h2>

<p>Seit der Sprachversion 1.1 von JavaScript (und auch seit HTL 4.0) ist es m&ouml;glich, JavaScript-Code in separaten Dateien zu notieren. Das ist sehr n&uuml;tzlich, wenn Sie gleiche JavaScript-Funktionen in mehreren HTML-Dateien verwenden wollen. Denn so brauchen Sie den Code nur einmal notieren und k&ouml;nnen ihn in mehreren HTML-Dateien referenzieren.</p>


<h3 class="xmp">Beispiel: (HTML-Datei)</h3>

<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;JavaScript-Test&lt;/title&gt;
&lt;script language=&quot;JavaScript&quot; src=&quot;quadrat.js&quot; type=&quot;text/javascript&quot;&gt;
&lt;/script&gt;
&lt;/head&gt;
&lt;body&gt;
&lt;form&gt;
&lt;input type=button value=&quot;Quadrat von 6 errechnen&quot; onClick=&quot;Quadrat(6)&quot;&gt;
&lt;/form&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>
<h3 class="xmp">Beispiel (separate JavaScript-Datei):</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
 function Quadrat(Zahl)
  {
   Ergebnis = Zahl * Zahl;
   alert(&quot;Das Quadrat von &quot; + Zahl + &quot; = &quot; + Ergebnis);
  }
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Das Beispiel tut das gleiche wie das Beispiel im <img src="xgoup.gif" width=14 height=10 border=0>&nbsp;<a href="#a5"><b>Abschnitt zuvor</b></a>. Der Unterschied ist lediglich, da&szlig; der JavaScript-Code in einer separaten Datei steht. Dazu notieren Sie im einleitenden <tt>&lt;script&gt;</tt>-Tag die Angabe <tt>src=</tt> (<i>src = source = Quelle</i>). Dahinter folgt, in Anf&uuml;hrungszeichen, der Name der separaten Datei mit dem Quellcode. Ebenfalls notieren sollten Sie die Angabe zum <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcjj.htm"><b>Mime-Type</b></a> der eingebundenen Datei. Mit <tt>type=&quot;text/javascript&quot;</tt> bestimmen Sie den Mime-Type f&uuml;r JavaScript-Dateien.</p> 

<p>Die Datei mit dem Quellcode mu&szlig; eine reine ASCII-Datei sein und sollte die Dateinamenerweiterung <tt>.js</tt> erhalten. Die Datei sollte nichts anderes als JavaScript-Code enthalten.</p>

<p>Beim Referenzieren von separaten JavaScript-Dateien, die sich in anderen Verzeichnissen oder auf anderen Server-Rechnern im Internet befinden, gelten die gleichen Regeln wie beim <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcga.htm"><b>Einbinden von Grafiken</b></a>.</p>


<h3 class="inf">Beachten Sie:</h3>

<p>Es kann passieren, da&szlig; ein JavaScript, das in einer separaten Datei notiert ist, lokal wunderbar funktioniert, aber nach dem Hochladen der Dateien auf einen WWW-Server pl&ouml;tzlich nicht mehr. Bitten Sie in diesem Fall den Provider oder Webmaster des Servers, den Mime-Type <tt>text/javascript</tt> f&uuml;r Dateien mit der Endung <tt>.js</tt> in die Konfiguration des Web-Servers mit aufzunehmen.</p>


<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="teba.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF><img src="x3.gif" width=15 height=10 border=0> <a href="teba.htm"><b>Allgemeine Notationsregeln</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tdcl.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tdcl.htm"><b>Cursor und Microsoft-Spezialfilter</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="te.htm"><b>JavaScript</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>