<html>
<head>
<title>SELFHTML: JavaScript /  Objekt-Referenz / Hinweise zur JavaScript Objekt-Referenz</title>
<meta name="description" content="(SELFHTML 7.0) Erl&auml;uterungen zum Gebrauch der JavaScript-Objektreferenz">
<meta name="keywords" content="SELFHTML, JavaScript">
<link rel=stylesheet type="text/css" href="wselfhtm.css">
</head>
<body bgcolor=#ffffff text=#000000 link=#aa5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="te.htm"><b>JavaScript</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tec.htm"><b>Objekt-Referenz</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Hinweise zur JavaScript Objekt-Referenz</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#ffffff valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Beschriebene Objekte</b></a> <br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>JavaScript-Objektreferenz verwenden</b></a>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="a1">Beschriebene Objekte</a></h2>

<p>In der JavaScript Objekt-Referenz dieses Dokuments werden folgende Objekte beschrieben (mit Kennzeichnung):</p>

<table>
<tr>
<td valign=top><img src="xjavs10.gif" width=30 height=30 alt="JavaScript1.0" border="0"></td>
<td valign=top>Das Objekt, die Eigenschaft oder die Methode geh&ouml;rt zum JavaScript-Sprachstandard 1.0. Dieser Sprachstandard wird von Netscape ab der Version 2.x und weitgehend vom MS Internet Explorer ab der Version 3.x interpretiert.</td>
</tr>
<tr>
<td valign=top><img src="xjavs11.gif" width=30 height=30 alt="JavaScript1.1" border="0"></td>
<td valign=top>Das Objekt, die Eigenschaft oder die Methode geh&ouml;rt zum JavaScript-Sprachstandard 1.1. Dieser Sprachstandard wird von Netscape ab der Version 3.x und weitgehend vom MS Internet Explorer ab der Version 4.x interpretiert.</td>
</tr>
<tr>
<td valign=top><img src="xjavs12.gif" width=30 height=30 alt="JavaScript1.2" border="0"></td>
<td valign=top>Das Objekt, die Eigenschaft oder die Methode geh&ouml;rt zum JavaScript-Sprachstandard 1.2. Dieser Sprachstandard wird von Netscape ab der Version 4.x und in einzelnen F&auml;llen auch vom MS Internet Explorer ab der Version 4.x interpretiert.</td>
</tr>
<tr>
<td valign=top><img src="xmsjs.gif" width=30 height=30 alt="MS JavaScript/JScript" border="0"></td>
<td valign=top>Das Objekt, die Eigenschaft oder die Methode geh&ouml;rt nicht zu einem offiziellen JavaScript-Sprachstandard, sondern ist von Microsoft eingef&uuml;hrt worden. Solche Bestandteile werden in der Regel nur vom MS Internet Explorer ab V4.x interpretiert; es wurden einige wichtige solcher Elemente in die Objekt-Referenz mit aufgenommen, n&auml;mlich solche, eine Grundlage f&uuml;r Dynamisches HTML nach dem Ansatz des MS Internet Explorers darstellen.</td>
</tr>
</table>

<p>Nicht beschrieben werden Objekte f&uuml;r server-seitiges JavaScript (bekannt unter dem Namen LiveWire) von Netscape. Ebenfalls nicht beschrieben werden JScript-Erweiterungen von Microsoft, die f&uuml;r die Desktop-Erweiterungen des MS Internet Explorers 4 gedacht sind.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2">JavaScript-Objektreferenz verwenden</a></h2>

<p>Die JavaScript-Objektreferenz werden Sie h&auml;ufig benutzen, wenn Sie ernsthaft in die Tiefen von JavaScript einsteigen wollen. Denn hier wird das &quot;Material&quot; dokumentiert, das JavaScript zu einer Erg&auml;nzungssprache f&uuml;r HTML macht. Die <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tebc.htm#a1"><b>vordefinierten Objekte</b></a> von JavaScript bieten Ihnen Zugriff auf die &quot;Daten&quot; einer WWW-Seite und ihrer Umgebung.</p>

<p>Jedes JavaScript-Objekt wird in dieser Referenz nach folgendem Schema beschrieben:</p>

<p><b>Allgemeines zur Verwendung</b><br>
In diesem Abschnitt wird beschrieben, welche Voraussetzungen erf&uuml;llt sein m&uuml;ssen, damit Sie die Eigenschaften und Methoden des Objekts benutzen k&ouml;nnen. Lesen Sie diesen Abschnitt genau, wenn Sie mit dem Objekt noch nie gearbeitet haben.</p>

<p><b>Eigenschaften</b><br>
In diesem Abschnitt werden die <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tebc.htm#a4"><b>Eigenschaften</b></a> eines Objekts beschrieben. Eine Eigenschaft eines JavaScript-Objekts ist zum Beispiel <tt>window.location.href</tt> - die URL-Adresse der aktuell angezeigten HTML-Datei. Die Werte von solchen Objekteigenschaften k&ouml;nnen Sie in jedem Fall auslesen. In vielen F&auml;llen k&ouml;nnen Sie die Werte auch &auml;ndern. In der Objekt-Referenz wird jeweils angegeben, ob Sie eine gespeicherte Objekteigenschaft nur auslesen oder auch &auml;ndern k&ouml;nnen. Dazu werden in dieser Objekt-Referenz folgende Signalisierungen benutzt:
<table>
<tr>
<td valign=top><img src="xjsread.gif" width=60 height=30 alt="Lesen" border="0"></td>
<td valign=top>bedeutet: Sie k&ouml;nnen den Wert der Eigenschaft auslesen, aber nicht ver&auml;ndern. Sie k&ouml;nnen den Wert allerdings in einer selbst definierten <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tebb.htm"><b>Variablen</b></a> speichern. So k&ouml;nnen Sie zum Beispiel die URL-Adresse der angezeigten HTML-Datei durch <tt>var Adresse = window.location.href</tt> in einer Variablen namens <tt>Adresse</tt> speichern. Das hei&szlig;t, Sie weisen einer Variablen den Wert der Objekteigenschaft zu. Die Variable k&ouml;nnen Sie nach Belieben weiterverarbeiten.</td>
</tr>
<tr>
<td valign=top><img src="xjswrite.gif" width=60 height=30 alt="Lesen/&Auml;ndern" border="0"></td>
<td valign=top>bedeutet: Sie k&ouml;nnen die Objekteigenschaft auslesen, ihr aber auch selbst einen neuen Wert zuweisen. So k&ouml;nnen Sie zum Beispiel die URL-Adresse der angezeigten HTML-Datei durch <tt>window.location.href = &quot;http://www.teamone.de/selfhtml/&quot;</tt> &auml;ndern. Das hei&szlig;t, Sie weisen der Objekteigenschaft einen Wert zu. Im Beispiel hat das zur Folge, da&szlig; der WWW-Browser einen Sprung zu der angegebenen URL-Adresse ausf&uuml;hrt.</td>
</tr>
</table>
</p>

<p><b>Methoden</b><br>
<img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tebc.htm#a5"><b>Methoden</b></a> eines Objekts sind objektgebundene Funktionen, die eine Aktion ausf&uuml;hren. So k&ouml;nnen Sie zum Beispiel mit <tt>document.write(&quot;&lt;b&gt;Ihr WWW-Browser: &lt;/b&gt;&quot; + navigator.userAgent)</tt> dynamisch erzeugten, HTML-formatierten Text in das aktuelle Anzeigefenster des WWW-Browsers schreiben. Im Beispiel wird auf diese Weise der vom Anwender verwendete WWW-Browser-Typ ins Anzeigefenster geschrieben.</p>

<p>Um mit der JavaScript-Objektreferenz arbeiten zu k&ouml;nnen, m&uuml;ssen Sie die <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="teb.htm"><b>JavaScript Sprachelemente</b></a> kennen und wissen, wie Sie <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tea.htm"><b>JavaScript in HTML einbinden</b></a> k&ouml;nnen. Zum Umgang mit JavaScript-Objekten sollten Sie auch die in diesem Dokument vorgestellten <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="ted.htm"><b>JavaScript Anwendungsbeispiele</b></a> genau studieren.</p>



<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tecb.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#ffffff><img src="x3.gif" width=15 height=10 border=0> <a href="tecb.htm"><b>window</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tebj.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#ffffff width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tebj.htm"><b>Event-Handler</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="te.htm"><b>JavaScript</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tec.htm"><b>Objekt-Referenz</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>