<html>
<head>
<title>SELFHTML: JavaScript / Anwendungsbeispiele / Pers&ouml;nliche Seitenbesuche z&auml;hlen mit Cookies</title>
<meta name="description" content="(SELFHTML 7.0) JavaScript, das dem Anwender beim Aufruf der Seite mitteilt, wie oft er schon auf der Seite war. Realisiert mit Hilfe von Cookies.">
<meta name="keywords" content="SELFHTML, JavaScript, Cookies, Counter">
<link rel=stylesheet type="text/css" href="wselfhtm.css">
</head>
<body bgcolor=#ffffff text=#000000 link=#aa5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="te.htm"><b>JavaScript</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="ted.htm"><b>Anwendungsbeispiele</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Pers&ouml;nliche Seitenbesuche z&auml;hlen mit Cookies</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#ffffff valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Pers&ouml;nliche Seitenbesuche z&auml;hlen mit Cookies - das Beispiel</b></a>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="a1"><img src="xnetsi2.gif" width=30 height=30 border=0 alt="Netscape2.0"><img src="xmsie3.gif" width=30 height=30 border=0 alt="MS IE 3.0"> Pers&ouml;nliche Seitenbesuche z&auml;hlen mit Cookies - das Beispiel</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tedea.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Cookies (Kekse) sind ein nicht unumstrittenes Feature, das Netscape in JavaScript eingebaut hat. Cookies erlauben einem JavaScript-Programm, Daten auf der Festplatte des Anwenders zu speichern. Dies geschieht jedoch in kontrollierter Form. Ein &quot;Ausspionieren&quot; der Anwenderfestplatte ist dabei ebenso wenig m&ouml;glich wie das Plazieren von ausf&uuml;hrbarem Code, also etwa Viren. Denn wenn Sie in einem JavaScript einen Cookie schreiben, k&ouml;nnen Sie nicht angeben, wohin der Cookie beim Anwender gespeichert wird. Das kontrolliert der WWW-Browser des Anwenders. Au&szlig;erdem k&ouml;nnen Cookies keine unkontrollierten Datenmengen auf den Anwenderrechner schreiben, sondern nur eine begrenzte Anzahl von Zeilen. Jede solcher Zeilen definiert eine Variable und weist dieser Variablen einen Wert zu. Ein Cookie l&auml;&szlig;t sich also mit einem Eintrag in einer Konfigurationsdatei vergleichen - mit dem Unterschied, da&szlig; der Cookie keine Konfigurationsdaten des Anwenderrechners ansprechen kann.</p>

<p>Durch die M&ouml;glichkeit, Daten zu speichern, werden jedoch viele neue Anwendungsbereiche f&uuml;r JavaScript m&ouml;glich. So auch das hier beschriebene Beispiel. Denn um zeitlich auseinanderliegende Seitenbesuche zu z&auml;hlen, mu&szlig; man die Anzahl der bisherigen Seitenbesuche irgendwo fest speichern, beim n&auml;chsten Seitenbesuch wieder auslesen, den Z&auml;hler um 1 erh&ouml;hen und den neuen Wert wieder speichern. Genau das tut das hier beschriebene Beispiel.</p>

<h3 class="Inf">Beachten Sie:</h3>

<p>Das Z&auml;hlen von pers&ouml;nlichen Seitenbesuchen ist etwas anderes als das Z&auml;hlen aller Seitenbesuche. Um alle Zugriffe auf eine Seite zu verwalten, mu&szlig; das Programm seine Z&auml;hlerst&auml;nde auf dem Server-Rechner ablegen. Deshalb funktioniert ein klassischer &quot;Counter&quot; nur mit CGI. Das hier beschriebene Script z&auml;hlt nur, wie oft ein bestimmter Anwender eine bestimmte Seite besucht.</p>

<p>Der MS Internet Explorer interpretiert Cookies nur vollst&auml;ndig, wenn die HTML-Datei, die Cookies liest und schreibt, vom Browser &uuml;ber das HTTP-Protokoll aufgerufen wird.</p>

<p><b>Hinweis:</b> Zur besseren Orientierung enth&auml;lt das Beispiel Verweise zu den entsprechenden Erl&auml;uterungen, z.B. <a href="#a1a1"><b>1*</b></a>. Diese Verweise geh&ouml;ren nicht zum Quellcode. Falls Sie das Beispiel in einen Editor kopieren, m&uuml;ssen Sie diese Verweise l&ouml;schen. Andernfalls erhalten Sie JavaScript-Fehlermeldungen.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
 &lt;html&gt;
 &lt;head&gt;
 &lt;title&gt;Seitentitel&lt;/title&gt;
 &lt;script language=&quot;JavaScript&quot;&gt;
  &lt;!--
  <a name="a1a1" href="#a1b1"><b>1*</b></a> function WertHolen()
  {
   var Wert = &quot;&quot;;
   if(document.cookie) 
   {
    Wertstart = document.cookie.indexOf(&quot;=&quot;) + 1;
    Wertende = document.cookie.indexOf(&quot;;&quot;);
    if(Wertende == -1) Wertende = document.cookie.length;
    Wert = document.cookie.substring(Wertstart,Wertende);
   }
   return Wert;
  }

  <a name="a1a2" href="#a1b2"><b>2*</b></a> function WertSetzen(Bezeichner, Wert, Verfall)
  {
   var jetzt = new Date();
   var Auszeit = new Date(jetzt.getTime() + Verfall);
   document.cookie = Bezeichner+&quot;=&quot;+Wert+&quot;; expires=&quot;+Auszeit.toGMTString()+&quot;;&quot;;
  }

  <a name="a1a3" href="#a1b3"><b>3*</b></a> function Zaehlerstand() 
  {
   var Verfallszeit = 1000*60*60*24*365;
   var Anzahl = WertHolen();
   var Zaehler = 0;
   if(Anzahl != &quot;&quot;) Zaehler = parseInt(Anzahl);
   if(document.cookie)
   {
    Zaehler = Zaehler + 1;
    WertSetzen(&quot;Zaehler&quot;,Zaehler,Verfallszeit);
   } 
   else 
   {
    Zaehler = 1;
    WertSetzen(&quot;Zaehler&quot;,Zaehler,Verfallszeit);
   } 
  alert(&quot;Dies ist Ihr &quot; + Zaehler + &quot;. Besuch auf dieser Seite!&quot;);
  }
  //--&gt;
 &lt;/script&gt;
 &lt;/head&gt;
 &lt;body onLoad=&quot;Zaehlerstand()&quot;&gt;
 Inhalt der Datei
 &lt;/body&gt;
 &lt;/html&gt;
</pre></td></tr></table>


<h3 class="xpl">Erl&auml;uterung:</h3>

<p><img src="xgoup.gif" width=14 height=10 border=0>&nbsp;<a name="a1b1" href="#a1a1"><b>Cookie lesen und gespeicherten Wert ermitteln</b></a><br>
Die <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tebd.htm"><b>Funktion</b></a> <tt>WertHolen()</tt>, die im Beispiel definiert ist, ist allgemein geschrieben. Sie k&ouml;nnen diese Funktion nutzen, um einen Cookie auszulesen. Wenn die Datei schon einmal einen Cookie geschrieben hat, wird dessen Wert ermittelt und zur&uuml;ckgegeben. Wenn noch kein Cookie existiert, wird eine leere Zeichenkette <tt>&quot;&quot;</tt> zur&uuml;ckgegeben.</p>

<p>Mit der Abfrage <tt>if(document.cookie)</tt> ermittelt die Funktion, ob bereits ein Cookie vorhanden ist. Wenn ja, wird dessen Wert ermittelt. Ein Cookie besteht normalerweise aus einem Bezeichner und einem Wert, zum Beispiel:<br>
<tt>Zaehler=4</tt><br>
Dabei ist <tt>Zaehler</tt> der Bezeichner und <tt>4</tt> der Wert, der diesem Bezeichner zugewiesen ist. Die Funktion <tt>WertHolen()</tt> holt sich den Wert, indem sie mit <tt>indexOf()</tt>-Befehlen den Anfang und das Ende des Wertes innerhalb des gespeicherten Cookies ermittelt. Diesen Wert weist sie der Variablen <tt>Wert</tt> zu. Die Variable <tt>Wert</tt> wird am Ende der Funktion zur&uuml;ckgegeben.</p>

<p><img src="xgoup.gif" width=14 height=10 border=0>&nbsp;<a name="a1b2" href="#a1a2"><b>Cookie schreiben und Wert setzen</b></a><br>
Die <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tebd.htm"><b>Funktion</b></a> <tt>WertSetzen()</tt>, die im Beispiel definiert ist, ist ebenfalls allgemein geschrieben. Diese Funktion erwartet drei Parameter:<br>
<tt>Bezeichner</tt> ist das Element vor dem Istgleichzeichen, zum Beispiel <tt>Zaehler</tt>.<br>
<tt>Wert</tt> ist der Wert, der dem Bezeichner zugewiesen und mit gespeichert werden soll.<br>
<tt>Verfall</tt> ist eine Zahl, die als Anzahl Millisekunden interpretiert wird. Jeder Cookie, der &uuml;ber die aktuelle Browser-Sitzung hinaus gespeichert bleiben soll, mu&szlig; eine Angabe dazu enthalten, wann der Browser den Cookie l&ouml;schen soll. Das soll verhindern, das Cookies &quot;ewig&quot; gespeichert bleiben. Der Verfallszeitpunkt des Cookies mu&szlig; in Form des GMT-Zeitformats angegeben werden. Darum brauchen Sie sich aber nicht zu k&uuml;mmern, da die Funktion <tt>WertSetzen()</tt> dies automatisch erledigt. Die Funktion ermittelt zu diesem Zweck die aktuelle Zeit (<tt>var jetzt = new Date();</tt>). In der Variablen <tt>Auszeit</tt> errechnet sie einen zuk&uuml;nftigen Zeitpunkt aus dem &uuml;bergebenen Parameter <tt>Verfall</tt> und dem ermittelten aktuellen Zeitpunkt.</p>

<p>Mit der Anweisung, die mit <tt>document.cookie =</tt> beginnt, wird der Cookie geschrieben.</p>

<p><img src="xgoup.gif" width=14 height=10 border=0>&nbsp;<a name="a1b3" href="#a1a3"><b>&Uuml;bergeordnete Funktion zum Verwalten des Cookies</b></a><br>
Die beiden allgemeinen Funktionen <tt>WertHolen()</tt> und <tt>WertSetzen()</tt> ben&ouml;tigen nun noch ein paar allgemeine Anweisungen, die den Cookie verwalten. Dies geschieht im Beispiel in der Funktion <tt>Zaehlerstand()</tt>. Zun&auml;chst definiert diese Funktion einen Verfallswert, der sp&auml;ter beim Schreiben des Cookies an die Funktion <tt>WertSetzen()</tt> &uuml;bergeben wird. Mit dem Rechenausdruck <tt>1000*60*60*24*365</tt> wird die Millisekundenzahl eines Jahres ermittelt. Der Cookie soll also ein Jahr lang gespeichert werden.</p>

<p>Um die pers&ouml;nlichen Seitenbesuche des Anwenders zu verwalten, mu&szlig; die Funktion <tt>Zaehlerstand()</tt> folgendes tun: sie mu&szlig; erstens den aktuellen Z&auml;hlerstand ermitteln, zweitens den Z&auml;hler um 1 erh&ouml;hen und drittens den neuen Z&auml;hlerstand wieder speichern. Wenn noch kein Cookie vorhanden ist, d.h. wenn der Anwender die Seite zum ersten Mal besucht, mu&szlig; der Z&auml;hler auf 1 gesetzt und gespeichert werden.</p>

<p>Zuerst ruft die Funktion <tt>Zaehlerstand()</tt> deshalb die Funktion <tt>WertHolen()</tt> auf, um den aktuellen Z&auml;hlerstand zu ermitteln. Der R&uuml;ckgabewert von <tt>WertHolen()</tt> wird in der Variablen <tt>Anzahl</tt> gespeichert. Wenn noch kein Cookie vorhanden ist, steht in <tt>Anzahl</tt> anschlie&szlig;end eine leere Zeichenkette <tt>&quot;&quot;</tt>. Ist ein Wert vorhanden, enth&auml;lt <tt>Anzahl</tt> den Wert in Form einer Zeichenkette. Da man mit Zeichenketten nicht rechnen kann, zum Hochz&auml;hlen des Z&auml;hlers jedoch ein numerischer Wert ben&ouml;tigt wird, wird im Beispiel noch eine numerische Variable namens <tt>Zaehler</tt> definiert. Mit der <tt>parseInt()</tt>-Methode wird dieser Variablen der Wert von <tt>Anzahl</tt> als Zahl zugewiesen.</p>

<p>Wenn ein Cookie vorhanden ist, wird der Z&auml;hler um 1 erh&ouml;ht. Anschlie&szlig;end wird die Funktion <tt>WertSetzen()</tt> aufgerufen, die den Cookie speichert. Als Bezeichner wird das Wort <tt>&quot;Zaehler&quot;</tt> &uuml;bergeben, als Wert der Inhalt der Variablen <tt>Zaehler</tt>, und als Verfallszeitpunkt der Inhalt der Variablen <tt>Verfallszeit</tt>.</p>

<p>Wenn kein Cookie vorhanden ist, wird die Funktion Funktion <tt>WertSetzen()</tt> genauso aufgerufen. Vorher wird jedoch der Inhalt der Variablen <tt>Zaehler</tt> auf 1 gesetzt.</p>

<p>Am Ende gibt die Funktion <tt>Zaehlerstand()</tt> mit Hilfe von <tt>alert()</tt> den aktuellen Z&auml;hlerstand in einem Meldungsfenster aus.</p>

<p>Alle Anweisungen des Beispiel-Scripts stehen innerhalb von Funktionen. Damit diese Anweisungen beim Einlesen der Datei &uuml;berhaupt ausgef&uuml;hrt werden, mu&szlig; die Funktion <tt>Zaehlerstand()</tt> explizit aufgerufen werden. Das passiert im Beispiel im einleitenden <tt>&lt;body&gt;</tt>-Tag mit Hilfe des <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tebj.htm"><b>Event-Handlers</b></a> <tt>onLoad=</tt>.</p>



<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tedf.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#ffffff><img src="x3.gif" width=15 height=10 border=0> <a href="tedf.htm"><b>Formulareingaben &uuml;berpr&uuml;fen</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tedd.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#ffffff width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tedd.htm"><b>Monatskalender</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="te.htm"><b>JavaScript</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="ted.htm"><b>Anwendungsbeispiele</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>