<html>
<head>
<title>SELFHTML: JavaScript / Anwendungsbeispiele / Dynamische grafische Buttons</title>
<meta name="description" content="(SELFHTML 7.0) JavaScript, das daf&uuml;r sorgt, da&szlig; grafische Verweis-Buttons beim &Uuml;berfahren mit der Maus optisch hervorgehoben werden.">
<meta name="keywords" content="SELFHTML, JavaScript, dynamische Grafiken">
<link rel=stylesheet type="text/css" href="wselfhtm.css">
</head>
<body bgcolor=#ffffff text=#000000 link=#aa5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="te.htm"><b>JavaScript</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="ted.htm"><b>Anwendungsbeispiele</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Dynamische grafische Buttons</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#ffffff valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Dynamische grafische Buttons - das Beispiel</b></a>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="a1"><img src="xnetsi3.gif" width=30 height=30 border=0 alt="Netscape3.0"><img src="xmsie4.gif" width=30 height=30 border=0 alt="MS IE 4.0"> Dynamische grafische Buttons - das Beispiel</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tedga.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Auf WWW-Seiten kommen h&auml;ufig grafische Buttonleisten zum Einsatz, die Verweise zu bestimmten Seiten des Projekts enthalten. Wenn der Anwender mit der Maus &uuml;ber solche Grafiken f&auml;hrt, erkennt er am ver&auml;nderten Mauscursor und an den Verweiszielanzeigen in der Statuszeile des WWW-Browsers, da&szlig; es sich um Verweise handelt. Mit Hilfe von JavaScript k&ouml;nnen Sie solche grafischen Verweise jedoch noch deutlicher kenntlich machen und der Benutzerf&uuml;hrung gleichzeitig ein wenig mehr Pep verleihen.</p>

<p>Dazu brauchen Sie je zwei gleichartige, farblich unterschiedliche Grafiken f&uuml;r je einen Grafikbutton. Im Anzeigebeispiel zu diesem Abschnitt sind das die beiden folgenden Button-Paare:</p>


<table><tr>
<td><img src="xavista1.jpg" width=186 height=99 border=0 alt="Altavista normal"></td>
<td><img src="xavista2.jpg" width=186 height=99 border=0 alt="Altavista aktiviert"></td>
</tr><tr>
<td><img src="xlycos1.jpg" width=186 height=99 border=0 alt="Lycos normal"></td>
<td><img src="xlycos2.jpg" width=186 height=99 border=0 alt="Lycos aktiviert"></td>
</tr></table>

<p>Mit Hilfe von JavaScript l&auml;&szlig;t sich nun eine Grafik durch eine andere ersetzen, zum Beispiel, wenn die Grafik als Verweises dient und der Anwender mit der Maus &uuml;ber die Grafik f&auml;hrt. Wie das im einzelnen funktioniert, wird im folgenden beschrieben.</p>

<p>Dieses Beispiel funktioniert mit Netscape ab Version 3.x und mit dem MS Internet Explorer ab Version 4.x. Beachten Sie, da&szlig; es bei Verwendung dynamischer Grafiken in Tabellen innerhalb von Tabellen bei Netscape zu Verschiebungsproblemen kommen kann.</p> 

<p><b>Hinweis:</b> Zur besseren Orientierung enth&auml;lt das Beispiel Verweise zu den entsprechenden Erl&auml;uterungen, z.B. <a href="#a1a1"><b>1*</b></a>. Diese Verweise geh&ouml;ren nicht zum Quellcode. Falls Sie das Beispiel in einen Editor kopieren, m&uuml;ssen Sie diese Verweise l&ouml;schen. Andernfalls erhalten Sie JavaScript-Fehlermeldungen.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
 &lt;html&gt;
 &lt;head&gt;
 &lt;title&gt;Seitentitel&lt;/title&gt;
 &lt;script language=&quot;JavaScript&quot;&gt;
  &lt;!--
  <a name="a1a1" href="#a1b1"><b>1*</b></a> Normal1 = new Image(); 
  Normal1.src = &quot;button1a.gif&quot;; /* Hier erste Standard-Grafik angeben */
  Highlight1 = new Image(); 
  Highlight1.src = &quot;button1b.gif&quot;; /* Hier erste Highlight-Grafik angeben */

  Normal2 = new Image(); 
  Normal2.src = &quot;button2a.gif&quot;; /* Hier zweite Standard-Grafik angeben */
  Highlight2 = new Image(); 
  Highlight2.src = &quot;button2b.gif&quot;; /* Hier zweite Highlight-Grafik angeben */

  /* usw. fuer alle weiteren zu benutzenden Grafiken */

  <a name="a1a2" href="#a1b2"><b>2*</b></a> function Bildwechsel(Bildnr,Bildobjekt)
  {
   window.document.images[Bildnr].src = Bildobjekt.src;
  }
 //--&gt;
  //--&gt;
 &lt;/script&gt;
 &lt;/head&gt;
 &lt;body&gt;

 <a name="a1a3" href="#a1b3"><b>3*</b></a> &lt;table&gt;&lt;tr&gt;&lt;td&gt;
 &lt;a href=&quot;index.htm&quot; onMouseOver=&quot;Bildwechsel(0,Highlight1)&quot;
 onMouseOut=&quot;Bildwechsel(0,Normal1)&quot;&gt;
 &lt;img src=&quot;button1a.gif&quot;&gt;&lt;/a&gt; 
 &lt;/td&gt;&lt;td&gt;
 &lt;a href=&quot;verweise.htm&quot; onMouseOver=&quot;Bildwechsel(1,Highlight2)&quot;
 onMouseOut=&quot;Bildwechsel(1,Normal2)&quot;&gt;
 &lt;img src=&quot;button2a.gif&quot;&gt;&lt;/a&gt; 
 &lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;

 &lt;/body&gt;
 &lt;/html&gt;
</pre></td></tr></table>


<h3 class="xpl">Erl&auml;uterung:</h3>





<p><img src="xgoup.gif" width=14 height=10 border=0>&nbsp;<a name="a1b1" href="#a1a1"><b>Neue Grafikobjekte f&uuml;r Highlight-Grafiken erzeugen</b></a><br>
F&uuml;r jede Grafik, die Sie dynamisch anzeigen m&ouml;chten, m&uuml;ssen Sie eine Instanz des <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tecbbe.htm"><b>image-Objekts</b></a> erzeugen. Das gilt sowohl f&uuml;r die Grafiken, die zun&auml;chst in der HTML-Datei referenziert werden, als auch f&uuml;r diejenigen, die beim &Uuml;berfahren mit der Maus dynamisch angezeigt werden sollen.</p>

<p>Dazu wird im Beispiel mit Anweisungen wie <tt>Normal1 = new Image();</tt> eine Objektinstanz erzeugt. Nachdem die Objektinstanz erzeugt ist, sind unter dem gew&auml;hlten Objektnamen, im ersten Fall <tt>Normal1</tt>, alle Eigenschaften des Objekts ansprechbar. Zun&auml;chst enth&auml;lt das Objekt noch gar keine Daten. Mit der Anweisung <tt>Normal1.src = &quot;button1a.gif&quot;;</tt> wird dem neuen Grafikobjekt eine Grafikdatei zugewiesen.</p> 

<p>Wiederholen Sie die beiden beschriebenen Anweisungen f&uuml;r jede Grafikdatei, die von dynamischen &Auml;nderungen betroffen sein wird - und zwar sowohl f&uuml;r Grafiken, die im &quot;Normalfall&quot; angezeigt werden, als auch f&uuml;r Grafiken, die beim Dar&uuml;berfahren mit der Maus dynamisch angezeigt werden. Vergeben Sie dabei jedesmal einen neuen Objektnamen.</p>

<p><img src="xgoup.gif" width=14 height=10 border=0>&nbsp;<a name="a1b2" href="#a1a2"><b>Funktion <i>Bildwechsel()</i> zum dynamischen Austauschen von Grafiken</b></a><br>
Der bisherige Code im Beispiel wird beim Einlesen der HTML-Datei direkt ausgef&uuml;hrt, da er nicht in einer Funktion gebunden ist. Die Ausf&uuml;hrung dieses Codes bewirkt aber keine sichtbaren Ausgaben und wird vom Anwender gar nicht bemerkt. Das, was am Bildschirm mit Hilfe von JavaScript passieren soll, n&auml;mlich das dynamische Austauschen eines Bildes, geschieht in der definierten <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tebd.htm"><b>Funktion</b></a> <tt>Bildwechsel()</tt>.</p>

<p>Die Funktion soll aufgerufen werden, wenn der Anwender mit der Maus &uuml;ber einen grafischen Verweis f&auml;hrt, und wenn er den Verweisbereich mit der Maus wieder verl&auml;&szlig;t. Dazu ben&ouml;tigt die Funktion zwei Parameter: die wievielte Grafik in der Datei ausgetauscht werden soll (Parameter <tt>Bildnr</tt>), und durch welches zuvor definierte Grafikobjekt das Bild ersetzt werden soll (Parameter <tt>Bildobjekt</tt>). Die Funktion kommt dann mit einer einzigen Anweisung aus. Diese Anweisung ersetzt das vorhandene Bild durch das neue. Beachten Sie hier den wichtigen Zusammenhang: das dynamische Ersetzen einer Grafik ist nur m&ouml;glich, wenn f&uuml;r die neue Grafik zuvor eine Instanz des Grafikobjekts erzeugt wurde. Im Beispiel geschah dies ja ganz am Anfang des Scripts.</p>

<p><img src="xgoup.gif" width=14 height=10 border=0>&nbsp;<a name="a1b3" href="#a1a3"><b>Grafische Verweise mit Event-Handlern f&uuml;r Mausbewegungen des Anwenders</b></a><br>
Damit der gew&uuml;nschte Effekt zustande kommt, m&uuml;ssen Sie in der HTML-Datei <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcgg.htm"><b>Grafiken als Verweise</b></a> definieren. Bei Buttons, die nebeneinander liegen sollen, empfiehlt sich eine <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tceh.htm"><b>blinde Tabelle</b></a>, wie sie auch im Beispiel verwendet wird.</p>

<p>Im einleitenden Verweis-Tag werden die <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tebj.htm"><b>Event-Handler</b></a> <tt>onMouseOver=</tt> und <tt>onMouseOut=</tt> notiert. Bei <tt>onMouseOver=</tt> (wenn der Anwender mit der Maus &uuml;ber den verweis-sensitiven Bereich, hier eine Grafik f&auml;hrt) wird die im Script-Bereich definierte Funktion <tt>Bildwechsel()</tt> aufgerufen, ebenso bei <tt>onMouseOut=</tt> (wenn der Mauszeiger den verweis-sensitiven Bereich wieder verl&auml;&szlig;t).</p>

<p>Beim Aufruf von <tt>Bildwechsel()</tt> werden jeweils die beiden ben&ouml;tigten Parameter &uuml;bergeben. Z&auml;hlen Sie dazu die referenzierten Grafikdateien in der HTML-Datei, aber fangen Sie bei 0 an zu z&auml;hlen, d.h. 0 f&uuml;r die erste Grafik in der Datei, 1 f&uuml;r die zweite Grafik usw. &Uuml;bergeben Sie den Indexwert der Grafik, die in den Verweis eingebettet ist. Im Beispiel sind in der gesamten HTML-Datei keine anderen als die dynamisch zu tauschenden Grafiken referenziert. Deshalb wird im ersten Fall 0 (erste Grafik der Datei) &uuml;bergeben, im zweiten Fall 1 (zweite Grafik der Datei).<br>
Beim zweiten Parameter &uuml;bergeben Sie den Objektnamen f&uuml;r das gew&uuml;nschte Grafikobjekt. Das ist einer der Namen, die Sie am Anfang des Script-Bereichs vergeben haben. Im Beispiel wird im ersten Fall z.B. <tt>Highlight1</tt> bei <tt>onMouseover</tt> &uuml;bergeben, und <tt>Normal1</tt> bei <tt>onMouseout</tt>.</p>


<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tedh.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#ffffff><img src="x3.gif" width=15 height=10 border=0> <a href="tedh.htm"><b>Aufenthaltsdauer auf Web-Seite anzeigen</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tedf.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#ffffff width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tedf.htm"><b>Formulareingaben &uuml;berpr&uuml;fen</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="te.htm"><b>JavaScript</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="ted.htm"><b>Anwendungsbeispiele</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>