<html>
<head>
<title>SELFHTML: Dynamisches HTML /  Allgemeines</title>
<meta name="description" content="(SELFHTML 7.0) Der Zusammenhang zwischen HTML und Dynamischem HTML und die derzeitigen Realisierungen von Dynamischem HTML">
<meta name="keywords" content="SELFHTML, Dynamisches HTML, Dynamic">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tf.htm"><b>Dynamisches HTML</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Allgemeines zu Dynamischem HTML</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Das &quot;Dynamische&quot; an Dynamischem HTML</b></a> <br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Das &quot;Document Object Model&quot;</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>Microsoft, Netscape und das W3-Konsortium</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a4"><b>Informationen im WWW</b></a>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="a1">Das &quot;Dynamische&quot; an Dynamischem HTML</a></h2>

<p>Dynamisches HTML (engl. &quot;Dynamic HTML&quot; oder abgek&uuml;rzt &quot;DHTML&quot;) ist eine Erfindung von Marktstrategen, sagen Kritiker. In der Tat ist Dynamisches HTML keine klassische HTML-Erweiterung in Gestalt neuer HTML-Tags. Es ist auch keine neue Sprache. Dynamisches HTML ist vielmehr der Sammelbegriff f&uuml;r verschiedene L&ouml;sungen, um dem Autor einer WWW-Seite zu erm&ouml;glichen, beliebige Elemente der WWW-Seite w&auml;hrend der Anzeige dynamisch zu &auml;ndern, sei es automatisch oder durch Einwirken des Anwenders. Dazu dienen neuere Technologien wie <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="td.htm"><b>Style-Sheets</b></a>, vor allem aber bestimmte neuere Befehle in Scriptsprachen wie <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="te.htm"><b>JavaScript</b></a>. Die Basis von allem bleibt jedoch <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tc.htm"><b>HTML</b></a>, also strukturierte WWW-Seiten.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;p onClick=&quot;this.innerHTML='Sehen Sie - ich habe es ja gesagt!'&quot;&gt;Ich bin dynamisch&lt;/p&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Das kleine Beispiel zeigt Dynamisches HTML nach dem Ansatz des MS Internet Explorers 4.x. Es dient hier nur dem Zweck, das &quot;Typische&quot; an Dynamischem HTML zu verdeutlichen. In dem Beispiel wird mit <tt>&lt;p&gt;...&lt;/p&gt;</tt> ein gew&ouml;hnlicher HTML-Textabsatz definiert. Am Bildschirm steht dann:  <tt>Ich bin dynamisch</tt>. Damit der Textabsatz sein Versprechen auch halten kann, enth&auml;lt er im einleitenden <tt>&lt;p&gt;</tt>-Tag einen sogenannten <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tebj.htm"><b>Event-Handler</b></a>, im Beispiel den Event-Handler <tt>onClick=</tt>. Dieser Event-Handler tritt in Aktion, wenn der Anwender mit der Maus auf den angezeigten Text klickt. Im Beispiel verwandelt sich nach dem Anklicken des Textes dessen Inhalt in: <tt>Sehen Sie - ich habe es ja gesagt!</tt>.</p>

<p>Wie Sie an dem Beispiel erkennen, k&ouml;nnen Sie also bestimmte angezeigte Inhalte austauschen, ohne daf&uuml;r jedesmal vollst&auml;ndige neue Seiten laden zu m&uuml;ssen. Das ist eine charakteristische Eigenschaft von Dynamischem HTML. Eine Web-Seite verh&auml;lt sich also pl&ouml;tzlich wie ein Anwendung, die einmal in den Arbeitsspeicher geladen wird und dann durch Interaktion mit dem Anwender das Geschehen am Bildschirm bestimmt.</p>

<p>Dynamisches HTML bietet Gestaltern anspruchsvoller WWW-Seiten schier unersch&ouml;pfliche M&ouml;glichkeiten bei der Kontrolle &uuml;ber das Geschehen am Bildschirm. Es f&auml;ngt mit Kleinigkeiten wie dem obigen Beispiel an. Es geht weiter mit animierten Grafiken, die &uuml;ber den angezeigten Inhalt gleiten oder h&uuml;pfen - manche Web-Seiten versuchen, ganze Aquarien abzubilden. Und es geht hin bis zu der M&ouml;glichkeit, mit Hilfe von Grafiken und anderen Elementen komplexe, interaktive Spiele oder Lernsituationen oder auch selbstablaufende Animationen zu programmieren. Der Phantasie sind kaum mehr Grenzen gesetzt. Das Anzeigefenster eines WWW-Browsers kann sich durch massiven Einsatz von Dynamischem HTML in ein bewegtes Spektakel verwandeln. Der Anwender kann beim Anzeigen einer dynamischen HTML-Datei auch mit viel mehr Reaktionen konfrontiert werden als beim Betrachten einer normalen HTML-Datei. Das hat - wie fast alle neueren Features beim Web-Publishing - Vor und Nachteile. Es kommt immer darauf an, wie man die Features nutzt, ob zur blo&szlig;en Selbstdarstellung und Angeberei, oder zum Nutzen des Anwenders.</p>

<p>Microsoft f&uuml;hrt im Zusammenhang mit Dynamischem HTML zwei neue Konzepte ein, die ziemlich spektakul&auml;r sind: Datenanbindung und Filter-Scripting.<br>
Bei der Datenanbindung ist es einer HTML-Datei m&ouml;glich, auf externe Datenquellen zuzugreifen und Daten daraus kontrolliert innerhalb der Datei anzuzeigen. Wenn dieses Konzept erst einmal voll ausgereift ist, wird es vor allem Teile der <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tg.htm"><b>CGI</b></a>-Programmierung ersetzen. Im Gegensatz zu CGI ist das Konzept der Datenanbindung n&auml;mlich nicht vom HTTP-Protokoll abh&auml;ngig und funktioniert deshalb beispielsweise auch auf CD-ROMs.<br>
Filter-Scripting - das ist die dynamische Behandlung der MS-proriet&auml;ren Style-Sheet-<img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tdcl.htm"><b>Filter</b></a>. Damit sind allerdings so wunderbare grafische Effekte - auch mit normalem HTML-Text - m&ouml;glich, da&szlig; Web-Designern eine riesige neue Spielwiese zur Verf&uuml;gung steht.</p>

<p>&quot;Programmieren&quot; ist jedoch bei allem angesagt, was mit Dynamischem HTML zu tun hat: fortgeschrittene Programmierkenntnisse in Scriptsprachen wie <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="te.htm"><b>JavaScript</b></a> sind Voraussetzung. Nat&uuml;rlich gibt es im WWW immer fertige L&ouml;sungen zum Abkupfern, aber wer sich ernsthaft mit der Materie besch&auml;ftigen will, um eigene kreative L&ouml;sungen zu entwickeln, kommt um die Programmierung nicht herum. Das soll jedoch keine Entmutigung sein. Es gibt durchaus n&uuml;tzliche und pfiffige Anwendungsm&ouml;glichkeiten von Dynamischem HTML, die ohne allzugro&szlig;en Programmieraufwand auskommen.</p>


<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2">Das &quot;Document Object Model&quot;</a></h2>


<p>Die Aufgabe einer Script-Sprache wie JavaScript ist es, nachtr&auml;glich auf Elemente und aktuelle Zust&auml;nde einer WWW-Seite zuzugreifen. Herk&ouml;mmliches JavaScript ist dabei jedoch ziemlich beschr&auml;nkt. So k&ouml;nnen Sie damit zwar beispielsweise auf einzelne Formularelemente zugreifen, nicht aber auf &Uuml;berschriften, Textabs&auml;tze oder Tabellenzellen. Es bleibt dem Zufall &uuml;berlassen, welche Features sich Browser-Hersteller als n&auml;chstes einfallen lassen, und auf welche das Volk der Entwickler weiter vergeblich wartet.</p>

<p>Zu diesem Zweck hat man das &quot;Document Object Model&quot; (Abk&uuml;rzung &quot;DOM&quot;) ersonnen. Das h&auml;ngt sehr eng mit der Philosophie der objektorientierten und ereignisorientierten Programmierung zusammen. Alle HTML-Elemente einer WWW-Seite bilden einen &quot;Objektbaum&quot;. So ist das <tt>&lt;body&gt;</tt>-Tag beispielsweise der Vater oder die Mutter aller anzeigbaren Elemente wie &Uuml;berschriften, Grafiken, Verweise oder Tabellen. Ein mit <tt>&lt;div&gt;</tt>...<tt>&lt;/div&gt;</tt> formatierter Bereich ist das Elternteil aller Elemente, die innerhalb dieses Bereichs vorkommen. Jede Tabellenzelle geh&ouml;rt zu einer Tabelle usw. Aber auch das Anzeigefenster des Browsers mit seinen aktuellen Eigenschaften geh&ouml;rt dazu, sowie Maus- und Tastaturaktionen innerhalb des Anzeigefensters. Das Document Object Model ist der Versuch, alle relevanten Bestandteile einer angezeigten WWW-Seite als eine Objekthierarchie abzubilden. Diese Objekthierarchie sollte sich dann idealerweise in webseiten-bezogenen Programmiersprachen wie JavaScript wiederfinden.</p>

<p>Das W3-Konsortium, das f&uuml;r die Normierung von WWW-Technologien verantwortlich ist, hat mittlerweile eine Spezifikation zum Document Object Model ver&ouml;ffentlicht. Das betreffende Dokument m&uuml;ssen Sie sich vorstellen als eine Spezifikation f&uuml;r Scriptsprachen-&quot;Hersteller&quot;. Es enth&auml;lt Empfehlungen f&uuml;r die Objekthierarchie, die eine webseiten-orientierte Scriptsprache realisieren sollte. Bei vollst&auml;ndiger Umsetzung der empfohlenen Objekthierarchie w&auml;re dann zugleich eine standardisierte  Grundlage f&uuml;r Dynamisches HTML geschaffen.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a3">Microsoft, Netscape und das W3-Konsortium</a></h2>

<p>Dynamisches HTML wird von Netscape ab Version 4.0 und vom MS Internet Explorer ab Version 4.0 interpretiert. Leider ist das Thema &quot;Dynamic HTML&quot; jedoch zu einem Kriegsschauplatz im Duell der beiden f&uuml;hrenden WWW-Browser geworden. Denn die Realisierungen sind in beiden Browsern grundverschieden. Ist das Erstellen von WWW-Seiten mit Dynamischem HTML bereits nicht ganz einfach, so wird es durch die weitgehend inkompatiblen L&ouml;sungen der Browser in den 4er-Versionen doppelt und dreifach schwer. Vieles mu&szlig; man f&uuml;r beide Browser getrennt kodieren (mit doppeltem Kenntnisaufwand), wenn man f&uuml;r beide Browser schreiben will. Vieles funktioniert &uuml;berhaupt nur mit dem einen oder mit dem anderen Browser. Die &quot;Szene&quot; sitzt angesichts dieser Situation in den Startl&ouml;chern und lauert auf Vereinheitlichung.</p>

<p>Beim Bem&uuml;hen um Vereinheitlichung zeichnet sich ab, da&szlig; Netscape diesmal das Nachsehen hat, denn der Ansatz von Microsoft ist deutlich ausgereifter und n&auml;her an den Standards des W3-Konsortiums orientiert. W&auml;hrend der MS Internet Explorer 4.x das Document Object Model weitgehend umsetzt, kann davon bei Netscape Netscape 4.x kaum die Rede sein. Netscape hat das mittlerweile selbst zugegeben und f&uuml;r seine Browser-Version 5 eine bessere Umsetzung des Document Object Models versprochen. Inwieweit Dynamisches HTML aber auch weiterhin als Schlachtfeld f&uuml;r Anwenderanteile im Milliardenmarkt Internet herhalten mu&szlig;, ist derzeit noch nicht absehbar.</p>

<p>Das W3-Konsortium sieht die Notwendigkeit, in Sachen Dynamischem HTML an einer einheitlichen L&ouml;sung mitzuwirken, mu&szlig; jedoch der Gefahr ausweichen, einfach nur die bereits realisierten Features eines bestimmten Browsers abzusegnen. Andererseits haben die Browser-Entwickler erkannt, da&szlig; das W3-Konsortium eine wichtige Institution f&uuml;r den R&uuml;ckhalt bei Neuentwicklungen ist. Denn herk&ouml;mmliche, herstellerspezifische Programmier-L&ouml;sungen oder Datenformate sind im Zeitalter des Internet-Booms nicht mehr gefragt und auf die Dauer zum Aussterben verurteilt.</p>

<p>In der vorliegenden Dokumentation werden zun&auml;chst beide Ans&auml;tze (Microsoft und Netscape) getrennt beschrieben (<img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tfb.htm"><b>Die Ans&auml;tze von Microsoft und Netscape</b></a>). Denn nur wenn Sie beide Konzepte klar unterscheiden k&ouml;nnen, sind Sie in der Lage, Dynamisches HTML so zu schreiben, da&szlig; es mit beiden Browsern funktioniert. Im zweiten Schritt k&ouml;nnen Sie dann sehen, wie sich Dynamisches HTML f&uuml;r beide Browser realisieren l&auml;&szlig;t (<img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tfc.htm"><b>L&ouml;sungen f&uuml;r die Praxis</b></a>).</p>


<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a4">Informationen zu &quot;DHTML&quot; im WWW</a></h2>

<p>Die folgenden Internet-Adressen sollten Sie besuchen, um weiterf&uuml;hrende Informationen rund um Dynamisches HTML zu erhalten:</p>

<p><img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.microsoft.com/workshop/author/dhtml/"><b>Dynamic HTML (Microsoft)</b></a><br>
Original-Dokumentation von Microsoft</p>

<p><img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://developer.netscape.com/docs/manuals/communicator/dynhtml/"><b>Dynamic HTML in Netscape</b></a><br>
Original-Dokumentation von Netscape</p>

<p><img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.w3.org/TR/WD-DOM/"><b>Document Object Model</b></a><br>
Spezifikation des W3-Konsortiums</p>

<p><img src="xdeu.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://dhtml.seite.net/"><b>DHTML Seite</b></a><br>
Beispiele, Beschreibungen, Verweise, Tips und Tricks</p>

<p><img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.insidedhtml.com/"><b>Inside DHTML</b></a><br>
Workshop mit Demos, Beispiele - auch downloadbar - und Verweisen</p>

<p><img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.dhtmlzone.com/"><b>DHTML Zone</b></a><br>
Workshop mit dokumentierten Beispielen, Verweise usw.</p>




<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tfba.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF><img src="x3.gif" width=15 height=10 border=0> <a href="tfba.htm"><b>Dynamischer Zugriff auf HTML-Elemente (Microsoft)</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tedi.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tedi.htm"><b>Verweisliste als Auswahlliste</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tf.htm"><b>Dynamisches HTML</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>