<html>
<head>
<title>SELFHTML: Dynamisches HTML /  Ans&auml;tze / Dynamischer Zugriff auf HTML-Elemente (Microsoft)</title>
<meta name="description" content="(SELFHTML 7.0) Die Bestandteile, die man kennen mu&szlig;, um Dynamisches HTML f&uuml;r den MS Internet Explorer ab 4.x zu schreiben">
<meta name="keywords" content="SELFHTML, Dynamisches HTML, Dynamic, Microsoft, Internet Explorer">
<link rel=stylesheet type="text/css" href="wselfhtm.css">
</head>
<body bgcolor=#ffffff text=#000000 link=#aa5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tf.htm"><b>Dynamisches HTML</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tfb.htm"><b>Die Ans&auml;tze von Microsoft und Netscape</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Dynamischer Zugriff auf HTML-Elemente (Microsoft)</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#ffffff valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>CSS Style-Sheets und Scripts</b></a> <br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Scriptsprachen: JavaScript, JScript und VBScript</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>Schreibweise von Style-Sheet-Angaben in JavaScript/JScript</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a4"><b>Das all-Objekt</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a5"><b>Event-Handler und das Event-Objekt</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a6"><b>Vererbung bei Events (Event-Bubbling)</b></a>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="a1"><img src="xmsie4.gif" width=30 height=30 border=0 alt="MS IE 4.0"> CSS Style-Sheets und Scripts</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tfbaa.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Sie k&ouml;nnen mit Dynamischem HTML nach Microsoft-Syntax dynamisch auf alle Style-Definitionen einzelner HTML-Elemente zugreifen. Dadurch k&ouml;nnen Sie Elemente w&auml;hrend der Anzeige praktisch beliebig ver&auml;ndern. Wenn etwa eine &Uuml;berschrift 2. Ordnung anfangs eine Schriftgr&ouml;&szlig;e von 14 Punkt hat, k&ouml;nnen Sie diese dynamisch auf 42 Punkt &auml;ndern. &quot;Dynamisch&quot; bedeutet dabei: bei einem Anwenderereignis wie einem Mausklick auf die &Uuml;berschrift oder automatisch zeitgesteuert, etwa nach drei Sekunden.</p>

<p>Neben der Schriftgr&ouml;&szlig;e k&ouml;nnen Sie auch dynamisch eine Hintergrundfarbe unterlegen, Rahmen um ein Element ziehen, das Element &uuml;ber den Bildschirm wandern lassen und vieles mehr. Die Voraussetzung f&uuml;r diese Effekte sind beim MS Internet Explorer <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="td.htm"><b>CSS Style-Sheets</b></a>. Die Syntax der CSS-Style-Sheets und die M&ouml;glichkeiten der Style-Sheet-Angaben sollten Sie kennen.</p>

<p>Die Style-Definitionen eines HTML-Elements &auml;ndern Sie dynamisch, indem Sie mit Hilfe einer Scriptsprache auf das Element zugreifen und mit neuen Style-Sheet-Angaben das Aussehen des Elements &auml;ndern. Dazu m&uuml;ssen Sie Kenntnisse in einer Scriptsprache wie <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="te.htm"><b>JavaScript</b></a> haben. Ohne solche Kenntnisse werden Sie die folgenden Beispiele nur schwer verstehen.</p>

<h3 class="xmp">Beispiel:</h3>

<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;h1 id=&quot;Wechseltext&quot; style=&quot;font-size:14pt&quot;&gt;Wichtigtuer&lt;/h1&gt;
&lt;script language=&quot;JScript&quot;&gt;
&lt;!--
function MachKlein()
{
 document.all.Wechseltext.style.fontSize = &quot;14pt&quot;;
 window.setTimeout(&quot;MachGross()&quot;,1000);
}
function MachGross()
{
 document.all.Wechseltext.style.fontSize = &quot;42pt&quot;;
 window.setTimeout(&quot;MachKlein()&quot;,1000);
}
MachKlein();
//--&gt;
&lt;/script&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Das Beispiel zeigt zun&auml;chst eine <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcda.htm"><b>&Uuml;berschrift</b></a> 1. Ordnung (<tt>&lt;h1&gt;</tt>...<tt>&lt;/h1&gt;</tt>). Mit Hilfe des Attributs <tt>style=</tt> bekommt die &Uuml;berschrift <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tdc.htm"><b>Style-Sheet-Angaben</b></a> zugewiesen. Im Beispiel wird die Schriftgr&ouml;&szlig;e auf 14 Punkt gesetzt (<tt>font-size:14pt</tt>).</p>

<p>Das gesamte Beispiel bewirkt, da&szlig; die Gr&ouml;&szlig;e der &Uuml;berschrift einmal pro Sekunde von 14 auf 42 Punkt wechselt und wieder umgekehrt. F&uuml;r dieses dynamische Ver&auml;ndern ist ein Script erforderlich. Im obigen Beispiel wird deshalb ein Script-Bereich mit <tt>&lt;script language=&quot;JScript&quot;&gt;</tt>...<tt>&lt;/script&gt;</tt> definiert. Innerhalb des Script-Bereichs werden zwei <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tebd.htm"><b>Funktionen</b></a> definiert. Die eine Funktion - <tt>MachKlein()</tt> - &auml;ndert die Schriftgr&ouml;&szlig;e der &Uuml;berschrift auf 14 Punkt, die andere Funktion  - <tt>MachGross()</tt> - auf 42 Punkt. Nach jeweils einer Sekunde (1000 Millisekunden) ruft jede der beiden Funktionen die jeweils andere wieder auf. Dadurch entsteht der Wechsel-Effekt.</p>

<p>Um das dynamische Ver&auml;ndern der Schriftgr&ouml;&szlig;e zu verstehen, m&uuml;ssen Sie folgende Zusammenh&auml;nge beachten: im &Uuml;berschriften-Tag <tt>&lt;h1&gt;</tt> wird mit dem Attribut <tt>id=</tt> ein Name, n&auml;mlich <tt>Wechseltext</tt>, zugewiesen. Diesen Namen k&ouml;nnen Sie frei verbeben. Er darf nur aus Buchstaben, Ziffern und Unterstrichen &quot;_&quot; bestehen und darf keine Leerzeichen oder deutschen Umlaute enthalten. Das Script im Beispiel greift mit den Anweisungen, in denen  <tt>document.all.Wechseltext</tt> vorkommt, auf genau dieses Element zu. Mit dem <img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a4"><b>all-Objekt</b></a> (<tt>document.all</tt>) werden alle Elemente einer HTML-Datei angesprochen. Durch den Namen dahinter wird genau das Element angesprochen, das diesen Namen hat - im Beispiel <tt>Wechseltext</tt>. Dahinter folgt das Style-Objekt (<tt>style</tt>), das dem all-Objekt untergeordnet ist. &Uuml;ber das Style-Objekt k&ouml;nnen Sie als Eigenschaft eine erlaubte CSS-Style-Sheet-Angabe notieren. Dabei gelten besondere <img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>Schreibweisen in JavaScript/JScript</b></a>.</p>


<h3 class="inf">Beachten Sie:</h3>

<p>Dies alles funktioniert nicht mit Netscape (Version 4.x). An dieser Stelle wird nur der Ansatz des MS Internet Explorers behandelt. Wenn Sie sich lieber zuerst mit dem Ansatz von Netscape besch&auml;ftigen wollen, dann lesen Sie den Abschnitt <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tfbe.htm"><b>Dynamisches Positionieren (Netscape)</b></a>.</p>

<p>Anstelle einer Angabe wie:<br>
<tt>document.all.Wechseltext.style.fontSize = &quot;42pt&quot;;</tt><br>
gen&uuml;gt es auch, die Angabe verk&uuml;rzt zu notieren:<br>
<tt>Wechseltext.style.fontSize = &quot;42pt&quot;;</tt><br>
Die Zuordnung zum All-Objekt ist klar, da ein eindeutiger Name (Wechseltext) f&uuml;r ein HTML-Element vergeben wurde. Deshalb kann der vordere Teil der &uuml;blichen Objektvererbungsnotation in Scriptsprachen wie JScript oder JavaScript entfallen.</p>


<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2">Scriptsprachen: JavaScript, JScript und VBScript</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tfbab.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Das W3-Konsortium macht keine Vorschriften daf&uuml;r, welche Scriptsprache f&uuml;r Dynamisches HTML verwendet werden soll. Deshalb herrscht hierbei noch etwas Verwirrung.</p>

<p><img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="te.htm"><b>JavaScript</b></a> ist die meist verwendete und bekannteste Scriptsprache. Sie wurde durch Netscape eingef&uuml;hrt. Der MS Internet Explorer interpretiert JavaScript ebenfalls. Dabei hinkt er Netscape jedoch immer etwas hinterher, da Netscape die Lizenzen f&uuml;r JavaScript besitzt und es Microsoft nicht erlaubt ist, den Sprachumfang von JavaScript selbstst&auml;ndig zu erweitern. Mit einem kleinen Kniff hat sich Microsoft aus dieser mi&szlig;lichen Lage befreit: die Sprache wurde einfach in JScript umbenannt. JScript ist JavaScript plus MS-eigene Spracherweiterungen. JScript enth&auml;lt etliche Objekte, Methoden und Eigenschaften, die in JavaScript nicht vorkommen. Die meisten dieser Befehle sind f&uuml;r die lokalen Betriebssystemerweiterungen gedacht, die der MS Internet Explorer 4.x unter MS Windows ben&ouml;tigt. Aber auch das <img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a4"><b>all-Objekt</b></a>, das in Netscape's JavaScript bislang nicht vorkommt, geh&ouml;rt dazu. Und dieses Objekt ist ganz entscheidend f&uuml;r Dynamisches HTML im MS Internet Explorer.</p>

<p>Neben JavaScript und JScript beherrscht der MS Internet Explorer auch noch VBScript. Diese Sprache ist von Visual Basic (VB) abgeleitet. Sie konnte sich bislang jedoch nicht durchsetzen im WWW. VBScript hat eine andere Syntax als JavaScript und JScript. Die Objekte, Eigenschaften und Methoden sind jedoch im wesentlichen die gleichen. Mit VBScript k&ouml;nnen Sie also ebenfalls Dynamisches HTML schreiben.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;p&gt;Ihr WWW-Browser beherrscht folgende Scriptsprachen:&lt;/p&gt;
&lt;ul&gt;
&lt;script language=&quot;JavaScript&quot;&gt;
&lt;!--
document.write(&quot;&lt;li&gt;JavaScript&quot;);
//--&gt;
&lt;/script&gt;
&lt;script language=&quot;JScript&quot;&gt;
&lt;!--
document.write(&quot;&lt;li&gt;JScript&quot;);
//--&gt;
&lt;/script&gt;
&lt;script language=&quot;VBScript&quot;&gt;
&lt;!--
document.write &quot;&lt;li&gt;VBScript&quot;
//--&gt;
&lt;/script&gt;
&lt;/ul&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Das obige Beispiel ist kein Dynamisches HTML im engeren Sinn. Es soll lediglich demonstrieren, wie Sie unterschiedliche Scriptsprachen einsetzen k&ouml;nnen, und welche Wirkung dies auf WWW-Browser hat. In dem Beispiel wird mit HTML eine Aufz&auml;hlungsliste (<tt>&lt;ul&gt;</tt>...<tt>&lt;/ul&gt;</tt>) definiert. Dazwischen werden drei Script-Bereiche definiert: einer mit JavaScript (<tt>&lt;script language=&quot;JavaScript&quot;&gt;</tt>), einer mit JScript (<tt>&lt;script language=&quot;JScript&quot;&gt;</tt>) und einer mit VBScript <tt>&lt;script language=&quot;VBScript&quot;&gt;</tt>. Jeder der drei Bereiche schreibt mit Hilfe eines document.write-Befehls (dieser Befehl ist in allen drei Sprachen gleich) einen Punkt in die Aufz&auml;hlungsliste. Da ein WWW-Browser nur diejenigen Script-Bereiche ausf&uuml;hrt, deren Sprachen er kennt, stehen am Ende genau diejenigen Script-Sprachen in der Liste, die der benutzte WWW-Browser kennt.</p>
 
<p>Sie sollten einen Script-Bereich einfach dann mit &quot;JScript&quot; auszeichnen, wenn Sie verhindern wollen, da&szlig; Netscape den Bereich interpretiert. Der MS Internet Explorer 4.x selbst nimmt es andererseits nicht &uuml;bel, wenn Sie einen Script-Bereich mit &quot;JavaScript&quot; auszeichnen und darin Objekte, Methoden und Eigenschaften verwenden, die bislang eigentlich nur in JScript vorkommen. Wenn Sie einen Script-Bereich mit &quot;JavaScript&quot; auszeichnen und darin microsoft-spezifische JScript-Erweiterungen wie das all-Objekt verwenden, sollten Sie die Ausf&uuml;hrung entsprechender Anweisungen von einer Abfrage abh&auml;ngig machen. Lesen Sie dazu das Thema <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tebc.htm#a6"><b>Abfragen ob Objekte ansprechbar sind</b></a> in JavaScript.</p>

<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a3"><img src="xmsie4.gif" width=30 height=30 border=0 alt="MS IE 4.0"> Schreibweise von Style-Sheet-Angaben in JavaScript/JScript</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tfbac.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Wenn Sie Style-Sheet-Angaben innerhalb von Scriptsprachen verwenden, m&uuml;ssen Sie die Syntax der Scriptsprache ber&uuml;cksichtigen.</p>

<p>Ein Problem beim Mischen von CSS Style-Sheets und JavaScript oder JScript ist es, da&szlig; viele Style-Sheet-Angaben Bindestriche im Namen haben, wie etwa <tt>font-size</tt>, <tt>margin-top</tt> oder <tt>background-color</tt>. Wenn Sie aus solche Namen in JavaScript oder JScript einen Befehl wie:<br>
<tt>document.all.MeinText.style.font-size = &quot;24pt&quot;;</tt><br>
erzeugen, erhalten Sie eine Fehlermeldung. Der Grund ist, da&szlig; Bindestriche keine zul&auml;ssigen Zeichen in Namen sind (der Bindestrich ist in diesen Sprachen ja der Operator f&uuml;r Subtraktionen).</p>

<p>Um dieses Problem zu umgehen, hat Microsoft eine einfache Regel aufgestellt. Wenn in einem Script eine Style-Sheet-Angabe ausgelesen oder ver&auml;ndert werden soll, entf&auml;llt der Bindestrich, und der erste Buchstabe des Wortes hinter dem Bindestrich wird gro&szlig;geschrieben.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;script language=&quot;JScript&quot;&gt;
&lt;!--
var modus = 1;
 function Textspiel()
 {
  if(modus == 1)
   {
    document.all.MeinText.style.fontSize = &quot;24pt&quot;;
    modus = 2;
    return;
   }
  if(modus == 2)
   {
    document.all.MeinText.style.padding = &quot;8pt&quot;;
    document.all.MeinText.style.backgroundColor = &quot;#FFFF00&quot;;
    modus = 3;
    return;
   }
  if(modus == 3)
   {
    document.all.MeinText.style.border = &quot;8pt groove #FFCC33&quot;;
    document.all.MeinText.style.backgroundImage = &quot;url(back.gif)&quot;;
    modus = 0;
    return;
   }
  if(modus == 0)
   {
    document.all.MeinText.style.fontSize = &quot;12pt&quot;;
    document.all.MeinText.style.padding = &quot;0pt&quot;;
    document.all.MeinText.style.backgroundColor = &quot;#FFFFFF&quot;;
    document.all.MeinText.style.border = &quot;none&quot;;
    document.all.MeinText.style.backgroundImage = &quot;none&quot;;
    modus = 1;
    return;
   }
 }
//--&gt;
&lt;/script&gt;

&lt;p id=&quot;MeinText&quot; style=&quot;font-size:12pt; background-color:#FFFFFF; padding:0pt; border:none;
background-image:none; cursor:hand&quot; onClick=&quot;Textspiel()&quot;&gt;Klicken Sie auf diesen Text&lt;/p&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>In dem Beispiel wird am Ende ein Textabsatz mit diversen Style-Sheet-Angaben definiert. Einige dieser Style-Sheet-Angaben enthalten Bindestriche, n&auml;mlich <tt>font-size</tt>, <tt>background-color</tt> und <tt>background-image</tt>. Innerhalb des Scripts, das &uuml;ber dem Textabsatz notiert ist, werden diese und andere Style-Sheet-Angaben dynamisch ver&auml;ndert. Sie k&ouml;nnen erkennen, da&szlig; <tt>font-size</tt> zu <tt>fontSize</tt> wird, <tt>background-color</tt> zu <tt>backgroundColor</tt> und <tt>background-image</tt> zu <tt>backgroundImage</tt> - getreu der Regel.

<p>Wenn Sie innerhalb eines Scripts einer Style-Sheet-Eigenschaft einen neuen Wert zuweisen wollen, m&uuml;ssen Sie zuerst das gew&uuml;nschte HTML-Objekt mit der style-Eigenschaft notieren, im obigen Beispiel etwa <tt>document.all.MeinText.style.fontSize</tt>. Dahinter folgt ein Istgleichzeichen f&uuml;r die Zuweisung, und dahinter der Wert, den Sie zuweisen wollen, also etwa <tt>&quot;24pt&quot;</tt>. Dieser Wert mu&szlig; bei JavaScript und JScript immer in Anf&uuml;hrungszeichen stehen.

<p>Diese Art der Wertzuweisung an eine Style-Sheet-Angabe unterscheidet sich von der Art, wie Werte zu Style-Sheet-Angaben bei normalen Style-Sheet-Definitionen zugewiesen werden. Dort notieren Sie anstelle eines Istgleichzeichens einen Doppelpunkt, so wie in den Style-Sheet-Definitionen im Textabsatz des obigen Beispiels. Anf&uuml;hrungszeichen sind dabei nicht n&ouml;tig.</p>

<p>Das Script im Beispiel ver&auml;ndert die Formatierung des Textes innerhalb des Textabsatzes, wenn der Anwender mit der Maus auf den Text klickt. Immer, wenn dieses Ereignis eintritt, wird mit Hilfe des <img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a5"><b>Event-Handlers</b></a> <tt>onClick=</tt> die Funktion <tt>Textspiel()</tt> innerhalb des Scripts aufgerufen. Das Script 
verwaltet eine global definierte Variable namens <tt>modus</tt>. Abh&auml;ngig davon, welchen Wert diese Variable hat, werden dem Text diverse neue Style-Sheet-Angaben zugewiesen. Das dynamische Ver&auml;ndern des Textabsatzes im Script wird durch die Angabe <tt>id=&quot;MeinText&quot;</tt> im Textabsatz und Befehlen des Typs <tt>document.all.MeinText.style</tt> bewerkstelligt.</p>









<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a4"><img src="xmsie4.gif" width=30 height=30 border=0 alt="MS IE 4.0"> Das all-Objekt</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tfbad.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Das all-Objekt ist beim DHTML-Ansatz von Microsoft der entscheidende Schl&uuml;ssel. Wie der Name schon verspricht, ist &uuml;ber dieses Objekt jedes einzelne HTML-Tag einer HTML-Datei ansprechbar. Das all-Objekt hat etliche Eigenschaften und Methoden, die das dynamische Ver&auml;ndern eines HTML-Tags erlauben. Alle Methoden und Eigenschaften k&ouml;nnen an dieser Stelle nicht behandelt werden. Rufen Sie dazu die <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tec.htm"><b>JavaScript-Objektreferenz</b></a> auf und verschaffen Sie sich einen &Uuml;berblick &uuml;ber die Eigenschaften und Methoden des Objekts <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tecbba.htm"><b>all</b></a>. Hier soll lediglich ein weiteres Beispiel die Wirkungsweise dieses Objekts verdeutlichen.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;script language=&quot;JScript&quot;&gt;
&lt;!--
 Wochentagname =
 new Array(&quot;Sonntag&quot;,&quot;Montag&quot;,&quot;Dienstag&quot;,&quot;Mittwoch&quot;,&quot;Donnerstag&quot;,&quot;Freitag&quot;,&quot;Samstag&quot;);
function ZeitAnzeigen() 
{ 
 var Jetzt = new Date();
 var Tag = Jetzt.getDate();
 var Monat = Jetzt.getMonth() + 1;
 var Jahr = Jetzt.getYear();
 var Stunden = Jetzt.getHours();
 var Minuten = Jetzt.getMinutes();
 var Sekunden = Jetzt.getSeconds();
 var WoTag = Jetzt.getDay();
 var Vortag  = ((Tag &lt; 10) ? &quot;0&quot; : &quot;&quot;);
 var Vormon  = ((Monat &lt; 10) ? &quot;.0&quot; : &quot;.&quot;);
 var Vorstd  = ((Stunden &lt; 10) ? &quot;0&quot; : &quot;&quot;);
 var Vormin  = ((Minuten &lt; 10) ? &quot;:0&quot; : &quot;:&quot;);
 var Vorsek  = ((Sekunden &lt; 10) ? &quot;:0&quot; : &quot;:&quot;);
 var Datum = Vortag + Tag + Vormon + Monat  + &quot;.&quot; + Jahr;
 var Uhrzeit = Vorstd + Stunden + Vormin + Minuten + Vorsek + Sekunden;
 document.all.Uhr.innerHTML = Datum + &quot; (&quot; + Wochentagname[WoTag] + &quot;)&lt;br&gt;&quot; + Uhrzeit;
 window.setTimeout(&quot;ZeitAnzeigen()&quot;,1000);
}
// --&gt;
&lt;/script&gt;
&lt;/head&gt;
&lt;body bgcolor=#FFFFFF&gt;
&lt;p id=&quot;Uhr&quot; style=&quot;font-family:Verdana; font-size:24pt;
font-weight:bold; color:#CC00CC&quot;&gt;&lt;/p&gt;
&lt;script language=&quot;JScript&quot;&gt;
&lt;!--
window.setTimeout(&quot;ZeitAnzeigen()&quot;,1000);
// --&gt;
&lt;/script&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Das Beispiel stellt eine vollst&auml;ndige, laufende Uhr mit Datum dar. Dazu wird ein leerer Textabsatz mit <tt>&lt;p&gt;</tt>...<tt>&lt;/p&gt;</tt> definiert. Style-Sheet-Angaben dienen dazu, den Textabsatz nach Wunsch zu formatieren. Obwohl der Absatz zun&auml;chst keinen Text enth&auml;lt, dient er im Verlauf des Scripts als Container (Beh&auml;lter) f&uuml;r den angezeigten Text mit Datum und Uhrzeit.</p>

<p>Das obere Script ermittelt Datum und Uhrzeit und formatiert es f&uuml;r eine ordentliche, hierzulande &uuml;bliche Schreibweise. Die Zeichenkette, die ausgegeben werden soll, wird schlie&szlig;lich der Objekteigenschaft <tt>document.all.Uhr.innerHTML</tt> zugewiesen. <tt>Uhr</tt> ist dabei der Bezug auf den Namen, der bei der Definition des Textabsatzes mit <tt>id=</tt> definiert wird. Mit der Objekteigenschaft <tt>innerHTML</tt> k&ouml;nnen Sie den gesamten Inhalt eines Elements, hier den des benannten <tt>&lt;p&gt;</tt>...<tt>&lt;/p&gt;</tt>-Elements, dynamisch ersetzen. Da sich die Funktion zur Ausgabe der Zeit jede Sekunde selbst von neuem aufruft, wird jede Sekunde ein neuer Inhalt in das <tt>&lt;p&gt;</tt>-Tag mit der <tt>id=&quot;Uhr&quot;</tt> geschrieben. Auf diese Weise entsteht der Effekt einer laufenden Uhr.</p>

<p>Es gibt weitere, m&auml;chtige M&ouml;glichkeiten des all-Objekts. Diese werden in der JavaScript-Objektreferenz beim Objekt <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tecbba.htm"><b>all</b></a> beschrieben. Hier nur noch einige typische Befehlsfolgen:</p>

<p>Angenommen, Sie haben folgendes HTML-Element, ein gew&ouml;hnlicher Textabsatz:<br>
<tt>&lt;p id=&quot;derText&quot;&gt;Das ist Text in einem Textabsatz&lt;/p&gt;</tt><br>
Dann k&ouml;nnen Sie beispielsweise folgende Dynamische Ver&auml;nderungen bewirken:<br>
Mit <tt>document.all.derText.innerHTML = &quot;&lt;b&gt;neuer Text&lt;/b&gt; im gleichen Textabsatz&quot;;</tt> &auml;ndern Sie den Inhalt des Textabsatzes und k&ouml;nnen dabei auch HTML-Tags zur Formatierung benutzen.<br>
Mit <tt>document.all.derText.outerHTML = &quot;&lt;h1&gt;&quot; + document.all.derText.innerHTML + &quot;&lt;/h1&gt;&quot;;</tt> verwandeln Sie den Textabsatz in eine &Uuml;berschrift 1. Ordnung.<br>
Mit <tt>document.all.derText.className = &quot;Wichtig&quot;;</tt> weisen Sie dem Absatz eine Style-Sheet-Klasse namens <tt>Wichtig</tt> zu. Wenn Sie eine solche Klasse definiert haben, &uuml;bernimmt der Absatz alle in der Klasse definierten Style-Sheet-Angaben (lesen Sie dazu auch den Abschnitt <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tdbb.htm#a2"><b>Unterklassen von HTML-Tags definieren</b></a>).<br>
</p>

<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a5"><img src="xmsie4.gif" width=30 height=30 border=0 alt="MS IE 4.0"> Event-Handler und das Event-Objekt</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tfbae.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Eine wichtige Voraussetzung f&uuml;r Dynamisches HTML ist in vielen F&auml;llen die Interaktion zwischen Anwender und angezeigter HTML-Datei. Die angezeigte Datei kann auf Anwenderereignisse wie Mausklicks oder gedr&uuml;ckte Tasten an der Tastatur reagieren und Elemente daraufhin dynamisch ver&auml;ndern. Dazu gibt es Event-Handler und auch ein Event-Objekt. Alle Methoden und Eigenschaften des Event-Objekts und alle einzelnen Event-Handler k&ouml;nnen an dieser Stelle nicht behandelt werden. Rufen Sie dazu in der JavaScript-Dokumentation die <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tebj.htm"><b>Event-Handler</b></a> sowie die Referenz des Objekts <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tecbc.htm"><b>event</b></a> auf und verschaffen Sie sich einen &Uuml;berblick &uuml;ber die M&ouml;glichkeiten. Hier soll lediglich ein Beispiel die Wirkungsweise verdeutlichen.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;script language=&quot;JScript&quot;&gt;
&lt;!--
 function SetPos()
 {
  document.all.Springer.style.left = window.event.x;
  document.all.Springer.style.top = window.event.y;
 }
// --&gt;
&lt;/script&gt;
&lt;/head&gt;
&lt;body bgcolor=#FFFFFF onClick=&quot;SetPos()&quot;&gt;
&lt;div id=&quot;Springer&quot; style=&quot;position:absolute; top:100px; left:100px; width:200px;
height:100px; font-size:16pt; background-color:#000066; color;#FFFF00; padding:1cm;&quot;&gt;
Klicken Sie mit der Maus irgendwohin!
&lt;/div&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Das obige Beispiel definiert einen Bereich mit <tt>&lt;div&gt;</tt>...<tt>&lt;/div&gt;</tt>. Verschiedene Style-Sheet-Angaben im einleitenden <tt>&lt;div&gt;</tt>-Tag sorgen daf&uuml;r, da&szlig; der Bereich gut sichtbar ist und absolut am Bildschirm positioniert wird. Wenn der Anwender w&auml;hrend der Anzeige irgendwo im Anzeigefenster des Browsers mit der Maus hinklickt, wird der definierte <tt>&lt;div&gt;</tt>-Bereich neu positioniert, und zwar so, da&szlig; die linke obere Ecke genau an der Stelle beginnt, wo der Anwender hingeklickt hat.</p>

<p>Damit dies m&ouml;glich ist, mu&szlig; das gesamte Dokument sofort reagieren, wenn der Anwender mit der Maus irgendwohin klickt. Zu diesem Zweck wird im einleitenden <tt>&lt;body&gt;</tt>-Tag der Event-Handler <tt>onClick=</tt> notiert. Beim jedem Mausklick im Anzeigefenster wird dann die <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tebd.htm"><b>Funktion</b></a> SetPos() aufgerufen, die innerhalb des Script-Bereichs definiert ist. Diese Funktion setzt die Werte f&uuml;r die linke obere Ecke des <tt>&lt;div&gt;</tt>-Bereichs neu. Bezug ist dabei der Name (&quot;<tt>Springer</tt>&quot;), der im <tt>&lt;div&gt;</tt>-Tag mit <tt>id=</tt> vergeben wurde. Mit dem Befehl <tt>document.all.Springer.style.left</tt> wird die neue Anfangsposition links gesetzt, mit <tt>document.all.Springer.style.top</tt> die neue Anfangsposition oben. Den neuen Wert f&uuml;r links liefert die Eigenschaft <tt>x</tt> des <tt>window.event</tt>-Objekts, den Wert f&uuml;r oben die Eigenschaft <tt>y</tt> dieses Objekts. Der <tt>&lt;div&gt;</tt>-Bereich wird dadurch neu positioniert.</p>

<p>Das Event-Objekt h&auml;lt st&auml;ndig alle relevanten Anwendert&auml;tigkeiten wie Mausposition, Tastaturereignisse, Mausklicks, gedr&uuml;ckte Maustasten usw. in seinen Objekteigenschaften fest. Durch einfaches Abrufen der Eigenschaften vom Typ <tt>window.event.[Eigenschaft]</tt> k&ouml;nnen Sie jederzeit aktuelle Ereignisse abfangen. Das Abfangen geschieht durch Notieren von Event-Handlern. Wichtig ist dabei auch, an welcher Stelle Sie ein Ereignis abfangen, also wo Sie den Event-Handler notieren. So k&ouml;nnten Sie im obigen Beispiel den Event-Handler <tt>onClick=</tt> auch im einleitenden <tt>&lt;div&gt;</tt>-Tag notieren. Dann w&uuml;rden Scriptbefehle nur dann ausgef&uuml;hrt, wenn der Mausklick innerhalb dieses <tt>&lt;div&gt;</tt>-Bereichs vorkommt.</p>

<p>Ein wichtiges Unter-Objekt des Event-Objekts ist das Objekt f&uuml;r das angeklickte Element (<tt>srcElement</tt>). So k&ouml;nnen Sie etwa mit <tt>window.event.srcElement.tagName</tt> ermitteln welches HTML-Tag von einem aktuellen Anwenderereignis betroffen ist. In Ihren Scripts k&ouml;nnen Sie dann entsprechend reagieren.</p>

<p>Es gibt nicht nur den Event-Handler <tt>onClick=</tt>, sondern viele weitere. Wenn Sie beispielsweise im einleitenden <tt>&lt;body&gt;</tt>-Tag die Anweisung <tt>onkeydown=&quot;alert(window.event.keyCode)&quot;</tt> notieren, wird bei jedem Dr&uuml;cken einer Taste deren Zeichenwert in dezimaler Form ausgegeben. Denn in der Eigenschaft <tt>keyCode</tt> des Event-Objekts wird der Tastaturwert festgehalten, sobald der Anwender eine Taste dr&uuml;ckt.</p>

<h3 class="inf">Beachten Sie:</h3>

<p>Microsoft stellt zum event-abh&auml;ngigen Ausf&uuml;hren von Scripts noch eine spezielle Syntax bereit, die Sie ebenfalls verwenden k&ouml;nnen:</p>

<pre>&lt;script for=document event=&quot;onkeydown()&quot; language=&quot;JScript&quot;&gt;
 if(event.keyCode == 32) window.location.href=&quot;datei2.htm&quot;;
&lt;/script&gt;</pre>

<p>Mit einer solchen Anweisung im einleitenden Script-Tag wird das Script nur dann ausgef&uuml;hrt, wenn das angegebene Ereignis (Event) eintritt. In dem Beispiel wird bewirkt, da&szlig; der Browser beim Dr&uuml;cken der Leertaste (sie hat den Tastaturcode 32) zu einer anderen Datei springt.</p>


<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a6"><img src="xmsie4.gif" width=30 height=30 border=0 alt="MS IE 4.0"> Vererbung bei Events (Event-Bubbling)</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tfbaf.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Anwenderereignisse (Events) w&auml;hrend der Anzeige einer WWW-Seite werden im MS Internet Explorer von &quot;innen nach au&szlig;en vererbt&quot;. Wenn der Anwender beispielsweise auf einen mit <tt>&lt;b&gt;</tt>...<tt>&lt;/b&gt;</tt> als fett ausgezeichneten Text innerhalb eines mit <tt>&lt;p&gt;</tt>...<tt>&lt;/p&gt;</tt> definierten Textabsatzes klickt, betrifft der Mausklick zun&auml;chst nur den fetten Text. Angenommen, der Textabsatz enth&auml;lt im einleitenden <tt>&lt;p&gt;</tt>-Tag einen Event-Handler <tt>onClick=</tt>, so w&uuml;rde dieser nicht aktiv, da der Mausklick ja nur den als fett markierten Text innerhalb des Absatzes betrifft. Da das <tt>&lt;b&gt;</tt>-Tag keinen Event-Handler enth&auml;lt, w&uuml;rde der Mausklick unbemerkt bleiben, obwohl er innerhalb des Textabsatzes stattfand, der f&uuml;r den Fall eines Mausklicks einen Event-Handler enth&auml;lt. Der Bubble-Effekt (w&ouml;rtlich: <i>Blaseneffekt</i>) bewirkt, da&szlig; das Ereignis (der Mausklick) zum jeweils n&auml;chsth&ouml;heren Element im Elementenbaum der HTML-Datei weitergegeben wird. Auf diese Weise gelangt das Ereignis zu dem <tt>&lt;p&gt;</tt>-Tag, das den Event verarbeitet. W&uuml;rde das <tt>&lt;p&gt;</tt>-Tag auch keinen Event-Handler <tt>onClick=</tt> enthalten, so w&uuml;rde der Bubble-Effekt das Ereignis an das n&auml;chsth&ouml;here Element weitergeben, also z.B. an ein <tt>&lt;div&gt;</tt>-Tag, innerhalb dessen sich der Textabsatz befindet, oder an das <tt>&lt;body&gt;</tt>-Tag. Wenn nirgendwo ein Event-Handler notiert ist, der auf den Mausklick reagiert, passiert einfach nichts.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;script language=&quot;JScript&quot;&gt;
&lt;!--
 function Handle_Click()
 {
  document.all.Info.innerHTML = &quot;Der Bereich, auf den Sie geklickt haben,
  ist mit &amp;lt;&quot; + window.event.srcElement.tagName + &quot;&amp;gt;
  ausgezeichnet und hat die id &lt;i&gt;&quot; + window.event.srcElement.id +
  &quot;&lt;/i&gt;. Der Event wurde jedoch bis ans body-Tag durchgereicht.&quot;;
 }
// --&gt;
&lt;/script&gt;
&lt;/head&gt;
&lt;body bgcolor=#FFFFFF onClick=&quot;Handle_Click()&quot;&gt;
&lt;div id=&quot;Inhalt&quot;&gt;
Ein wenig Text. Klicken Sie hinein, wenn Sie wollen
&lt;p id=&quot;Text_1&quot;&gt;Ein &lt;i id=&quot;i_Text&quot;&gt;Textabsatz&lt;/i&gt;. Klicken Sie hinein&lt;/p&gt;
&lt;p id=&quot;Text_2&quot;&gt;Ein &lt;u id=&quot;u_Text&quot;&gt;anderer Textabsatz&lt;/u&gt;. Klicken Sie hinein&lt;/p&gt;
&lt;p id=&quot;Text_3&quot;&gt;Noch ein &lt;b id=id=&quot;b_Text&quot;&gt;Textabsatz&lt;/b&gt;. Klicken Sie hinein&lt;/p&gt;
&lt;p id=&quot;Text_4&quot;&gt;Ein letzter &lt;tt id=&quot;tt_Text&quot;&gt;Textabsatz&lt;/tt&gt;. Klicken Sie hinein&lt;/p&gt;
&lt;/div&gt;
&lt;p id=&quot;Info&quot;&gt;Hier erscheinen Infos zum Klick&lt;/p&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Im Beispiel werden diverse Texte in verschiedenen HTML-Auszeichnungen definiert. Jedes HTML-Element erh&auml;lt dabei auch einen Namen (<tt>id=</tt>). Der unterste Textabsatz mit <tt>id=&quot;Info&quot;</tt> dient dazu, dynamisch Informationen dar&uuml;ber auszugeben, welches Element der Anwender angeklickt hat. Jedesmal, wenn der Anwender ein Element anklickt, wird die <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tebd.htm"><b>Funktion</b></a> <tt>Handle_Click()</tt> aufgerufen, die in einem JavaScript-Bereich im Dateikopf definiert ist. Jedesmal wird in dem Textabsatz &quot;Info&quot; ausgegeben, welches HTML-Tag angeklickt wurde, und welche id es hat. Eigentlich betrifft der Mausklick dabei ja nur das jeweilige Element. Keines dieser Elemente hat jedoch einen Event-Handler <tt>onClick=</tt>, der einen Mausklick abf&auml;ngt und Script-Code ausf&uuml;hrt. Da&szlig; der Script-Code trotzdem bei jedem Mausklick ausgef&uuml;hrt wird, liegt am Event-Bubbling. Der Mausklick-Event wird immer weiter &quot;nach au&szlig;en&quot; gegeben und landet schlie&szlig;lich beim <tt>&lt;body&gt;</tt>-Tag, das einen Event-Handler <tt>onClick=</tt> enth&auml;lt.</p>

<p>Der Bubble-Effekt l&auml;&szlig;t sich auch ausschalten, falls er nicht erw&uuml;nscht ist. Dazu m&uuml;ssen Sie in einem JScript/JavaScript-Bereich die Anweisung notieren:<br>
<tt>window.event.cancelBubble = true;</tt></p>





<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tfbb.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#ffffff><img src="x3.gif" width=15 height=10 border=0> <a href="tfbb.htm"><b>Datenanbindung (Microsoft)</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tfa.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#ffffff width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tfa.htm"><b>Allgemeines zu Dynamischem HTML</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tf.htm"><b>Dynamisches HTML</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tfb.htm"><b>Die Ans&auml;tze von Microsoft und Netscape</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>