<html>
<head>
<title>SELFHTML: Dynamisches HTML /  Ans&auml;tze / Datenanbindung (Microsoft)</title>
<meta name="description" content="(SELFHTML 7.0) Die Bestandteile, die man kennen mu&szlig;, um Dynamisches HTML f&uuml;r den MS Internet Explorer ab 4.x zu schreiben">
<meta name="keywords" content="SELFHTML, Dynamisches HTML, Dynamic, Microsoft, Internet Explorer">
<link rel=stylesheet type="text/css" href="wselfhtm.css">
</head>
<body bgcolor=#ffffff text=#000000 link=#aa5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tf.htm"><b>Dynamisches HTML</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tfb.htm"><b>Die Ans&auml;tze von Microsoft und Netscape</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Datenanbindung (Microsoft)</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#ffffff valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Allgemeines zur Datenanbindung</b></a> <br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Beispiel: Datei dynamisch in Tabelle einbinden</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>Beispiel: Daten durchsuchbar machen</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a4"><b>HTML-Tags f&uuml;r die Anzeige von externen Daten</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a5"><b>Datenmodell: Tabular Data Control (TDC)</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a6"><b>Datenmodell: Remote Data Service (RDS)</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a7"><b>Datenmodell: JDBC DataSource Applet</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a8"><b>Datenmodell: XML Data Source</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a9"><b>Datenmodell: MSHTML Data Source</b></a>
</p>


</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="a1"><img src="xmsie4.gif" width=30 height=30 border=0 alt="MS IE 4.0"> Allgemeines zur Datenanbindung</a></h2>

<p>Der MS Internet Explorer 4.x erlaubt es, in kontrollierter Form Daten aus einer externen Datenquelle zu holen und in HTML-Elementen dynamisch anzuzeigen. So ist beispielsweise eine Tabelle denkbar, in der sich der Anwender bei jedem Klick auf einen entsprechenden Button die Bundesliga-Endtabellen der Spielsaisons von 1960 bis heute anzeigen lassen kann. Bei jedem Klick werden aus einer externen Datei eine Reihe von Daten ausgelesen und dynamisch in die Anzeigetabelle &uuml;bernommen.</p>

<p>Microsoft hat das Konzept der Datenanbindung sehr flexibel ausgelegt. Es gibt diverse M&ouml;glichkeiten, auf externe Datenquellen zuzugreifen. Der Zugriff auf eine einfache Textdatei ist nur eine davon. Es besteht ebenso die M&ouml;glichkeit, etwa &uuml;ber die Datenbankabfragesprache SQL auf eine Datenbank zuzugreifen, die SQL-Befehle verarbeiten kann. F&uuml;r die verschiedenen M&ouml;glichkeiten der Datenanbingung gibt es verschiedene <b>Datenmodelle</b>. F&uuml;r jedes der Datenmodelle gibt es ein bestimmtes ActiveX-Control oder ein Java-Applet, das Sie in Ihrer HTML-Datei ansprechen m&uuml;ssen, um die Datenanbindung damit zu realisieren. Die Datenmodelle und deren Einbindung in HTML werden auf dieser Seite vorgestellt.</p>

<p>Die Vorteile der Datenanbindung liegen auf der Hand: Daten k&ouml;nnen mit einer daf&uuml;r geeigneten Anwendung gepflegt und gespeichert werden. Eine HTML-Datei kann auf immer aktuelle Daten zugreifen, ohne selbst ge&auml;ndert werden zu m&uuml;ssen. F&uuml;r das &quot;Holen&quot; der Daten gibt es kein vorgeschriebenes Protokoll. Die Datenanbindung funktioniert also auf allen Umgebungen, ob auf einem WWW-Server, lokal auf einer PC-Festplatte oder auf einer CD-ROM (zumindest auf das einfachste Datenmodell trifft dies zu). Es ist kein zus&auml;tzliches CGI-Script erforderlich, da&szlig; als Vermittler zwischen HTML-Datei und Datenbestand f&uuml;r jede Interaktion zwischen Anwender und Datenbank immer wieder aufgerufen werden mu&szlig;. Das Know How hat der Browser, und die Steuerung der Datenanbindung wird direkt in der HTML-Datei notiert. Durch dynamisches Austauschen der Inhalte von HTML-Elementen, in denen die Daten angezeigt werden, ist kein neuer Aufbau der WWW-Seite erforderlich.</p>

<h3 class="rem">Hinweis:</h3>

<p>Die Erl&auml;uterungen zu den Datenmodellen weiter unten auf dieser Seite sind zum Teil sehr technisch. Das ist leider nicht zu &auml;ndern, da die Materie ziemlich komplex ist. Die Erl&auml;uterungen zu den Datenmodellen richten sich auch nur an Spezialisten, die wissen, was mit den entsprechenden Begriffen anzufangen ist.</p>


<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2"><img src="xmsie4.gif" width=30 height=30 border=0 alt="MS IE4.0"> Beispiel: Datei dynamisch in Tabelle einbinden</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tfbba.htm"><b>Anzeigebeispiel: So sieht's aus</b></a><br>

<p>Die hier beschriebene Vorgehensweise erl&auml;utert, wie Sie in einer Tabelle einzelne Datens&auml;tze aus einer externen Textdatei anzeigen k&ouml;nnen. Dabei wird das <img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a4"><b>Datenmodell: Tabular Data Control (TDC)</b></a> verwendet. Mit Hilfe von Buttons kann der Anwender den n&auml;chsten oder vorhergehenden Datensatz in die Tabelle laden.</p>

<h3 class="xmp">Beispiel Teil 1 (externe Datei mit Daten):</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
Name|Vorname|Strasse|PLZ|Ort|Tel|EMail
Berger|Hans|Pfisterstr.11|38487|Grubenhausen|04987-4445631|berger@kabumm.de
Heidenfroh|Martina|Mittelweg 123|43985|Hatzenau|04583-2398474|mh@heidenfroh.com
Rauhbein|Eberhard|Traumstr.13|56097|H&ouml;llenbachhausen|068347-582374|-
Truthahn|Gerlinde|Aufplatz 1|93722|S&uuml;ndenstadt|032987-385750|gerlinde@metawelt.net
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Die externe Datei ist in diesem Beispiel eine einfache Textdatei, z.B. eine Datei mit dem Namen <tt>daten.txt</tt>. Die Datei ist so aufgebaut, da&szlig; jede Zeile einen Datensatz darstellt. Die einzelnen Felder eines Datensatzes werden in diesem Beispiel durch das Zeichen &quot;<tt>|</tt>&quot; getrennt. Es k&ouml;nnte auch ein anderes Zeichen sein. Das Zeichen &quot;<tt>|</tt>&quot; wurde hier gew&auml;hlt, weil es sehr selten ist und in den Daten selbst nicht vorkommt. In der ersten Zeile der Datei stehen keine Daten, sondern Feldnamen. Der dritte Feldname lautet beispielsweise <tt>Strasse</tt>. In den eigentlichen Datenzeilen darunter stehen dann in entsprechender Reihenfolge die Daten. So hat das dritte Feld der ersten Datenzeile den Wert <tt>Pfisterstr.11</tt>. Dies ist also ein Wert f&uuml;r den in der ersten Zeile an dritter Stelle vergebenen Feldnamen <tt>Strasse</tt>.</p>

<p>Textdateien dieser Art sind nicht besonders komfortabel, wenn man sie selbst in einem Texteditor bearbeiten will. Doch solche Textdateien lassen sich mit fast allen Tabellenkalkulations- und Datenbankprogrammen erzeugen. Meist ist daf&uuml;r der Datentyp &quot;kommabegrenzt&quot; (&quot;comma delimited&quot;) mit der Standard-Dateiendung <tt>.csv</tt> vorgesehen. Bessere Programme erlauben es dabei auch, ein selbst definierbares Feldbegrenzerzeichen zu vergeben.</p>

<h3 class="xmp">Beispiel Teil 2 (HTML-Datei mit Datenzugriff):</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;/head&gt;
&lt;body&gt;
&lt;object id=&quot;Adressen&quot; classid=&quot;clsid:333C7BC4-460F-11D0-BC04-0080C7055A83&quot;&gt;
 &lt;param name=&quot;DataURL&quot; value=&quot;daten.txt&quot;&gt;
 &lt;param name=&quot;UseHeader&quot; value=&quot;true&quot;&gt;
 &lt;param name=&quot;FieldDelim&quot; value=&quot;|&quot;&gt;
&lt;/object&gt;
&lt;form&gt;&lt;table id=&quot;Anzeigetabelle&quot; datasrc=&quot;#Adressen&quot; datapagesize=1 width=100%&gt;
&lt;colgroup&gt;
&lt;col width=200&gt;
&lt;col&gt;
&lt;tr&gt;
&lt;td bgcolor=&quot;#EEEEEE&quot;&gt;&#160;&lt;/td&gt;
&lt;td bgcolor=#EEEEEE align=right&gt;
&lt;input type=button value=&quot; &amp;lt; &quot; 
onclick=&quot;document.all.Anzeigetabelle.previousPage();&quot;&gt;
&lt;input type=button value=&quot; &amp;gt; &quot; 
onclick=&quot;document.all.Anzeigetabelle.nextPage();&quot;&gt;
&lt;/td&gt;
&lt;/tr&gt;&lt;tr&gt;
&lt;td bgcolor=#EEEEEE valign=top&gt;&lt;b&gt;Name:&lt;/b&gt;&lt;/td&gt;
&lt;td bgcolor=#FFFFE0 valign=top&gt;&lt;span datafld=&quot;Name&quot;&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;&lt;tr&gt;
&lt;td bgcolor=#EEEEEE valign=top&gt;&lt;b&gt;Vorname:&lt;/b&gt;&lt;/td&gt;
&lt;td bgcolor=#FFFFE0 valign=top&gt;&lt;span datafld=&quot;Vorname&quot;&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;&lt;tr&gt;
&lt;td bgcolor=#EEEEEE valign=top&gt;&lt;b&gt;Stra&amp;szlig;e:&lt;/b&gt;&lt;/td&gt;
&lt;td bgcolor=#FFFFE0 valign=top&gt;&lt;span datafld=&quot;Strasse&quot;&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;&lt;tr&gt;
&lt;td bgcolor=#EEEEEE valign=top&gt;&lt;b&gt;Postleitzahl:&lt;/b&gt;&lt;/td&gt;
&lt;td bgcolor=#FFFFE0 valign=top&gt;&lt;span datafld=&quot;PLZ&quot;&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;&lt;tr&gt;
&lt;td bgcolor=#EEEEEE valign=top&gt;&lt;b&gt;Wohnort:&lt;/b&gt;&lt;/td&gt;
&lt;td bgcolor=#FFFFE0 valign=top&gt;&lt;span datafld=&quot;Ort&quot;&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;&lt;tr&gt;
&lt;td bgcolor=#EEEEEE valign=top&gt;&lt;b&gt;Telefon:&lt;/b&gt;&lt;/td&gt;
&lt;td bgcolor=#FFFFE0 valign=top&gt;&lt;span datafld=&quot;Tel&quot;&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;&lt;tr&gt;
&lt;td bgcolor=#EEEEEE valign=top&gt;&lt;b&gt;E-Mail:&lt;/b&gt;&lt;/td&gt;
&lt;td bgcolor=#FFFFE0 valign=top&gt;&lt;span datafld=&quot;EMail&quot;&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;&lt;/table&gt;&lt;/form&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>


<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Um eine externe Datenquelle in einer HTML-Datei nutzen zu k&ouml;nnen, m&uuml;ssen Sie zun&auml;chst die Quelle und diverse Angaben zu deren Aufbau notieren. Dazu brauchen Sie das <tt>&lt;object&gt;</tt>-Tag. In dem einleitenden <tt>&lt;object&gt;</tt>-Tag sind zwei Attribute erforderlich: Mit der Angabe <tt>id=</tt> vergeben Sie einen Namen, unter dem Sie sp&auml;ter auf die Daten zugreifen k&ouml;nnen. Der Name sollte passend sein, im obigen Beispiel etwa <tt>&quot;Adressen&quot;</tt>. Als zweiten Parameter m&uuml;ssen Sie das ActiveX-Control referenzieren, da&szlig; den gesamten Zugriff auf die externe Datei abwickelt. Bei einfachen Textdateien mit zeilenweisen Datens&auml;tzen m&uuml;ssen Sie dabei immer die Angabe <tt>classid=&quot;clsid:333C7BC4-460F-11D0-BC04-0080C7055A83&quot;</tt> notieren. Das ActiveX-Control mit dieser Identifikationsnummer ist im Lieferumfang des MS Internet Explorers ab Version 4.x enthalten - Sie brauchen sich um nichts weiter zu k&uuml;mmern. Genau dabei liegt allerdings der Knackpunkt des gesamten Konzepts: ohne solche ActiveX-Controls l&auml;uft nichts.</p>

<p>Innerhalb des <tt>&lt;object&gt;</tt>-Tags notieren Sie Angaben zu Ort und Beschaffenheit der externen Datei.<br>
Mit <tt>&lt;param name=&quot;DataURL&quot;</tt> k&ouml;nnen Sie die gew&uuml;nschte Datei ansprechen. Hinter <tt>value=</tt> notieren Sie den Dateinamen. Wenn sich die Datei im gleichen Verzeichnis befindet, gen&uuml;gt der einfache Dateiname. Ansonsten gelten die gleichen Regeln wie bei <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcfa.htm#a2"><b>Verweisen in HTML</b></a>.<br>
Mit <tt>&lt;param name=&quot;UseHeader&quot; value=&quot;true&quot;&gt;</tt> weisen Sie den Browser an, die erste Zeile der externen Datei nicht als Datenzeile zu interpretieren, sondern als Zeile f&uuml;r die Definition der Feldnamen.<br>
Mit <tt>&lt;param name=&quot;FieldDelim&quot;</tt> geben Sie an, welches das Feldtrennzeichen sein soll. Im Beispiel ist dies das Zeichen <tt>&quot;|&quot;</tt>.</p>

<p>Damit sind alle Voraussetzungen geschaffen, um die Daten aus der externen Datei dynamisch in HTML anzuzeigen. Die Anzeige der Daten erfolgt in einer Tabelle. Das einleitende <tt>&lt;table&gt;</tt>-Tag schafft die n&ouml;tigen Voraussetzungen, um die Daten in kontrollierter Form anzuzeigen. Zun&auml;chst wird in der Tabelle mit <tt>id=</tt> ein Name vergeben (im Beispiel: <tt>Anzeigetabelle</tt>). Dieser Name wird bei den Buttons ben&ouml;tigt, die innerhalb der Tabelle das Bl&auml;ttern innerhalb der Datens&auml;tze erm&ouml;glichen.</p>

<p>Die n&auml;chste Angabe im <tt>&lt;table&gt;</tt>-Tag ist <tt>datasrc=</tt> (<i>data source, Datenquelle</i>). Damit nehmen Sie Bezug auf die externe Datendatei. An dieser Stelle d&uuml;rfen Sie jedoch nicht die Datendatei selbst angeben, sondern Sie m&uuml;ssen denjenigen Namen angeben, den Sie zuvor im <tt>&lt;object&gt;</tt>-Tag bei <tt>id=</tt> vergeben haben. Und zwar mit einem vorangestellten Gatterzeichen <tt>#</tt>. Dadurch stellen Sie den Bezug zwischen Tabelle und Datenquelle her. Es werden dann alle Parameter ber&uuml;cksichtigt, die Sie innerhalb des <tt>&lt;object&gt;</tt>-Tags angegeben haben.</p>

<p>Ebenfalls wichtig ist die Angabe <tt>datapagesize=</tt> (<i>Datenseitengr&ouml;&szlig;e</i>) im <tt>&lt;table&gt;</tt>-Tag. Damit geben Sie an, wie viele Datens&auml;tze aus der externen Datei gleichzeitig angezeigt werden sollen. Wenn Sie diese Angabe weglassen, macht der MS Internet Explorer die Tabelle automatisch so lang, da&szlig; alle Datens&auml;tze auf einmal darin dargestellt werden. Im obigen Beispiel wird <tt>datapagesize=1</tt> angegeben. Dadurch wird immer genau ein Datensatz angezeigt.</p>

<p>Innerhalb der Tabelle k&ouml;nnen Sie erkennen, wie ein Datensatz aus der externen Datenquelle darin angezeigt wird. Die Tabelle selbst k&ouml;nnen Sie nach Ihren W&uuml;nschen frei gestalten. Wichtig ist nur zu wissen, wie der Bezug zu einem Datensatz der externen Datei hergestellt wird. Im obigen Beispiel geschieht dies innerhalb entsprechender Tabellenzellen mit Hilfe des <tt>&lt;span&gt;</tt>-Tags. Mit einem, Befehl wie <tt>&lt;span datafld=&quot;PLZ&quot;&gt;&lt;/span&gt;</tt> weisen Sie den Browser an, in der betreffenden Tabellenzelle den aktuellen Inhalt des Feldes <tt>&quot;PLZ&quot;</tt> aus der externen Datenquelle anzuzeigen (<i>datafld = data field = Datenfeld</i>). Dabei mu&szlig; der Wert, den Sie hinter der Angabe <tt>datafld=</tt> notieren, mit dem Feldnamen &uuml;bereinstimmen, den Sie in der ersten Zeile der externen Datendatei vergeben haben. Beachten Sie dabei auch die exakte Schreibweise.</p>

<p>Neben der Angabe <tt>datafld=</tt> k&ouml;nnen Sie in so einem Datenanzeigebereich auch noch die Angabe <tt>dataformatas=</tt> (<i>formatiere Daten als</i>) notieren. Im obigen Beispiel wird davon kein Gebrauch gemacht. Benutzen Sie <tt>dataformatas=</tt>, Wenn die Daten in der externen Datei selbst HTML-Tags enthalten. Mit <tt>dataformatas=&quot;html&quot;</tt> erzwingen Sie dann, da&szlig; die Tags aus der externen Datei als HTML-Tags interpretiert werden.</p>

<p>Da im obigen Beispiel mit <tt>datapagesize=1</tt> festgelegt wurde, da&szlig; immer nur ein Datensatz angezeigt wird, erscheint in der Tabelle zun&auml;chst der Inhalt der ersten Datenzeile der externen Datei. Nat&uuml;rlich soll der Anwender nun in den Datens&auml;tzen bl&auml;ttern k&ouml;nnen. Dazu werden Buttons zum Vor- und Zur&uuml;ckbl&auml;ttern definiert. Im Beispiel befinden sich diese Buttons in der ersten Tabellenzeile. Sie k&ouml;nnten aber auch an einer anderen Stelle stehen.</p>

<p>Mit <tt>&lt;input type=button value=&quot; &amp;lt; &quot;
onclick=&quot;document.all.Anzeigetabelle.previousPage();&quot;&gt;</tt> wird ein Button definiert, bei dessen Anklicken der vorhergehende Datensatz aufgerufen wird. Mit <tt>document.all.Anzeigetabelle</tt> greifen Sie dabei auf die Tabelle zu, in der die Daten angezeigt werden (<tt>Anzeigetabelle</tt> ist dabei der Name, der in der Tabelle mit <tt>id=</tt> vergeben wurde). Mit <tt>&lt;input type=button value=&quot; &amp;gt; &quot;
onclick=&quot;document.all.Anzeigetabelle.nextPage();&quot;&gt;</tt> wird der Button definiert, der zum n&auml;chsten Datensatz springt. Beachten Sie, da&szlig; Sie nicht kontrollieren m&uuml;ssen, ob der Anwender gerade den ersten oder letzten Datensatz anzeigt. Es gibt keine Fehlermeldungen, wenn der Anwender versucht, einen nicht vorhandenen Datensatz aufzurufen. Der Button hat dann einfach keine Wirkung.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a3"><img src="xmsie4.gif" width=30 height=30 border=0 alt="MS IE4.0"> Beispiel: Daten durchsuchbar machen</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tfbbb.htm"><b>Anzeigebeispiel: So sieht's aus</b></a><br>

<p>Das folgende Beispiel setzt auf dem <img src="xgoup.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Beispiel: Datei dynamisch in Tabelle einbinden</b></a> auf. In diesem Beispiel wird gezeigt, wie Sie dem Anwender erm&ouml;glichen k&ouml;nnen, mit Hilfe eines Suchbegriffes nur diejenigen Datens&auml;tze anzuzeigen, in denen der gesuchte Begriff vorkommt. Das Beispiel zeigt auch, wie Sie mit Hilfe von Scripts auf die HTML-Elemente zur Datenanbindung zugreifen k&ouml;nnen.</p>

<h3 class="xmp">Beispiel (HTML-Datei mit Datenzugriff):</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;script language=&quot;JScript&quot;&gt;
function Suchen()
{
 var max = 500;
 document.all.Anzeige.style.display = &quot;none&quot;; 
 var Suchausdruck = &quot;&quot;;
 var Suchbegriffe = 0;
 if(document.Eingabe.SuchName.value != &quot;&quot;)
  {
   if(Suchbegriffe &gt; 0)
     Suchausdruck = Suchausdruck + &quot; &amp; Name = &quot; + document.Eingabe.SuchName.value;
   else 
     Suchausdruck = Suchausdruck + &quot;Name = &quot; + document.Eingabe.SuchName.value;
   Suchbegriffe++;
  }
 if(document.Eingabe.SuchVorname.value != &quot;&quot;)
  {
   if(Suchbegriffe &gt; 0)
     Suchausdruck = Suchausdruck + &quot; &amp; Vorname = &quot; + document.Eingabe.SuchVorname.value;
   else 
     Suchausdruck = Suchausdruck + &quot;Vorname = &quot; + document.Eingabe.SuchVorname.value;
   Suchbegriffe++;
  }
 document.all.Adressen.object.Filter = Suchausdruck;
 document.all.Adressen.Reset();
 document.all.Anzeige.dataSrc = &quot;#Adressen&quot;;
 if(document.all.Adressen.recordset.recordCount &lt; max)
  {
   document.all.Anzeige.dataPageSize = Adressen.recordset.recordCount;
   document.all.Treffer.innerText = Adressen.recordset.recordCount + &quot; Suchtreffer!&quot;;
   document.all.Anzeige.style.display = &quot;block&quot;; 
  } 
 else 
   document.all.Treffer.innerText = &quot;0 oder zu viele Suchtreffer!&quot;;
}
&lt;/script&gt;
&lt;/head&gt;
&lt;body&gt;
&lt;object id=&quot;Adressen&quot; classid=&quot;clsid:333C7BC4-460F-11D0-BC04-0080C7055A83&quot;&gt;
 &lt;param name=&quot;DataURL&quot; value=&quot;daten.txt&quot;&gt;
 &lt;param name=&quot;UseHeader&quot; value=&quot;true&quot;&gt;
 &lt;param name=&quot;FieldDelim&quot; value=&quot;|&quot;&gt;
 &lt;param name=&quot;Filter&quot; value=&quot;&quot;&gt;
&lt;/object&gt;
&lt;form name=&quot;Eingabe&quot;&gt;
Suche nach:&lt;br&gt;
&lt;input name=&quot;SuchName&quot; type=&quot;text&quot; width=40&gt; (Name)&lt;br&gt;
&lt;input name=&quot;SuchVorname&quot; type=&quot;text&quot; width=40&gt; (Vorname)&lt;br&gt;
&lt;input type=&quot;button&quot; style=&quot;width:150px; height:25px;&quot; value=&quot;Suche starten&quot; onClick=&quot;Suchen()&quot;&gt;
&lt;/form&gt;
&lt;span id=&quot;Treffer&quot; style=&quot;color:#0000FF; font-weight:bold;&quot;&gt;&lt;/span&gt;
&lt;table width=98%&gt;
&lt;tr&gt;
&lt;td bgcolor=&quot;#EEEEEE&quot; width=14%&gt;&lt;b&gt;Name&lt;/b&gt;&lt;/td&gt;
&lt;td bgcolor=&quot;#EEEEEE&quot; width=14%&gt;&lt;b&gt;Vorname&lt;/b&gt;&lt;/td&gt;
&lt;td bgcolor=&quot;#EEEEEE&quot; width=14%&gt;&lt;b&gt;Strasse&lt;/b&gt;&lt;/td&gt;
&lt;td bgcolor=&quot;#EEEEEE&quot; width=14%&gt;&lt;b&gt;PLZ&lt;/b&gt;&lt;/td&gt;
&lt;td bgcolor=&quot;#EEEEEE&quot; width=14%&gt;&lt;b&gt;Ort&lt;/b&gt;&lt;/td&gt;
&lt;td bgcolor=&quot;#EEEEEE&quot; width=14%&gt;&lt;b&gt;Telefon&lt;/b&gt;&lt;/td&gt;
&lt;td bgcolor=&quot;#EEEEEE&quot; width=14%&gt;&lt;b&gt;E-Mail&lt;/b&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/table&gt;
&lt;table id=&quot;Anzeige&quot; style=&quot;display:none&quot; width=98%&gt;
&lt;tr&gt;
&lt;td bgcolor=&quot;#FFFFE0&quot; width=14%&gt;&lt;span datafld=&quot;Name&quot;&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td bgcolor=&quot;#FFFFE0&quot; width=14%&gt;&lt;span datafld=&quot;Vorname&quot;&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td bgcolor=&quot;#FFFFE0&quot; width=14%&gt;&lt;span datafld=&quot;Strasse&quot;&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td bgcolor=&quot;#FFFFE0&quot; width=14%&gt;&lt;span datafld=&quot;PLZ&quot;&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td bgcolor=&quot;#FFFFE0&quot; width=14%&gt;&lt;span datafld=&quot;Ort&quot;&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td bgcolor=&quot;#FFFFE0&quot; width=14%&gt;&lt;span datafld=&quot;Telefon&quot;&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td bgcolor=&quot;#FFFFE0&quot; width=14%&gt;&lt;span datafld=&quot;EMail&quot;&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;&lt;/table&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Das Beispiel zeigt die vollst&auml;ndige HTML-Datei zur Realisierung einer durchsuchbaren Datenbank. Quelle ist dabei die Textdatei, in der Adressen gesammelt werden. Es handelt sich um die gleiche angenommene Datei wie im <img src="xgoup.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Beispiel: Datei dynamisch in Tabelle einbinden</b></a>. Innerhalb der HTML-Datei wird auch wieder das gleiche <tt>&lt;object&gt;</tt>-Tag notiert, um die Verbindung zu der externen Datendatei herzustellen. Es wird jedoch ein neuer Parameter angegeben:<br>
<tt> &lt;param name=&quot;Filter&quot; value=&quot;&quot;&gt;</tt><br>
Mit dem Parameter <tt>Filter</tt> k&ouml;nnen Sie die Datens&auml;tze, die aus der Datendatei &quot;geholt&quot; werden, begrenzen. Dazu k&ouml;nnen Sie bei <tt>value=</tt> Einschr&auml;nkungskriterien angeben. Bei der Objektdefinition im obigen Beispiel wird <tt>value=&quot;&quot;</tt> notiert. Das bedeutet, es gibt keine Einschr&auml;nkungen. Alle Datens&auml;tze werden gefunden.</p>

<p>In dem l&auml;ngeren Script, das im Kopf der HTML-Datei steht, wird der Wert f&uuml;r <tt>Filter</tt> dynamisch ver&auml;ndert. Dadurch wird die Anzeige auf bestimmte Datens&auml;tze eingeschr&auml;nkt, n&auml;mlich solche, die den Filterkriterien entsprechen.</p>

<p>Die Kriterien f&uuml;r den Filter soll der Anwender durch seine Suchanfrage selbst bestimmen k&ouml;nnen. Im obigen Beispiel wird dazu unterhalb des <tt>&lt;object&gt;</tt>-Tags ein Formular definiert (<tt>&lt;form name=&quot;Eingabe&quot;&gt;</tt>). Das Formular hat zwei Eingabefelder, eines zum Angeben eines Namens, und eines zur Eingabe eines Vornamens. Sie k&ouml;nnten an dieser Stelle nat&uuml;rlich auch f&uuml;r alle Felder eines Datensatzes ein Eingabefeld spendieren, im Beispiel etwa f&uuml;r Strasse, PLZ, Ort, Telefon und E-Mail. Die Felder wurden im Beispiel nur der Einfachheit halber weggelassen. Der Anwender kann eines oder auch beide Felder ausf&uuml;llen. Mit einem anklickbaren Button kann er die Suche abschicken. Beim Anklicken des Buttons wird die Funktion <tt>Suchen()</tt>  aufgerufen, die in dem JScript-Bereich im Dateikopf definiert ist (<tt>onClick=&quot;Suchen()&quot;</tt>). </p>

<p>Innerhalb der Funktion <tt>Suchen()</tt> wird zun&auml;chst eine Variable <tt>max</tt> mit einem Wert vorbelegt (500). Das empfiehlt sich bei gr&ouml;&szlig;eren Datenbest&auml;nden. Denn per Voreinstellung liefert der MS Internet Explorer, wenn er keine Datens&auml;tze findet, die dem Suchkriterium entsprechen, alle Datens&auml;tze zur&uuml;ck. Angenommen, Sie haben 5000 Datens&auml;tze. Dann w&uuml;rde eine Tabelle mit 5000 Zeilen angezeigt. Da dies im Aufbau unzumutbar lange dauert, ist eine Begrenzung sinnvoll.</p>

<p>Die Variable <tt>Suchausdruck</tt> soll die Anwenderkriterien zum Durchsuchen des Datenbestandes aufnehmen. Dabei ist es erforderlich, die Angaben aus den Formularfeldern in eine Zeichenkette zu konvertieren, die den Regeln f&uuml;r den Parameter <tt>Filter</tt> entsprechen.</p>

<p>Folgende wichtige Regeln gelten f&uuml;r Werte, die bei <tt>Filter</tt> erlaubt sind (diese Regeln gelten sowohl bei Wertzuweisungen innerhalb des <tt>&lt;object&gt;</tt>-Tags als auch bei dynamischen Wertzuweisungen innerhalb von Scripts):<br>
Mit <tt>Feldname = Wert</tt> werden nur Datens&auml;tze gefunden, bei denen das Feld <tt>Feldname</tt> exakt den Wert <tt>Wert</tt> enth&auml;lt und nicht mehr und nicht weniger. Bei <tt>Name = Meyer</tt> werden also nur Meyer's gefunden, keine Meyerbohm's.<br>
Mit <tt>Feldname &lt;&gt; Wert</tt> werden Datens&auml;tze gefunden, bei denen der Wert <tt>Wert</tt> im Feld <tt>Feldname</tt> vorkommt - er kann auch exakt damit &uuml;bereinstimmen. Bei <tt>Name &lt;&gt; Meyer</tt> werden also Meyer's und Meyerbohm's gefunden.<br>
Mit <tt>Feldname &gt; Wert</tt> werden Datens&auml;tze gefunden, bei denen der Wert von <tt>Feldname</tt> gr&ouml;&szlig;er ist als <tt>Wert</tt>. Bei <tt>Name &gt; Y</tt> werden also nur Namen gefunden, die mit Z anfangen.<br>
Mit <tt>Feldname &gt;= Wert</tt> werden Datens&auml;tze gefunden, bei denen der Wert von <tt>Feldname</tt> gr&ouml;&szlig;er oder gleich ist im Vergleich zu  <tt>Wert</tt>.  Bei <tt>Name &gt;= Y</tt> werden also nur Namen gefunden, die mit Y oder Z anfangen.<br>
Mit <tt>Feldname &lt; Wert</tt> werden Datens&auml;tze gefunden, bei denen der Wert von <tt>Feldname</tt> kleiner ist als <tt>Wert</tt>. Bei <tt>Name &lt; D</tt> werden also nur Namen gefunden, die mit A,B oder C anfangen.<br>
Mit <tt>Feldname &lt;= Wert</tt> werden Datens&auml;tze gefunden, bei denen der Wert von <tt>Feldname</tt> kleiner oder gleich ist im Vergleich zu  <tt>Wert</tt>.  Bei <tt>Name &lt;= D</tt> werden also Namen gefunden, die mit A,B,C oder D anfangen.<br>
An jeder Stelle ist ein Platzhalterzeichen erlaubt. Dies ist ein Sternzeichen (<tt>*</tt>). Es steht f&uuml;r kein, eines oder beliebig viele Zeichen.<br>
Sie k&ouml;nnen auch zwei oder mehrere solcher einfachen Ausdr&uuml;cke mit den Zeichen <tt>&amp;</tt> (f&uuml;r UND) oder <tt>|</tt> (f&uuml;r inklusives ODER) logisch verkn&uuml;pfen. Wenn Sie mehrere Ausdr&uuml;cke verkn&uuml;pfen und dabei sowohl UND also auch ODER verwenden, m&uuml;ssen Sie Klammern verwenden, um eine eindeutige Bewertung des gesamten Kriteriums sicherzustellen. Ein komplexer Ausdruck dieser Art ist etwa <tt>Name &gt; M &amp; PLZ = 8*</tt>.
</p>

<p>Im obigen Script wird mit diversen if-Abfragen aus den Eingabefeldern des Formulars ein g&uuml;ltiger Zuweisungswert f&uuml;r <tt>Filter</tt> konstruiert. Dabei wird nur die einfachste Bedingung mit dem Istgleichzeiten eingesetzt. Da der Anwender auch selbst das Sternzeichen als Platzhalterzeichen in einem Eingabefeld eingeben kann, gen&uuml;gt diese einfache Suche f&uuml;r viele F&auml;lle. Wenn Sie dem Anwender komplexere Suchabfragen erm&ouml;glichen wollen, m&uuml;ssen Sie diesen Teil des Scripts entsprechend aufwendiger gestalten.</p>

<p>Im unteren Teil der Funktion Suchen() steht dann der Befehl:<br>
<tt>document.all.Adressen.object.Filter = Suchausdruck;</tt><br>
Damit wird dem Parameter <tt>Filter</tt> des <tt>&lt;object&gt;</tt>-Tags der Suchausdruck zugewiesen, der zuvor ermittelt und in der Variablen <tt>Suchausdruck</tt> gespeichert wurde.</p>

<p>Der n&auml;chste Befehl ist ebenfalls von entscheidender Bedeutung:<br>
<tt>document.all.Adressen.Reset();</tt><br>
Damit veranlassen Sie den Browser, die Anzahl der anzuzeigenden Datens&auml;tze neu zu ermitteln. Da mittlerweile ein Filter bestimmt wurde, findet der Browser nun nur noch Datens&auml;tze, die den Bedingungen des Filters entsprechen.</p>

<p>Auf die &uuml;brigen Anweisungen des Scripts und die Elemente in der HTML-Datei wird hier nicht n&auml;her eingegangen. Es handelt sich dabei um einfaches dynamisches HTML nach den Regeln des MS Internet Explorers 4.x.</p>

<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a4"><img src="xmsie4.gif" width=30 height=30 border=0 alt="MS IE4.0"> HTML-Tags f&uuml;r die Anzeige von externen Daten</a></h2>

<p>Im <img src="xgoup.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Beispiel: Datei dynamisch in Tabelle einbinden</b></a> werden die externen Daten jeweils in einem <tt>&lt;span&gt;</tt>-Tag angezeigt. Es gibt eine Reihe weiterer HTML-Tags, in denen Sie Daten aus Datenfeldern externer Datenquellen anzeigen k&ouml;nnen. In anderen als diesen Tags ist die Anzeige externer Daten nicht m&ouml;glich. Folgende HTML-Tags sind erlaubt:</p>

<h3 class="xmp">Verweise mit &lt;a&gt;...&lt;/a&gt;:</h3>

<p>Angenommen, Sie haben eine externe Textdatei <tt>verweis.txt</tt> mit folgenden Zeilen:<br>
<tt>URL,Verweistext</tt><br>
<tt>http://www.yahoo.de/,Yahoo Suchdienst</tt><br>
Diese Datei k&ouml;nnen Sie mit dem <tt>&lt;object&gt;</tt>-Tag in HTML wie folgt einbinden:<br>
<tt>&lt;object id=&quot;Verweis&quot; classid=&quot;clsid:333C7BC4-460F-11D0-BC04-0080C7055A83&quot;&gt;</tt><br>
 <tt>&lt;param name=&quot;DataURL&quot; value=&quot;verweis.txt&quot;&gt;</tt><br>
 <tt>&lt;param name=&quot;UseHeader&quot; value=&quot;true&quot;&gt;</tt><br>
 <tt>&lt;param name=&quot;FieldDelim&quot; value=&quot;,&quot;&gt;</tt><br>
<tt>&lt;/object&gt;</tt><br>
Danach k&ouml;nnen Sie folgenden Verweis konstruieren:<br>
<tt>&lt;a datasrc=&quot;#Verweis&quot; datafld=&quot;URL&quot;&gt;&lt;span datafld=&quot;Verweistext&quot;&gt;&lt;/span&gt;&lt;/a&gt;</tt><br>
Indem Sie <tt>&lt;a datafld=&gt;</tt> notieren, wird der Inhalt, den das Datenfeld liefert, als Angabe f&uuml;r <tt>href=</tt> bewertet (im Beispiel liefert das Feld <tt>&quot;URL&quot;</tt> diese Angaben). Innerhalb des Verweises wird dann mit Hilfe des <tt>&lt;span&gt;</tt>-Tags das andere Feld &quot;geholt&quot;, n&auml;mlich der Verweistext. Solche Verweise machen beispielsweise Sinn, wenn Sie den gleichen Verweis an vielen verschiedenen Stellen auf Ihren WWW-Seiten nutzen. Verweisziel und Verweistext sind dann zentral gespeichert und brauchen bei &Auml;nderungen nur in der kleinen Textdatei einmal ge&auml;ndert werden. Alle entsprechenden HTML-Verweise sind damit automatisch aktualisiert.</p>

<h3 class="xmp">Buttons mit &lt;button&gt;...&lt;/button&gt;:</h3>
Angenommen, Sie haben eine externe Textdatei <tt>daten.txt</tt> mit folgendem Aufbau und Beispieleintr&auml;gen:<br>
<tt>Zeile,Text</tt><br>
<tt>1,Das ist ein Test</tt><br>
<tt>2,mit einem Button</tt><br>
<tt>3,spannend - was?</tt><br>
Diese Datei k&ouml;nnen Sie mit dem <tt>&lt;object&gt;</tt>-Tag in HTML wie folgt einbinden:<br>
<tt>&lt;object id=&quot;Daten&quot; classid=&quot;clsid:333C7BC4-460F-11D0-BC04-0080C7055A83&quot;&gt;</tt><br>
 <tt>&lt;param name=&quot;DataURL&quot; value=&quot;daten.txt&quot;&gt;</tt><br>
 <tt>&lt;param name=&quot;UseHeader&quot; value=&quot;true&quot;&gt;</tt><br>
 <tt>&lt;param name=&quot;FieldDelim&quot; value=&quot;,&quot;&gt;</tt><br>
<tt>&lt;/object&gt;</tt><br>
Danach k&ouml;nnen Sie beispielsweise folgende Tabelle konstruieren:<br>
<tt>&lt;table &quot;id=Anzeige&quot; datasrc=&quot;#Daten&quot; datapagesize=1&gt;&lt;tr&gt;&lt;td&gt;</tt><br>
<tt>&lt;form&gt;&lt;button datafld=&quot;Text&quot; onClick=&quot;document.all.Anzeige.nextPage()&quot;&gt;&lt;/button&gt;&lt;/form&gt;</tt><br>
<tt>&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;</tt><br>
Damit springt der Anwender bei jedem Klick auf den Button einen Datensatz weiter, und die Buttonbeschriftung nimmt den aktuellen Wert des Datenfeldes <tt>Text</tt> an.</p>

<h3 class="xmp">Bereiche mit &lt;div&gt;...&lt;/div&gt;:</h3>
<p>Mit diesem HTML-Tag k&ouml;nnen Sie beispielsweise innerhalb einer Tabelle externe Daten ausgeben, genau so wie es im <img src="xgoup.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Beispiel: Datei dynamisch in Tabelle einbinden</b></a> mit dem <tt>&lt;span&gt;</tt>-Tag gemacht wird. Der Unterschied zwischen <tt>&lt;div&gt;...&lt;/div&gt;</tt> und <tt>&lt;span&gt;...&lt;/span&gt;</tt> ist, da&szlig; das <tt>&lt;div&gt;</tt>-Tag einen eigenen Absatz erzeugt, das <tt>&lt;span&gt;</tt>-Tag dagegen nicht.</p>

<h3 class="xmp"><a class="an" name="a41">Grafiken mit &lt;img&gt;:</a></h3>
<p>Angenommen, Sie wollen eine kleine Diashow programmieren. Dazu k&ouml;nnen Sie eine Textdatei <tt>daten.txt</tt> anlegen, die etwa folgenden Aufbau hat:<br>
<tt>Nummer,Bild</tt><br>
<tt>1,meinhaus.gif</tt><br>
<tt>2,meinboot.gif</tt><br>
<tt>3,meinauto.gif</tt><br>
<tt>4,undich.gif</tt><br>
Diese Datei k&ouml;nnen Sie mit dem <tt>&lt;object&gt;</tt>-Tag in HTML wie folgt einbinden:<br>
<tt>&lt;object id=&quot;Daten&quot; classid=&quot;clsid:333C7BC4-460F-11D0-BC04-0080C7055A83&quot;&gt;</tt><br>
 <tt>&lt;param name=&quot;DataURL&quot; value=&quot;daten.txt&quot;&gt;</tt><br>
 <tt>&lt;param name=&quot;UseHeader&quot; value=&quot;true&quot;&gt;</tt><br>
 <tt>&lt;param name=&quot;FieldDelim&quot; value=&quot;,&quot;&gt;</tt><br>
<tt>&lt;/object&gt;</tt><br>
Danach k&ouml;nnen Sie beispielsweise folgende Tabelle konstruieren:<br>
<tt>&lt;table &quot;id=Anzeige&quot; datasrc=&quot;#Daten&quot; datapagesize=1&gt;&lt;tr&gt;</tt><br>
<tt>&lt;td&gt;</tt><br>
<tt>Bild &lt;span datafld=&quot;Nummer&quot;&gt;&lt;/span&gt;&lt;br&gt;
&lt;input type=button value=&quot; &amp;lt; &quot;
onclick=&quot;document.all.Anzeige.previousPage();&quot;&gt;</tt><br>
<tt>&lt;input type=button value=&quot; &amp;gt; &quot;
onclick=&quot;document.all.Anzeige.nextPage();&quot;&gt;</tt><br> 
<tt>&lt;/td&gt;&lt;td&gt;</tt><br>
<tt>&lt;img datafld=&quot;Bild&quot;&gt;</tt><br>
<tt>&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;</tt><br>
Damit kann der Anwender mit den Bl&auml;tterbuttons die Bilder durchbl&auml;ttern.
</p>

<h3 class="xmp">Frames mit &lt;frame&gt;:</h3>

<p>Angenommen, Sie haben eine externe Textdatei <tt>besteseite.txt</tt> mit folgenden Zeilen:<br>
<tt>BesteSeite</tt><br>
<tt>http://www.teamone.de/selfhtml/</tt><br>
Nun k&ouml;nnen Sie folgende HTML-Datei mit einem Frameset konstruieren:<br>
<tt>&lt;html&gt;&lt;head&gt;</tt><br>
<tt>&lt;object id=&quot;UrlDerWoche&quot; classid=&quot;clsid:333C7BC4-460F-11D0-BC04-0080C7055A83&quot;&gt;</tt><br>
 <tt>&lt;param name=&quot;DataURL&quot; value=&quot;besteseite.txt&quot;&gt;</tt><br>
 <tt>&lt;param name=&quot;UseHeader&quot; value=&quot;true&quot;&gt;</tt><br>
<tt>&lt;/object&gt;&lt;/head&gt;</tt><br>
<tt>&lt;frameset rows=&quot;100,*&quot;&gt;</tt><br>
<tt>&#160;&lt;frame src=&quot;meine.htm&quot;&gt;</tt><br>
<tt>&#160;&lt;frame datasrc=&quot;#UrlDerWoche&quot; datafld=&quot;BesteSeite&quot;&gt;</tt><br>
<tt>&lt;/frameset&gt;</tt><br>
<tt>&lt;/html&gt;</tt><br>
Auf diese Weise k&ouml;nnen Sie in einem Frame-Fenster eine Seite anzeigen, deren Zieladresse Sie in der separaten Textdatei pflegen. Wichtig ist, da&szlig; Sie das <tt>&lt;object&gt;</tt>-Tag genau an der Stelle plazieren wie im Beispiel.
</p>

<h3 class="xmp">Eingebettete Frames mit &lt;iframe&gt;:</h3>

<p>Siehe das Beispiel bei Frames. Der Unterschied ist, da&szlig; Sie das <tt>&lt;object&gt;</tt>-Tag in einer normalen HTML-Datei plazieren. Mit einem Befehl wie:<br>
<tt>&#160;&lt;iframe datasrc=&quot;#UrlDerWoche&quot; datafld=&quot;BesteSeite&quot;&gt;&lt;/iframe&gt;</tt><br>
k&ouml;nnen Sie dann in der gleichen HTML-Datei in einer eingebetteten Fensterbox den Inhalt der Seite anzeigen, die in der Textdatei angegeben ist.</p>

<h3 class="xmp">Labels mit &lt;label&gt;...&lt;/label&gt;:</h3>
<p>Das <tt>&lt;label&gt;</tt>-Tag, das neu ist in HTML 4.0, erlaubt die Beschriftung eines Formularfeldes. Im Rahmen der Datenanbindung k&ouml;nnen Sie dieses HTML-Tag benutzen, wenn Sie die externen Daten in Formularfeldern ausgeben. Sie k&ouml;nnen dann dem <tt>&lt;label&gt;</tt>-Tag, das Sie etwa einem Eingabefeld zuordnen, dynamisch den Feldnamen zuweisen, der in der externen Datendatei f&uuml;r dieses Feld definiert ist. Wenn sich der Feldname in der Datendatei dann &auml;ndert, wird er bei der Anzeige in der HTML-Datei automatisch aktualisiert. Beispiel:<br>
<tt>&lt;label for=&quot;Vorname&quot; datafld=&quot;prename&quot;&gt;&lt;/label&gt;</tt><br>
Dadurch wird dem Inhalt des <tt>&lt;label&gt;</tt>-Tags eines Formularfeldes der Feldname <tt>prename</tt> zugewiesen, der in der Datenbank definiert ist.</p>



<h3 class="xmp">Lauftexte mit &lt;marquee&gt;...&lt;/marquee&gt;:</h3>
<p>Mit diesem HTML-Tag k&ouml;nnen Sie beispielsweise innerhalb einer Tabelle externe Daten ausgeben, genau so wie es im <img src="xgoup.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Beispiel: Datei dynamisch in Tabelle einbinden</b></a> mit dem <tt>&lt;span&gt;</tt>-Tag gemacht wird. Der Unterschied zwischen <tt>&lt;marquee&gt;...&lt;/marquee&gt;</tt> und <tt>&lt;span&gt;...&lt;/span&gt;</tt> ist, da&szlig; das <tt>&lt;marquee&gt;</tt>-Tag einen Lauftext erzeugt, das <tt>&lt;span&gt;</tt>-Tag dagegen nicht. Das <tt>&lt;marquee&gt;</tt>-Tag geh&ouml;rt nicht zum HTML-Standard.</p>

<h3 class="xmp">Bereiche mit &lt;span&gt;...&lt;/span&gt;:</h3>

<p><p>Mit diesem HTML-Tag k&ouml;nnen Sie beispielsweise innerhalb einer Tabelle externe Daten ausgeben, genau so wie es im <img src="xgoup.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Beispiel: Datei dynamisch in Tabelle einbinden</b></a>.</p>

<h3 class="xmp">Formularfelder mit &lt;input&gt;:</h3>

<p>Mit diesem HTML-Tag k&ouml;nnen Sie beispielsweise innerhalb einer Tabelle externe Daten in editierbaren Formularfeldern ausgeben. Das ist besonders dann interessant, wenn ge&auml;nderte Daten auch tats&auml;chlich in die Datenquelle zur&uuml;ckgeschrieben werden k&ouml;nnen. Bei einfachen Textdateien ist das derzeit nicht m&ouml;glich, wohl aber beim <img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a5"><b>Datenmodell: Remote Data Service (RDS)</b></a> und beim <img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a6"><b>Datenmodell: JDBC DataSource Applet</b></a>.<br>
Die Einbindung in HTML erfolgt &auml;hnlich wie im <img src="xgoup.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Beispiel: Datei dynamisch in Tabelle einbinden</b></a>, mit dem Unterschied, da&szlig; Sie die Regeln zum Einbinden des gew&uuml;nschten Datenmodells beachten m&uuml;ssen. Notieren Sie im einleitenden <tt>&lt;table&gt;</tt>-Tag der Tabelle, in der Sie die Datens&auml;tze anzeigen, m&ouml;glichst die Angabe <tt>datapagesize=1</tt>. Innerhalb der Tabellenzelle, in der Sie externe Daten auf diese Weise anzeigen wollen, k&ouml;nnen Sie dann notieren (angenommene Beispiele):<br>
<tt>&lt;input type=text datafld=&quot;Vorname&quot;&gt;</tt><br>
oder:<br>
<tt>&lt;input type=radio name=&quot;Kunde&quot; value=&quot;Bereits Kunde&quot; datafld=&quot;BereitsKunde&quot;&gt;</tt><br>
oder:<br>
<tt>&lt;input type=checkbox name=&quot;Zahlweise&quot; value=&quot;Mastercard&quot; datafld=&quot;Zahlungsweise&quot;&gt;</tt><br>
Datenfelder, die in Eingabefeldern vom Typ <tt>&lt;input type=text</tt> angezeigt werden, k&ouml;nnen normale Texte sein, wie etwa ein Name.  Radiobuttons und Checkboxen stellen dagegen andere Anforderungen. Ein Radiobutton wird bei der Anzeige dann aktiviert, wenn der aktuelle Feldinhalt in der Datenbank mit dem Wert &uuml;bereinstimmt, der hinter der Angabe <tt>value=</tt> steht. Eine Checkbox wird dann markiert, wenn der betreffende Feldinhalt in der Datenbank 1, true oder einen beliebigen Inhalt mit mehr als einem Zeichen enth&auml;lt. Wenn der Inhalt 0, false oder leer ist, wird die Checkbox nicht markiert.
</p>

<h3 class="xmp">Formularfelder mit &lt;select&gt;:</h3>

<p>Dabei gelten die gleichen Bedingungen wie bei Formularfeldern vom Typ <tt>&lt;input&gt;</tt>. Wenn der Wert eines aktuellen Eintrags in der Datenbank mit einem der Werte &uuml;bereinstimmt, die in der <tt>value</tt>-Angabe bei einem <tt>option</tt>-Tag innerhalb der Auswahlliste definiert sind, ist diese Auswahl selektiert. Interessant ist diese Ausgabem&ouml;glichkeit von externen Daten wie bei anderen Formularfeldern nur, wenn auch ein Zur&uuml;ckschreiben ge&auml;nderter Daten m&ouml;glich ist. Bei Auswahllisten etwa kann ein neuer ausgew&auml;hlter Wert als neuer Feldinhalt gespeichert werden. Der MS Internet Explorer unterst&uuml;tzt dabei nur die einfache Auswahl, Mehrfachauswahl nicht.</p>

<h3 class="xmp">Andere Objekte mit &lt;object&gt;...&lt;/object&gt;:</h3>

<p>Mit dem <tt>&lt;object&gt;</tt>-Tag k&ouml;nnen Sie genau so arbeiten wie mit dem <img src="xgoup.gif" width=14 height=10 border=0>&nbsp;<a href="#a41"><b><tt>&lt;img&gt;</tt>-Tag</b></a>. Der Unterschied ist, da&szlig; Sie beim <tt>&lt;img&gt;</tt>-Tag auf Grafiken beschr&auml;nkt sind, w&auml;hrend Sie mit dem <tt>&lt;object&gt;</tt>-Tag beliebige Multimedia-Dateien oder ActiveX-Controls einbinden k&ouml;nnen. So k&ouml;nnen Sie, analog zu dem Beispiel beim <tt>&lt;img&gt;</tt>-Tag, anstelle einer &quot;Dia-Show&quot; eine &quot;Musik-Show&quot; programmieren, die zum Beispiel aus MIDI-Dateien besteht.<br>
In der externen Textdatei notieren Sie die gew&uuml;nschten MIDI-Dateien, und bei der Einbindung in HTML k&ouml;nnen Sie dann anstelle der Datenanbindung mit <tt>&lt;img&gt;</tt> einen Befehl notieren wie:<br>
<tt>&lt;object datafld=&quot;Musik&quot; width=0 height=0&gt;&lt;/object&gt;</tt><br>
(wobei &quot;Musik&quot; in der Textdatei mit den Daten als Feld&uuml;berschrift notiert sein mu&szlig;).
</p>

<h3 class="xmp">Java-Applets mit &lt;applet&gt;...&lt;/applet&gt;:</h3>
<p>Sie k&ouml;nnen das Feature der Datenanbindung nutzen, um einen Parameter eines Java-Applets aus einer externen Datenquelle zu versorgen. Beispiel:<br>
<tt>applet code=&quot;verzerr.class&quot;</tt><br>
<tt>&#160;&lt;param name=&quot;bild&quot; datasrc=&quot;#aktuell&quot; datafld=&quot;b_gates_bild&quot;&gt;</tt><br>
<tt>&quot;/applet&quot;</tt>
</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a5"><img src="xmsie4.gif" width=30 height=30 border=0 alt="MS IE4.0"> Datenmodell: Tabular Data Control (TDC)</a></h2>

<p>Dies ist das Datenmodell, wenn die externe Datenquelle eine einfache Textdatei ist, die in jeder Zeile einen Datensatz enth&auml;lt, und bei der die einzelnen Datenfelder der Datens&auml;tze durch ein Begrenzerzeichen, zum Beispiel ein Komma, markiert sind. Geeignet ist dieses Datenmodell f&uuml;r kleinere Datenbest&auml;nde mit bis zu ein paar tausend Datens&auml;tzen. Ein vollst&auml;ndiges Beispiel daf&uuml;r finden Sie weiter oben im Abschnitt <img src="xgoup.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Beispiel: Datei dynamisch in Tabelle einbinden</b></a>. Um eine solche Datenquelle an eine HTML-Datei anzubinden, m&uuml;ssen Sie folgendes Objekt in der HTML-Datei notieren:</p>

<h3 class="xmp">Schema zur Einbindung in HTML:</h3>

<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;object id=&quot;Objektname&quot; classid=&quot;clsid:333C7BC4-460F-11D0-BC04-0080C7055A83&quot;&gt;
 &lt;param name= value=&gt;
 &lt;!-- usw. weitere Parameter --&gt;
&lt;/object&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Um solche Daten einzubinden, verwenden Sie das im Internet Explorer 4.x eingebaute ActiveX-Control mit der ID 333C7BC4-460F-11D0-BC04-0080C7055A83. Innerhalb des <tt>&lt;object&gt;</tt>-Tags notieren Sie verschiedene Parameter, die f&uuml;r die Datenpr&auml;sentation wichtig sind. Folgende Parameter sind erlaubt:</p>

<table cellpadding=2 cellspacing=1 width=100%>
<tr>
<td valign=top bgcolor=#FFFFE0 class="code" nowrap><tt>&lt;param name=&quot;AppendData&quot; value=&gt;</tt></td>
<td valign=top bgcolor=#EEEEEE class="doc">Mit diesem Parameter k&ouml;nnen Sie angeben, ob in der Ausgabetabelle beim Bl&auml;ttern f&uuml;r jedes neue Datensatz-Set (entsprechend der Gr&ouml;&szlig;e von <tt>datapagesize=</tt> die vorhandenen Tabellenzellen &uuml;berschrieben werden sollen, oder ob neue Tabellenzellen angeh&auml;ngt werden sollen. Mit <tt>value=true</tt> erzwingen Sie das Anh&auml;ngen von Daten. Per Voreinstellung werden die vorhandenen Tabellenzellen &uuml;berschrieben.</td>
</tr>
<tr>
<td valign=top bgcolor=#FFFFE0 class="code" nowrap><tt>&lt;param name=&quot;CaseSensitive&quot; value=&gt;</tt></td>
<td valign=top bgcolor=#EEEEEE class="doc">Mit diesem Parameter k&ouml;nnen Sie angeben, ob bei Vergleichen von Anwendereingaben mit Daten aus der Datenquelle Gro&szlig;-/Kleinschreibung unterschieden werden soll. Nur interessant bei der Weiterverarbeitung von Daten mit Scripts. Per Voreinstellung wird Gro&szlig;-/Kleinschreibung unterschieden. Mit <tt>value=false</tt> k&ouml;nnen Sie die Fallunterscheidung ausschalten.</td>
</tr>
<tr>
<td valign=top bgcolor=#FFFFE0 class="code" nowrap><tt>&lt;param name=&quot;CharSet&quot; value=&gt;</tt></td>
<td valign=top bgcolor=#EEEEEE class="doc">Mit diesem Parameter k&ouml;nnen Sie den Zeichensatz angeben, der f&uuml;r die Daten in der Datendatei ma&szlig;geblich ist. Per Voreinstellung ist das der Zeichensatz Western Latin-1 (iso-8859-1). Verwenden Sie diesen Parameter nur, wenn die Daten einen anderen Zeichensatz benutzen, z.B. iso-8859-5 f&uuml;r Kyrillisch. Bei <tt>value=</tt> k&ouml;nnen Sie den Zeichensatz angeben. N&auml;here Informationen im Abschnitt &uuml;ber <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="thb.htm"><b>Zeichens&auml;tze</b></a>.</td>
</tr>
<tr>
<td valign=top bgcolor=#FFFFE0 class="code" nowrap><tt>&lt;param name=&quot;DataURL&quot; value=&gt;</tt></td>
<td valign=top bgcolor=#EEEEEE class="doc">Dieser Parameter ist unbedingt erforderlich. Bei <tt>value=</tt> geben Sie die Datei an, in der sich die Daten befinden.</td>
</tr>
<tr>
<td valign=top bgcolor=#FFFFE0 class="code" nowrap><tt>&lt;param name=&quot;EscapeChar&quot; value=&gt;</tt></td>
<td valign=top bgcolor=#EEEEEE class="doc">Diesen Parameter sollten Sie angeben, wenn in Ihrer Datendatei ein Zeichen als Maskierungszeichen verwendet wird. Das ist z.B. der Fall, wenn Sie in einer kommabegrenzten Datei Kommata innerhalb von Feldern mit einem vorangestellten Backslash \ maskieren. Geben Sie in diesem Fall bei <tt>value=</tt> das Maskierungszeichen an.</td>
</tr>
<tr>
<td valign=top bgcolor=#FFFFE0 class="code" nowrap><tt>&lt;param name=&quot;FieldDelim&quot; value=&gt;</tt></td>
<td valign=top bgcolor=#EEEEEE class="doc">Mit diesem Parameter geben Sie an, welches Zeichen als Trennzeichen f&uuml;r Datenfelder innerhalb einer Zeile der externen Textdatei interpretiert werden soll. Bei <tt>value=</tt> k&ouml;nnen Sie das Zeichen angeben.</td>
</tr>
<tr>
<td valign=top bgcolor=#FFFFE0 class="code" nowrap><tt>&lt;param name=&quot;Filter&quot; value=&gt;</tt></td>
<td valign=top bgcolor=#EEEEEE class="doc">Mit diesem Parameter k&ouml;nnen Sie die Datenauswahl einschr&auml;nken. Per Voreinstellung werden alle Daten aus der externen Datei angezeigt. Interessant ist dieser Parameter vor allem, wenn der Anwender in einem Eingabeformular die Suche selbst definieren kann, und die Eingaben dann mit Hilfe eines Scripts dynamisch diesem Parameter des <tt>&lt;object&gt;</tt>-Tags zugewiesen werden. Bei <tt>value=</tt> k&ouml;nnen Sie den Filter angeben. Beispiele:<br>
<tt>value=&quot;Telefon &lt;&gt; '089*'&quot;</tt> findet in einem Feld &quot;Telefon&quot; nur Nummern, die mit 089 beginnen.<br>
<tt>value=&quot;PLZ &gt; '50000'&quot;</tt> findet in einem Feld &quot;PLZ&quot; f&uuml;r Postleitzahlen nur Werte, die gr&ouml;&szlig;er als 50000 sind.
</td>
</tr>
<tr>
<td valign=top bgcolor=#FFFFE0 class="code" nowrap><tt>&lt;param name=&quot;Language&quot; value=&gt;</tt></td>
<td valign=top bgcolor=#EEEEEE class="doc">Mit diesem Parameter k&ouml;nnen Sie die Sprache angeben, in der die Daten der exterenen Datendatei vorliegen. Ma&szlig;geblich sind daf&uuml;r die Sprachennamen, wie sie in ISO 369 definiert sind. Bei <tt>value=</tt> k&ouml;nnen Sie die Sprache angeben.</td>
</tr>
<tr>
<td valign=top bgcolor=#FFFFE0 class="code" nowrap><tt>&lt;param name=&quot;RowDelim&quot; value=&gt;</tt></td>
<td valign=top bgcolor=#EEEEEE class="doc">Wenn Ihre externe Datendatei so aufgebaut ist, da&szlig; am Ende eines Datensatzes ein Datensatzbegrenzerzeichen steht, m&uuml;ssen Sie dieses Zeichen mit diesem Parameter angeben. Notieren Sie hinter <tt>value=</tt> das Zeichen.</td>
</tr>
<tr>
<td valign=top bgcolor=#FFFFE0 class="code" nowrap><tt>&lt;param name=&quot;Sort&quot; value=&gt;</tt></td>
<td valign=top bgcolor=#EEEEEE class="doc">Mit diesem Parameter k&ouml;nnen Sie veranlassen, da&szlig; bei gleichzeitiger Ausgabe mehrerer Datens&auml;tze (also bei <tt>datapagesize=</tt> gr&ouml;&szlig;er 1) die angezeigten Datens&auml;tze nach einem bestimmten Feld sortiert werden. Beispiele:<br>
<tt>value=&quot;PLZ&quot;</tt> sortiert auszugebende Daten nach einem Feld namens &quot;PLZ&quot;.<br>
<tt>value=&quot;-PLZ&quot;</tt> sortiert auszugebende Daten nach einem Feld namens &quot;PLZ&quot;, und zwar absteigend (Minuszeichen davor).<br><tt>value=&quot;Name; PLZ&quot;</tt> sortiert auszugebende Daten erstens nach Name und zweitens nach Postleitzahlen.</td>
</tr>
<tr>
<td valign=top bgcolor=#FFFFE0 class="code" nowrap><tt>&lt;param name=&quot;TextQualifier&quot; value=&gt;</tt></td>
<td valign=top bgcolor=#EEEEEE class="doc">Wenn Ihre externe Datendatei so aufgebaut ist, da&szlig; alle Datenfelder in bestimmte Zeichen eingeschlossen sind, zum Beispiel in Anf&uuml;hrungszeichen, dann sollten Sie mit diesem Parameter das betreffende Zeichen angeben. Mit value=&quot;'&quot;'&quot; etwa bestimmen Sie das Anf&uuml;hrungszeichen als Zeichen f&uuml;r Feldanfang und Feldende.</td>
</tr>
<tr>
<td valign=top bgcolor=#FFFFE0 class="code" nowrap><tt>&lt;param name=&quot;UseHeader&quot; value=&gt;</tt></td>
<td valign=top bgcolor=#EEEEEE class="doc">Diesen Parameter m&uuml;ssen Sie dann angeben, wenn die erste Zeile der externen Datendatei keine Daten enth&auml;lt, sondern die zugeh&ouml;rigen Feldnamen. Mit <tt>value=true</tt> wird die Datendatei so interpretiert, da&szlig; die erste Zeile Feldnamen enth&auml;lt. Mit <tt>value=false</tt> wird sie so interpretiert, da&szlig; gleich in der ersten Zeile die Daten beginnen.</td>
</tr>
</table>
<br>&#160;



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a6"><img src="xmsie4.gif" width=30 height=30 border=0 alt="MS IE4.0"> Datenmodell: Remote Data Service (RDS)</a></h2>

<p>&Uuml;ber das Datenmodell Remote Data Service (RDS) k&ouml;nnen Sie die Anbindung einer HTML-Datei an Daten aus einer Datenbank realisieren. Geeignet ist dieses Modell f&uuml;r Datenbanken, die &uuml;ber die Datenbank-Schnittstellen OLE-DB oder ODBC (DBMS) verf&uuml;gen. Das sind beispielsweise MS Access, Oracle oder SQL-Server wie msql. &Uuml;ber die entsprechenden Produkte und den Aufbau von Datenbanken damit informieren Sie sich bitte bei den betreffenden Herstellern. Um eine solche Datenanbindung im WWW zu realisieren, mu&szlig; die Datenbankanwendung auf dem Server-Rechner installiert sein. Fragen Sie dazu gegebenenfalls Ihren Provider.</p>

<p>Um eine solche Datenquelle an eine HTML-Datei anzubinden, m&uuml;ssen Sie folgendes Objekt in der HTML-Datei notieren:</p>

<h3 class="xmp">Schema zur Einbindung in HTML:</h3>

<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;object id=&quot;Objektname&quot; classid=&quot;clsid:BD96C556-65A3-11D0-983A-00C04FC29E33&quot;&gt;
 &lt;param name= value=&gt;
 &lt;!-- usw. weitere Parameter --&gt;
&lt;/object&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Um solche Daten einzubinden, verwenden Sie das im Internet Explorer 4.x eingebaute ActiveX-Control mit der ID BD96C556-65A3-11D0-983A-00C04FC29E33. Innerhalb des <tt>&lt;object&gt;</tt>-Tags notieren Sie verschiedene Parameter, die f&uuml;r die Datenpr&auml;sentation wichtig sind. folgende Parameter sind m&ouml;glich:</p>

<table cellpadding=2 cellspacing=1 width=100%>
<tr>
<td valign=top bgcolor=#FFFFE0 class="code" nowrap><tt>&lt;param name=&quot;Server&quot; value=&gt;</tt></td>
<td valign=top bgcolor=#EEEEEE class="doc">Mit diesem Parameter m&uuml;ssen Sie Sie die Datei angeben, die die Datenbank ausf&uuml;hrt. Das kann auf Windows-Rechnern eine EXE-Datei sein oder auf Unix-Rechnern auch ein Link zu einer ausf&uuml;hrbaren Datei. Bei <tt>value=</tt> k&ouml;nnen Sie den Namen angeben. Dabei sind nat&uuml;rlich relative Pfadangaben aus Sicht der HTML-Datei oder auch absolute URL-Adressen vom Typ http://... erlaubt.</td>
</tr>
<tr>
<td valign=top bgcolor=#FFFFE0 class="code" nowrap><tt>&lt;param name=&quot;Connect&quot; value=&gt;</tt></td>
<td valign=top bgcolor=#EEEEEE class="doc">Mit diesem Parameter m&uuml;ssen Sie eine Zeichenkette &uuml;bergeben, die eine ODBC-Verbindung zu der Datenbank aufbaut. Die Zeichenkette mu&szlig; dem ODBC-Standard entsprechen. Informationen dazu entnehmen Sie der Dokumentation zu der Datenbank. Bei <tt>value=</tt> geben Sie die Zeichenkette an, zum Beispiel <tt>value=&quot;dsn=Adressen;uid=guest;pwd=&quot;</tt></td>
</tr>
<tr>
<td valign=top bgcolor=#FFFFE0 class="code" nowrap><tt>&lt;param name=&quot;SQL&quot; value=&gt;</tt></td>
<td valign=top bgcolor=#EEEEEE class="doc">Mit diesem Parameter m&uuml;ssen Sie einen Befehl angeben, den Sie zum Ansprechen der Datenbank absetzen wollen. Dies kann ein beliebiger g&uuml;ltiger SQL-Befehl sein. SQL (Structured Query Language) ist eine standardisierte Datenbankabfragesprache. Diese Sprache und ihre Befehle m&uuml;ssen Sie kennen, um den Parameter mit korrekten Werten zu versorgen.</td>
</tr>
</table>

<h3 class="inf"><a class="an" name="a51">Beachten Sie:</a></h3>

<p>Solche Datenanbindungen sind nur sinnvoll, wenn Sie dem Anwender ein HTML-Formular zur Verf&uuml;gung stellen, in dem er seine Angaben zum Durchsuchen der Datenbank machen kann. Mit Hilfe eines JavaScripts k&ouml;nnen Sie dann die Anwendereingaben in einen g&uuml;ltigen SQL-Befehl umwandeln, den Sie im Script dem Parameter <tt>SQL</tt> des <tt>object</tt>-Tags zuweisen. So k&ouml;nnen Sie beispielsweise mit der JavaScript-Anweisung:<br>
<tt>document.all.Datenbank.SQL = Abfrage;</tt><br>
eine SQL-Abfrage zuordnen. In diesem Beispiel ist <tt>&quot;Datenbank&quot;</tt> der Name, der beim <tt>object</tt>-Tag als <tt>id=</tt> vergeben wird, und <tt>Abfrage</tt> ist eine Variable, die zuvor aus Formulareingaben des Anwenders einen SQL-Befehl kreiert hat. Bei solchen Datenbanken ist es auch m&ouml;glich, SQL-Befehle zum Schreiben von ge&auml;nderten Datens&auml;tzen in die Datenbank  zur&uuml;ckzuschreiben. Voraussetzung ist, da&szlig; die Daten in der HTML-Datei in editierbaren HTML-Eingabefeldern (z.B. <tt>&lt;input...&gt;</tt>) angezeigt werden.</p>
<p>Ausf&uuml;hrliche Informationen zum Einrichten und Realisieren einer Datenbank mit Scritps finden Sie innerhalb des <img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.microsoft.com/msdn/sdk/inetsdk/asetup/default.htm"><b>Microsoft Internet Client SDK</b></a> (Dokumentation aller Microsoft Internet Technologien).</p>




<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a7"><img src="xmsie4.gif" width=30 height=30 border=0 alt="MS IE4.0"> Datenmodell: JDBC DataSource Applet</a></h2>

<p>Das Datenmodell JDBC DataSource Applet greift ebenso wie das Datenmodell <img src="xgoup.gif" width=14 height=10 border=0>&nbsp;<a href="#a5"><b>Remote Data Service (RDS)</b></a> auf Datenbanken zu, die &uuml;ber die Datenbank-Schnittstellen OLE-DB oder ODBC (DBMS) verf&uuml;gen, zum Beispiel MS Access, Oracle oder SQL-Server wie msql. Der Unterschied zwischen dem JDBC DataSource Applet und dem Remote Data Service (RDS) ist, da&szlig; letzterer in der HTML-Datei als ActiveX-Control eingebunden wird, w&auml;hrend das JDBC DataSource Applet ein Java-Applet ist. Damit will Microsoft seine Datenanbindungs-Technologie anderen Browsern zur Verf&uuml;gung stellen, die kein ActiveX unterst&uuml;tzen, wohl aber Java. Das tun zwar Netscape und einige andere Browser, doch solange diese das Konzept der Datenanbindung mit Dynamischem HTML nicht unterst&uuml;tzen, macht das Ganze eigentlich wenig Sinn.</p>

<p>Das Java-Applet, das diese Form der Datenanbindung steuert, geh&ouml;rt nicht zum Lieferumfang des MS Internet Explorers. Auf den WWW-Seiten von Microsoft k&ouml;nnen Sie das <img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.microsoft.com/gallery/files/datasrc/"><b>JDBC DataSource Java-Applet downloaden</b></a>.</p>

<p>Um eine solche Datenanbindung im WWW zu realisieren, mu&szlig; die Datenbankanwendung auf dem Server-Rechner installiert sein. Fragen Sie dazu gegebenenfalls Ihren Provider.</p>

<p>Um eine solche Datenquelle an eine HTML-Datei anzubinden, m&uuml;ssen Sie das JDBC DataSource Java-Applet in der HTML-Datei notieren.</p>

<h3 class="xmp">Schema zur Einbindung in HTML:</h3>

<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;applet code=&quot;JDC.class&quot; name=&quot;DSA1&quot; id=&quot;DSA1&quot; width=0 height=0&gt;
 &lt;param name= value=&gt;
 &lt;!-- usw. weitere Parameter --&gt;
&lt;/applet&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Das Java-Applet wird wie in HTML &uuml;blich mit dem <tt>&lt;applet&gt;</tt>-Tag eingebunden. Mit dem Attribut <tt>code=</tt> geben Sie die ausf&uuml;hrbare Java-Datei an. Dies ist die Datei <tt>JDC.class</tt>, die Sie mit dem Download des JDBC DataSource Java-Applets erhalten. Innerhalb des Applets notieren Sie verschiedene Parameter, die das Applet ben&ouml;tigt, um korrekt zu arbeiten. Weiterf&uuml;hrende Infos zu den Parametern entnehmen Sie der Original-Dokumentation zu dem Applet. Folgende Parameter erwartet das Applet:</p>

<table cellpadding=2 cellspacing=1 width=100%>
<tr>
<td valign=top bgcolor=#FFFFE0 class="code" nowrap><tt>&lt;param name=&quot;cabbase&quot; value=&gt;</tt></td>
<td valign=top bgcolor=#EEEEEE class="doc">Mit diesem Parameter geben Sie die Datei an, in der der Quellcode des Applets steht. Es handelt sich um eine CAB-Datei. Relative Pfadnamen oder auch absolute URL-Adressen sind dabei erlaubt.</td>
</tr>
<tr>
<td valign=top bgcolor=#FFFFE0 class="code" nowrap><tt>&lt;param name=&quot;dbURL&quot; value=&gt;</tt></td>
<td valign=top bgcolor=#EEEEEE class="doc">Mit diesem Parameter geben Sie bei <tt>value=</tt> die Datei an, in der die Datenbank gespeichert ist. Relative Pfadnamen oder auch absolute URL-Adressen sind dabei erlaubt.</td>
</tr>
<tr>
<td valign=top bgcolor=#FFFFE0 class="code" nowrap><tt>&lt;param name=&quot;showUI&quot; value=&gt;</tt></td>
<td valign=top bgcolor=#EEEEEE class="doc">Mit diesem Parameter geben Sie an, ob das Applet innerhalb der HTML-Datei seine eigene Benutzeroberfl&auml;che anzeigen soll oder nicht. Mit <tt>value=true</tt> wird das Applet angezeigt, mit <tt>value=false</tt> nicht. Der Parameter ist optional.</td>
</tr>
<tr>
<td valign=top bgcolor=#FFFFE0 class="code" nowrap><tt>&lt;param name=&quot;sqlStatement&quot; value=&gt;</tt></td>
<td valign=top bgcolor=#EEEEEE class="doc">Mit diesem Parameter m&uuml;ssen Sie einen Befehl angeben, den Sie zum Ansprechen der Datenbank absetzen wollen. Dies kann ein beliebiger g&uuml;ltiger SQL-Befehl sein. SQL (Structured Query Language) ist eine standardisierte Datenbankabfragesprache. Diese Sprache und ihre Befehle m&uuml;ssen Sie kennen, um den Parameter mit korrekten Werten zu versorgen.</td>
</tr>
<tr>
<td valign=top bgcolor=#FFFFE0 class="code" nowrap><tt>&lt;param name=&quot;allowInsert&quot; value=&gt;</tt></td>
<td valign=top bgcolor=#EEEEEE class="doc">Mit diesem Parameter geben Sie an, ob der Anwender Datens&auml;tze durch Ausf&uuml;llen entsprechender Eingabefelder neue Datens&auml;tze in die Datenbank schreiben darf. Mit <tt>value=true</tt> erlauben Sie das Hinzuf&uuml;gen von Daten, mit <tt>value=false</tt> verbieten sie es.</td>
</tr>
<tr>
<td valign=top bgcolor=#FFFFE0 class="code" nowrap><tt>&lt;param name=&quot;allowDelete&quot; value=&gt;</tt></td>
<td valign=top bgcolor=#EEEEEE class="doc">Mit diesem Parameter geben Sie an, ob der Anwender angezeigte Datens&auml;tze mit Hilfe entsprechender Befehlsbuttons aus der Datenbank l&ouml;schen darf. Mit <tt>value=true</tt> erlauben Sie das L&ouml;schen von Daten, mit <tt>value=false</tt> verbieten sie es.</td>
</tr>
<tr>
<td valign=top bgcolor=#FFFFE0 class="code" nowrap><tt>&lt;param name=&quot;allowUpdate&quot; value=&gt;</tt></td>
<td valign=top bgcolor=#EEEEEE class="doc">Mit diesem Parameter geben Sie an, ob der Anwender angezeigte Datens&auml;tze in entsprechenden Eingabefeldern editieren und ge&auml;nderte Daten mit Hilfe entsprechender Befehlsbuttons in die Datenbank zur&uuml;ckschreiben darf. Mit <tt>value=true</tt> erlauben Sie das &Auml;ndern von Daten, mit <tt>value=false</tt> verbieten sie es.</td>
</tr>
<tr>
<td valign=top bgcolor=#FFFFE0 class="code" nowrap><tt>&lt;param name=&quot;user&quot; value=&gt;</tt></td>
<td valign=top bgcolor=#EEEEEE class="doc">Mit diesem Parameter k&ouml;nnen Sie der Datenbank bei <tt>value=</tt> den Namen eines angemeldeten Users &uuml;bergeben, sofern die Datenbank dies verlangt. Der Parameter ist optional.</td>
</tr>
<tr>
<td valign=top bgcolor=#FFFFE0 class="code" nowrap><tt>&lt;param name=&quot;password&quot; value=&gt;</tt></td>
<td valign=top bgcolor=#EEEEEE class="doc">Mit diesem Parameter k&ouml;nnen Sie der Datenbank bei <tt>value=</tt> das Passwort des Users &uuml;bergeben, sofern die Datenbank dies verlangt. Der Parameter ist optional.</td>
</tr>
</table>

<h3 class="inf">Beachten Sie:</h3>

<p>Beim Datenmodell JDBC DataSource Applet gelten die <img src="xgoup.gif" width=14 height=10 border=0>&nbsp;<a href="#a51"><b>Anmerkungen zum Datenmodell Remote Data Service (RDS)</b></a>.</p>




<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a8"><img src="xmsie4.gif" width=30 height=30 border=0 alt="MS IE4.0"> Datenmodell: XML Data Source</a></h2>

<p>Das Datenmodell XML Data Source k&ouml;nnte in Zukunft sehr  interessant werden, da es die vom W3-Konsortium standardisierte Sprache XML zur Definition von Daten benutzt. Bei diesem Datenmodell werden die Daten in einer XML-Datei gespeichert. F&uuml;r Datens&auml;tze und Datenfelder k&ouml;nnen Sie innerhalb der XML-Datei eigene Tags und deren Verschachtelung erfinden. Ein denkbares Schema f&uuml;r eine Adressendatei w&auml;re etwa:<br> <tt>&lt;adresse&gt;</tt><br>
<tt>&#160;&lt;name&gt;Meyer&lt;/name&gt;</tt><br>
<tt>&#160;&lt;vorname&gt;Hubert&lt;/vorname&gt;</tt><br>
<tt>&#160;&lt;ort&gt;Hamburg&lt;/ort&gt;</tt><br>
<tt>&#160;&lt;telefon&gt;040-598487374&lt;/telefon&gt;</tt><br>
<tt>&lt;/adresse&gt;</tt><br>
Die Datei mu&szlig; den Konventionen zum Aufbau einer XML-Datei entsprechen. Lesen Sie dazu die <img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.w3c.org/pub/WWW/TR/WD-xml.html"><b>XML-Spezifikation des W3-Konsortiums</b></a>. Eine sehr ordentliche deutschsprachige <img src="xdeu.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://members.aol.com/xmldoku/"><b>Einf&uuml;hrung in XML</b></a> stammt von Kuno D&uuml;nh&ouml;lter.</p>

<p>Im Lieferumfang des MS Internet Explorers 4.x ist ein Java-Applet enthalten, das solche Tag-Strukturen aus XML-Dateien interpretiert und die Datenstruktur daraus ermittelt.</p>

<p>Um diese Art von Datenquelle an eine HTML-Datei anzubinden, m&uuml;ssen Sie das zugeh&ouml;rige Java-Applet in der HTML-Datei notieren.</p>

<h3 class="xmp">Schema zur Einbindung in HTML:</h3>

<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;applet class=com.ms.xml.dso.xmldso.class id=&quot;xmldso&quot; width=0 height=0 mayscript=true&gt;
 &lt;param name=&quot;url&quot; value=&gt;
&lt;/applet&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Das Java-Applet wird wie in HTML &uuml;blich mit dem <tt>&lt;applet&gt;</tt>-Tag eingebunden. Notieren Sie das einleitende <tt>&lt;applet&gt;</tt>-Tag genau so wie im obigen Schema. Der Grund f&uuml;r die etwas ungew&ouml;hnliche Angabe bei <tt>class=</tt> ist, da&szlig; dieses Java-Applet eine interne Ressource des MS Internet Explorers ist und keine separat vorliegende Datei.</p>

<p>Das Applet erwartet genau einen Parameter:<br>
Mit <tt>&lt;param name=&quot;url&quot; value=&gt;</tt> geben Sie bei <tt>value=</tt> den Dateinamen der XML-Datei an. Dabei sind nat&uuml;rlich auch relative Pfadangaben oder absolute URL-Adressen erlaubt.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a9"><img src="xmsie4.gif" width=30 height=30 border=0 alt="MS IE4.0"> Datenmodell: MSHTML Data Source</a></h2>

<p>Was Sie mit XML besonders elegant l&ouml;sen k&ouml;nnen, geht etwas weniger elegant auch mit HTML selbst: hinter dem Datenmodell MSHTML Data Source verbirgt sich nichts anderes als eine Konvention, nach der die Daten in einer HTML-Datei gehalten werden - diese HTML-Datei dient dann als externe Quelle f&uuml;r eine andere HTML-Datei, in der die Daten angezeigt werden. Ein Schema f&uuml;r den Datensatz einer Adressendatei w&auml;re etwa:<br>
<tt>&lt;div id=&quot;Adresse&quot;&gt;</tt><br>
<tt>&#160;&lt;span id=&quot;Name&quot;&gt;Meyer&lt;/span&gt;&lt;br&gt;</tt><br>
<tt>&#160;&lt;span id=&quot;Vorname&quot;&gt;Hubert&lt;/span&gt;&lt;br&gt;</tt><br>
<tt>&#160;&lt;span id=&quot;Ort&quot;&gt;Hamburg&lt;/span&gt;&lt;br&gt;</tt><br>
<tt>&#160;&lt;span id=&quot;Telefon&quot;&gt;040-598487374&lt;/span&gt;&lt;br&gt;</tt><br>
<tt>&lt;/div&gt;</tt><br></p>

<p>Um diese Art von Datenquelle an eine HTML-Datei anzubinden, m&uuml;ssen Sie ein einfaches Objekt daf&uuml;r notieren.</p>

<h3 class="xmp">Schema zur Einbindung in HTML:</h3>

<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;object id=&quot;Daten&quot; data=&quot;daten.htm&quot; width=0 height=0&gt;
&lt;/object&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Innerhalb des <tt>&lt;object&gt;</tt>-Tags vergeben Sie mit <tt>id=</tt> wie &uuml;blich einen Namen, unter dem Sie das Objekt ansprechen und die Daten aus der anderen Datei in einer Tabelle dynamisch anzeigen k&ouml;nnen. Das Zugriefen auf die Datens&auml;tze funktioniert dabei genau so wie im <img src="xgoup.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Beispiel: Datei dynamisch in Tabelle einbinden</b></a>. Bei <tt>datafld=</tt> geben Sie den Namen an, den Sie in der externen HTML-Datei bei <tt>id=</tt> f&uuml;r jedes gleiche Feld eines Datensatzes vergeben haben, z.B. <tt>&quot;Vorname&quot;</tt>.</p>





<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tfbc.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#ffffff><img src="x3.gif" width=15 height=10 border=0> <a href="tfbc.htm"><b>Dynamische Filter (Microsoft)</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tfba.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#ffffff width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tfba.htm"><b>Dynamischer Zugriff auf HTML-Elemente (Microsoft)</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tf.htm"><b>Dynamisches HTML</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tfb.htm"><b>Die Ans&auml;tze von Microsoft und Netscape</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>