<html>
<head>
<title>SELFHTML: Dynamisches HTML /  Ans&auml;tze / JSSS JavaScript Style-Sheets (Netscape)</title>
<meta name="description" content="(SELFHTML 7.0) JSSS JavaScript Style-Sheets, ein Bestandteil f&uuml;r Dynamisches HTML bei Netscape ab 4.x">
<meta name="keywords" content="SELFHTML, Dynamisches HTML, Dynamic, JSSS, JavaScript Style-Sheets, Netscape">
<link rel=stylesheet type="text/css" href="wselfhtm.css">
</head>
<body bgcolor=#ffffff text=#000000 link=#aa5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tf.htm"><b>Dynamisches HTML</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tfb.htm"><b>Die Ans&auml;tze von Microsoft und Netscape</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>JSSS JavaScript Style-Sheets (Netscape)</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#ffffff valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Aufgaben von JavaScript Style-Sheets (JSSS)</b></a> <br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>JSSS Style-Sheets einbinden</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>HTML-Tags mit JSSS Style-Sheets formatieren</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a4"><b>Klassen mit JSSS Style-Sheets definieren</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a5"><b>Unabh&auml;ngige Formate mit JSSS Style-Sheets definieren</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a6"><b>Formate f&uuml;r verschachtelte HTML-Tags mit JSSS Style-Sheets definieren</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a7"><b>JSSS-Formate innerhalb von HTML-Tags definieren</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a8"><b>JSSS Style-Sheets und CSS Style-Sheets kombinieren</b></a>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="a1"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape 4.0"> Aufgaben von JavaScript Style-Sheets (JSSS)</a></h2>

<p>Wundern Sie sich nicht, wenn in den Anzeigebeispielen zu dieser Seite noch nichts &quot;dynamisch&quot; ist. Hier wird lediglich eine Variante zum Definieren von Style-Sheets vorgestellt, die Netscape-spezifisch ist. Es handelt sich um Style-Sheet-Definitionen mit Hilfe von JavaScript.</p>

<p>JSSS bedeutet &quot;<b>J</b>ava<b>S</b>cript <b>S</b>tyle <b>S</b>heets&quot;. Die Idee dahinter klingt logisch. Wenn man mit JavaScript dynamisch auf Formatierungen zugreifen k&ouml;nnen soll, ist es sinnvoll, die Formatierungen gleich so zu definieren, da&szlig; sie Eigenschaften eines JavaScript-Objekts sind. Deshalb werden die JavaScript-basierten Style-Sheets gerne im Zusammenhang mit Dynamischem HTML bei Netscape behandelt. Auch in dieser Dokumentation ist das so. Erwarten Sie aber keine weiterf&uuml;hrenden Zusammenh&auml;nge. Der JSSS-Ansatz von Netscape steht etwas im luftleeren Raum. F&uuml;r <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tfbe.htm"><b>Dynamisches Positionieren mit Netscape</b></a>, wie es mit dem Netscape-Browser in der Version 4.x machbar ist, spielt JSSS keine besondere Rolle.</p>

<p>In der JSSS-Syntax gibt es beispielsweise Anweisungen wie <tt>tags.H1.color = &quot;blue&quot;</tt>. Eine solche Notationsweise m&uuml;ssen Sie so lesen: es gibt ein JavaScript-Objekt <tt>tags</tt>. Unterhalb dieses Objekts liegen alle verf&uuml;gbaren HTML-Tags. <tt>H1</tt> ist beispielsweise so ein HTML-Tag. Deshalb darf es, durch einen Punkt getrennt, hinter <tt>tags</tt> notiert werden. Eine Angabe wie <tt>tags.H1.color</tt> ist also genau so zu lesen wie beispielsweise <tt>window.document.images.src</tt>. Beides ist JavaScript-Syntax zum Ansprechen von Objekteigenschaften. N&auml;heres zu diesem Thema finden Sie im Abschnitt &uuml;ber <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tebc.htm"><b>Objekte, Eigenschaften und Methoden</b></a> im JavaScript-Teil.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2">JSSS Style-Sheets einbinden</a></h2>

<p>Sie k&ouml;nnen JSSS Style-Sheets auf zwei Arten in HTML einbinden: entweder in der HTML-Datei selbst im Dateikopf, oder als externe Datei, in der die Sty-Sheet-Definitionen stehen.</p>

<h3 class="xmp">Beispiel (JSSS-Bereich in Datei definieren):</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;head&gt;
&lt;style type=&quot;text/javascript&quot;&gt;
  ... Hier folgen die JSSS Style-Sheet-Definitionen ...
&lt;/style&gt;
href=&quot;formate.htm&quot;&gt;
&lt;/head&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Mit <tt>&lt;style type=&quot;text/javascript&quot;&gt;</tt> definieren Sie innerhalb einer HTML-Datei einen Bereich, in dem Sie JSSS Style-Sheet-Angaben machen k&ouml;nnen (<i>style = Stil, Format</i>). Es handelt sich um den gleichen Befehl wie beim <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tdba.htm#a1"><b>Einbinden von CSS Style-Sheets</b></a>. Der einzige Unterschied ist, da&szlig; als Typ <tt>&quot;text/javascript&quot;</tt> angegeben wird. Dadurch wird dieser Bereich nur von Netscape ab 4.x ausgelesen, nicht vom MS Internet Explorer.</p>

<h3 class="xmp">Beispiel (JSSS-Angaben aus externer Datei einbinden):</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;head&gt;
&lt;link rel=stylesheet type=&quot;text/javascript&quot; href=&quot;formate.htm&quot;&gt;
&lt;/head&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Im Dateikopf einer HTML-Datei k&ouml;nnen Sie mit einem HTML-Befehl des Typs <tt>&lt;link...&gt;</tt> eine Datei referenzieren, die Style-Sheet-Angaben enth&auml;lt (<i>link = Verweis</i>). Es handelt sich um den gleichen Befehl wie f&uuml;r <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tdba.htm#a2"><b>CSS Style-Sheets in separater Datei</b></a>. Der einzige Unterschied ist, da&szlig; als Typ <tt>&quot;text/javascript&quot;</tt> angegeben wird. Die Datei, in der die Formate definiert werden, wird im Beispiel als HTML-Datei eingebunden. Notieren Sie dazu die Angabe <tt>href=</tt> und dahinter, in Anf&uuml;hrungszeichen, den Dateinamen. Dabei sind auch relative Pfadnamen oder absolute URL-Adressen erlaubt. Die Datei sollte nichts anderes enthalten als g&uuml;ltige Style-Sheet-Definitionen nach JSSS-Syntax.</p>


<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a3"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape 4.0"> HTML-Tags mit JSSS Style-Sheets formatieren</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tfbda.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Sie k&ouml;nnen mit Hilfe von JSSS Style-Sheet-Angaben HTML-Tags formatieren. Die Wirkungsweise ist die gleiche wie <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tdbb.htm#a1"><b>Definieren von Formaten f&uuml;r HTML-Tags</b></a> nach CSS-Syntax.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;style type=&quot;text/javascript&quot;&gt;
tags.H1.color = &quot;blue&quot;;
tags.p.fontSize = &quot;14pt&quot;;
with(tags.H3)
  color = &quot;green&quot;;
with(tags.H2)
 {
  color = &quot;red&quot;;
  fontSize = &quot;16pt&quot;;
  marginTop = &quot;2cm&quot;;
 }
&lt;/style&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Um HTML-Tags mit Hilfe von JSSS-Syntax zu formatieren, stehen Ihnen zwei M&ouml;glichkeiten der Notation zur Verf&uuml;gung:</p>

<p>Bei der ersten Notationsm&ouml;glichkeit notieren Sie zuerst das Schl&uuml;sselwort <tt>tags</tt> (kleingeschrieben!). Dahinter folgt, durch einen Punkt getrennt, das HTML-Tag, jedoch ohne die sonst &uuml;blichen spitzen Klammern. Bei dem Namen es HTML-Tags ist Gro&szlig;-/Kleinschreibung egal, Sie k&ouml;nnen also beispielsweise <tt>h1</tt> oder auch <tt>H1</tt> notieren. Im obigen Beispiel bekommen die Tags <tt>&lt;h1&gt;</tt> und <tt>&lt;p&gt;</tt> auf diese Weise je eine Style-Sheet-Angabe zugewiesen.</p>

<p>Bei der zweiten Notationsm&ouml;glichkeit notieren Sie zuerst das Schl&uuml;sselwort <tt>with</tt> (<i>mit</i>). Dahinter folgt, in Klammern stehend, wieder das Schl&uuml;sselwort <tt>tags</tt> und dahinter, durch einen Punkt getrennt, wieder das HTML-Tag. Wenn Sie dem HTML-Tag nur eine Style-Sheet-Angabe zuweisen wollen, k&ouml;nnen Sie das einfach hinter oder unterhalb der Klammer tun, so wie im obigen Beispiel bei <tt>with(tags.H3)</tt>. Gedacht ist diese Form der Notation jedoch f&uuml;r den Fall, da&szlig; Sie f&uuml;r ein HTML-Tag mehrere Style-Sheet-Angaben notieren wollen. In diesem Fall notieren Sie die Angaben in geschweiften Klammern, so wie im Beispiel bei <tt>with(tags.H2)</tt>. Innerhalb der geschweiften Klammern brauchen Sie dann nur noch die reinen Style-Sheet-Angaben notieren (also ohne <tt>tags.H2.</tt> davor).</p>

<p>Um einer Style-Sheet-Angabe einen Wert zuzurodnen, notieren Sie hinter dem Bezeichner f&uuml;r die Style-Sheet-Angabe ein Istgleichzeichen und dahinter die Wertzuweisung. Die Wertzuweisung mu&szlig; in Anf&uuml;hrungszeichen stehen. Die Syntax bei der Wertzuweisung ist also eine andere als bei den CSS Style-Sheets.</p>

<h3 class="inf"><a class="an" name="a31">Beachten Sie:</a></h3>

<p>Zur Formatierung stehen alle Style-Sheet-Angaben zur Verf&uuml;gung, die Netscape auch bei CSS Style-Sheets interpretiert. Im Kapitel <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tdc.htm"><b>Style-Sheet-Angaben</b></a> werden die einzelnen Style-Sheet-Angaben beschrieben.</p>

<p>Eine <b>wichtige Konvention</b> m&uuml;ssen Sie beachten: Viele Style-Sheet-Angaben enthalten normalerweise Bindestriche, wie etwa <tt>font-size</tt> (Schriftgr&ouml;&szlig;e) oder <tt>background-color</tt> (Hintergrundfarbe). Wenn Sie so eine Style-Sheet-Angabe in JSSS-Syntax notieren, entf&auml;llt der Bindestrich, und der erste Buchstabe des Wortes hinter dem Bindestrich wird gro&szlig;geschrieben. Statt <tt>font-size</tt> m&uuml;ssen Sie also <tt>fontSize</tt> notieren, und statt <tt>background-color</tt> m&uuml;ssen Sie <tt>backgroundColor</tt> notieren.</p>

<p><b>Alle</b> Werte, die Sie JSSS Style-Sheet-Angaben zuordnen, m&uuml;ssen in Anf&uuml;hrungszeichen stehen, da diese aus Sicht von JavaScript Zeichenketten darstellen.</p>


<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a4"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape 4.0"> Klassen mit JSSS Style-Sheets definieren</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tfbdb.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Sie k&ouml;nnen Unterklassen mit Formaten anlegen. So ist es m&ouml;glich, einem HTML-Element, etwa einer &Uuml;berschrift 2. Ordnung, verschiedene Formate zuzuordnen. Dazu vergeben Sie Namen f&uuml;r die entsprechenden Unterklassen. Die Wirkungsweise ist die gleiche wie <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tdbb.htm#a2"><b>Definieren von Format-Unterklassen</b></a> nach CSS-Syntax.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;Titel der Datei&lt;/title&gt;
&lt;style type=&quot;text/javascript&quot;&gt;
classes.Wichtig.H1.color = &quot;blue&quot;;
classes.Teletyper.all.fontFamily = &quot;Courier&quot;;
with(classes.Zusatzinfo.H2)
  marginLeft = &quot;1cm&quot;;
with(classes.Thema.H2)
 {
  color = &quot;red&quot;;
  fontSize = &quot;16pt&quot;;
  marginTop = &quot;2cm&quot;;
 }
&lt;/style&gt;
&lt;/head&gt;
&lt;body&gt;
&lt;h1 class=&quot;Wichtig&quot;&gt;&amp;Uuml;berschrift 1. Ordnung in Blau&lt;/h1&gt;
&lt;p class=&quot;Teletyper&quot;&gt;Textabsatz mit Courier-Schrift&lt;/p&gt;
&lt;div class=&quot;Teletyper&quot;&gt;Bereich mit Courier-Schrift&lt;/div&gt;
&lt;h2 class=&quot;Thema&quot;&gt;Rot, 16 Punkt und 2cm Abstand oben&lt;/h2&gt;
&lt;h2 class=&quot;Zusatzinfo&quot;&gt;Normal, aber mit 1cm Abstand links&lt;/h2&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Um Formatklassen f&uuml;r HTML-Tags mit Hilfe von JSSS-Syntax zu definieren, stehen Ihnen wieder beide M&ouml;glichkeiten der Notation zur Verf&uuml;gung:</p>

<p>Bei der ersten Notationsm&ouml;glichkeit notieren Sie zuerst das Schl&uuml;sselwort <tt>classes</tt> (kleingeschrieben!). Dahinter folgt, durch einen Punkt getrennt, ein Name f&uuml;r die Klasse, den Sie selbst vergeben d&uuml;rfen. Der Name darf nur aus Buchstaben, Ziffern und Unterstrichen bestehen. Gro&szlig;-/Kleinschreibung wird unterschieden. Im obigen Beispiel wird auf diese Weise eine Klasse namens <tt>Wichtig</tt> definiert.</p>

<p>Hinter dem Klassennamen folgt der Name des HTML-Tags, von dem diese Unterklasse abgeleitet werden soll. Im Beispiel wird also eine Unterklasse f&uuml;r <tt>H2</tt> definiert.</p>

<p>Hinter dem Namen des HTML-Tags notieren Sie die gew&uuml;nschte Style-Sheet-Angabe zur Formatierung. Dabei gelten die <img src="xgoup.gif" width=14 height=10 border=0>&nbsp;<a href="#a31"><b>speziellen Konventionen</b></a>.</p>

<p>Bei der zweiten Notationsm&ouml;glichkeit notieren Sie zuerst das Schl&uuml;sselwort <tt>with</tt> (<i>mit</i>). Dahinter folgt, in Klammern stehend, wieder das Schl&uuml;sselwort <tt>classes</tt>, dahinter, durch einen Punkt getrennt, der selbst vergebene Klassenname, und schlie&szlig;lich das HTML-Tag, f&uuml;r das die Unterklasse definiert werden soll. Im obigen Beispiel wird so mit  <tt>with(classes.Thema.H2)</tt> eine Reihe von Formatierungen f&uuml;r die Klasse <tt>Thema</tt> eingeleitet, wobei diese Klasse eine Unterklasse des HTML-Tags <tt>&lt;H2&gt;</tt> ist. Innerhalb der geschweiften Klammern stehen dann die reinen Style-Sheet-Angaben.</p>

<p>Genau wie bei CSS Style-Sheets k&ouml;nnen Sie auch bei JSSS Style-Sheets &quot;abstrakte&quot; Formatklassen definieren, die keinem bestimmten HTML-Tag zugeordnet sind. Dazu notieren Sie bei der Definition anstelle eines HTML-Tags einfach das Schl&uuml;sselwort <tt>all</tt>. Im obigen Beispiel wird auf diese Weise eine Klasse mit dem Namen <tt>Teletyper</tt> definiert.</p>

<p>Innerhalb von HTML-Tags wenden Sie solche Formatklassen an, indem Sie im einleitenden HTML-Tag das Attribut <tt>class=</tt> notieren und dahinter den Klassennamen. Klassen, die Sie nur f&uuml;r bestimmte HTML-Tags definiert haben, d&uuml;rfen nur innerhalb solcher Tags anwenden (im Beispiel etwa die Klasse <tt>Thema</tt> nur f&uuml;r <tt>&lt;h2&gt;</tt>-&Uuml;berschriften). Klassen, die mit <tt>all</tt> definiert worden sind, d&uuml;rfen Sie dagegen auf alle HTML-Tags anwenden.</p>

<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a5"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape 4.0"> Unabh&auml;ngige Formate mit JSSS Style-Sheets definieren</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tfbdc.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Sie k&ouml;nnen mit JSSS Style-Sheets individuelle, unabh&auml;ngige Formate definieren, die Sie dann innerhalb von HTML bei Bedarf anwenden k&ouml;nnen. Die Wirkungsweise ist die gleiche wie beim <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tdbb.htm#a4"><b>Definieren unabh&auml;ngiger Formate</b></a> nach CSS-Syntax.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;Titel der Datei&lt;/title&gt;
&lt;style type=&quot;text/javascript&quot;&gt;
ids.rot.color = &quot;red&quot;;
with(ids.rotfett)
 {
  color = &quot;red&quot;;
  fontWeight = &quot;bold&quot;;
 }
&lt;/style&gt;
&lt;/head&gt;
&lt;body&gt;
&lt;p id=&quot;rot&quot;&gt;roter Textabsatz&lt;/p&gt;
&lt;p&gt;Textabsatz mit &lt;b id=&quot;rotfett&quot;&gt;fettem roten Text&lt;/b&gt;.&lt;/p&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Um unabh&auml;ngige Formate mit Hilfe von JSSS-Syntax zu definieren, stehen Ihnen wieder beide M&ouml;glichkeiten der Notation zur Verf&uuml;gung:</p>

<p>Bei der ersten Notationsm&ouml;glichkeit notieren Sie zuerst das Schl&uuml;sselwort <tt>ids</tt> (kleingeschrieben!). Dahinter folgt, durch einen Punkt getrennt, ein Name, den Sie selbst vergeben d&uuml;rfen. Der Name darf nur aus Buchstaben, Ziffern und Unterstrichen bestehen. Gro&szlig;-/Kleinschreibung wird unterschieden. Im obigen Beispiel wird auf diese Weise eine Klasse namens <tt>rot</tt> definiert.</p>

<p>Hinter dem Namen notieren Sie die gew&uuml;nschte Style-Sheet-Angabe zur Formatierung. Dabei gelten die <img src="xgoup.gif" width=14 height=10 border=0>&nbsp;<a href="#a31"><b>speziellen Konventionen</b></a>.</p>

<p>Bei der zweiten Notationsm&ouml;glichkeit notieren Sie zuerst das Schl&uuml;sselwort <tt>with</tt> (<i>mit</i>). Dahinter folgt, in Klammern stehend, wieder das Schl&uuml;sselwort <tt>ids</tt>, und dahinter der selbst vergebene Formatname. Im obigen Beispiel wird mit  <tt>with(ids.rotfett)</tt> ein unabh&auml;ngiges Format definiert. Innerhalb der geschweiften Klammern stehen dann die reinen Style-Sheet-Angaben.</p>

<p>Innerhalb von HTML-Tags wenden Sie unabh&auml;ngige Formate an, indem Sie im einleitenden HTML-Tag das Attribut <tt>id=</tt> notieren und dahinter den Namen des Formats.</p>




<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a6"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape 4.0"> Formate f&uuml;r verschachtelte HTML-Tags mit JSSS Style-Sheets definieren</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tfbdd.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Sie k&ouml;nnen mit JSSS Style-Sheets Formate f&uuml;r HTML-Tags definieren, die nur dann g&uuml;ltig sind, wenn das HTML-Tag innerhalb eines bestimmten anderen HTML-Tags vorkommt. Die Wirkungsweise ist die gleiche wie beim <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tdbb.htm#a3"><b>Definieren von Formaten f&uuml;r verschachtelte HTML-Tags</b></a> nach CSS-Syntax.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;Titel der Datei&lt;/title&gt;
&lt;style type=&quot;text/javascript&quot;&gt;
contextual(tag.P, tags.I).color = &quot;red&quot;;
&lt;/style&gt;
&lt;/head&gt;
&lt;body&gt;
&lt;div&gt;Normaler Textbereich mit &lt;i&gt;normalem kursivem Text&lt;/i&gt;.&lt;/div&gt;
&lt;p&gt;Normaler Textabsatz mit &lt;i&gt;kursivem Text in rot&lt;/i&gt;.&lt;/p&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Um mit Hilfe von JSSS-Syntax ein Format f&uuml;r ein HTML-Tag zu definieren, das nur innerhalb eines bestimmten anderen HTML-Tags eine bestimmte Formatierung erhalten soll, m&uuml;ssen Sie zuerst das Schl&uuml;sselwort <tt>contextual</tt> notieren. Dahinter folgt ein Ausdruck, der in Klammern steht. Zuerst notieren Sie nach JSSS-Syntax das &quot;&uuml;bergeordnete, &auml;u&szlig;ere&quot; HTML-Tag, im obigen Beispiel <tt>tags.P</tt>. Dahinter folgt, durch ein Komma getrennt, das &quot;untergeordnete, innere&quot; HTML-Tag, im Beispiel <tt>tags.I</tt>. Hinter der abschlie&szlig;enden Klammer folgt noch mal ein Punkt, gefolgt von der gew&uuml;nschten Style-Sheet-Angabe. Dabei gelten die <img src="xgoup.gif" width=14 height=10 border=0>&nbsp;<a href="#a31"><b>speziellen Konventionen</b></a>.</p>

<p>Innerhalb von HTML werden die definierten Formate angewendet. Im obigen Beispiel wird Text, der mit <tt>&lt;i&gt;</tt>...<tt>&lt;/i&gt;</tt> als kursiv definiert wird, zus&auml;tzlich rot, wenn er innerhalb eines Textabsatzes (<tt>&lt;p&gt;</tt>...<tt>&lt;/p&gt;</tt>) steht. In allen anderen F&auml;llen
erh&auml;lt <tt>&lt;i&gt;</tt>...<tt>&lt;/i&gt;</tt> die &uuml;bliche Formatierung.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a7"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape 4.0"> JSSS-Formate innerhalb von HTML-Tags definieren</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tfbde.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Sie k&ouml;nnen JSSS-Definitionen auch innerhalb einzelner HTML-Tags zur Schnellformatierung benutzen. Das funktioniert genau so wie beim <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tdbc.htm#a1"><b>Formatieren einzelner HTML-Tags</b></a> nach CSS-Syntax. Der einzige Unterschied ist die Notation der Style-Sheet-Angaben.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;p style=&quot;fontSize='14pt'; marginLeft='1cm'&quot;&gt;Textabsatz&lt;/p&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Sie k&ouml;nnen Formatangaben f&uuml;r ein HTML-Tag bestimmen, indem Sie innerhalb des einleitenden HTML-Tags die Angabe <tt>style=</tt> und dahinter, in Anf&uuml;hrungszeichen, die gew&uuml;nschte Formatdefinitionen notieren. Innerhalb der Formatdefinitionen sind Style-Sheet-Angaben erlaubt. Jede Eigenschaftszuweisung besteht aus einem Namen, z.B. <tt>color</tt> und einem Wert, z.B. <tt>red</tt>, getrennt durch ein Istgleichzeichen (anders als bei CSS!). Style-Sheet-Angaben, die normalerweise mit Bindestrich geschrieben werden, werden bei JSSS-Syntax zusammengeschrieben. Ab dem zweiten Angabenteil beginnt jeder Teil mit einem Gro&szlig;buchstaben. Aus <tt>margin-left</tt> wird so beispielsweise <tt>marginLeft</tt>, aus <tt>background-color</tt> wird <tt>backgroundColor</tt>, und aus <tt>border-bottom-width</tt> wird <tt>borderBottomWidth</tt>. Notieren Sie die Wertzuweisungen in einfachen Anf&uuml;hrungszeichen, so wie im Beispiel etwa <tt>'14pt'</tt>. Doppelte Anf&uuml;hrungszeichen d&uuml;rfen Sie deshalb nicht verwenden, weil ja der gesamte Ausdruck <tt>style=</tt> bereits in solchen Anf&uuml;hrungszeichen steht.</p>


<h3 class="inf">Beachten Sie:</h3>

<p>Diese Art, JSSS-Style-Sheet-Angaben zu definieren, funktioniert noch nicht mit der glatten Versionsnummer 4.0 bei Netscape. Erst bei zus&auml;tzlichen Releases des Typs V4.0x funktionieren die JSSS-Style-Sheet-Angaben innerhalb von HTML-Tags.</p>

<p>Angaben, die Sie innerhalb eines HTML-Tags auf diese Weise definieren, werden vom MS Internet Explorer ignoriert.</p>

<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a8"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape 4.0"> JSSS Style-Sheets und CSS Style-Sheets kombinieren</a></h2>

<p>Es spricht nichts dagegen, CSS Style-Sheets und JSSS Style-Sheets innerhalb der gleichen HTML-Datei zu verwenden. Dabei gelten zwei einfache Prinzipien:</p>
<ol>
<li>CSS Style-Sheets werden sowohl von Netscape als auch vom MS Internet Explorer unterst&uuml;tzt, JSSS Style-Sheets dagegen nur von Netscape.</li>
<li>Diejenige Style-Sheet-Angabe, die &quot;als letzte&quot; definiert wird, ist ma&szlig;geblich.</li>
</ol>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;Titel der Datei&lt;/title&gt;
&lt;style type=&quot;text/css&quot;&gt;
p { fontSize:10pt; color:red; }
&lt;/style&gt;
&lt;style type=&quot;text/javascript&quot;&gt;
with(tags.P)
 {
  fontSize = &quot;12pt&quot;;
  color = &quot;blue&quot;;
 }
&lt;/style&gt;
&lt;/head&gt;
&lt;body&gt;
&lt;p&gt;Text, der in Netscape und MS IE unterschiedlich aussieht&lt;/p&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Im obigen Beispiel wird das HTML-Tag <tt>&lt;p&gt;</tt>...<tt>&lt;/p&gt;</tt> zuerst mit CSS-Syntax formatiert, anschlie&szlig;end mit JSSS-Syntax. Nach CSS-Syntax wird der Text 10 Punkt gro&szlig; und rot, nach JSSS-Syntax 12 Punkt gro&szlig; und blau.</p>

<p>Beim MS Internet Explorer greift nur die CSS-Definition, da dieser Browser den Bereich, der mit <tt>&lt;style type=&quot;text/javascript&quot;&gt;</tt> ist, erst gar nicht ausliest. Bei Netscape greift dagegen die JSSS-Definition. Aber nicht deshalb, weil sie von vorneherein Vorrang vor der CSS-Definition hat, sondern deshalb, weil sie &quot;hinter&quot; der CSS-Definition notiert ist. W&uuml;rde zuerst der JSSS-Bereich notiert und dahinter der CSS-Bereich, w&uuml;rde auch Netscape die CSS-Angaben zur Formatierung verwenden.</p>



<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tfbe.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#ffffff><img src="x3.gif" width=15 height=10 border=0> <a href="tfbe.htm"><b>Dynamisches Positionieren (Netscape)</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tfbc.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#ffffff width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tfbc.htm"><b>Dynamische Filter (Microsoft)</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tf.htm"><b>Dynamisches HTML</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tfb.htm"><b>Die Ans&auml;tze von Microsoft und Netscape</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>