<html>
<head>
<title>SELFHTML: Dynamisches HTML /  Ans&auml;tze / Dynamisches Positionieren (Netscape)</title>
<meta name="description" content="(SELFHTML 7.0) JSSS JavaScript Style-Sheets, ein Bestandteil f&uuml;r Dynamisches HTML bei Netscape ab 4.x">
<meta name="keywords" content="SELFHTML, Dynamisches HTML, Dynamic, JSSS, JavaScript Style-Sheets, Netscape">
<link rel=stylesheet type="text/css" href="wselfhtm.css">
</head>
<body bgcolor=#ffffff text=#000000 link=#aa5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tf.htm"><b>Dynamisches HTML</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tfb.htm"><b>Die Ans&auml;tze von Microsoft und Netscape</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Dynamisches Positionieren (Netscape)</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#ffffff valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Dynamisches Positionieren bei Netscape</b></a> <br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Layer-Bereiche dynamisch anzeigen/verstecken</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>Layer-Bereiche dynamisch &uuml;berlappen</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a4"><b>Layer-Bereiche dynamisch bewegen</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a5"><b>Layer-Bereiche dnyamisch vergr&ouml;&szlig;ern/verkleinern</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a6"><b>Layer-Inhalte dynamisch austauschen</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a7"><b>Layer ohne &lt;layer&gt;-Tag simulieren</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a8"><b>Das Event-Objekt</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a9"><b>Inline-Scripts bei Layern</b></a>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="a1"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape 4.0"> Dynamisches Positionieren bei Netscape</a></h2>

<p>&quot;Dynamisches HTML&quot; - das ist bei Netscape <b>nicht</b> wie beim MS Internet Explorer der beliebige nachtr&auml;gliche Zugriff auf alle Elemente einer HTML-Datei. Sie k&ouml;nnen mit Netscape also nicht wie beim MS Internet Explorer nachtr&auml;glich einen Textabsatz, der mit <tt>&lt;p&gt;</tt>...<tt>&lt;/p&gt;</tt> definiert ist, ohne weiteres v&ouml;llig anders formatieren, oder in eine &Uuml;berschrift 1. Ordnung verwandeln. Eine nahezu vollst&auml;ndige Umsetzung des Document Object Models in JavaScript, wie sie beim MS Internet Explorer mit Hilfe des all-Objekts realisiert ist, gibt es bei Netscape nicht.</p>

<p>Dynamisches HTML gibt es bei Netscape 4.x nur im Zusammenhang mit positionierten Elementen. Deshalb ist hier auch von &quot;Dynamischem Positionieren&quot; die Rede. Bei Netscape ist Dynamisches HTML die M&ouml;glichkeit, positionierte Layer dynamisch zu behandeln, also ein- und auszublenden, zu verschieben usw.</p>

<p>Die Layer-Technologie von Netscape ist allerdings sehr m&auml;chtig. Voraussetzung dabei ist das Definieren von Layern in HTML. Es besteht zwar auch die M&ouml;glichkeit, ohne das <tt>&lt;layer&gt;</tt>-Tag Dynamisches HTML f&uuml;r Netscape zu schreiben, doch das ganze Konzept, das Netscape seinem Browser in der Version 4.x als Dynamisches HTML eingebaut hat, basiert auf dem <tt>&lt;layer&gt;</tt>-Tag. Wenn man auf das <tt>&lt;layer&gt;</tt>-Tag verzichten will, bleibt einem nur, die Layer zu &quot;simulieren&quot;.</p>

<p>Die Beispiele auf dieser Seite konzentrieren sich deshalb im wesentlichen auf die Layer-Technologie. Denn nur so wird der Ansatz deutlich, den Netscape mit seiner Implementierung von Dynamischem HTML verfolgt.</p>

<p>Um die Beispiele auf dieser Seite zu verstehen, m&uuml;ssen Sie vor allem die <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tck.htm"><b>Layer</b></a> in HTML kennen sowie Vorkenntnisse in <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="te.htm"><b>JavaScript</b></a> mitbringen.</p>

<p>S&auml;mtliche Beispiele auf dieser Seite funktionieren nur mit Netscape ab der Version 4.x.</p>

<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape 4.0"> Layer-Bereiche dynamisch anzeigen/verstecken</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tfbea.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Sie k&ouml;nnen Layer mit Hilfe von JavaScript dynamisch anzeigen und verstecken. Je nachdem, wie Sie Ihre Layer definieren, k&ouml;nnen Sie dadurch die verschiedensten Effekte erzielen. Das folgende Beispiel demonstriert, wie Sie eine &quot;Diashow&quot; aus kurzen Texten definieren k&ouml;nnen. Der Anwender braucht nicht mehr scrollen, sondern klickt sich von einem Text zum n&auml;chsten. Die Texte werden in einer &quot;Box&quot; angezeigt.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;Titel der Datei&lt;/title&gt;
&lt;script language=&quot;JavaScript&quot;&gt;
&lt;!--
var AktuellerText = 1;
var Texte = 4;

function NextText()
{
 ++AktuellerText;
 if(AktuellerText &gt; Texte) AktuellerText = 1;
 for(i=0;i&lt;Texte;i++)
  document.layers[i].visibility = &quot;hide&quot;;
 document.layers[AktuellerText-1].visibility = &quot;show&quot;;
}
//--&gt;
&lt;/script&gt;
&lt;/head&gt;
&lt;body&gt;

&lt;layer visibility=show top=150 left=50 width=400 height=125 bgcolor=#DDFFDD&gt;
&lt;p style=&quot;color:#006600; font-family:Arial,Helvetica,San-Serif;
font-size:14pt; font-weight:bold; padding:5mm&quot;&gt; Das ist der erste Text&lt;/p&gt;
&lt;/layer&gt;
&lt;layer visibility=hide top=150 left=50 width=400 height=125 bgcolor=#DDFFDD&gt;
&lt;p style=&quot;color:#006600; font-family:Arial,Helvetica,San-Serif;
font-size:14pt; font-weight:bold; padding:5mm&quot;&gt; Das ist der zweite Text&lt;/p&gt;
&lt;/layer&gt;
&lt;layer top=275 left=50 width=400 bgcolor=#DDFFDD&gt;
&lt;center&gt;&lt;form&gt;
&lt;input type=button value=&quot; weiter &amp;gt;&amp;gt; &quot; onClick=&quot;NextText()&quot;&gt;
&lt;/form&gt;&lt;/center&gt;
&lt;/layer&gt;

&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Im K&ouml;rper der Beispiel-HTML-Datei werden insgesamt drei Layer definiert. Der erste und der zweite Layer enthalten Texte, die dynamisch wechseln sollen. Der dritte Layer enth&auml;lt einen Button. Wenn der Anwender auf den Button klickt, wird eine JavaScript-<img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tebd.htm"><b>Funktion</b></a> mit Namen <tt>NextText()</tt> aufgerufen. Diese Funktion wird im Kopf der HTML-Datei in einem JavaScript-Bereich definiert. Die Funktion sorgt daf&uuml;r, da&szlig; der jeweils n&auml;chste Text angezeigt wird.</p>

<p>Beachten Sie, da&szlig; die ersten beiden Layer identische Angaben zur Position enthalten. Die Angaben <tt>top=150</tt> (linke obere Ecke beginnt 150 Pixel von oben), <tt>left=50</tt> (linke obere Ecke beginnt 50 Pixel von links), <tt>width=400</tt> (Breite des Layers: 400 Pixel), und <tt>height=125</tt> (H&ouml;he des Layers: 125 Pixel), sind in beiden Layern die gleichen. Die beiden Layer unterscheiden sich lediglich durch die Angabe von <tt>visibilty=</tt>. Der erste Layer wird mit <tt>visibilty=show</tt> auf &quot;sichtbar&quot; gesetzt, der zweite Layer mit <tt>visibilty=hide</tt> auf &quot;unsichtbar&quot;. Dadurch wird erreicht, da&szlig; zun&auml;chst nur der erste Layer am Bildschirm angezeigt wird.</p>

<p>Der dritte Layer, also der mit dem Kontroll-Button, enth&auml;lt ebenfalls Angaben zur Position. Er hat die gleiche Breite wie die beiden ersten Layer und beginnt auch links an der gleichen Position. In der H&ouml;he beginnt er genau 125 Pixel tiefer als die beiden ersten Layer. Da diese eine H&ouml;he von 125 Pixeln haben, schlie&szlig;t der &quot;Kontroll-Button-Layer&quot; also nahtlos an die oberen Layer an. Er enth&auml;lt keine Angabe zur Sichtbarkeit. Das bedeutet, er ist sichtbar, und das wird sich auch im Verlauf des JavaScripts nicht &auml;ndern. Denn der Inhalt dieses Layers steuert ja das Geschehen.</p>

<p>In dem <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tea.htm#a4"><b>JavaScript-Bereich</b></a> im Kopf der Datei werden zun&auml;chst zwei globale <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tebb.htm"><b>Variablen</b></a> definiert. Da sie au&szlig;erhalb jeder Funktion stehen, beh&auml;lt ihr aktueller Wert solange G&uuml;ltigkeit, wie die HTML-Datei angezeigt wird. In der Variablen <tt>AktuellerText</tt> wird die Nummer des aktuellen Textes gespeichert. In <tt>Texte</tt> wird die Anzahl der dynamisch austauschbaren Texte gespeichert. Sie k&ouml;nnten anstelle der zwei Layer mit Texten auch 10 oder 100 solcher Layer definieren. Entsprechend der Anzahl der definierten Layer m&uuml;&szlig;ten Sie nur den Anfangswert von Texte anders <tt>zuweisen</tt>.</p>

<p>Innerhalb der Funktion <tt>NextText()</tt> wird zun&auml;chst die Nummer von <tt>AktuellerText</tt> erh&ouml;ht, denn es soll ja der jeweils n&auml;chste Text angezeigt werden. Anschlie&szlig;end werden in einer for-Schleife alle Layer mit Texten auf &quot;unsichtbar&quot; gesetzt. Am Ende wird der Layer desjenigen Textes, der angezeigt werden soll (<tt>AktuellerText</tt>) auf &quot;sichtbar&quot; gesetzt. Dadurch entsteht der Diashow-Effekt.</p>

<h3 class="inf">Beachten Sie:</h3>

<p>Netscape dehnt die Layer entsprechend ihres Inhalts aus. Wenn der Inhalt eines Textes im obigen Beispiel gr&ouml;&szlig;er ist als der definierte Layer-Bereich, &uuml;berschneidet er sich mit dem Layer des Kontoll-Buttons, jedoch so, da&szlig; der Layer mit dem Kontroll-Button &uuml;ber dem unteren Teil des Layers mit dem Text liegt. Der Grund daf&uuml;r ist, da&szlig; der Layer mit dem Kontroll-Button hinter dem Layer mit dem Text definiert wird und daher im &quot;Stack&quot; (Stapel) weiter oben liegt. Wenn Sie die Gr&ouml;&szlig;e eines Layers unabh&auml;ngig vom Inhalt fest machen wollen, m&uuml;ssen Sie das Attribut <tt>clip=</tt> benutzen (siehe auch: <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcka.htm#a4"><b>Anzeigebereich von Layern beschneiden</b></a>).</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a3"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape 4.0"> Layer-Bereiche dynamisch &uuml;berlappen</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tfbeb.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Sie k&ouml;nnen Layer so positionieren, da&szlig; diese sich &uuml;berlappen. Das macht ohne JavaScript meistens allerdings wenig Sinn, denn der Anwender soll die Inhalte der Layer ja sehen k&ouml;nnen. Mit Hilfe von JavaScript k&ouml;nnen Sie jedoch bewirken, da&szlig; der Anwender sich einen einzelnen Layer in den Vordergrund holen kann, um dessen Inhalt anzuzeigen. Auf diese Weise k&ouml;nnen Sie auf einer WWW-Seite durchaus verschiedene Inhalte unterbringen, f&uuml;r die normalerweise mehrere Seiten angebracht w&auml;ren. Im folgenden Beispiel sind die Layer wie in einem Karteikastenstapel aufgereiht. Der Anwender kann einen Layer &quot;herausgreifen&quot;.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;Titel der Datei&lt;/title&gt;
&lt;style type=&quot;text/css&quot;&gt;
 layer.Kopf { text-align:right }
 layer.Text { padding:5px }
&lt;/style&gt;
&lt;script language=&quot;JavaScript&quot;&gt;
&lt;!--
var aktiv = &quot;Home&quot;;
function Hervorheben(neu_aktiv)
{
 document.layers['Infos'].zIndex = 1;
 document.layers['News'].zIndex = 2;
 document.layers['Home'].zIndex = 3;
 document.layers[aktiv].bgColor = &quot;#CCCCCC&quot;;
 document.layers[aktiv].layers[0].bgColor = &quot;#666666&quot;;
 document.layers[aktiv].layers[1].visibility = &quot;hide&quot;;
 document.layers[neu_aktiv].zIndex = 4;
 document.layers[neu_aktiv].bgColor = &quot;#FFCCFF&quot;;
 document.layers[neu_aktiv].layers[0].bgColor = &quot;#000000&quot;;
 document.layers[neu_aktiv].layers[1].visibility = &quot;show&quot;;
 aktiv = neu_aktiv;
}
//--&gt;
&lt;/script&gt;
&lt;/head&gt;
&lt;body link=#FFFFFF vlink=#FFFFFF alink=#FFFFFF text=#000000&gt;
&lt;layer id=&quot;Infos&quot; top=155 left=70 width=360 height=230 bgcolor=#CCCCCC&gt;
  &lt;layer class=&quot;Kopf&quot; width=360 height=25 bgcolor=#666666&gt;
   &lt;a href=&quot;javascript:Hervorheben('Infos')&quot;&gt;Infos&lt;/a&gt;
  &lt;/layer&gt;
  &lt;layer class=&quot;Text&quot; top=25 visibility=hide&gt;
   Hier stehen die Infos
  &lt;/layer&gt;
&lt;/layer&gt;
&lt;layer id=&quot;News&quot; top=180 left=130 width=360 height=230 bgcolor=#CCCCCC&gt;
  &lt;layer class=&quot;Kopf&quot; width=360 height=25 bgcolor=#666666&gt;
   &lt;a href=&quot;javascript:Hervorheben('News')&quot;&gt;News&lt;/a&gt;
  &lt;/layer&gt;
  &lt;layer class=&quot;Text&quot; top=25 visibility=hide&gt;
   Hier stehen die News
  &lt;/layer&gt;
&lt;/layer&gt;
&lt;layer id=&quot;Home&quot; top=205 left=190 width=360 height=230 bgcolor=#FFCCFF&gt;
  &lt;layer class=&quot;Kopf&quot; width=360 height=25 bgcolor=#000000&gt;
   &lt;a href=&quot;javascript:Hervorheben('Home')&quot;&gt;HOME&lt;/a&gt;
  &lt;/layer&gt;
  &lt;layer class=&quot;Text&quot; top=25 visibility=show&gt;
   Hier steht der Einstiegstext
  &lt;/layer&gt;
&lt;/layer&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Im Beispiel werden drei &quot;gro&szlig;e&quot; Layer definiert: einer f&uuml;r Infos, einer f&uuml;r News, und einer f&uuml;r &quot;Home&quot;, was bedeuten soll, da&szlig; dieser Layer eine Art Homepage, einen Home-Layer darstellt. Dieser Layer wird auch zuerst im Vordergrund angezeigt. Und zwar deshalb, weil er als letzter definiert wird. Wenn Sie bei Layern kein Attribut  <tt>z-index=</tt> notieren, liegt immer derjenige Layer ganz oben, der als letzter definiert wird.</p>

<p>Dem Beispiel k&ouml;nnen Sie auch entnehmen, da&szlig; innerhalb der Layer f&uuml;r Infos, News und Home jeweils zwei &quot;innere&quot; Layer definiert werden. Layer, die innerhalb anderer Layer definiert werden, werden relativ zu ihrem Eltern-Layer positioniert. Dazu m&uuml;ssen Sie sich einen Layer vorstellen wie einen neuen kleinen Dateik&ouml;rper. Alles, was innerhalb davon notiert wird, wird relativ dazu positioniert.</p>

<p>Die Angaben zu <tt>top=</tt>, <tt>left=</tt>, <tt>height=</tt> und <tt>width=</tt> in den Layern im obigen Beispiel sind alle genau ermittelt, und zwar so, da&szlig; die Layer optisch einen sauber sortierten Karteikastenstapel darstellen. Versuchen Sie, die Abh&auml;ngigkeiten der Positionierungsangaben im Beispiel zu ermitteln. So k&ouml;nnen Sie erkennen, wie Sie vorgehen m&uuml;ssen, um mehrere Layer nach einem von Ihnen gew&uuml;nschten Kriterium ordentlich verteilt im Anzeigefenster zu plazieren.</p>

<p>Jeder der &quot;gro&szlig;en&quot; Layer enth&auml;lt im obigen Beispiel zwei innere Layer: einen Layer, der wie eine Titelleiste wirkt und einen Verweis enth&auml;lt, und einen Layer, der den eigentlichen Inhalt enth&auml;lt. Die Verweise in den Titelleisten-Layern rufen eine JavaScript-Funktion namens <tt>Hervorheben()</tt> auf. Diese Funktion bewirkt das dynamische Hervorholen des &quot;gro&szlig;en&quot; Layers, der zu dem angeklickten Verweis geh&ouml;rt (also des Eltern-Layers von dem Layer, in dem der Verweis steht).</p>

<p>In dem Script-Bereich, in dem die Funktion <tt>Hervorheben()</tt> steht, wird vor der Funktion eine Variable <tt>aktuell</tt> definiert. Sie bekommt zu Beginn den Namen des vorne liegenden Layers zugewiesen. Das ist derjenige Name, der beim entsprechenden Layer im Attribut <tt>id=</tt> vergeben wurde.<br>
Die Funktion <tt>Hervorheben()</tt> erwartet einen Parameter, n&auml;mlich den Namen desjenigen Layers, der anstelle des bisher vorne liegenden Layers hervorgeholt werden soll. Bei den Verweisen, die die Funktion aufrufen, wird denn auch wieder der Name &uuml;bergeben, der im entsprechenden Layer bei <tt>id=</tt> vergeben ist.</p>

<p>Innerhalb der Funktion <tt>Hervorheben()</tt> wird zun&auml;chst die normale Layer-Reihenfolge hergestellt. Das geschieht durch Zuweisen einer Zahl an die Layer-Objekteigenschaft <tt>zIndex</tt>. Je h&ouml;her die Zahl, desto weiter vorne im Stapel liegt der Layer. Das Wiederherstellen der normalen Layer-Reihenfolge bewirkt, da&szlig; der &quot;Karteikastenstapel&quot;, den das Beispiel darstellt, immer aufger&auml;umt erscheint.</p>

<p>Anschlie&szlig;end wird der bisher aktive Layer, bezeichnet durch <tt>document.layers[aktiv]</tt>, mit mehreren Anweisungen behandelt. Die Angabe <tt>aktiv</tt> in den eckigen Klammern zeigt zun&auml;chst auf den Layer <tt>&quot;Home&quot;</tt>. Am Ende der Funktion wird der Wert der Variablen <tt>aktiv</tt> jedoch ge&auml;ndert. Dort wird ihr der Name des neuen hervorgehobenen Layers zugewiesen. Dadurch ist beim n&auml;chsten Aufruf der Funktion dieser Layer derjenige, der von <tt>document.layers[aktiv]</tt> betroffen ist.<br>
Die Anweisungen, die den bisher aktiven Layer betreffen, weisen diesem Atrribute zu, die ihn optisch zu einem &quot;untenliegenden&quot; Layer im Karteikastenstapel machen.</p>

<p>Derjenige Layer mit dem Namen, der mit dem Parameter <tt>neu_aktiv</tt> &uuml;bergeben wurde, erh&auml;lt dagegen diejenigen optischen Attribute, die ihn als hervorgehobenen Layer auszeichnen. Er bekommt auch die h&ouml;chste Zahl f&uuml;r <tt>zIndex</tt>. Dadurch wird er als oberster Layer angezeigt.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a4"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape 4.0"> Layer-Bereiche dynamisch bewegen</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tfbec.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Sie k&ouml;nnen Layer mit beliebigen Inhalten &uuml;ber das Anzeigefenster springen oder wandern lassen. Das Springen zu einer Stelle ist dabei nur ein einziger Befehl, da dies als Methode im Layer-Objekt von JavaScript zur Verf&uuml;gung steht. Wenn Sie dagegen zeitgesteuerte Bewegungseffekte wollen, m&uuml;ssen Sie die Positionsberechung vom Startpunkt bis zum Endpunkt des Bewegungsvorgangs &quot;zu Fu&szlig;&quot; programmieren. Das folgende Beispiel zeigt, wie so etwas im Prinzip funktioniert.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;Titel der Datei&lt;/title&gt;
&lt;script language=&quot;JavaScript&quot;&gt;
&lt;!--
function hBeweg(LayerNum,bis_links,Pixel,Pause)
{
 Restpixel = bis_links - document.layers[LayerNum].left;
 if(bis_links &lt; document.layers[LayerNum].left) Pixel=0-Pixel;
 if(Math.abs(Restpixel) &gt; Math.abs(Pixel))
   document.layers[LayerNum].moveBy(Pixel,0);
 else
   document.layers[LayerNum].moveBy(Restpixel,0);
 if(document.layers[LayerNum].left != bis_links)
window.setTimeout('hBeweg('+LayerNum+','+bis_links+','+Math.abs(Pixel)+')','+Pause+');
}
function vBeweg(LayerNum,bis_oben,Pixel,Pause)
{
 Restpixel = bis_oben - document.layers[LayerNum].top;
 if(bis_oben &lt; document.layers[LayerNum].top) Pixel=0-Pixel;
 if(Math.abs(Restpixel) &gt; Math.abs(Pixel))
   document.layers[LayerNum].moveBy(0,Pixel);
 else
   document.layers[LayerNum].moveBy(0,Restpixel);
 if(document.layers[LayerNum].top != bis_oben)
window.setTimeout('vBeweg('+LayerNum+','+bis_oben+','+Math.abs(Pixel)+')','+Pause+');
//--&gt;
&lt;/script&gt;
&lt;/head&gt;
&lt;body link=#FF0000 vlink=#FF0000 alink=#000000 text=#000000&gt;
&lt;layer left=10 top=10 width=450 height=150&gt;
&lt;p&gt;Springe nach:
&lt;a href=&quot;javascript:document.layers[0].moveTo(10,10)&quot;&gt;links oben&lt;/a&gt; |
&lt;a href=&quot;javascript:document.layers[0].moveTo(260,10)&quot;&gt;rechts oben&lt;/a&gt; |
&lt;a href=&quot;javascript:document.layers[0].moveTo(10,260)&quot;&gt;links unten&lt;/a&gt; |
&lt;a href=&quot;javascript:document.layers[0].moveTo(260,260)&quot;&gt;rechts unten&lt;/a&gt;&lt;br&gt;
Bewege nach:
&lt;a href=&quot;javascript:hBeweg(0,10,4,2)&quot;&gt;links&lt;/a&gt; |
&lt;a href=&quot;javascript:hBeweg(0,260,4,2)&quot;&gt;rechts&lt;/a&gt; |
&lt;a href=&quot;javascript:vBeweg(0,10,4,2)&quot;&gt;oben&lt;/a&gt; |
&lt;a href=&quot;javascript:vBeweg(0,260,4,2)&quot;&gt;unten&lt;/a&gt;&lt;/p&gt;
&lt;/layer&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Innerhalb des Dateik&ouml;rpers der HTML-Datei im obigen Beispiel wird ein Layer definiert. Dieser Layer enth&auml;lt insgesamt acht Verweise. Bei jedem Verweis wird JavaScript-Code ausgef&uuml;hrt. Dabei wird der Befehl, den der Verweis dem Anwender anbietet, in die Tat umgesetzt.</p>

<p>Alle Verweise sorgen f&uuml;r eine Neupositionierung des Layers, in dem sie sich selber befinden. Das mu&szlig; nicht so sein - es ist im obigen Beispiel einfach zu Demo-Zwecken so gel&ouml;st. Der Layer, den es dynamisch zu positionieren gilt, k&ouml;nnte auch etwas ganz anderes enthalten, etwa Grafiken, Tabellen usw.</p>

<p>Die ersten vier Verweise f&uuml;hren lediglich Spr&uuml;nge aus, d.h. beim Klicken auf einen dieser Verweise wird der Layerinhalt einfach sofort an einer anderen Stelle im Anzeigefenster angezeigt. F&uuml;r diese Aufgabe stellt das Layer-Objekt von JavaScript die Methode <tt>moveTo()</tt> zur Verf&uuml;gung. Mit einer Anweisung wie <tt>document.layers[0].moveTo(...)</tt> positionieren Sie den ersten Layer der Datei (der den Index 0 hat) an einer neuen Position. Die Methode <tt>moveTo()</tt> setzt die neue Position der linken oberen Ecke des Layers. Dazu erwartet die Methode zwei Parameter, und zwar zuerst den Wert f&uuml;r links, und als zweites den Wert f&uuml;r oben. Mit einer Anweisung wie <tt>document.layers[0].moveTo(260,10)</tt> wird also die linke obere Ecke des Layers auf 260 Pixel von links und 10 Pixel von oben gesetzt. Die Angaben beziehen sich auf das jeweilige Elternelement des Layers. Da der Layer im obigen Beispiel kein Layer innerhalb eines anderen Layers ist, ist das normale Anzeigefenster das Elternelement.</p>

<p>W&auml;hrend das einfache Neupositionieren mit einer einzigen JavaScript-Anweisung m&ouml;glich ist, die im obigen Beispiel direkt in den entsprechenden Verweisen steht, mu&szlig; zum dynamischen Bewegen von Layern eine eigene Funktion aufgerufen werden, die den Bewegungsabluf bestimmt. Im obigen Beispiel gibt es zwei solcher Funktionen. Die Funktion <tt>hBeweg()</tt> kann Layer horizontal nach links oder rechts verschieben, die Funktion <tt>vBeweg()</tt> leistet das gleiche, nur vertikal nach oben oder unten. Entsprechend werden die Funktionen aufgerufen. Wenn der Anwender einen der Verweise zum Bewegen nach rechts oder links angeklickt, wird <tt>hBeweg()</tt> aufgerufen, und bei den Verweisen zum Bewegen nach unten oder oben wird <tt>vBeweg()</tt> aufgerufen.</p>

<p>Beide Funktionen sind allgemein geschrieben. Deshalb erwarten sie als Input auch verschiedene Parameter, die beim Funktionsaufruf zu &uuml;bergeben sind:<br>
<tt>LayerNum</tt> ist die Indexnummer des Layers, der bewegt werden soll. Da im Beispiel immer der gleiche und einzige vorhandene Layer bewegt werden soll, wird beim Aufruf der Funktionen immer dessen Indexnummer 0 &uuml;bergeben.<br>
<tt>bis_links</tt> (bei <tt>hBeweg()</tt>) bzw. <tt>bis_oben</tt> (bei  <tt>vBeweg()</tt>) ist der neue Endwert, bei dem die Bewegung gestoppt werden soll. Je nachdem, ob der Wert, den Sie dabei &uuml;bergeben, gr&ouml;&szlig;er oder kleiner ist als die aktuelle Position des Layers, ergibt sich automatisch die Bewegungsrichtung.<br>
<tt>Pixel</tt> ist die Anzahl der Pixel, um die pro Bewegungsschritt weiter gesprungen wird. Je h&ouml;her der Wert ist, den Sie daf&uuml;r &uuml;bergeben, desto schneller und ruckartiger die Bewegung. Im obigen Beispiel wird in allen F&auml;llen 4 &uuml;bergeben.<br>
<tt>Pause</tt> ist ein weiterer Parameter zur Beeinflussung der Geschwindigkeit. Je h&ouml;her der Wert, desto langsamer die Bewegung.</p>

<p>Ein Bewegen von Layern besteht in nichts anderem als einem schrittweise neuen Positionieren des Layers. In den Funktionenen <tt>hBeweg()</tt> und <tt>vBeweg()</tt> stehen jeweils etwa in der Mitte zwei Anweisungen der Art <tt>document.layers[LayerNum].moveBy(...)</tt>, von denen immer nur eine ausgef&uuml;hrt wird. Das ist diejenige Anweisung, mit der der Layer jeweils neu positioniert wird. Es handelt sich einfach um den Aufruf der Methode <tt>moveBy()</tt> des Layer-Objekts. Diese Methode funktioniert genauso wie <tt>moveTo()</tt>, nur mit relativen Angaben statt mit absoluten.</p>

<p>Damit der Layer nicht nur einmal, sondern weiter bewegt wird, rufen sich die beiden Funktionen <tt>hBeweg()</tt> und <tt>vBeweg()</tt> am Ende jeweils selbst wieder auf. Der Schleifen-Effekt, der dadurch entsteht, wird erst abgebrochen, wenn der gew&uuml;nschte Endwert erreicht ist.<br>
Der Selbstaufruf der Funktion ist in die JavaScript-Methode window.setTimeout() eingebunden. Dadurch kann die Verz&ouml;gerung ber&uuml;cksichtigt werden, die mit dem Parameter <tt>Pause</tt> &uuml;bergeben wurde. Der Selbstaufruf der Funktion wirkt etwas kompliziert. Das liegt daran, da&szlig; die Funktion sich auch wieder mit den von ihr erwarteten Parametern aufrufen mu&szlig;. Leider ist es nicht m&ouml;glich, dazu einen normalen Funktionsaufruf zu notieren und einfach die &uuml;bergeben bekommenen Parameter wieder zu &uuml;bergeben. Stattdessen wird eine Zeichenkette zusammengebaut, die die Funktion beim Neuaufruf mit tats&auml;chlichen Werten versorgt.</p>

<p>Die &uuml;brigen Anweisungen in den beiden Funktionen dienen zur Kontrolle des Bewegungsablaufs, vor allem dazu, da&szlig; trotz unterschiedlicher Aufrufparameter am Ende tats&auml;chlich die gew&uuml;nschte Endposition erreicht wird. So ist <tt>Restpixel</tt> eine Hilfsvariable, die ermittelt, wie viele Pixel noch zwischen aktueller Layerposition und dem gew&uuml;nschten Endwert liegen. Wichtig ist auch die korrekte Bestimmung der Bewegungsrichtung. Wenn der gew&uuml;nschte Endwert der Bewegung kleiner ist als die Position des Layers beim Start der Bewegung, dann mu&szlig; der Schrittwert, der mit dem Parameter <tt>Pixel</tt> &uuml;bergeben wird, als negative Zahl interpretiert werden. Denn nur so kann es &quot;r&uuml;ckw&auml;rts&quot; gehen, also nach links oder nach oben. Mit dem Ausdruck <tt>Pixel=0-Pixel</tt> wird der Schrittwert bei Bedarf auf eine negative Zahl &quot;umgepolt&quot;.</p>

<h3 class="inf">Beachten Sie:</h3>

<p>Komplexere Bewegungsabl&auml;ufe ben&ouml;tigen entsprechend komplexere Programmierung. Bei diagonalen Bewegungen ist es nur einfach, solange die Anzahl der Pixel, um die pro Bewegungsschritt weiter positioniert wird, horizontal und vertikal immer proportional ist. Sobald Sie aber &quot;krumme&quot; Aufgaben l&ouml;sen wollen, etwa die, von oben 10 links 10 nach oben 86 links 623 auf m&ouml;glichst geradem Weg zu kommen, d&uuml;rfen Sie in die Tiefen der Arithmetik eintauchen. Und wenn Sie gar Kreis- oder Ellipsenbewegungen wollen, m&uuml;ssen Sie entsprechende geometrische Formeln kennen und die daf&uuml;r vorgesehenen Methoden des Math-Objekts von JavaScript benutzen. Die besondere Herausforderung bei alledem ist jedoch weniger das Anwenden von Formeln in JavaScript, sondern das Umsetzen der Formelergebnisse in Treppeneffekte - denn Sie k&ouml;nnen einen Layer nun mal nicht um die Zahl Pi bewegen, sondern immer nur um eine Anzahl von Pixeln horizontal und vertikal.</p>

<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a5"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape 4.0"> Layer-Bereiche dynamisch vergr&ouml;&szlig;ern/verkleinern</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tfbed.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Durch dynamisches Ver&auml;ndern des angezeigten Bereichs eines Layers lassen sich unz&auml;hlige interessante Effekte erzielen, zum Beispiel zum dynamischen Aufklappen und Zuklappen von Teilen einer WWW-Seite. Das folgende Beispiel bewirkt drei &quot;Bl&ouml;cke&quot;, von denen zun&auml;chst nur Titelzeilen sichtbar sind. Jede Titelzeile enth&auml;lt einen Verweis. Beim Anklicken des Verweises wird unterhalb der Titelzeile ein Bereich mit Inhalt nach unten aufgerollt. Beim n&auml;chsten Anklicken des Verweises wird er wieder zugerollt.</p>


<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;Titel der Datei&lt;/title&gt;
&lt;style type=&quot;text/css&quot;&gt;
layer.Text { padding:5px; font-size:14pt;
font-family:Arial,Helvetica,Sans-Serif; color:#FFFFFF }
layer.Kopf { padding:5px; font-size:10pt;
font-family:Arial,Helvetica,Sans-Serif; font-weight:bold; }
a:link, a:visited, a:active { color:#FFFFE0; }
&lt;/style&gt;
&lt;script language=&quot;JavaScript&quot;&gt;
&lt;!--
var Status = new Array(&quot;zu&quot;,&quot;zu&quot;,&quot;zu&quot;);
function AufUndZu(LayerNum)
{
 if(Status[LayerNum] == &quot;zu&quot;)
  {
   for(i=2;i&lt;250;++i)
     document.layers[LayerNum].clip.bottom = i;
   Status[LayerNum] = &quot;auf&quot;;
  }
 else
  {
   for(i=250;i&gt;2;--i)
     document.layers[LayerNum].clip.bottom = i;
   Status[LayerNum] = &quot;zu&quot;;
  }
}
//--&gt;
&lt;/script&gt;
&lt;/head&gt;
&lt;body bgcolor=#FFFFFF&gt;
&lt;layer class=&quot;Text&quot; left=10 top=170 width=198 height=250 bgcolor=#000099 clip=&quot;0,0,198,2&quot;&gt;
Inhalt des linken aufklappbaren Layers
&lt;/layer&gt;
&lt;layer class=&quot;Text&quot; left=210 top=170 width=198 height=250 bgcolor=#994000 clip=&quot;0,0,198,2&quot;&gt;
Inhalt des mittleren aufklappbaren Layers
&lt;/layer&gt;
&lt;layer class=&quot;Text&quot; left=410 top=170 width=198 height=250 bgcolor=#008000 clip=&quot;0,0,198,2&quot;&gt;
Inhalt des rechten aufklappbaren Layers
&lt;/layer&gt;
&lt;layer class=&quot;Kopf&quot; left=10 top=145 width=198 height=25 bgcolor=#000000&gt;
&lt;a href=&quot;javascript:AufUndZu(0)&quot;&gt;Verweis links&lt;/a&gt;
&lt;/layer&gt;
&lt;layer class=&quot;kopf&quot; left=210 top=145 width=198 height=25 bgcolor=#000000&gt;
&lt;a href=&quot;javascript:AufUndZu(1)&quot;&gt;Verweis Mitte&lt;/a&gt;
&lt;/layer&gt;
&lt;layer class=&quot;kopf&quot; left=410 top=145 width=198 height=25 bgcolor=#000000&gt;
&lt;a href=&quot;javascript:AufUndZu(2)&quot;&gt;Verweis rechts&lt;/a&gt;
&lt;/layer&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>In dem Beispiel werden insgesamt sechs Layer definiert. Die ersten drei Layer sind diejenigen, die auf- und zuklappbar sind. Zun&auml;chst sind diese Layer zugeklappt. Das wird durch das Attribut <tt>clip=</tt> erreicht. Durch diese Angabe l&auml;&szlig;t sich der angezeigte Bereich eines Layers beliebig einschr&auml;nken. Die auf-/zuklappbaren Layer im obigen Beispiel etwa haben durch die Angaben <tt>width=198 height=250</tt> eine Breite von 198 und eine H&ouml;he von 250 Pixeln. Durch die Angabe <tt>clip=&quot;0,0,198,2&quot;</tt> wird folgendes erreicht: trotz der definierten Breite und H&ouml;he ist nur der Bereich von links 0 oben 0 bis links 198 oben 2 sichtbar. Das ist nur ein ganz d&uuml;nner Streifen, der aus optischen Gr&uuml;nden zugelassen wird. Mit <tt>0,0,198,0</tt> w&auml;re von den Layern &uuml;berhaupt nichts zu sehen.</p>

<p>Die drei unteren Layer sind mit Hilfe der Angaben zu <tt>top=</tt>, <tt>left=</tt>, <tt>width=</tt> und <tt>height=</tt> so positioniert, da&szlig; sie genau &uuml;ber den auf-/zuklappbaren Layern stehen. Diese &quot;Kopf&quot;-Layer enthalten Verweise. Bei jedem Klick auf einen Verweis in einem der Kopf-Layer wird der Layer unterhalb davon auf- oder wieder zugeklappt. Dazu wird bei jedem Klick auf einen der Verweise eine JavaScript-Funktion aufgerufen: die Funktion <tt>AufUndZu()</tt>, die im Kopf der Datei in einem JavaScript-Bereich definiert ist.</p>

<p>In dem JavaScript-Bereich wird vor der Funktion <tt>AufUndZu()</tt> bereits ein Array, bestehend aus drei Werten, definiert: der Array <tt>Status</tt>. Alle seine drei Werte erhalten den Anfangszustand <tt>&quot;zu&quot;</tt>. Da dieser Array au&szlig;erhalb jeder Funktion definiert ist, stehen seine Daten jederzeit zur Verf&uuml;gung.</p>

<p>Innerhalb der Funktion <tt>AufUndZu()</tt> wird gepr&uuml;ft, ob ein Layer derzeit auf- oder zugeklappt ist. Dazu bekommt die Funktion beim Aufruf einen Parameter <tt>LayNum</tt> &uuml;bergeben. Das ist die Indexnummer des Layers, der auf- oder zugeklappt werden soll. Da im Beispiel die ersten drei definierten Layer davon betroffen sein sollen, kommen also nur die Indexnummern 0, 1 und 2 in Frage. Beim Aufruf der Funktion in den unteren drei Layern werden denn auch genau diese drei Werte &uuml;bergeben. Mit der Abfrage <tt>if(Status[LayerNum] == &quot;zu&quot;)</tt> vergleicht die Funktion <tt>AufUndZu()</tt>, was im Array <tt>Status</tt> als Wert f&uuml;r die &uuml;bergebene Indexnummer steht. Wenn dort <tt>&quot;zu&quot;</tt> steht, wird der Layer aufgeklappt. Wenn er aufgeklappt wird, wird der Wert im Array am Ende auf den Wert <tt>&quot;auf&quot;</tt> gesetzt. Dadurch gelangt die Funktion bei der n&auml;chsten Abfrage f&uuml;r den gleichen Layer in den else-Zweig, wo sie genau die umgekehrten Arbeiten durchf&uuml;hrt.</p>

<p>Das eigentliche Auf- und Zuklappen geschieht innerhalb der for-Schleife. Dort wird beim Aufklappen von 2 bis 250 gez&auml;hlt und beim Zuklappen von 250 zur&uuml;ck auf 2. Abh&auml;ngig vom aktuellen Schleifenwert wird die Unterseite des Clip-Bereichs des Layers mit <tt>document.layers[LayerNum].clip.bottom=</tt> dynamisch ver&auml;ndert. Die Grenzwerte von 2 und 250 h&auml;ngen mit den definierten Layern zusammen: die 2 ist jener Wert, der bei den Angaben <tt>clip=&quot;0,0,198,2&quot;</tt> vorkommt, und 250 ist die H&ouml;he der definierten Layer (<tt>height=250</tt>). Beim Aufklappen wird also der Clip-Bereich im Script dynamisch auf 0,0,198,250 ver&auml;ndert. Das bedeutet: der Layer ist vollst&auml;ndig sichtbar. Beim Zuklappen wird dagegen wieder der Clip-Anfangszustand von 0,0,198,2 wiederhergestellt.</p>


<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a6"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape 4.0"> Layer-Inhalte dynamisch austauschen</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tfbee.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Einen der gro&szlig;en Vorteile des Microsoft-Ansatzes f&uuml;r Dynamisches HTML, n&auml;mlich das beliebige Austauschenk&ouml;nnen von HTML-Elementinhalten, k&ouml;nnen Sie mit Hilfe von Netscape-Layern zumindest &quot;nachstellen&quot;. Der Grund ist, da&szlig; Netscape einen Layer wie ein eigenes kleines neues Dokument innerhalb des Elterndokuments behandelt. So sind auch alle JavaScript-Objekte darauf anwendbar, die unterhalb des document-Objekts liegen. Das folgende Beispiel verdeutlicht, wie dies bei Layern im einzelnen funktioniert, und welche M&ouml;glichkeiten sich dabei er&ouml;ffnen.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;Titel der Datei&lt;/title&gt;
&lt;script language=&quot;JavaScript&quot;&gt;
&lt;!--
function DatenSchreiben()
{
 var Text = document.Input.document.Eingabe.Feld.value;
 var Laenge = document.Input.document.Eingabe.Feld.value.length;
 document.Output.document.clear();
 document.Output.document.write(&quot;&lt;p&gt;Sie haben folgenden Text eingegeben:&lt;br&gt;&quot;);
 document.Output.document.write(&quot;&lt;b&gt;&quot; + Text + &quot;&lt;/b&gt;&lt;/p&gt;&quot;);
 document.Output.document.write(&quot;&lt;p&gt;Der Text hat eine Laenge von &quot;);
 document.Output.document.write(&quot;&lt;b&gt;&quot; + Laenge + &quot; Zeichen&lt;/b&gt;&lt;/p&gt;&quot;);
 document.Output.document.close();
}
//--&gt;
&lt;/script&gt;
&lt;/head&gt;
&lt;body bgcolor=#FFFFFF&gt;
&lt;layer id=&quot;Input&quot; bgcolor=#EEEEFF style=&quot;padding:5mm&quot;
left=10 top=140 width=280 height=280&gt;
&lt;p&gt;Geben Sie in dem Feld Text ein und klicken Sie dann auf &quot;Interaktion&quot;&lt;/p&gt;
&lt;form name=&quot;Eingabe&quot;&gt;
&lt;textarea name=&quot;Feld&quot; cols=25 rows=6 wrap=virtual&gt;&lt;/textarea&gt;&lt;br&gt;
&lt;input type=&quot;button&quot; value=&quot;Interaktion&quot; width=221 onClick=&quot;DatenSchreiben()&quot;&gt;
&lt;/form&gt;
&lt;/layer&gt;
&lt;layer id=&quot;Output&quot; left=310 top=145 width=280 height=280&gt;
&lt;/layer&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Im Beispiel werden zwei Layer definiert: einer mit dem Namen (id) <tt>Input</tt> und einer mit dem Namen <tt>Output</tt>. Beide Layer sind so positioniert, da&szlig; der Layer f&uuml;r den Output neben dem Layer f&uuml;r den Input erscheint. Der Layer f&uuml;r den Output erh&auml;lt jedoch zun&auml;chst keinen Inhalt. Im Layer f&uuml;r den Input wird dagegen ein Formular definiert. Das Formular besteht aus einem mehrzeiligen Eingabefeld und einem Button. Wenn der Anwender auf den Button klickt, wird die JavaScript-Funktion <tt>SchreibeDaten()</tt> aufgerufen, die im Kopf der Datei innerhalb eines JavaScript-Bereichs definiert ist.</p>

<p>Die Funktion ermittelt zun&auml;chst den eingegebenen Text und dessen L&auml;nge. Anschlie&szlig;end schreibt sie diese Daten zur Kontrolle in den Layer mit dem Namen <tt>Output</tt>. Wichtig ist, da&szlig; vor dem dynamischen Schreiben des Inhalts die Methode <tt>clear()</tt> aufgerufen wird, die den aktuellen Inhalt des Layers l&ouml;scht, und nach dem Schreiben die Methode <tt>close()</tt>, die den Vorgang abschlie&szlig;t, so da&szlig; beim n&auml;chsten Mal ein neuer Schreibzugriff m&ouml;glich ist. Dazwischen werden die eigentlichen Daten geschrieben, und zwar mit der Methode <tt>write()</tt>.</p>

<p>Alle drei Methoden sind altbekannte Methoden des document-Objekts von JavaScript. Das besondere im Fall der Layer ist, da&szlig; das document-Objekt bei den Anweisungen gleich doppelt verwendet wird. Ein Beispiel ist die Anweisung: 
<tt>document.Output.document.clear();</tt>. Auch zu Beginn der Funktion, beim Ermitteln des Formularfeldinhalts, kommt diese doppelte Verwendung von <tt>document</tt> vor.<br>
Solche Konstruktionen m&uuml;ssen Sie so verstehen: &uuml;ber das vorne notierte <tt>document</tt> sind Layer-Objekte ansprechbar, da diese unterhalb des document-Objekts liegen. <tt>Output</tt> ist im Beispiel der Name eines Layers. Dadurch wird dieser Layer angesprochen. Ein Layer gilt nun aber selbst wieder als &quot;Dokument&quot;. Deshalb d&uuml;rfen Sie dahinter nochmals <tt>document</tt> und dahinter erlaubte Eigenschaften und Methoden des document-Objekts notieren. Die Anweisungen beziehen sich dann auf die Elemente innerhalb des entsprechenden Layers. Elemente innerhalb eines Layers m&uuml;ssen Sie auf diese Weise ansprechen. Im obigen Beispiel etwa kommen Sie an den Formularfeldinhalt nur mit <tt>document.Input.document.Eingabe.Feld.value</tt> (<tt>document.Eingabe.Feld.value</tt> w&uuml;rde dagegen eine Fehlermeldung erzeugen).</p>

<h3 class="inf">Beachten Sie:</h3>

<p>Der Phantasie sind hierbei kaum Grenzen gesetzt. Alles, was Sie beispielsweise durch Interaktion mit dem Anwender mit Hilfe eines Formulars in JavaScript ermitteln und berechnen k&ouml;nnen, k&ouml;nnen Sie auf diese Weise dynamisch ausgeben. Mit Methoden wie <tt>window.setTimeout()</tt> k&ouml;nnen Sie auch zeitgesteuert Inhalte in Layer schreiben.</p>

<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a7"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape 4.0"> Layer ohne &lt;layer&gt;-Tag simulieren</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tfbef.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Unter dem Druck von Microsoft und angesichts der Tatsache, da&szlig; das W3-Konsortium keine Anstalten macht, das &lt;layer&gt;-Tag und damit die Grundlage f&uuml;r Dynamisches HTML nach dem Netscape-Ansatz in den HTML-Standard zu &uuml;bernehmen, hat Netscape die F&auml;higkeit zum Dynamischen Positionieren auch auf die beiden &quot;abstrakten&quot; HTML-Tags <tt>&lt;div&gt;</tt>...<tt>&lt;/div&gt;</tt> und <tt>&lt;span&gt;</tt>...<tt>&lt;/span&gt;</tt> ausgedehnt. Wenn Sie innerhalb solcher HTML-Tags mit Hilfe Style-Sheet-Angaben zur Positionierung des Elements notieren, k&ouml;nnen Sie mit JavaScript auf solche Angaben zugreifen. Netscape interpretiert die Angaben dann genau so wie bei Layern.</p> 

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;Titel der Datei&lt;/title&gt;
&lt;script language=&quot;JavaScript&quot;&gt;
&lt;!--
function Zeigen()
{
 document.BildAnzeige.visibility = &quot;show&quot;;
 document.ZeigenVerweis.visibility = &quot;hide&quot;;
 document.VersteckenVerweis.visibility = &quot;show&quot;;
}
function Verstecken()
{
 document.BildAnzeige.visibility = &quot;hide&quot;;
 document.VersteckenVerweis.visibility = &quot;hide&quot;;
 document.ZeigenVerweis.visibility = &quot;show&quot;;
}
//--&gt;
&lt;/script&gt;
&lt;/head&gt;
&lt;body bgcolor=#FFFFFF&gt;
&lt;div id=&quot;ZeigenVerweis&quot;
style=&quot;position:absolute; left:100; top:140; width:400; height:30;  visibility:show&quot;&gt;
&lt;a href=&quot;javascript:Zeigen()&quot;&gt;&lt;b&gt;Zeig das Bild an&lt;/b&gt;&lt;/a&gt;
&lt;/div&gt;
&lt;div id=&quot;VersteckenVerweis&quot;
style=&quot;position:absolute; left:100; top:140; width:400; height:30; visibility:hide&quot;&gt;
&lt;a href=&quot;javascript:Verstecken()&quot;&gt;&lt;b&gt;Versteck das Bild&lt;/b&gt;&lt;/a&gt;
&lt;/div&gt;
&lt;div id=&quot;BildAnzeige&quot;
style=&quot;position:absolute; left:100; top:170; width:400; height:230; visibility:hide&quot;&gt;
&lt;img src=&quot;dasbild.jpg&quot; width=91 height=177 border=0&gt;
&lt;/div&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Das Beispiel bewirkt, da&szlig; beim Anklicken eines Verweises ein Bild angezeigt wird, das zun&auml;chst nicht sichtbar ist. Gleichzeitig erscheint ein neuer Verweis, der das Ausblenden des Bildes erlaubt. Auf diese Weise l&auml;&szlig;t sich das Bild immer wieder ein- und ausblenden.</p>

<p>In dem Beispiel werden dazu innerhalb des Dateik&ouml;rpers drei Bereiche mit <tt>&lt;div&gt;</tt>...<tt>&lt;/div&gt;</tt> definiert. Alle drei einleitenden <tt>&lt;div&gt;</tt>-Tags enthalten Style-Sheet-Angaben zur Positionierung. Ohne solche Angaben ist bei Netscape kein dynamischer Zugriff auf das entsprechende Element m&ouml;glich.</p>

<p>Die beiden ersten <tt>&lt;div&gt;</tt>-Bereiche im Beispiel haben die gleichen Angaben zur Positionierung. Sie unterscheiden sich lediglich durch die Wertzuweisung bei der Angabe <tt>visibility=</tt>. Dadurch wird bewirkt, da&szlig; beide Bereiche an der gleichen Stelle angezeigt werden, der eine Bereich zun&auml;chst jedoch ausgeblendet bleibt, w&auml;hrend der andere angzeigt wird.<br>
Der dritte <tt>&lt;div&gt;</tt>-Bereich ist der Beh&auml;lter f&uuml;r das anzuzeigende Bild. Er ist zun&auml;chst auch nicht sichtbar.</p>

<p>Die beiden ersten Bereiche enthalten jeweils einen Verweis. Beim Anklicken des Verweises wird jeweils eine JavaScript-Funktion aufgerufen, die im Kopf der Datei in einem JavaScript-Bereich definiert ist. Der Bereich, der zun&auml;chst angezeigt wird, enth&auml;lt einen Verweis, bei dessen Anklicken die Funktion <tt>Zeigen()</tt> aufgerufen wird.</p>

<p>Die Funktion <tt>Zeigen()</tt> tut nichts anderes, als die Anzeigeverh&auml;ltnisse unter den drei <tt>&lt;div&gt;</tt>-Bereichen zu &auml;ndern. Der erste Bereich, &uuml;ber  dessen Verweis die Funktion aufgerufen wurde, wird mit <tt>document.ZeigenVerweis.visibility=&quot;hide&quot;</tt> auf unsichtbar gesetzt. Der zweite Bereich, der mit dem anderen Verweis, wird dagegen auf sichtbar gesetzt. Auch der Bereich mit dem Bild wird sichtbar.<br>
Nun werden der zweite Verweis (&quot;Versteck das Bild&quot;) und das Bild selbst angezeigt. Beim Klicken auf den Verweis wird die andere JavaScript-Funktion <tt>Verstecken()</tt> aufgerufen. Diese Funktion arbeitet genau so wie die Funktion <tt>Zeigen()</tt>, nur umgekehrt.</p>

<p>Der Zugriff auf die <tt>&lt;div&gt;</tt>-Bereiche wird dadurch m&ouml;glich, da&szlig; bei der Definition der <tt>&lt;div&gt;</tt>-Bereiche mit <tt>id=</tt> ein Name vergeben wird. &Uuml;ber <tt>document.BereichName</tt> ist dann der Zugriff auf Eigenschaften wie <tt>visibility</tt>, <tt>top</tt>, <tt>left</tt>, <tt>width</tt>, <tt>height</tt> oder <tt>clip</tt> m&ouml;glich. So lassen sich praktisch alle Aufgaben l&ouml;sen, ohne das <tt>&lt;layer&gt;</tt>-Tag einzusetzen. In der Praxis kommt es allerdings immer wieder mal zu Problemen, die bei Verwendung von Layern nicht auftreten.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a8"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape 4.0"> Das Event-Objekt</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tfbeg.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Das Event-Objekt von JavaScript erlaubt es, auf Anwendereignisse zu reagieren. Es stellt eine Erweiterung der klassischen Event-Handler dar. Das folgende Beispiel demonstriert die M&ouml;glichkeiten des Event-Objekts.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;Titel der Datei&lt;/title&gt;
&lt;style type=&quot;text/css&quot;&gt;
 layer { font-size:10pt; font-family:Arial }
 layer.Kopf { color:#FFFFFF; padding:1mm; cursor:hand; }
 layer.Text { color:#000000; padding-top:30px; padding-left:1mm; padding-right:1mm }
&lt;/style&gt;
&lt;/head&gt;
&lt;body bgcolor=#FFFFFF&gt;

&lt;layer id=&quot;Gruen&quot; class=&quot;Text&quot; bgcolor=#99FF99 top=170 left=10 width=200 height=180&gt;
&lt;layer id=&quot;Gruenkopf&quot; class=&quot;Kopf&quot; bgcolor=#000000 top=0 left=0 width=200 height=25&gt;
Titelleiste des gr&amp;uuml;nen Layers&lt;/layer&gt;
Inhalt des gr&amp;uuml;nen Layers.
&lt;/layer&gt;
&lt;layer id=&quot;Gelb&quot; class=&quot;Text&quot; bgcolor=#FFFF66 top=10 left=310 width=300 height=120&gt;
&lt;layer id=&quot;Gelbkopf&quot; class=&quot;Kopf&quot; bgcolor=#000000 top=0 left=0 width=300 height=25&gt;
Titelleiste des gelben Layers&lt;/layer&gt;
Inhalt des gelben Layers.
&lt;/layer&gt;

&lt;script language=&quot;JavaScript&quot;&gt;
&lt;!--
var Gruen = document.layers['Gruen'];
var Gruentitel = document.layers['Gruen'].document.layers['Gruenkopf'].document;
var Gelb = document.layers['Gelb'];
var Gelbtitel = document.layers['Gelb'].document.layers['Gelbkopf'].document;

Gruentitel.captureEvents(Event.MOUSEUP|Event.MOUSEDOWN|Event.MOUSEDRAG);
Gruentitel.onmousedown=StartGruen;
Gruentitel.onmouseup=EndGruen;
document.layers['Gruen'].document.layers['Gruenkopf'].onload=GruenReset;

Gelbtitel.captureEvents(Event.MOUSEUP|Event.MOUSEDOWN|Event.MOUSEDRAG);
Gelbtitel.onmousedown=StartGelb;
Gelbtitel.onmouseup=EndGelb;
document.layers['Gelb'].document.layers['Gelbkopf'].onload=GelbReset;

function GruenReset() 
 { Gruentitel.captureEvents(Event.MOUSEUP|Event.MOUSEDOWN|Event.MOUSEDRAG); }
function GelbReset()
 { Gelbtitel.captureEvents(Event.MOUSEUP|Event.MOUSEDOWN|Event.MOUSEDRAG); }
function StartGruen()
 { Gruentitel.captureEvents(Event.MOUSEMOVE); Gruentitel.onmousemove=ZiehGruen; }
function StartGelb()
 { Gelbtitel.captureEvents(Event.MOUSEMOVE); Gelbtitel.onmousemove=ZiehGelb; }
function ZiehGruen(Ereignis)
 { Gruen.left = Ereignis.pageX; Gruen.top = Ereignis.pageY; }
function ZiehGelb(Ereignis)
 { Gelb.left = Ereignis.pageX; Gelb.top = Ereignis.pageY; }
function EndGruen()
 { Gruentitel.onmousemove=0; Gruentitel.releaseEvents(Event.MOUSEMOVE); }
function EndGelb()
 { Gelbtitel.onmousemove=0; Gelbtitel.releaseEvents(Event.MOUSEMOVE); }

//--&gt;
&lt;/script&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Im Beispiel werden insgesamt vier Layer definiert, davon zwei &quot;&auml;u&szlig;ere&quot; (mit <tt>id=&quot;Gruen&quot;</tt> bzw. <tt>id=&quot;Gelb&quot;</tt>) und zu jedem jeweils ein &quot;innerer&quot; (mit <tt>id=&quot;Gruenkopf&quot;</tt> bzw. <tt>id=&quot;Gelbkopf&quot;</tt>). Die inneren Layer sind so gestaltet, da&szlig; sie wie Titelleisten zu den jeweils &auml;u&szlig;eren Layern wirken, daher auch die id-Namen.</p>

<p>Wie Sie erkennen k&ouml;nnen, steht nirgendwo bei der Layerdefinition oder innerhalb eines der Layer ein JavaScript-Aufruf. Dennoch sind die beiden Titelleisten &quot;sensitiv&quot;: wenn der Anwender mit der Maus darauf klickt, die Maustaste gedr&uuml;ckt h&auml;lt und die Maus bewegt, bewegt sich der gesamte zugeh&ouml;rige &quot;&auml;u&szlig;ere&quot; Layer mit. Der Grund daf&uuml;r ist das Konzept des Event-Objekts. Es ben&ouml;tigt keine Event-Handler innerhalb von HTML, um JavaScript-Aktionen anzusto&szlig;en.</p>

<p>Der JavaScript-Bereich des obigen Beispiels enth&auml;lt daf&uuml;r einige &quot;ungewohnte&quot; Dinge. Er wird unterhalb der Layer definiert, weil gleich bei seinem Einlesen Code ausgef&uuml;hrt wird, der sich auf die definierten Layer bezieht. Die Layer m&uuml;ssen zu diesem Zeitpunkt bereits eingelesen sein, sonst gibt es eine Fehlermeldung.</p>

<p>Die ersten vier Zeilen des JavaScript-Codes im Beispiel speichern einfach nur ziemlich lange Objekt-Eigenschaften-Ketten in Variablen, da diese im weiteren Verlauf h&auml;ufig notiert werden m&uuml;ssen. Danach folgen jeweils vier Anweisungen, und zwar je f&uuml;r den gr&uuml;nen Layer und f&uuml;r den gelben. Die Methode <tt>captureEvents()</tt> bewirkt, da&szlig; Anwenderaktionen &uuml;berwacht und bei Eintritt gemeldet werden. Die Methode <tt>captureEvents()</tt> erwartet als Parameter einen Wert. Notieren Sie dazu nach dem Prinzip <tt>Event.WELCHER</tt> die Events, die &uuml;berwacht werden sollen. Die gew&uuml;nschten Events sind durch bitweises Oder (einfacher Vertikalstrich) zu trennen. Welche Events es neben denen im obigen Beispiel gibt, erfahren Sie in der <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tec.htm"><b>JavaScript Objekt-Referenz</b></a> beim Objekt <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tecbc.htm"><b>event</b></a>.</p>

<p>Beim Eintritt von &uuml;berwachten Ereignissen werden Funktionen aufgerufen. Beachten Sie dabei die etwas merkw&uuml;rdige Syntax: mit einer Anweisung wie <tt>Gruentitel.onmousedown=StartGruen</tt> wird die selbstgeschriebene Funktion <tt>StartGruen()</tt> aufgerufen, die weiter unten im Script definiert ist. Beim Aufruf d&uuml;rfen Sie in diesem Fall jedoch keine Klammern hinter dem Funktionsnamen notieren!</p>

<p>Verfolgen Sie nun mal im Beispiel den Fall, da&szlig; der Anwender auf die Titelleiste des gr&uuml;nen Layers klickt. Dann wird das Ereginis <tt>MOUSEDOWN</tt> f&uuml;r <tt>Gruentitel</tt> gemeldet. F&uuml;r diesen Fall (onmousedown) wird die Funktion <tt>StartGruen</tt> aufgerufen. Innerhalb dieser Funktion wird wiederum &uuml;berwacht, ob der Anwender die Maus bei gedr&uuml;ckter Maustaste bewegt. Wenn ja, wird dort nach dem gleichen Schema die Funktion <tt>ZiehGruen</tt> aufgerufen. Obwohl die Funktion keinen Parameter &uuml;bergeben bekommt, erwartet sie einen - auch das gegen alle sonstige Regeln. Der erwartete Parameter ist aber kein &quot;Wert&quot; wie sonst &uuml;blich, sondern einfach ein Name f&uuml;r den aktuellen Event. Im Beispiel wurde der Name <tt>Ereignis</tt> gew&auml;hlt. Unter dem vergebenen Namen lassen sich Eigenschaften des Event-Objekts ansprechen. Da innerhalb der Funktion <tt>ZiehGruen</tt> davon Gebrauch gemacht wird, ist ein solcher Name erforderlich. Aktiv ist die Funktion <tt>ZiehGruen</tt> solange, wie der Anwender die Maustaste bewegt und nicht losl&auml;&szlig;t. W&auml;hrend dieser Zeit werden &quot;so oft wie m&ouml;glich&quot; die Eigenschaften <tt>PageX</tt> (aktuelle Mausposition von links) und <tt>PageY</tt>  (aktuelle Mausposition von oben) von <tt>Ereignis</tt> abgefragt. Diese Werte werden dem betroffenen Layer dynamisch als neue Werte f&uuml;r die linke obere Ecke zugewiesen. So entsteht der Bewegungseffekt.</p>

<p>Wenn der Anwender die Maustaste losl&auml;&szlig;t, wird die Funktion <tt>ZiehGruen</tt> sofort verlassen. Da die Event-&Uuml;berwachung ja noch aktiv ist, wird jetzt das Ereginis <tt>MOUSEUP</tt> gemeldet. F&uuml;r diesen Fall wird die Funktion <tt>EndGruen</tt> aufgerufen. Diese Funktion enth&auml;lt zwei Befehle zum &quot;Aufr&auml;umen&quot;.</p>

<p>Wenn Sie sonst nichts weiter unternehmen w&uuml;rden, w&auml;re der Layer nach dem ersten Bewegen nicht mehr bewegungsf&auml;hig. Damit er immer wieder bewegbar ist, tritt automatisch ein LOAD-Ereignis ein. Dieses wird mit <tt>onload</tt> abgefangen. Dabei wird die Funktion <tt>GruenReset</tt> aufgerufen. Diese Funktion startet die erneute &Uuml;berwachung der Ereignisse.</p>

<p>Analog zu dem Handling f&uuml;r den gr&uuml;nen Layer wird mit dem Handling f&uuml;r den gelben Layer verfahren.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a9"><img src="xnetsi4.gif" width=30 height=30 border=0 alt="Netscape 4.0"> Inline-Scripts bei Layern</a></h2>

<p><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel" align=absmiddle> <a href="tfbeh.htm"><b>Anzeigebeispiel: So sieht's aus</b></a></p>

<p>Netscape bietet eine vereinfachte JavaScript-Syntax an, um Layer-Eigenschaften innerhalb eines Layers dynamisch zu &auml;ndern.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;Titel der Datei&lt;/title&gt;
&lt;style type=&quot;text/css&quot;&gt;
layer { padding:1mm; }
p.Verweis { font-size:10pt; font-weight:bold; font-family:Arial; color:yellow; }
p.Text { font-size:10pt; font-family:Arial; color:white; }
&lt;/style&gt;
&lt;/head&gt;
&lt;body bgcolor=#FFFFFF&gt;
&lt;layer bgcolor=#000000 top=175 left=50 width=500 height=200
clip=&quot;0,0,500,25&quot; onMouseover=&quot;Zeigen()&quot; onMouseout=&quot;Verstecken()&quot;&gt;
&lt;p class=&quot;Verweis&quot;&gt;Was Sie schon immer wissen wollten &uuml;ber ...&lt;/p&gt;
&lt;p class=&quot;Text&quot;&gt;Hier steht das, was Sie schon immer wissen wollten.&lt;/p&gt;
&lt;script language=&quot;JavaScript&quot;&gt;
&lt;!--
function Zeigen() { clip.bottom = 200; }
function Verstecken() { clip.bottom = 25; }
//--&gt;
&lt;/script&gt;
&lt;/layer&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Im Beispiel wird ein Layer definiert. Mit einer Angabe zu <tt>clip=</tt> wird der Anzeigebereich des Layers jedoch zun&auml;chst beschnitten, und zwar so, da&szlig; gerade der erste Textabsatz sichtbar ist. Wenn der Anwender mit der Maus &uuml;ber den sichtaben Layer-Bereich f&auml;hrt, wird die JavaScript-Funktion <tt>Zeigen()</tt> aufgerufen. Diese Funktion ver&auml;ndert den Clip-Bereich des Layers so, da&szlig; er in ganzer Gr&ouml;&szlig;e angezeigt wird. Wenn die Maus den Layerbereich wieder verl&auml;&szlig;t, wird die Funktion <tt>Verstecken()</tt> aufgerufen. Diese Funktion &auml;ndert den Clip-Bereich wieder auf den Anfangswert.</p>

<p>Wichtig ist bei dieser Form, da&szlig; der JavaScript-Bereich innerhalb des Layers definiert wird. Dann brauchen Sie sich nicht um die korrekte Adressierung des Layers mit Indexnummern oder Namen zu k&uuml;mmern. Sie k&ouml;nnen einfach Anweisungen wie <tt>clip.bottom=[Wert]</tt> (wie im Beispiel) oder Anweisungen wie <tt>top=</tt>, <tt>left=</tt> oder <tt>bgColor=</tt> notieren, um Wirkungsweise und Aussehen des Layers zu ver&auml;ndern. Welche Eigenschaften Sie &auml;ndern k&ouml;nnen, entnehmen Sie der Referenz zum Layer-Objekt.</p>



<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tfca.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#ffffff><img src="x3.gif" width=15 height=10 border=0> <a href="tfca.htm"><b>Datums-/Uhrzeitanzeige</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tfbd.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#ffffff width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tfbd.htm"><b>JSSS JavaScript Style-Sheets (Netscape)</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tf.htm"><b>Dynamisches HTML</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tfb.htm"><b>Die Ans&auml;tze von Microsoft und Netscape</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>