<html>
<head>
<title>SELFHTML: CGI/Perl / CGI-Scripts auf &ouml;ffentlichem WWW-Server installieren</title>
<meta name="description" content="(SELFHTML 7.0) Wie Sie CGI-Scripts im WWW installieren und worauf Sie dabei achten sollten.">
<meta name="keywords" content="SELFHTML, CGI, CGI-Scripts">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tg.htm"><b>CGI/Perl</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tgb.htm"><b>Voraussetzungen/Allgemeines</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>CGI-Scripts auf &ouml;ffentlichem WWW-Server installieren</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>CGI-Verzeichnis mit FTP-Zugriff verwalten</b></a> <br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Tips f&uuml;r die Praxis</b></a>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="a1">CGI-Verzeichnis mit FTP-Zugriff verwalten</a></h2>

<p>Wenn Sie nicht gerade einen eigenen &ouml;ffentlichen WWW-Server betreiben, den Sie direkt an der Konsole bedienen k&ouml;nnen, sind Sie darauf angewiesen, Ihre Daten auf dem Server-Rechner per Fernbedienung zu verwalten. Normalerweise geschieht das heutzutage mit Hilfe des FTP-Protokolls, vereinzelt auch noch mit Hilfe des Telnet-Protokolls. F&uuml;r die FTP-Verwaltung von eigenen Daten auf einem Server-Rechner sollten Sie ein gutes <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tbcf.htm"><b>FTP-Programm</b></a> besitzen.</p> 

<p>CGI-Scripts k&ouml;nnen Sie mit Hilfe eines FTP-Programms in das daf&uuml;r vorgesehene Verzeichnis hochladen. Meistens hat dieses Verzeichnis einen entsprechenden Namen, z.B. <tt>cgi-bin</tt> oder <tt>cgi-local</tt>. Ihr Webmaster oder Provider mu&szlig; Ihnen ein solches Verzeichnis eingerichtet haben. Das bedeutet, er mu&szlig; auf dem &ouml;ffentlichen Server-Rechner in den <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgba.htm#a3"><b>Einstellungen des WWW-Servers</b></a> ein solches Verzeichnis angegeben und Ihnen den Zugriff darauf erlaubt haben. Fragen Sie im Zweifelsfall Ihren Webmaster oder Provider danach! (Allgemeines zu diesem Thema finden Sie auch im Abschnitt <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tjc.htm"><b>WWW-Projekte publizieren</b></a>).</p>

<p>Beim Hochladen von CGI-Scripts oder CGI-Programmen in das CGI-Verzeichnis m&uuml;ssen Sie folgendes beachten:</p>
<ul>
<li>Perl-Scripts m&uuml;ssen immer im ASCII-Modus &uuml;bertragen werden. Achten Sie vor dem Hochladen von Perl-Dateien darauf, da&szlig; in Ihrem FTP-Programm der ASCII-Modus als &Uuml;bertragungsmodus eingestellt ist.</li>
<li>Compilierte Programme m&uuml;ssen dagegen immer im Bin&auml;r-Modus &uuml;bertragen werden. Achten Sie im FTP-Programm darauf, da&szlig; der Bin&auml;r-Modus eingestellt ist. Beachten Sie bei compilierten Programmen auch, da&szlig; diese auf dem Server-Rechner nur ausf&uuml;hrbar sind, wenn sie f&uuml;r das Betriebssystem des Server-Rechners compiliert wurden. So hat es keinen Sinn, wenn Sie ein unter DOS/Windows zu einer EXE-Datei compiliertes C-Programm in das CGI-Verzeichnis eines Unix-Rechners hochladen.</li> 
<li>Einige WWW-Server sind so eingerichtet, da&szlig; CGI-Scripts die Dateinamenendung <tt>.cgi</tt> erhalten m&uuml;ssen. Fragen Sie gegebenenfalls Ihren Provider danach! Wenn dies bei Ihnen der Fall ist, benennen Sie beispielsweise ein Perl-Script namens <tt>counter.pl</tt> einfach in <tt>counter.cgi</tt> um.</li>
<li>Wenn der Server-Rechner ein Unix-Rechner ist, m&uuml;ssen Sie au&szlig;erdem noch angeben, von wem die Programmdatei bzw. die Scriptdatei ausgef&uuml;hrt werden darf. Damit alle Besucher Ihrer WWW-Seiten Ihr CGI-Script oder CGI-Programm ausf&uuml;hren k&ouml;nnen, m&uuml;ssen Sie das Lese- und Ausf&uuml;hrrecht &quot;f&uuml;r alle&quot; einstellen. Dies geschieht mit dem Unix-Befehl <tt>chmod 755 datei.ext</tt>. Wenn Sie beispielsweise ein Perl-Script namens <tt>counter.pl</tt> hochladen, m&uuml;ssen Sie es mit <b>chmod 755 counter.pl</b> allgemein ausf&uuml;hrbar machen. Lesen Sie im Zweifelsfall in der Dokumentation Ihres FTP-Programms nach, wie Sie damit die Zugriffsrechte f&uuml;r Dateien auf dem fernen Rechner einstellen k&ouml;nnen.</li>
</ul>





<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2">Tips f&uuml;r die Praxis</a></h2>

<p>Die folgenden Hinweise und organisatorischen &Uuml;berlegungen sollten Sie beachten:</p>
<ul>
<li>Testen Sie Ihre CGI-Scripts bzw. CGI-Programme vor dem &ouml;ffentlichen Einsatz im WWW. Am besten tun Sie das offline und in aller Ruhe an Ihrem lokalen Rechner. Dazu m&uuml;ssen Sie sich einen eigenen <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgba.htm"><b>lokalen WWW-Server einrichten</b></a>. Wenn Sie Perl-Scripts einsetzen wollen, m&uuml;ssen Sie au&szlig;erdem <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgbb.htm"><b>Perl lokal installieren</b></a>.</li>
<li>Rufen Sie neu ins WWW hochgeladene CGI-Scripts/CGI-Programme nicht gleich von einer viel besuchten WWW-Seite aus auf, sondern laden Sie erst mal eine Test-HTML-Datei mit einem Aufruf des CGI-Programms hoch. So k&ouml;nnen Sie auch online erst mal testen, ob alles einwandfrei funktioniert. Wenn es sich um wichtige Anwendungen wie elektronische Einkaufsk&ouml;rbe usw. handelt, sollten Sie das Script in so einer Testumgebung von verschiedenen Personen testen lassen, bevor Sie es &ouml;ffentlich zur Verf&uuml;gung stellen.</li>
<li>Die meisten CGI-Scripts speichern Daten in Dateien und/oder lesen diese Dateien aus. Wenn es sich um eine einzige Datendatei handelt, spricht nichts dagegen, diese im CGI-Verzeichnis abzulegen. Bei einem einfachem Seitenzugriffsz&auml;hler, der mit Hilfe eines Perl-Scripts namens <tt>counter.pl</tt> realisiert ist, ist es beispielsweise sinnvoll, den Z&auml;hlerstand in einer Datei <tt>counter.dat</tt> zu speichern und diese ebenso wie die Perl-Datei direkt im CGI-Verzeichnis abzulegen. Wenn ein CGI-Script/CGI-Programm jedoch mehrere Dateien verwaltet, ist es sinnvoll, diese in einem eigenen Verzeichnis abzulegen. Dazu k&ouml;nnen Sie z.B. unterhalb des CGI-Verzeichnisses Unterverzeichnisse anlegen. So k&ouml;nnte etwa ein CGI-basiertes Nachrichtenforum (Bulletin-Board) namens <tt>bulletin.pl</tt> seine verschiedenen Konfigurations- und aktuellen Datendateien in einem entsprechenden Unterverzeichnis <tt>bulletin</tt> haben.</li>
</ul>








<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tgbd.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF><img src="x3.gif" width=15 height=10 border=0> <a href="tgbd.htm"><b>CGI-Umgebungsvariablen</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tgbb.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tgbb.htm"><b>Perl auf einem PC einrichten</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tg.htm"><b>CGI/Perl</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tgb.htm"><b>Voraussetzungen/Allgemeines</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>



</body>
</html>