<html>
<head>
<title>SELFHTML: CGI/Perl / CGI-Umgebungsvariablen</title>
<meta name="description" content="(SELFHTML 7.0) Welche Aufgabe CGI-Umgebungsvariablen haben und welche CGI-Umgebungsvariablen es gibt.">
<meta name="keywords" content="SELFHTML, CGI, Umgebungsvariablen">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tg.htm"><b>CGI/Perl</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tgb.htm"><b>Voraussetzungen/Allgemeines</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>CGI-Umgebungsvariablen</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Allgemeines zu CGI-Umgebungsvariablen</b></a> <br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>&Uuml;bersicht der CGI-Umgebungsvariablen</b></a>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="a1">Allgemeines zu CGI-Umgebungsvariablen</a></h2>

<p>Zur sogenannten &quot;CGI-Schnittstelle&quot; geh&ouml;ren auch die CGI-Umgebungsvariablen. Ein installierter <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgba.htm"><b>WWW-Server</b></a> stellt solche Variablen auf Betriebssystemebene zur Verf&uuml;gung. Bei jedem Aufruf eines CGI-Scripts f&uuml;llt er einige dieser Variablen mit Informationen. Das CGI-Script kann den Inhalt dieser Variablen auslesen und f&uuml;r eigene Zwecke nutzen. Das CGI-Script kann einige dieser Variablen auch selbst mit Inhalt f&uuml;llen oder einen dort gespeicherten Inhalt &auml;ndern. CGI-Umgebungsvariablen existieren unabh&auml;ngig von den Variablen, die Sie in einem CGI-Script selbst definieren k&ouml;nnen.</p> 

<p>In CGI-Umgebungsvariablen ist w&auml;hrend der Ausf&uuml;hrung eines CGI-Scripts beispielsweise der Namen des Server-Rechners gespeichert, oder Information zum verwendeten Browser des Anwenders, der den Aufruf des CGI-Programms verursacht hat. Wenn zum Aufruf des CGI-Scripts aus einem <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tch.htm"><b>Formular</b></a> die GET-Methode verwendet wurde, stehen die Daten, die der Anwender in das Formular eingegeben hat, in einer CGI-Umgebungsvariablen (siehe auch den Abschnitt <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgbf.htm#a1"><b>Formulardaten &uuml;bertragen mit GET oder POST</b></a>).</p>

<p>Um CGI-Umgebungsvariablen aus einem CGI-Programm heraus zu nutzen, m&uuml;ssen Sie in der verwendeten Programmiersprache die Techniken zum Auslesen von Umgebungsvariablen nutzen. So k&ouml;nnen Sie in Perl &uuml;ber <tt>$ENV{'UMGEBUNGS_VARIABLENNAME'}</tt> auf CGI-Umgebungsvariablen zugreifen. Mit einer Anweisung wie <tt>print $ENV{'SERVER_NAME'};</tt> k&ouml;nnen Sie beispielsweise den Namen des Servers ausgeben. Da die Umgebungsvariablen aus Sicht von Perl in einem <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgcb.htm#a3"><b>Hash</b></a> gespeichert sind, k&ouml;nnen Sie mit einer Anweisung wie <tt>print %ENV</tt> alle verf&uuml;gbaren Umgebungsvariablen ausgeben.</p>




<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2">&Uuml;bersicht der CGI-Umgebungsvariablen</a></h2>


Die folgende Liste ist nach Variablennamen alphabetisch sortiert.
<p>
<table cellpadding=3>
<tr>
<th bgcolor=#EEEEEE class="doc" align=left>Variablenname</th>
<th bgcolor=#EEEEEE class="doc" align=left>Erl&auml;uterung</th>
</tr>
<tr>
<td class="code" bgcolor=#FFFFE0 valign=top nowrap><tt>CONTENT_LENGTH</tt></td>
<td class="tabxpl" bgcolor=#EEEEFF valign=top>Enth&auml;lt die Anzahl der Zeichen, die beim Aufruf des CGI-Scripts &uuml;ber die POST-Methode &uuml;bergeben wurden. Wenn das CGI-Script beispielsweise beim Absenden eines HTML-Formulars aufgerufen wurde und dort als &Uuml;bertragungsmethode POST angegeben ist, steht in dieser Umgebungsvariablen, wie viele Zeichen das Script von der Standardeingabe lesen mu&szlig;, um die &uuml;bermittelten Formulardaten vollst&auml;ndig einzulesen.</td>
</tr>
<tr>
<td class="code" bgcolor=#FFFFE0 valign=top nowrap><tt>CONTENT_TYPE</tt></td>
<td class="tabxpl" bgcolor=#EEEEFF valign=top>Enth&auml;lt beim Aufruf &uuml;ber die POST-Methode den Mime-Type der &uuml;bergebenen Daten. Wenn das CGI-Script beispielsweise beim Absenden eines HTML-Formulars aufgerufen wurde und dort als &Uuml;bertragungsmethode POST angegeben ist, steht in dieser Umgebungsvariablen der f&uuml;r HTML-Formulare typische Mime-Type <i>application/x-www-form-urlencoded</i>.</td>
</tr>
<tr>
<td class="code" bgcolor=#FFFFE0 valign=top nowrap><tt>GATEWAY_INTERFACE</tt></td>
<td class="tabxpl" bgcolor=#EEEEFF valign=top>Enth&auml;lt die Version der CGI-Schnittstelle, die von dem installierten Server unterst&uuml;tzt wird, z.B. CGI/1.1, wenn die gegenw&auml;rtig &uuml;bliche Version 1.1 der Schnittstellendefinition unterst&uuml;tzt wird.</td>
</tr>
<tr>
<td class="code" bgcolor=#FFFFE0 valign=top nowrap><tt>HTTP_ACCEPT</tt></td>
<td class="tabxpl" bgcolor=#EEEEFF valign=top>Enth&auml;lt die Liste der Mime-Types, die der aufrufende WWW-Browser akzeptiert. Die Angabe */* bedeutet: der WWW-Browser akzeptiert alles.</td>
</tr>
<tr>
<td class="code" bgcolor=#FFFFE0 valign=top nowrap><tt>HTTP_REFERER</tt></td>
<td class="tabxpl" bgcolor=#EEEEFF valign=top>Enth&auml;lt die URL-Adresse der WWW-Seite, von der aus das CGI-Script aufgerufen wurde. Der Wert wird jedoch nicht von allen WWW-Browsern &uuml;bermittelt, ist also nicht in jedem Fall verf&uuml;gbar.</td>
</tr>
<tr>
<td class="code" bgcolor=#FFFFE0 valign=top nowrap><tt>HTTP_USER_AGENT</tt></td>
<td class="tabxpl" bgcolor=#EEEEFF valign=top>Enth&auml;lt Produkt- und Versionsinformationen zum aufrufenden WWW-Browser. Ein CGI-Script kann auf diese Weise ermitteln, welchen Browser ein Anwender verwendet.</td>
</tr>
<tr>
<td class="code" bgcolor=#FFFFE0 valign=top nowrap><tt>PATH_INFO</tt></td>
<td class="tabxpl" bgcolor=#EEEEFF valign=top>Enth&auml;lt spezielle Pfadinformationen, wenn das Script &uuml;ber die GET-Methode aufgerufen wurde, und zwar relativ zu den im WWW-Server eingestellten Root-Verzeichnissen.</td>
</tr>
<tr>
<td class="code" bgcolor=#FFFFE0 valign=top nowrap><tt>PATH_TRANSLATED</tt></td>
<td class="tabxpl" bgcolor=#EEEEFF valign=top>Enth&auml;lt spezielle Pfadinformationen, wenn das Script &uuml;ber die GET-Methode aufgerufen wurde - im Unterschied zu PATH_INFO jedoch Pfadangaben entsprechend der Verzeichnisstruktur des Server-Rechners.</td>
</tr>
<tr>
<td class="code" bgcolor=#FFFFE0 valign=top nowrap><tt>QUERY_STRING</tt></td>
<td class="tabxpl" bgcolor=#EEEEFF valign=top>Enth&auml;lt beim Aufruf &uuml;ber die GET-Methode eine Zeichenkette mit Daten, die dem Script &uuml;bergeben wurden. Wenn ein Anwender ein HTML-Formular ausgef&uuml;llt hat, bei dessen Absenden das CGI-Script aufgerufen wurde, stehen in dieser Umgebungsvariablen die ausgef&uuml;llten Formulardaten. Die Daten sind nach den Regeln des Mime-Types <i>application/x-www-form-urlencoded</i> kodiert.</td>
</tr>
<tr>
<td class="code" bgcolor=#FFFFE0 valign=top nowrap><tt>REMOTE_ADDR</tt></td>
<td class="tabxpl" bgcolor=#EEEEFF valign=top>Enth&auml;lt die IP-Adresse des Server-Rechners, &uuml;ber den das CGI-Script aufgerufen wurde, wenn es ein anderer Server ist als der, auf dem das CGI-Script liegt. Dieser Wert wird jedoch nicht in allen F&auml;llen gesetzt.</td>
</tr>
<tr>
<td class="code" bgcolor=#FFFFE0 valign=top nowrap><tt>REMOTE_HOST</tt></td>
<td class="tabxpl" bgcolor=#EEEEFF valign=top>Enth&auml;lt die Domain-Adresse des Server-Rechners, &uuml;ber den das CGI-Script aufgerufen wurde, wenn es ein anderer Server ist als der, auf dem das CGI-Script liegt. Dieser Wert wird jedoch nicht in allen F&auml;llen gesetzt.</td>
</tr>
<tr>
<td class="code" bgcolor=#FFFFE0 valign=top nowrap><tt>REMOTE_IDENT</tt></td>
<td class="tabxpl" bgcolor=#EEEEFF valign=top>Enth&auml;lt Protokollinformation, wenn auf dem Server das Protokoll <i>ident</i> f&uuml;r gesch&uuml;tzte Zugriffe l&auml;uft.</td>
</tr>
<tr>
<td class="code" bgcolor=#FFFFE0 valign=top nowrap><tt>REMOTE_USER</tt></td>
<td class="tabxpl" bgcolor=#EEEEFF valign=top>Enth&auml;lt den Benutzernamen, der das CGI-Script aufgerufen hat. Dieser Wert wird nur gesetzt, wenn die Server-Authentifizierung eingeschaltet ist.</td>
</tr>
<tr>
<td class="code" bgcolor=#FFFFE0 valign=top nowrap><tt>REQUEST_METHOD</tt></td>
<td class="tabxpl" bgcolor=#EEEEFF valign=top>Enth&auml;lt den HTTP-Befehl, mit dem das CGI-Programm aufgerufen wurde. Entweder GET oder POST. Ein CGI-Script kann beispielsweise diese Variable auslesen und danach entscheiden, wie es Formulardaten einlesen kann: entweder von der Standardeingabe (bei Methode POST) oder aus der Umgebungsvariablen QUERY_STRING (bei Methode GET).</td>
</tr>
<tr>
<td class="code" bgcolor=#FFFFE0 valign=top nowrap><tt>SCRIPT_NAME</tt></td>
<td class="tabxpl" bgcolor=#EEEEFF valign=top>Enth&auml;lt die URL-Adresse des aufgerufenen CGI-Scripts realtiv zur Domain-Adresse, also z.B. /cgi-bin/search.pl.</td>
</tr>
<tr>
<td class="code" bgcolor=#FFFFE0 valign=top nowrap><tt>SERVER_NAME</tt></td>
<td class="tabxpl" bgcolor=#EEEEFF valign=top>Enth&auml;lt den Namen des Servers (z.B. www.xy.com) oder die IP-Adresse (z.B. 127.0.0.1).</td>
</tr>
<tr>
<td class="code" bgcolor=#FFFFE0 valign=top nowrap><tt>SERVER_PORT</tt></td>
<td class="tabxpl" bgcolor=#EEEEFF valign=top>Enth&auml;lt die Portnummer, die f&uuml;r den WWW-Server eingerichtet wurde. Normalerweise ist dies f&uuml;r WWW-Server die Nummer 80.</td>
</tr>
<tr>
<td class="code" bgcolor=#FFFFE0 valign=top nowrap><tt>SERVER_PROTOCOL</tt></td>
<td class="tabxpl" bgcolor=#EEEEFF valign=top>Enth&auml;lt die Version des HTTP-Protokolls, das der installierte WWW-Server unterst&uuml;tzt, z.B. HTTP/1.0, wenn die gegenw&auml;rtig &uuml;bliche Version 1.0 des HTTP-Protokolls unterst&uuml;tzt wird.</td>
</tr>
<tr>
<td class="code" bgcolor=#FFFFE0 valign=top nowrap><tt>SERVER_SOFTWARE</tt></td>
<td class="tabxpl" bgcolor=#EEEEFF valign=top>Enth&auml;lt die Produktbezeichnung der installierten Server-Software, z.B. OmniHTTPd/2.0a1 (Win32; i386)</td>
</tr>
</table>

<p>&#160;</p>





<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tgbe.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF><img src="x3.gif" width=15 height=10 border=0> <a href="tgbe.htm"><b>Server Side Includes in HTML</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tgbc.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tgbc.htm"><b>CGI-Scripts auf &ouml;ffentlichem WWW-Server installieren</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tg.htm"><b>CGI/Perl</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tgb.htm"><b>Voraussetzungen/Allgemeines</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>



</body>
</html>