<html>
<head>
<title>SELFHTML: CGI/Perl / HTML-Formulare und CGI</title>
<meta name="description" content="(SELFHTML 7.0) Der Zusammenhang zwischen einem HTML-Formular und einem CGI-Script, das die Formulardaten verarbeitet.">
<meta name="keywords" content="SELFHTML, CGI, HTML, Formulare">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tg.htm"><b>CGI/Perl</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tgb.htm"><b>Voraussetzungen/Allgemeines</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>HTML-Formulare und CGI</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Formulardaten &uuml;bertragen mit GET oder POST</b></a> <br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Datenstrom bei &Uuml;bertragung von Formulardaten</b></a>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="a1">Formulardaten &uuml;bertragen mit GET oder POST</a></h2>

<p>Das Hypertext Transfer Protocol (HTTP) ist das &Uuml;bertragungsprotokoll, mit dem WWW-Browser und WWW-Server Daten austauschen. Daf&uuml;r gibt es HTTP-Befehle. Zwei HTTP-Befehle sind im Zusammenhang mit der &Uuml;bertragung von Formulardaten von Bedeutung:</p>
<ul>
<li><b>GET</b><br>
In einem HTML-Formular erzwingen Sie diesen Befehl durch die Angabe von <tt>method=get</tt> im einleitenden <tt>&lt;form&gt;</tt>-Tag. Bei dieser Angabe werden die ausgef&uuml;llten Formulardaten zuerst an die Server-Software &uuml;bertragen und von dieser in einer bestimmten Umgebungsvariablen mit dem Namen QUERY_STRING zwischenspeichert. Ein CGI-Script, das durch die Angabe <tt>action=</tt> im einleitenden Formular-Tag aufgerufen wird, mu&szlig; den Inhalt dieser Umgebungsvariablen auslesen, um an die Formulardaten heranzukommen (siehe auch den Abschnitt &uuml;ber <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgbd.htm"><b>Umgebungsvariablen</b></a>). In Perl ist das beispielsweise mit einer Anweisung wie <tt>$form_daten = $ENV{'QUERY_STRING'};</tt> m&ouml;glich. Wenn ein HTML-Formular die GET-Methode verwendet, wird der Formulardatenstrom, getrennt durch ein Fragezeichen, direkt hinter die URL-Adresse des CGI-Programmaufrufs geh&auml;ngt. Im WWW-Browser des Anwenders ist dies nach dem Absenden des Formulars in der URL-Zeile sichtbar.</li>
<li><b>POST</b><br>
In einem HTML-Formular erzwingen Sie diesen Befehl durch die Angabe von <tt>method=post</tt> im einleitenden <tt>&lt;form&gt;</tt>-Tag. Die Angabe bewirkt, da&szlig; die  ausgef&uuml;llten Formulardaten direkt an die Adresse &uuml;bertragen werden, die bei <tt>action=</tt> angegeben ist. Ein CGI-Script, das bei <tt>action=</tt> aufgerufen wird, mu&szlig; die Standardeingabe auslesen, um an die Formulardaten heranzukommen. In Perl geht das beispielsweise mit einer Anweisung wie <tt>read(STDIN, $Daten, $ENV{'CONTENT_LENGTH'});</tt>. Beachten Sie dabei, da&szlig; das Programm die Umgebungsvariable CONTENT_LENGTH auslesen mu&szlig;, um zu ermitteln, wie viele Zeichen es von der Standardeingabe lesen soll. Das ist erforderlich, da der &uuml;bergebene Datenstrom kein Datenendekennzeichen enth&auml;lt!
</ul> 
<p>Wenn Sie ein vorhandenes CGI-Script einsetzen wollen, m&uuml;ssen Sie wissen, nach welcher der beiden Methoden das betreffende Script die Daten erwartet. Normalerweise ist das vom Autor des CGI-Scripts dokumentiert. Einige Scripts sind auch so intelligent, beide M&ouml;glichkeiten abzufragen - in diesem Fall ist es egal, welche &Uuml;bertragungsmethode Sie im HTML-Formular w&auml;hlen. Wenn Sie eigene Scripts schreiben, m&uuml;ssen Sie eine &Uuml;bertragungsmethode festlegen oder ebenfalls so intelligent programmieren, da&szlig; es egal ist, welche Methode im HTML-Formular angegeben wird.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2">Datenstrom bei &Uuml;bertragung von Formulardaten</a></h2>


<p>Ein typisches HTML-Formular besteht aus benannten Feldern (z.B. f&uuml;r Name, E-Mail-Adresse und Kommentartext). Bei der &Uuml;bertragung eines ausgef&uuml;llten Formulars an den Server-Rechner bzw. ein CGI-Programm m&uuml;ssen die Daten so &uuml;bertragen werden, da&szlig; es dem CGI-Script m&ouml;glich ist zu erkennen, aus welchen Feldern das Formular besteht, und welche Daten der Anwender in welches Feld eingetragen hat. Deshalb gibt es eine bestimmte Kodierungsmethode, die Formularfelder und deren Daten voneinander trennt. Diese Kodierungsmethode benutzt folgende Regeln:</p>
<ul>
<li>Die einzelnen Formularelemente inclusive ihrer Daten werden durch ein kaufm&auml;nnisches <tt>&amp;</tt> voneinander getrennt.</li>
<li>Name und Daten eines Formularelements werden durch ein Istgleichzeichen <tt>=</tt> voneinander getrennt.</li>
<li>Leerzeichen in den eingegebenen Daten (z.B. bei mehreren W&ouml;rtern) werden durch ein Pluszeichen <tt>+</tt> ersetzt.</li>
<li>Alle Zeichen mit den ASCII-Werten 128 bis 255 (hexadezimal 80 bis FF) werden durch eine Hexadezimalzeichenfolge umschrieben, eingeleitet durch ein Prozentzeichen <tt>%</tt> und dahinter der Hexadezimalwert des Zeichens (z.B. wird der deutsche Umlaut <tt>&ouml;</tt> durch <tt>%F6</tt> umschrieben).</li>
<li>Alle Zeichen, die in diesen Regeln als Steuerzeichen vorkommen (also &amp;, +, = und %) werden ebenfalls hexadezimal umschrieben, und zwar genau so wie h&ouml;herwertige ASCII-Zeichen.</li>
</ul>
<p>Das folgende Beispiel zeigt zun&auml;chst den HTML-Quelltext eines HTML-Formulars und darunter ein Bild, wie das Formular im WWW-Browser mit Anwendereingaben aussieht. Unterhalb des Bildes sehen Sie, wie der Formulardatenstrom entsprechend der Kodierungsregeln aussieht, nachdem der Anwender das Formular absendet.</p>

<h3 class="xmp">Beispiel: HTML-Formular (HTML-Quelltext)</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;form action=&quot;/cgi-bin/comments.pl&quot; method=post&gt;
&lt;pre&gt;
Name:   &lt;input name=&quot;AnwenderName&quot; size=40&gt;
E-Mail: &lt;input name=&quot;AnwenderMail&quot; size=40&gt;
Text:   &lt;textarea rows=5 cols=34&gt;&lt;/textarea&gt;
             &lt;input type=submit value=&quot;Formulardaten absenden&quot;&gt;
&lt;/pre&gt;
&lt;/form&gt;
</pre></td></tr></table>
<h3 class="xmp">Beispiel: Abbildung des HTML-Formulars im WWW-Browser mit Anwendereingaben</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
<img src="xtgbf01.gif" width=366 height=191 border=1>
</pre></td></tr></table>
<h3 class="xmp">Beispiel: Formulardatenstrom aufgrund dieser Formulareingaben</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
AnwenderName=Stefan+M%FCnz&amp;AnwenderMail=s.muenz@euromail.com&amp;Text=Das+ist+ein+kleiner+Text
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>So kodiert der WWW-Browser die Formulardaten beim Absenden des Formulars. Diese Zeichenkette wird mit einer der erlaubten Methoden POST oder GET an das aufgerufene CGI-Script &uuml;bergeben. Das CGI-Script kann diesen Datenstrom in Kenntnis der Kodierungsregeln auseinanderdividieren, um die Formulardaten beispielsweise feldweise zu verarbeiten.
</p>




<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tgca.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF><img src="x3.gif" width=15 height=10 border=0> <a href="tgca.htm"><b>Grunds&auml;tzliches zu Perl-Scripts</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tgbe.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tgbe.htm"><b>Server Side Includes in HTML</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tg.htm"><b>CGI/Perl</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tgb.htm"><b>Voraussetzungen/Allgemeines</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>



</body>
</html>