<html>
<head>
<title>SELFHTML: CGI/Perl / Perl-Sprachelemente / Unterprogramme und Perl-Funktionen</title>
<meta name="description" content="(SELFHTML 7.0) Wie Sie in Perl Funktionen und Unterprogramme definieren und Parameter &uuml;bergeben.">
<meta name="keywords" content="SELFHTML, Perl, Unterprogramme, Funktionen, Parameter, Variablen, lokale Variablen">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tg.htm"><b>CGI/Perl</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tgc.htm"><b>Perl-Sprachelemente</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Unterprogramme und Perl-Funktionen</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Unterprogramme</b></a> <br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Unterprogramme mit Parameter&uuml;bergaben und R&uuml;ckgabewert</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>Lokale Variablen</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a4"><b>Perl-Funktionen</b></a>
</p>


</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="a1">Unterprogramme</a></h2>

<p>Bei komplexeren Perl-Scripts ist es empfehlenswert, bestimmte Programmteile in selbst definierte Unterprogramme zu verlagern. Auf diese Weise k&ouml;nnen Sie das Script besser strukturieren. Sinnvoll ist das vor allem bei Programmteilen, die im Laufe des Scripts mehrmals ausgef&uuml;hrt werden. Bevor Sie also eine gr&ouml;&szlig;ere Prozedur mehrmals im Script notieren, sollten Sie die entsprechende Prozedur in ein Unterprogramm stecken und dieses Unterprogramm an der gew&uuml;nschten Stelle aufrufen.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
#!/usr/bin/perl

$Ergebnis = 1 + 2 * 3 + 4 * 5 + 6 * 7 + 8 * 9;
&amp;Ausgabe;
$Ergebnis = sqrt(sqrt(81));
&amp;Ausgabe;

sub Ausgabe
{
 print &quot;Das Ergebnis lautet: &quot;, $Ergebnis, &quot;\n&quot;;
}</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Ein Unterprogramm definieren Sie mit dem Schl&uuml;sselwort <tt>sub</tt>. Dahinter folgt ein frei w&auml;hlbarer Name, der den Namenskonventionen von Perl entsprechen mu&szlig;. Im obigen Beispiel wird auf diese Weise ein Unterprogramm <tt>sub Ausgabe</tt> definiert. Der gesamte Inhalt des Unterprogramms mu&szlig; in geschweiften Klammern stehen. Sie k&ouml;nnen beliebige und beliebig viele Anweisungen innerhalb des Unterprogramms notieren.</p>

<p>Mit einem kaufm&auml;nnischen Und-Zeichen <tt>&amp;</tt> und anschlie&szlig;endem Unterprogrammnamen rufen Sie ein Unterprogramm auf. Der Aufruf ist eine eigene Anweisung, mu&szlig; also wie andere Anweisungen mit einem Strichpunkt abgeschlossen werden. Im obigen Beispiel kommt zwei mal die Anweisung <tt>&amp;Ausgabe;</tt> vor. Dadurch wird das Unterprogramm mit dem Namen <tt>Ausgabe</tt> aufgerufen.</p>

<h3 class="inf">Beachten Sie:</h3>

<p>Es ist egal, an welcher Stelle innerhalb des Scripts ein Unterprogramm steht. Bei der Interpretation f&uuml;hrt der Perl-Interpreter zuerst diejenigen Anweisungen der Reihe aus, die au&szlig;erhalb der Unterprogramme stehen.</p>

<p>Die Unterprogramme werden beim Aufruf automatisch gesucht.</p>


<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2">Unterprogramme mit Parameter&uuml;bergaben und R&uuml;ckgabewert</a></h2>

<p>Sie k&ouml;nnen ein Unterprogramm aufrufen, das einen Wert ermittelt und diesen an die aufrufende Anweisung zur&uuml;ckgibt.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
#!/usr/bin/perl

$x = &amp;Rechne(1 + 2 * 3 + 4 * 5 + 6 * 7 + 8 * 9);
print $x, &quot;\n&quot;;

sub Rechne
{
 return eval($_[0]);
}
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Im Gegensatz zu anderen Programmiersprachen wie etwa C oder auch Java und JavaScript brauchen Sie bei einem Unterprogramm, dem Parameter &uuml;bergeben werden sollen, bei der Definition des Unterprogramms keine Parameterdeklarationen anzugeben. Im obigen Beispiel wird das Unterprogramm <tt>Rechne</tt> mit einem Parameter aufgerufen: <tt>(1 + 2 * 3 + 4 * 5 + 6 * 7 + 8 * 9)</tt>. Das Unterprogramm <tt>Rechne</tt> verarbeitet diesen Parameter mit dem Konstrukt <tt>$_[0]</tt>. Dahinter steckt eine <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgcc.htm"><b>vordefinierte Variablen</b></a>, n&auml;mlich die Liste <tt>@_</tt>. Es handelt sich um die Liste der &uuml;bergebenen Parameter. <tt>$_[0]</tt> greift auf den ersten &uuml;bergebenen Parameter zu, <tt>$_[1]</tt> auf den zweiten Parameter usw. Mit einer Anweisung wie <tt>for(@_) { print $_, &quot;\n&quot;; }</tt> k&ouml;nnen Sie beispielsweise auch alle &uuml;bergebenen Parameter abarbeiten, ohne wissen zu m&uuml;ssen, wie viele Parameter &uuml;bergeben wurden. So einfach ist das sonst in kaum einer Programmiersprache.</p>

<p>Der lange Rechenausdruck, der im obigen Beispiel an das Unterprogramm <i>Rechne</i> &uuml;bergeben wird, ist ein einziger Parameter. Wenn Sie mehrere Parameter &uuml;bergeben wollen, trennen Sie diese durch Kommata.</p>

<p>Um aus einem Unterprogramm einen Wert an eine aufrufende Anweisung zur&uuml;ckzugeben, benutzen Sie am besten die <img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a4"><b>Perl-Funktion</b></a> <tt>return</tt>. Dahinter k&ouml;nnen Sie z.B. eine Variable angeben, deren aktuellen Wert Sie zur&uuml;ckgeben wollen. Im obigen Beispiel gibt <tt>return</tt> direkt den R&uuml;ckgabewert einer Perl-Funktion weiter, n&auml;mlich den R&uuml;ckgabewert der Funktion <tt>eval()</tt>. Diese Funktion bewertet eine Zeichenkette als Rechenoperation und gibt das errechnete Ergebnis zur&uuml;ck.</p>

<p>Im obigen Beispiel wird der von <tt>Rechne</tt> zur&uuml;ckgegebene Wert in dem <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgcb.htm#a1"><b>Skalar</b></a> <tt>$x</tt> gespeichert. Dazu wird diesem Skalar einfach der Aufruf des Unterprogramms <tt>Rechne</tt> zugewiesen.</p>


<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a3">Lokale Variablen</a></h2>

<p>Im Gegensatz zu den meisten anderen Programmiersprachen behalten Variablen, die innerhalb eines Unterprogramms definiert werden, nach Beenden des Unterprogramms ihre G&uuml;ltigkeit. Das bedeutet, da&szlig; Sie keine zwei gleichnamigen Variablen im gesamten Script definieren k&ouml;nnen. Denn sobald Sie mit der zweiten Variablen irgendetwas anstellen, ver&auml;ndern Sie einfach den aktuellen Inhalt der ersten, bereits vorhandenen. Diese Eigenschaft hat Perl den Ruf eingetragen, da&szlig; man damit nicht sauber strukturiert programmieren k&ouml;nne. Es gibt jedoch l&auml;ngst die M&ouml;glichkeit, die Lebensdauer einer Variablen innerhalb von Unterprogrammen auf das Unterprogramm zu beschr&auml;nken.</p>

<h3 class="xmp">Beispiel 1:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
#!/usr/bin/perl

&amp;Rechne(3*12);
print $x, &quot;\n&quot;;

sub Rechne
{
 $x = eval($_[0]);
}
</pre></td></tr></table>
<h3 class="xmp">Beispiel 2:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
#!/usr/bin/perl

&amp;Rechne(3*12);
print $x, &quot;\n&quot;;

sub Rechne
{
 my $x = eval($_[0]);
}
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>In Beispiel 1 wird zuerst das Unterprogramm <i>Rechne</i> aufgerufen. Dort wird ein <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgcb.htm#a1"><b>Skalar</b></a> <tt>$x</tt> definiert, der den ersten &uuml;bergebenen Parameter errechnet. Sonst tut das Unterprogramm nichts weiter. Im Hauptprogramm geht es anschlie&szlig;end damit weiter, da&szlig; der Inhalt von <tt>$x</tt> ausgegeben wird. Das funktioniert - <tt>$x</tt> hat seinen Wert nach Beenden des Unterprogramms <tt>Rechne</tt> also nicht verloren.<br>
Beispiel 2 unterscheidet sich von Beispiel 1 nur durch ein einziges W&ouml;rtchen, n&auml;mlich das W&ouml;rtchen <tt>my</tt> vor der Definition von <tt>$x</tt>. Durch Voranstellen von <tt>my</tt> wird ein Skalar, eine <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgcb.htm#a2"><b>Liste</b></a>, ein <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgcb.htm#a3"><b>Hash</b></a> usw. innerhalb eines Unterprogramms als lokal definiert. Im obigen Beispiel 2 bleibt der im Hauptprogramm definierte Skalar <tt>$x</tt> leer, und es wird nichts ausgegeben.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a4">Perl-Funktionen</a></h2>

<p>Perl ist unter anderem deshalb so m&auml;chtig, weil der Perl-Interpreter etliche vordefinierte Unterprogramme - hier Perl-Funktionen genannt - kennt. Es gibt Perl-Funktionen f&uuml;r die unterschiedlichsten Aufgaben. Viele davon lernen Sie in den Abschnitten <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgcj.htm"><b>Dateien lesen und schreiben</b></a>, <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgck.htm"><b>Zeichenketten und Listen manipulieren</b></a> und <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgcl.htm"><b>Mit Zahlen und Zeit arbeiten</b></a> kennen.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
#!/usr/bin/perl

print &quot;Geben Sie eine Reihe von Begriffen, getrennt durch Kommata, ein:\n&quot;;
$Eingabe = &lt;STDIN&gt;;
@Liste = split(/,/, $Eingabe);
@SortierteListe = sort(@Liste);
print &quot;Danke! Und hier die Ausgabe der alphabetisch sortierten Begriffe:\n&quot;;
for(@SortierteListe)
 {
  if(/\n/)
   {
    chop($_);
   }
  print $_, &quot;\n&quot;;
 }
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Die erste Perl-Funktion, die im obigen Beispiel vorkommt, ist <tt>print</tt>. Meistens werden Perl-Funktionen zwar wie in C oder deren Verwandten mit Klammern () aufgerufen, aber erforderlich ist das nicht. Bei so h&auml;ufig benutzten Funktionen wie <tt>print</tt> ist das Verwenden der Klammer daher mittlerweile der Schreibfaulheit zum Opfer gefallen. Wenn Sie beispielsweise statt des Funktionsaufrufs <tt>sort(@Liste)</tt> (siehe obiges Beispiel) <tt>sort @Liste</tt> notieren, erkennt Perl das auch an.</p>

<p>Eine Perl-Funktion bekommt in der Regel Parameter &uuml;bergeben, mit denen sie irgendetwas tut. So ist im Beispiel <tt>&quot;Geben Sie eine Reihe von Begriffen,  getrennt durch Kommata, ein:\n&quot;;</tt> ein Parameter, der der <tt>print</tt>-Funktion &uuml;bergeben wird. Weiter unten im Beispiel wird der Funktion <tt>sort</tt> als Parameter die <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgcb.htm#a2"><b>Liste</b></a> mit dem Namen <tt>@Liste</tt> &uuml;bergeben. Wenn Sie einer Funktion mehrere Parameter &uuml;bergeben, trennen Sie diese durch Kommata.</p> 

<p>Perl-Funktionen haben in der Regel auch einen R&uuml;ckgabewert. Im obigen Beispiel &uuml;bernimmt etwa die Perl-Funktion <tt>sort</tt> die Sortierung der &uuml;bergebenen Liste. Zur&uuml;ck gibt die Funktion eine neue Liste, n&auml;mlich mit den sortierten Elementen.</p> 

<p>Zwei weitere Perl-Funktionen im obigen Beispiel sind <tt>split</tt> und <tt>chop</tt>.<br>
Die <tt>split</tt>-Funktion kann in einer Zeichenkette nach Zeichen oder Zeichenketten suchen, die Sie mit Hilfe eines regul&auml;ren Ausdrucks als Parameter &uuml;bergeben. Au&szlig;erdem mu&szlig; noch die Zeichenkette oder der Skalar &uuml;bergeben werden, der eine entsprechende Zeichenkette enth&auml;lt. Dann liefert <tt>split</tt> eine Liste mit Elementen zur&uuml;ck, die durch die angegebene Trennregel voneinander getrennt wurden.<br>
Die <tt>chop</tt>-Funktion beseitigt das letzte Zeichen einer Zeichenkette. Das ist h&auml;ufig sinnvoll, da Zeichenketten in Perl oft automatisch ein Steuerzeichen f&uuml;r Zeilenumbruch (\n) angeh&auml;ngt bekommen.</p>


<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tgcj.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF><img src="x3.gif" width=15 height=10 border=0> <a href="tgcj.htm"><b>Dateien lesen und schreiben</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tgch.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tgch.htm"><b>Steuerzeichen und besondere Notationen</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tg.htm"><b>CGI/Perl</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tgc.htm"><b>Perl-Sprachelemente</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>



</body>
</html>