<html>
<head>
<title>SELFHTML: CGI/Perl / Perl-Sprachelemente / Zeichenketten und Listen manipulieren</title>
<meta name="description" content="(SELFHTML 7.0) Wie Sie in Perl Zeichenketten durchsuchen, &auml;ndern oder Elemente in Listen l&ouml;schen, sortieren oder einf&uuml;gen.">
<meta name="keywords" content="SELFHTML, Perl, Zeichenketten, Listen, Anh&auml;ngen, Einf&uuml;gen, L&ouml;schen, Sortieren">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tg.htm"><b>CGI/Perl</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tgc.htm"><b>Perl-Sprachelemente</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Zeichenketten und Listen manipulieren</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Teile aus Zeichenketten extrahieren</b></a> <br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Zeichenketten in Listen verwandeln</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>Listenelemente zu Zeichenkette verbinden</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a4"><b>Listenelemente hinzuf&uuml;gen, ersetzen und l&ouml;schen</b></a> <br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a5"><b>Listenelemente sortieren</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a6"><b>Suchen und Ersetzen von Zeichen oder Zeichenketten</b></a>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="a1">Teile aus Zeichenketten extrahieren</a></h2>

<p>Sie k&ouml;nnen aus einer gr&ouml;&szlig;eren Zeichenkette ein einzelnes Zeichen oder eine Zeichenfolge entnehmen.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
#!/usr/bin/perl

$Url = &quot;http://www.teamone.de/selfhtml/tgck.htm&quot;;

$Stop = index($Url,&quot;:&quot;);
$Protokoll = substr($Url,0,$Stop);
$Start = index($Url,&quot;//&quot;) + 2;
$Domain = substr($Url,$Start);
$Stop = index($Domain,&quot;/&quot;);
$Domain = substr($Domain,0,$Stop);
$Start = rindex($Url,&quot;/&quot;) + 1;
$Dateiname = substr($Url,$Start);
$Url_Laenge = length($Url);

print &quot;Das verwendete Internet-Protokoll der URL-Adresse lautet: &quot;, $Protokoll, &quot;\n&quot;;
print &quot;Die Domain-Adresse der URL-Adresse lautet: &quot;, $Domain, &quot;\n&quot;;
print &quot;Der Dateiname der URL-Adresse lautet: &quot;, $Dateiname, &quot;\n&quot;;
print &quot;Die URL-Adresse hat eine Laenge von: &quot;, $Url_Laenge, &quot; Zeichen\n&quot;;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Im obigen Beispiel wird aus einer URL-Adresse, die in dem <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgcb.htm#a1"><b>Skalar</b></a> <tt>$Url</tt> gespeichert wird, das Internet-Protokoll (im Beispiel: http), die Domain-Adresse (im Beispiel: www.teamone.de) und der Dateiname (im Beispiel teck.htm) extrahiert. Alle drei Teile der URL-Adresse werden in eigenen Skalaren gespeichert. Das Internet-Protokoll wird in <tt>$Protokoll</tt> gespeichert, die Domain-Adresse in <tt>$Domain</tt> und der Dateiname in <tt>$Dateiname</tt>. Am Ende des Scripts werden die ermittelten Teile mit der <tt>print</tt>-Funktion ausgegeben.</p>

<p>Die <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgci.htm#a4"><b>Perl-Funktion</b></a>, mit deren Hilfe Sie eine Teilzeichenkette aus einer gr&ouml;&szlig;eren Zeichenkette extrahieren k&ouml;nnen, hei&szlig;t <tt>substr</tt> (= <i>Unterzeichenkette</i>). Diese Funktion erwartet zwei oder drei Parameter. Der erste Parameter ist die Zeichenkette, von der ein Teil extrahiert werden soll. Der zweite Parameter ist eine Zahl. Die Zahl gibt an, ab dem wievielten Zeichen der Zeichenkette die Teilzeichenkette extrahiert werden soll. Dabei wird bei 0 (f&uuml;r das erste Zeichen) zu z&auml;hlen begonnen. Wenn Sie beispielsweise <tt>substr(Stefan,2)</tt> notieren, gibt die Funktion <tt>efan</tt> zur&uuml;ck. Als dritten Parameter k&ouml;nnen Sie <tt>substr</tt> noch mitteilen, wieviele Zeichen ab dem angegebgenen Startzeichen extrahiert werden sollen. Wenn Sie etwa <tt>substr(Stefan,2,3)</tt> notieren, erhalten Sie als Ergebnis <tt>efa</tt>.</p>

<p>H&auml;ufig wissen Sie jedoch nicht, an der wievielten Stelle einer Zeichenkette ein gew&uuml;nschter, sinnvoller Teil beginnt. Daf&uuml;r wissen Sie, da&szlig; die Zeichenkette einen bestimmten Aufbau hat. So ist es auch im obigen Beispiel. Die Zeichenkette stellt eine URL-Adresse dar. URL-Adressen haben bekanntlich einen einheitlichen Aufbau. Wenn Sie, wie im Beispiel, etwa die Domainadresse aus einer URL extrahieren wollen, wissen Sie, da&szlig; die Domainadresse hinter dem doppelten Schr&auml;gstrich // beginnt. Perl bietet dazu die Funktionen <tt>index</tt> und <tt>rindex</tt> an. Mit <tt>index</tt> ermitteln Sie, an der wievielten Stelle einer Zeichenkette ein bestimmtes Zeichen oder eine bestimmte Zeichenfolge zum <tt>n&auml;chsten mal</tt> vorkommt. Mit <tt>rindex</tt> ermitteln Sie, an der wievielten Stelle einer Zeichenkette ein bestimmtes Zeichen oder eine bestimmte Zeichenfolge zum <tt>letzten mal</tt> vorkommt. Beide Funktionen erwarten zwei Parameter. Als ersten Parameter &uuml;bergeben Sie die Zeichenkette, in der nach dem Vorkommen eines Zeichens oder einer Zeichenfolge gesucht werden soll. Als zweiten Parameter bekommt die Funktion das Zeichen oder die Zeichenfolge &uuml;bergeben, nach der gesucht werden soll. Beide Funktionen geben dann eine Zahl zur&uuml;ck. Diese Zahl k&ouml;nnen Sie dann in <tt>substr</tt> als zweiten Parameter &uuml;bergeben. Wenn Sie beispielsweise <tt>index(&quot;Opa nahm Opium&quot;,&quot;Op&quot;)</tt> notieren, erhalten Sie 0 zur&uuml;ck, weil &quot;Op&quot; gleich am Anfang zum ersten mal vorkommt. Wenn Sie dagegen <tt>rindex(&quot;Opa nahm Opium&quot;,&quot;Op&quot;)</tt> notieren, erhalten Sie 9 zur&uuml;ck, da in diesem Fall das letzte Vorkommen von &quot;Op&quot; ermittelt wird.</p>

<p>Es ist sinnvoll, die R&uuml;ckgabewerte der all dieser Perl-Funktionen in eigens daf&uuml;r definierten Skalaren zu speichern, so wie im obigen Beispiel. Diese Skalare k&ouml;nnen Sie anschlie&szlig;end bequem weiterverarbeiten.</p>

<h3 class="inf">Beachten Sie:</h3>

<p>Eine weitere interesante Funktion f&uuml;r Zeichenketten ist <tt>length</tt> (siehe Beispiel). Diese Funktion gibt die Anzahl Zeichen in einer Zeichenkette zur&uuml;ck.</p>


<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2">Zeichenketten in Listen verwandeln</a></h2>

<p>Wenn Sie Zeichenketten haben, die bestimmte, regelm&auml;&szlig;ig vorkommende Zeichen enthalten, k&ouml;nnen Sie diese Zeichen als Trennzeichen behandeln und die Zeichenkette in eine <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgcb.htm#a1"><b>Liste</b></a> &uuml;bertragen.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
$CSV_Zeile = &quot;Wilhemine Sauerapfel,Schlundstr. 13,90001 Neunhausen,099/12345&quot;;
@Adresse = split(/,/,$CSV_Zeile,4);
$i = 0;
for(@Adresse)
 {
  print $i+1, &quot;. Feld der Adresse: &quot;, $Adresse[$i], &quot;\n&quot;;
  $i++;
 }
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Im obigen Beispiel ist in dem <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgcb.htm#a1"><b>Skalar</b></a> <tt>$CSV_Zeile</tt> eine typische Zeile aus einer kommabegrenzten Datei gespeichert. Viele Datenbank- und Tabellenkalkulationsprogramme bieten die M&ouml;glichkeit, strukturierte Daten in Form solcher kommabegrenzter Dateien abzuspeichern. Dateien dieser Art werden &uuml;blicherweise mit der Dateiendung <tt>.csv</tt> abgespeichert. Wenn Sie so eine <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgcj.htm#a2"><b>Datei zeilenweise einlesen</b></a>, erhalten Sie in jeder Zeile einen Inhalt von der Art, wie er im obigen Beispiel in <tt>$CSV_Zeile</tt> gespeichert ist.</p>

<p>Mit der <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgci.htm#a4"><b>Perl-Funktion</b></a> <tt>split</tt> k&ouml;nnen Sie solche Inhalte in Felder aufteilen und in einer Liste speichern. Definieren Sie eine <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgcb.htm#a2"><b>Liste</b></a> wie im Beispiel die Liste <tt>@Adresse</tt>. Dieser Liste weisen Sie den R&uuml;ckgabewert von <tt>split</tt> zu. Die Funktion <tt>split</tt> erwartet zwei, optional auch drei Parameter. Als ersten Parameter &uuml;bergeben Sie einen <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgcg.htm"><b>regul&auml;ren Ausdruck</b></a>, mit dessen Hilfe der Feldtrenner ermittelt wird. Im obigen Beispiel ist das einfach das Kommazeichen. Als zweiten Parameter &uuml;bergeben Sie die Zeichenkette, aus der die Liste erzeugt werden soll. Im Beispiel ist das der Skalar <tt>$CSV_Zeile</tt>. Als dritten Parameter k&ouml;nnen Sie der <tt>split</tt>-Funktion noch angeben, wie viele Felder sie maximal erzeugen soll. Im obigen Beispiel ist das eigentlich nicht n&ouml;tig, aber der Vollst&auml;ndigkeit halber wird 4 &uuml;bergeben, denn so viele Datenfelder enth&auml;lt die Adressenzeile.</p>


<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a3">Listenelemente zu Zeichenkette verbinden</a></h2>

<p>Sie k&ouml;nnen aus Elementen einer Liste eine Zeichenkette bilden.</p>

<h3 class="xmp">Beispiel:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
#!/usr/bin/perl

@Adresse = (&quot;Wilhemine Sauerapfel&quot;,&quot;Schlundstr. 13&quot;,&quot;90001 Neunhausen&quot;,&quot;099/12345&quot;);
$CSV_Zeile = join(&quot;,&quot;,@Adresse);
print &quot;Die erzeugte Zeichenkette lautet: &quot;, $CSV_Zeile, &quot;\n&quot;;
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Im obigen Beispiel haben Sie eine Adresse in einer Liste <tt>@Adresse</tt> mit Feldern f&uuml;r die einzelnen Daten gespeichert. Diese Liste k&ouml;nnen Sie mit Hilfe der <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgci.htm#a4"><b>Perl-Funktion</b></a> <tt>join</tt> in eine Zeichenkette verwandeln. Dabei geben Sie au&szlig;erdem an, durch welches Zeichen oder welche Zeichenfolge die Felder in der zu erzeugenden Zeichenkette voneinander getrennt werden sollen. Die Funktion <tt>join</tt> ist also die Umkehrfunktion zu <tt>split</tt>.</p> 

<p>Definieren Sie einen <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgcb.htm#a1"><b>Skalar</b></a> wie im Beispiel den Skalar <tt>$CSV_Zeile</tt>. Diesem Skalar weisen Sie den R&uuml;ckgabewert von <tt>join</tt> zu. Die Funktion <tt>join</tt> erwartet zwei Parameter. Als ersten Parameter &uuml;bergeben Sie das Zeichen oder die Zeichenfolge, durch die die Felder in der zu erzeugenden Zeichenkette voneinander getrennt sein sollen. Im Beispiel ist das einfach ein Kommazeichen. Als zweiten Parameter &uuml;bergeben Sie die Liste, aus der die Zeichenkette erzeugt werden soll. Im Beispiel ist das die Liste <tt>@Adresse</tt>.</p>


<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a4">Listenelemente hinzuf&uuml;gen, ersetzen und l&ouml;schen</a></h2>

<p>Eine <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgcb.htm#a2"><b>Liste</b></a> mu&szlig; keinen festen Inhalt und keine feste L&auml;nge haben. Sie k&ouml;nnen beispielsweise w&auml;hrend des Programmlaufs zu einer Liste Elemente an eine Liste anh&auml;ngen oder Elemente aus der Liste l&ouml;schen.</p>


<h3 class="xmp">Beispiel 1: Element hinzuf&uuml;gen:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
#!/usr/bin/perl

@Adresse = (&quot;Wilhemine Sauerapfel&quot;,&quot;Schlundstr. 13&quot;,&quot;90001 Neunhausen&quot;,&quot;099/12345&quot;);
push(@Adresse,&quot;sauerapfel\@finster.de&quot;);
for(@Adresse)
 {
  print $_, &quot;\n&quot;;
 }
</pre></td></tr></table>
<h3 class="xmp">Beispiel 2: Element entfernen</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
#!/usr/bin/perl

@Adresse = (&quot;Wilhemine Sauerapfel&quot;,&quot;Schlundstr. 13&quot;,&quot;90001 Neunhausen&quot;,&quot;099/12345&quot;);
pop(@Adresse);
for(@Adresse)
 {
  print $_, &quot;\n&quot;;
 }
</pre></td></tr></table>
<h3 class="xmp">Beispiel 3: Element ersetzen</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
#!/usr/bin/perl

@Adresse = (&quot;Wilhemine Sauerapfel&quot;,&quot;Schlundstr. 13&quot;,&quot;90001 Neunhausen&quot;,&quot;099/12345&quot;);
$Adresse[1] = &quot;Hasenschartenstr. 7&quot;;
for(@Adresse)
 {
  print $_, &quot;\n&quot;;
 }
</pre></td></tr></table>
<h3 class="xmp">Beispiel 4: Elemente umsortieren</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
#!/usr/bin/perl

@Adresse = (&quot;Wilhemine Sauerapfel&quot;,&quot;Schlundstr. 13&quot;,&quot;90001 Neunhausen&quot;,&quot;099/12345&quot;);
for($i=1;$i&lt;3;$i++)
 {
  $Temp = shift(@Adresse);
  push(@Adresse,$Temp);
 }
for(@Adresse)
 {
  print $_, &quot;\n&quot;;
 }
</pre></td></tr></table>


<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Mit Hilfe der <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgci.htm#a4"><b>Perl-Funktion</b></a> <tt>push</tt> k&ouml;nnen Sie ein Element an eine Liste anh&auml;ngen. Im obigen Beispiel 1 wird an die Liste <tt>@Adresse</tt> ein Element angeh&auml;ngt, das eine E-Mail-Adresse enth&auml;lt. Die Funktion <tt>push</tt> bekommt beim Aufruf im ersten Parameter die Liste &uuml;bergeben, an die Sie ein oder mehrere Elemente anh&auml;ngen m&ouml;chten. Dahinter geben Sie ein oder mehrere Elemente an, die Sie anh&auml;ngen m&ouml;chten. Das k&ouml;nnen Zeichenketten oder Zahlen sein. Im obigen Beispiel wird nur ein Element angeh&auml;ngt, n&auml;mlich die E-Mail-Adresse. Wenn Sie mehrere Elemente anh&auml;ngen wollen, trennen Sie diese durch Kommata.<br>
Der Schr&auml;gstrich in der E-Mail-Adresse geh&ouml;rt &uuml;brigens nicht zu der Adresse, sondern ist ein Maskierungszeichen f&uuml;r das Klammeraffenzeichen @, da dieses Zeichen in Perl eine eigene Bedeutung hat (es markiert Listen).</p>

<p>Mit Hilfe der Funktion <tt>pop</tt> k&ouml;nnen Sie das letzte Element einer Liste entfernen. Dazu &uuml;bergeben Sie beim Aufruf der Funktion einfach die Liste, deren letztes Element Sie entfernen wollen. Im obigen Beispiel 2 ist das die Liste <tt>@Adresse</tt>. In dem Beispiel wird die Telefonnummer aus der Liste entfernt.</p>

<p>Um in einer Liste ein bestimmtes Element zu ersetzen, sprechen Sie einfach das betreffende Listenelement an und weisen ihm einen anderen Wert zu, so wie im obigen Beispiel 3.</p>

<p>Das obige Beispiel 4 zeigt, wie Sie die Elemente einer Liste &quot;h&auml;ndisch&quot; umsortieren k&ouml;nnen. Dazu eignet sich die Perl-Funktion <tt>shift</tt>. Diese Funktion entfernt das erste Element aus einer Liste und gibt es zur&uuml;ck. Alle weiteren Elemente r&uuml;cken eins nach vorne, so da&szlig; das bislang zweite Element nun das erste wird usw. Damit das entfernte erste Element nicht verloren geht, k&ouml;nnen Sie es in einem Skalar zwischenspeichern. Im obigen Beispiel 4 wird das entfernte Element im Skalar <tt>$Temp</tt> zwischengespeichert. Mit der Funktion <tt>push</tt> wird dieses Element anschlie&szlig;end wieder ans Ende der Liste angeh&auml;ngt. Im Beispiel findet dieser Austausch innerhalb einer <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgce.htm#a3"><b>for-Schleife</b></a> statt. Auf diese Weise lassen sich mehrere Elemente nacheinander umsortieren. In dem Beispiel stehen am Ende Ort und Telefonnummer der Adresse am Anfang der Liste, gefolgt von Name und Stra&szlig;e.</p>


<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a5">Listenelemente sortieren</a></h2>

<p>Eine sehr leistungsstarke Funktion in Perl ist die M&ouml;glichkeit, Listen zu sortieren.</p>

<h3 class="xmp">Beispiel 1: Zeichenketten sortieren</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
#!/usr/bin/perl

@Freundinnen = (&quot;Nina&quot;,&quot;Martina&quot;,&quot;Annina&quot;,&quot;Christina&quot;,&quot;Ina&quot;,&quot;Sabrina&quot;);
@Ordnung = sort(@Freundinnen);
for(@Ordnung)
 {
  print $_, &quot;\n&quot;;
 }
</pre></td></tr></table>
<h3 class="xmp">Beispiel 2: Zahlen sortieren</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
#!/usr/bin/perl

@HighscoreListe = (9834,9837,5989,4509,4329,6509,2837,8289,10845);
@SortierteListe = sort NummernSort @HighscoreListe;
@AbsteigendSortierteListe = reverse @SortierteListe; 
for(@AbsteigendSortierteListe)
 {
  print $_, &quot;\n&quot;;
 }

sub NummernSort
{
 if($a &lt; $b)
  { return -1; }
 elsif($a == $b)
  { return 0; }
 else
  { return 1; }
}
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Zum automatischen Sortierung von Listen steht die <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgci.htm#a4"><b>Perl-Funktion</b></a> <tt>sort</tt> zur Verf&uuml;gung. Diese Funktion sortiert die Elemente einer Liste, die der Funktion als Parameter &uuml;bergeben wird, automatisch alphabetisch in aufsteigender Reihenfolge. Wenn Sie genau das erreichen wollen, brauchen Sie nur einen Befehl wie im obigen Beispiel 1 der Befehl <tt>@Ordnung = sort(@Freundinnen)</tt>. In diesem Beispiel wird die Liste <tt>@Freundinnen</tt> sortiert. Die sortierte Liste wird in <tt>@Ordnung</tt> gespeichert.</p>

<p>Schwieriger wird es, wenn Sie numerische Werte sortieren wollen, so wie im obigen Beispiel 2. Dazu brauchen Sie ein eigenes <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgci.htm#a1"><b>Unterprogramm</b></a>, das ein bestimmtes Aussehen haben mu&szlig;, da die <tt>sort</tt>-Funktion dieses Unterprogramm auf Wunsch aufruft. Das Unterprogramm <tt>NummernSort</tt> aus Beispiel 2 k&ouml;nnen Sie f&uuml;r all solche Zwecke verwenden. Mit der Anweisung <tt>@SortierteListe = sort NummernSort @HighscoreListe;</tt> wird im Beispiel die Liste <tt>@HighscroreListe</tt> numerisch sortiert. Lassen Sie bei diesem Funktionsaufruf am besten die Klammern weg und notieren Sie hinter <tt>sort</tt> den Namen des Unterprogramms f&uuml;r den Sortiervorgang, im Beispiel also <tt>NummernSort</tt>. Dahinter folgt die Angabe der Liste, die auf diese Weise sortiert werden soll, im Beispiel <tt>@HighscoreListe</tt>.</p>

<p>Wenn Sie eine Liste nicht aufsteigend, sondern absteigend sortiert haben wollen, k&ouml;nnen Sie die Perl-Funktion <tt>reverse</tt> anwenden. Im obigen Beispiel 2 wird die Liste <tt>@SortierteListe</tt>, die zun&auml;chst aufsteigend sortiert ist, mit der Anweisung <tt>@AbsteigendSortierteListe = reverse @SortierteListe;</tt> in eine neue Liste mit dem Namen <tt>@AbsteigendSortierteListe</tt> gespeichert. Diese Liste ist absteigend sortiert.</p>


<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a6">Suchen und Ersetzen von Zeichen oder Zeichenketten</a></h2>

<p>Das m&auml;chtige Werkzeug der <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgcg.htm"><b>regul&auml;ren Ausdr&uuml;cke</b></a> wird in Perl auch oft dazu benutzt, um in Zeichenketten bestimmte Zeichen oder Zeichenfolgen durch andere zu ersetzen, oder um bestimmte Zeichen oder Zeichenfolgen aus Zeichenketten zu entfernen. Dazu gibt es eine spezielle Syntax.</p>

<h3 class="xmp">Beispiel 1: Alle Buchstaben und Leerzeichen entfernen</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
#!/usr/bin/perl

$Text = &quot;Franz jagt im komplett verwahrlosten Taxi quer durch Bayern 1234567890&quot;;
$Text =~ s/[a-z]| //gi;
print $Text;
</pre></td></tr></table>
<h3 class="xmp">Beispiel 2: Deutsche Umlaute HTML-gerecht ersetzen</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
#!/usr/bin/perl

$Text = &quot;In M&uuml;nchen steht ein Hofbr&auml;uhaus, dort gibt es Bier in Ma&szlig;en&quot;;
$Text =~ s/&auml;/\&amp;auml\;/g;
$Text =~ s/&ouml;/\&amp;ouml\;/g;
$Text =~ s/&uuml;/\&amp;uuml\;/g;
$Text =~ s/&Auml;/\&amp;Auml\;/g;
$Text =~ s/&Ouml;/\&amp;Ouml\;/g;
$Text =~ s/&Uuml;/\&amp;Uuml\;/g;
$Text =~ s/&szlig;/\&amp;szlig\;/g;
print $Text;
</pre></td></tr></table>
<h3 class="xmp">Beispiel 3: Fehlerhafte Angaben entfernen und unterdr&uuml;cken</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
#!/usr/bin/perl

@Schulnoten = (1,4,7,2,X,3,0,1,6,3,3,8,R,G,9,2,3,4,1,1,3);
$Notenkette = join(&quot;,&quot;,@Schulnoten);
$Notenkette =~ s/[7-9]|0|[A-Z]//gi;
@NeueNoten = split(/,|,,/,$Notenkette);
for(@NeueNoten)
 {
  unless($_ eq &quot;&quot;)
   {
    print $_, &quot;\n&quot;;
   }
 }
</pre></td></tr></table>

<h3 class="xpl">Erl&auml;uterung:</h3>

<p>Das Schema f&uuml;r alle Suche-Ersetze-Vorg&auml;nge in Perl lautet:<br>
<tt>Zeichenkette =~ s/Suchmuster/Ersetzmuster/[Optionen]</tt></p>

<p><tt>Zeichenkette</tt> ist meistens ein <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tgcb.htm#a1"><b>Skalar</b></a>, in dem eine Zeichenkette gespeichert ist, so wie etwa <tt>$Text</tt> im obigen Beispiel 1. Dahinter notieren Sie die Zuweisung <tt>=~</tt>, gefolgt von einem Leerzeichen und dem kleinen Buchstaben <tt>s</tt>. Unmittelbar hinter dem kleinen <tt>s</tt> folgt ein regul&auml;rer Ausdruck, markiert durch die Schr&auml;gstriche <tt>/.../</tt>. In diesem Suchausdruck definieren Sie nach den Regeln f&uuml;r regul&auml;re Ausdr&uuml;cke, wonach in der Zeichenkette gesucht werden soll. Hinter dem abschlie&szlig;enden Schr&auml;gstrich folgt ein zweiter Ausdruck. In diesem Ausdruck notieren Sie das Zeichen oder die Zeichenfolge, durch die Fundstellen ersetzt werden sollen. Dahinter folgt nochmals ein abschlie&szlig;ender Schr&auml;gstrich. Hinter diesem Schr&auml;gstrich k&ouml;nnen Sie mit Hilfe von erlaubten Kleinbuchstaben Optionen f&uuml;r den Suche-Ersetze-Vorgang definieren. Dabei sind folgende Buchstaben wichtig:<br>
<tt>g</tt> sucht/ersetzt alle Fundstellen (ansonsten wird nur die erste Fundstelle ersetzt)<br>
<tt>i</tt> sucht/ersetzt Buchstaben unabh&auml;ngig davon, ob sie gro&szlig; oder klein geschrieben sind (ansonsten wird Gro&szlig;-/Kleinschreibung unterschieden)</p>

<p>Im obigen Beispiel 1 werden aus <tt>$Text</tt> alle Buchstaben (gro&szlig; und klein) und alle Leerzeichen entfernt. Es bleiben anschlie&szlig;end also nur noch die Ziffern am Ende stehen.</p>

<p>Im obigen Beispiel 2 werden in <tt>$Text</tt> alle deutschen Umlaute und scharfes S durch ihre HTML-gerechten Umschreibungen ersetzt.</p>

<p>Im obigen Beispiel 3 werden aus der Liste <tt>@Schulnoten</tt> alle Werte entfernt, die nicht zwischen 1 und 6 liegen. Dazu wird die <img src="xgoup.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>Liste zu einer Zeichenkette verbunden</b></a>. Aus dieser Zeichenkette <tt>$Notenkette</tt> werden alle Ziffern entfernt, die nicht zwischen 1 und 6 liegen, sowie alle Buchstaben. Das Ersetzmuster bleibt dabei leer, was dazu f&uuml;hrt, das die Fundstellen einfach entfernt werden. Anschlie&szlig;end wird die behandelte <img src="xgoup.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Zeichenkette in eine Liste verwandelt</b></a>. Dabei werden mit dem regul&auml;ren Ausdruck <tt>/,|,,/</tt> auch alle leeren Elemente, die der Suche-Ersetze-Vorgang zur&uuml;ckgelassen hat, &uuml;bergangen. Die neue Liste enth&auml;lt nur noch g&uuml;ltige Schulnoten zwischen 1 und 6.</p>




<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tgcl.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF><img src="x3.gif" width=15 height=10 border=0> <a href="tgcl.htm"><b>Mit Zahlen und Zeit arbeiten</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tgcj.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tgcj.htm"><b>Dateien lesen und schreiben</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tg.htm"><b>CGI/Perl</b></a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tgc.htm"><b>Perl-Sprachelemente</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>



</body>
</html>