<html>
<head>
<title>SELFHTML: Internationalisierung / Computer und geschriebene Sprache</title>
<meta name="description" content="(SELFHTML 7.0) Das Zusammenspiel von Bits, Bytes, Zeichens&auml;tzen und Schriftarten mit einem Beispiel zur Verdeutlichung">
<meta name="keywords" content="SELFHTML, HTML, Internationalisierung, Zeichens&auml;tze">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="th.htm"><b>Internationalisierung</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Computer und geschriebene Sprache</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 border=0 vspace=6 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Bits, Bytes und Zeichens&auml;tze</b></a> <br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Beispiel f&uuml;r Zeichens&auml;tze</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>Die Grenzen von Bytes und Zeichens&auml;tzen sprengen</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a4"><b>Die Bedeutung der Schriftarten</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a5"><b>Schriftkulturen mit anderer Schreibrichtung</b></a>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="a1">Bits, Bytes und Zeichens&auml;tze</a></h2>

<p>Die beiden Grundeinheiten in jedem heutigen Computer sind die Einheiten <b>Bit</b> und <b>Byte</b>. Ein Byte ist bei den heute &uuml;blichen Systemen als Folge von 8 Bit definiert (man spricht auch von <b>Octets</b>). Da jedes Bit zwei Zust&auml;nde haben kann, n&auml;mlich 0 oder 1 bzw. ja oder nein, lassen sich mit einer Folge von 8 Bit genau 256 (= 8 hoch 2) unterschiedliche Zust&auml;nde realisieren. Ein Byte kann also 256 unterschiedliche Werte haben. Da im Computer immer auch die 0 dazugeh&ouml;rt, k&ouml;nnen in einem Byte dezimal ausgedr&uuml;ckt Werte zwischen 0 und 255 stehen.</p> 

<p>Wenn ein laufendes Programm im Computer eine Datei zeichenweise in den Arbeitsspeicher einliest, stehen im Arbeitsspeicher anschlie&szlig;end nur Byte-Werte. Wenn also ein WWW-Browser eine HTML-Datei in den Arbeitsspeicher einliest, besteht die Datei dort aus nichts anderem als Byte-Werten. Von Zeichen unseres Alphabets ist auf dieser Ebene noch keine Rede. Damit aus den Byte-Werten lesbare Zeichen werden, die sich am Bildschirm darstellen lassen, braucht es eine Konvention, die festlegt, welcher Byte-Wert als welches Zeichen dargestellt werden soll. Diese Aufgabe haben die sogenannten <b>Zeichens&auml;tze</b>. Zeichens&auml;tze sind Tabellen, die einem Byte-Wert ein Zeichen zuordnen, das in unseren Schriftkulturen eine Bedeutung hat.</p>

<p>Die Zeichens&auml;tze sind EDV-historisch gewachsene Gebilde. Bis zum Aufkommen der Personal Computer benutzten viele Rechner noch 7 Bit lange Grundeinheiten, mit denen sich nur 128 unterschiedliche Zust&auml;nde darstellen lassen. Noch fr&uuml;her waren es auch mal 6 und 5 Bit lange Grundeinheiten. Auf der 7 Bit langen Grundeinheit beruhten die ersten Zeichens&auml;tze, die historisch den Durchbruch schafften: der <b>ASCII-Zeichensatz</b> und der <b>EBCDIC-Zeichensatz</b>. Dabei setzte sich vor allem der ASCII-Zeichensatz durch, weil er im erfolgreichen Unix-Betriebssystem und in den aufkommenden Personal Computern zum Einsatz kam.</p>

<p>Beim ASCII-Zeichensatz sind die ersten 32 Zeichen f&uuml;r Steuerzeichen reserviert, etwa f&uuml;r Tastatur-Impulse wie Zeilenumbruch. Die Zeichen zwischen 32 und 127 sind darstellbare Zeichen, darunter alle Ziffern, Satzzeichen und Buchstaben, die ein Amerikaner so braucht (denn der ASCII-Zeichensatz kommt nat&uuml;rlich aus den USA).</p>

<p>Lange Zeit war ASCII der einzige verbreitete Standard. Da die neueren Computer aber 256 lange Bytes hatten, war es folgerichtig, f&uuml;r die Werte zwischen 128 und 255 neue Verwendungszwecke zu finden. Dabei entwickelten sich jedoch propriet&auml;re L&ouml;sungen. MS DOS beispielsweise benutzt einen &quot;erweiterten ASCII-Zeichensatz&quot;, der aber nicht viel mehr ist als eine sch&ouml;ne Umschreibung f&uuml;r die Microsoft-eigene Belegung der Zeichen 128 bis 255 speziell f&uuml;r die Bed&uuml;rfnisse von MS DOS.</p>

<p>Um auch hierf&uuml;r einen Standard zu schaffen, ersann die amerikanische Standardisierungs-Organisation den <b>ANSI-Zeichensatz</b>. Dieser Zeichensatz &uuml;bernimmt f&uuml;r die Zeichen 0 bis 127 den ASCII-Zeichensatz und definiert f&uuml;r die Werten zwischen 128 und 255 etliche Sonderzeichen, darunter wichtige Alphabetzeichen verbreiteter Sprachen, etwa deutsche Umlaute, franz&ouml;sische Accent-Zeichen oder spanische Zeichen mit Tilde. Dazu kamen diverse verbreitete kaufm&auml;nnisch-/wissenschaftliche Zeichen.</p>

<p>Der Bedarf an international g&uuml;ltigen Zeichens&auml;tzen wird jedoch immer gr&ouml;&szlig;er. Ein Versuch, ein solches Set von Zeichens&auml;tzen zu etablieren, stellt die <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="thb.htm#a1"><b>iso-8559-Familie</b></a> dar. HTML unterst&uuml;tzt mittlerweile die M&ouml;glichkeit, all diese Zeichens&auml;tze zu verwenden.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2">Beispiel f&uuml;r Zeichens&auml;tze</a></h2>

<p>Ein Beispiel soll das Prinzip der Zeichens&auml;tze verdeutlichen. Die folgende Abbildung zeigt zwei Zeichens&auml;tze: den MS-DOS-Zeichensatz und den ANSI-Zeichensatz, den z.B. MS Windows als Voreinstellung verwendet.</p>

<p><img src="xtcma1.gif" width=626 height=377 border=0 alt="Zeichens&auml;tze"></p>

<p>Der Abbildung k&ouml;nnen Sie entnehmen, da&szlig; die oberen Teile (dunkler) beider Zeichens&auml;tze identisch sind, da beide Zeichens&auml;tze den ASCII-Zeichensatz f&uuml;r die ersten 128 Zeichen &uuml;bernehmen (die ersten 32 Zeichen fehlen in der Abbildung, da es sich bei diesen Zeichen um Steuerzeichen handelt, die nicht abbildbar sind). Die unteren Teile (heller) sind dagegen unterschiedlich. Wo im ANSI-Zeichensatz beispielsweise ein kleines deutsches <b>&uuml;</b> liegt, bietet der erweiterte DOS-Zeichensatz ein hochgestelltes <b><sup><small>S</small></sup></b> an.</p>

<p>Wenn Sie mit MS Windows arbeiten, k&ouml;nnen Sie das selbst ausprobieren: erzeugen Sie unter MS Windows mit einem ANSI-Texteditor (z.B. Notepad) eine leere Datei: tippen Sie einfach so etwas wie  &quot;&auml;&auml;&auml;&auml;&ouml;&ouml;&ouml;&ouml;&uuml;&uuml;&uuml;&uuml;&quot; ein. Die Eingaben speichern Sie unter einem Dateinamen ab. Anschlie&szlig;end rufen Sie die DOS-Eingabeaufforderung auf und geben <i>edit</i> ein. Dann &ouml;ffnet sich der DOS-Editor. Damit &ouml;ffnen Sie die zuvor unter Windows abgespeicherte Datei. Nun k&ouml;nnen Sie sehen, was der Zusammenhang zwischen Byte und Zeichensatz ist: es werden zwar genau so viele Zeichen angezeigt als unter MS Windows, aber es sind andere Zeichen. Der Grund ist, da&szlig; im Arbeitsspeicher immer nur Byte-Werte stehen. Was ein Programm jedoch daraus macht, h&auml;ngt davon ab, welchen Zeichensatz es benutzt.</p>

<p>Das Beispiel zwischen dem MS-DOS-Zeichensatz und dem ANSI-Zeichensatz wurde hier bewu&szlig;t ausgew&auml;hlt, da es sich an ein und demselben Rechner testen l&auml;&szlig;t. Das Beispiel soll aber vor allem auch dazu ermuntern, tiefer in die Geheimnisse der Zeichens&auml;tze einzusteigen und sich besonders an die Regeln der <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="thd.htm"><b>Verwendung von Zeichens&auml;tzen und Unicodes in HTML</b></a> zu halten.</p>




<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a3">Die Grenzen von Bytes und Zeichens&auml;tzen sprengen</a></h2>


<p>Zeichens&auml;tze decken einzelne Schriftkulturen und damit verbundene Sprachen oder Sprachfamilien ab. Problematisch wird es, wenn mehrsprachige Dokumente erstellt werden sollen, die Schriften ganz unterschiedlicher Zeichens&auml;tze enthalten. Auch f&uuml;r nicht-alphabetische Schriftkulturen sind Zeichens&auml;tze ungeeignet. In unseren Zeiten der Globalisierung wird es jedoch immer wichtiger, f&uuml;r solche Probleme eine standardisierte EDV-technische L&ouml;sung zu finden, die sich auf den verschiedensten Computersystemen durchsetzt. Eine solche L&ouml;sung gibt es auch schon: das <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="thc.htm"><b>Unicode-System</b></a>. Unicode soll langfristig das heute &uuml;bliche System der Zeichens&auml;tze abl&ouml;sen.</p>

<p>Ferner mu&szlig; bei so einem Ansatz das Problem gel&ouml;st werden, wie sich die numerischen Werte mit Hilfe von Schriftarten in anzeigbare oder druckbare Zeichen umsetzen lassen.</p>




<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a4">Die Bedeutung der Schriftarten</a></h2>

<p>Schriftarten sind Beschreibungsmodelle, um auf Ausgabemedien wie Bildschirm oder Drucker Zeichen abzubilden. Jedes heute &uuml;bliche Betriebssystem enth&auml;lt sogenannte <b>Systemschriften</b>. Das sind Schriftarten, die auf jeden Fall genau die Zeichen enthalten, die in dem <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="thb.htm"><b>Zeichensatz</b></a> definiert sind, auf dem das Betriebssystem per Voreinstellung basiert. Unter MS Windows gibt es beispielsweise eine solche Schriftart namens &quot;System&quot;. Daneben gibt es auf modernen Rechnern definierte Schnittstellen f&uuml;r beliebige Schriftarten. Verbreitet ist z.B. die Adobe-Schnittstelle f&uuml;r Schriftarten (&quot;PostScript&quot;). Unter MS Windows kommt eine eigene Schnittstelle hinzu (&quot;TrueType&quot;).</p> 

<p>Solche Schriftarten k&ouml;nnen auf die zur Verf&uuml;gung stehenden Byte-Werte beliebige Darstellungsmuster legen. So gibt es auch Schriftarten wie <i>WingDings</i> oder <i>ZapfDingbats</i>, die fast nur Symbole und Icons enthalten. Wichtig sind jedoch vor allem auch Schriftarten, die zwar ansprechend aussehen, aber gleichzeitig einen bestimmten Zeichensatz unterst&uuml;tzen, d.h. alle Zeichen dieses Zeichensatzes darstellen, und zwar genau auf den Byte-Werten, die im Zeichensatz daf&uuml;r vorgesehen sind. Nur durch solche Schriftarten wird es m&ouml;glich, festgelegte Zeichens&auml;tze in eine grafisch darstellbare Form zu bringen. Die folgende Abbildung zeigt ein Beispiel f&uuml;r diesen Zusammenhang:</p>

<p><img src="xtcma2.gif" width=246 height=236 border=0 alt="Schriftarten"></p>

<p>Solche Schriftarten bleiben jedoch zeichensatzorientiert. Auf den Ansatz von <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="thc.htm"><b>Unicode</b></a> ist das Prinzip zeichensatzorientierter Schriftarten kaum &uuml;bertragbar. </p>

<p>F&uuml;r den Einsatz im WWW sind herk&ouml;mmliche Schriftarten wie Adobe- oder Truetype-Schriftarten nicht geeignet, da sie plattformspezifisch sind. Mittlerweile gibt es jedoch Ans&auml;tze zur L&ouml;sung dieses Problems. Es gibt plattformunabh&auml;ngige Schriftarten, die Sie mit Hilfe entsprechender Befehle auch direkt in HTML einbinden k&ouml;nnen. Auf diese Weise k&ouml;nnen Sie nicht nur eine Schriftart erzwingen in der Hoffnung, da&szlig; diese beim Anwender vorhanden ist, sondern Sie liefern die Schriftart mit Ihren HTML-Dateien gleich mit. Deshalb spricht man dabei auch von <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="thf.htm"><b>downloadbaren Schriftarten</b></a>.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a5">Schriftkulturen mit anderer Schreibrichtung</a></h2>

<p>Da die Computerindustrie historisch gesehen in den USA und Europa entstand, bauen die heutigen Hardware-Systeme und Betriebssysteme auf Prinzipien auf, die zun&auml;chst als selbstverst&auml;ndlich galten. Wenn Sie in einem Textverarbeitungsprogramm einen Text tippen, wandert der Cursor beim Schreiben von links nach rechts. Automatische Zeilenumbr&uuml;che erfolgen nach typischen Begrenzerzeichen westlicher Sprachen wie Leerzeichen oder Silbentrennstrich.</p> 

<p>Es gibt jedoch etliche Schriftkulturen, die eine andere Schreibrichtung als die unsrige haben. Dazu geh&ouml;ren etwa die arabische Schrift, die hebr&auml;ische Schrift oder die ferns&ouml;tlichen Schriftkulturen. Um solche Schriftkulturen auf Computern abzubilden, ist eine zus&auml;tzliche, systemnahe Software erforderlich. Denn es gilt nicht nur, die Schriftelemente abzubilden, sondern auch die Editierrichtung bei der Texteingabe und die Ausgaberichtung auf Medien wie Bildschirm oder Drucker an die Schreibrichtung der entsprechenden Schriftkultur anzupassen.</p>




<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tclb.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="thb.htm"><b>Zeichens&auml;tze (iso-8559-Familie und andere)</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tgcm.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tgcm.htm"><b>CGI-typische Anweisungen in Perl</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="th.htm"><b>Internationalisierung</b></a></nobr></p>

<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>