<html>
<head>
<title>SELFHTML: Internationalisierung / Zeichens&auml;tze (iso-8559-Familie und andere)</title>
<meta name="description" content="(SELFHTML 7.0) Zeichens&auml;tze nach der ISO-8559-Norm">
<meta name="keywords" content="SELFHTML, HTML, Internationalisierung, Zeichens&auml;tze">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="th.htm"><b>Internationalisierung</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Zeichens&auml;tze (iso-8559-Familie und andere)</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 border=0 vspace=6 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Die iso-8559-Zeichens&auml;tze</b></a> <br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Liste der iso-8559-Zeichens&auml;tze</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>Andere Zeichens&auml;tze</b></a>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="a1">Die iso-8559-Zeichens&auml;tze</a></h2>

<p>Die iso-8559-Familie wurde vom European Computer Manufacturer's Association (ECMA) entwickelt. Es handelt sich um ein Set von standardisierten Zeichens&auml;tzen f&uuml;r alphabetische Schriften. Dazu geh&ouml;ren die lateinischen Schriften, auf denen die meisten Sprachen Westeuropas und Amerikas beruhen, oder etwa die kyrillischen Schriften.</p>

<p>Alle Zeichens&auml;tze dieser Familie basieren auf der 1-Byte-Abbildung eines Zeichens. Das hei&szlig;t, alle Zeichens&auml;tze enthalten 256 m&ouml;gliche Zeichen. Bei allen Zeichens&auml;tzen sind die ersten 128 Zeichen, also die Zeichen mit den Werten 0 bis 127, identisch mit dem <b>ASCII-Zeichensatz</b>. Das hat den Vorteil, da&szlig; die &uuml;blichen lateinischen Gro&szlig;- und Kleinbuchstaben, die arabischen Ziffern und die &uuml;blichen Sonderzeichen wie Satzzeichen oder kaufm&auml;nnische Zeichen in all diesen Zeichens&auml;tzen immer zur Verf&uuml;gung stehen.</p> 

<p><img src="xascii.gif" width=289 height=302 border=0 alt="ASCII-Zeichensatz"></p>

<p>Oberhalb ist der ASCII-Zeichensatz abgebildet. Die darstellbaren Zeichen dieses Zeichensatzes haben die Werte zwischen 32 und 127. Wert 32 ist das Leerzeichen. Alle iso-8559-Zeichens&auml;tze enthalten diesen Zeichensatz.</p>

<p><b>Zur Lesart dieser und der folgenden Zeichensatz-Tabellen:</b><br>
Den Wert eines Zeichens ermitteln Sie, indem Sie die Werte aus Spalten- und Zeilen&uuml;berschrift des Zeichens addieren. Ein gro&szlig;es K hat in dieser Tabelle beispielsweise den Zeilenwert 70 und den Spaltenwert 5. Daraus ergibt sich der Wert 75 f&uuml;r dieses Zeichen. Zeichenwerte k&ouml;nnen bei der <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="thd.htm"><b>Verwendung von Zeichens&auml;tzen und Unicodes in HTML</b></a> eine Rolle spielen.</p>

<p>So wie im ASCII-Zeichensatz die ersten 32 Zeichen (Zeichenwerte 0 bis 31) f&uuml;r Steuerzeichen reserviert sind, sparen auch die erweiterten Zeichens&auml;tze der iso-Familie einen Bereich von Zeichen aus. Es handelt sich um die ersten 32 Zeichen oberhalb des ASCII-Bereichs, also um die Zeichenwerte 128 bis 159. Die Tabellen zu den einzelnen Zeichens&auml;tzen weiter unten bilden daher die verbleibenden Zweichenwerte 160 bis 255 ab. Das Zeichen mit dem Wert 160 ist in all diesen Zeichens&auml;tzen ein erzwungenes Leerzeichen.</p>

<p>Viele der Zeichens&auml;tze der iso-8559-Familie &uuml;berlappen sich. Das ist Absicht. Die Zeichens&auml;tze sind so optimiert, da&szlig; sich mit je einem Zeichensatz m&ouml;glichst viele Schriften m&ouml;glichst vollst&auml;ndig abdecken lassen. Zeichen, die in mehreren Zeichens&auml;tzen der iso-8559-Familie vorkommen, haben in der Regel immer den gleichen Wert, d.h. sie befinden sich in den unterschiedlichen Zeichens&auml;tzen an der gleichen Stelle.</p>

<p>Sechs der iso-8559-Zeichens&auml;tze beziehen sich auf Schriften, die im Kern auf der lateinischen Schrift basieren. Diese Zeichens&auml;tze haben daher noch die Beinamen <b>Latin-1 bis Latin-6</b>.</p>
<br clear=all>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2">Liste der iso-8559-Zeichens&auml;tze</a></h2>

<p>Die folgenden Tabellen zeigen die einzelnen Zeichens&auml;tze der iso-8559-Familie. Wie Sie diese Zeichens&auml;tze in HTML einsetzen k&ouml;nnen, wird im Abschnitt <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="thd.htm#a1"><b>Zeichensatzangabe als Meta-Angabe</b></a> beschrieben.</p>

<h3><a class="an" name="a201">iso-8559-1 (&quot;Latin-1&quot;)</a></h3>
<p>Dieser Zeichensatz enth&auml;lt die schriftspezifischen Zeichen f&uuml;r westeurop&auml;ische und amerikanische Sprachen. Der Zeichensatz deckt die Sprachen Albanisch, D&auml;nisch, Deutsch, Englisch, Fara&ouml;risch, Finnisch, Franz&ouml;sisch, Galizisch, Irisch, Isl&auml;ndisch, Italienisch, Katalanisch, Niederl&auml;ndisch, Norwegisch, Portugiesisch, Schwedisch und Spanisch ab. Lediglich einzelne Zeichen wie das niederl&auml;ndische &quot;ij&quot; oder die deutschen Anf&uuml;hrungszeichen unten fehlen.</p>

<p><img src="x8559_1.gif" width=289 height=302 border=0 alt="iso 8559-1"></p>


<h3><a class="an" name="a202">iso-8559-2 (&quot;Latin-2&quot;)</a></h3>
<p>Dieser Zeichensatz enth&auml;lt die schriftspezifischen Zeichen f&uuml;r die meisten mitteleurop&auml;ischen und slawischen Sprachen. Der Zeichensatz deckt die Sprachen Kroatisch, Polnisch, Rum&auml;nisch, Slowaisch, Slowenisch, Tschechisch und Ungarisch ab.</p>

<p><img src="x8559_2.gif" width=289 height=302 border=0 alt="iso 8559-2"></p>

<h3><a class="an" name="a203">iso-8559-3 (&quot;Latin-3&quot;)</a></h3>
<p>Dieser Zeichensatz deckt die Sprachen Esperanto, Galizisch, Maltesisch und T&uuml;rkisch ab.</p>

<p><img src="x8559_3.gif" width=289 height=302 border=0 alt="iso 8559-3"></p>


<h3><a class="an" name="a204">iso-8559-4 (&quot;Latin-4&quot;)</a></h3>
<p>Dieser Zeichensatz enth&auml;lt einige Zeichen der Sprachen Estonisch, L&auml;ttisch und Lithauisch. Vergleichen Sie diesen Zeichensatz auch mit iso 8559-10, der sehr &auml;hnlich ist.</p>

<p><img src="x8559_4.gif" width=289 height=302 border=0 alt="iso 8559-4"></p>

<h3><a class="an" name="a205">iso-8559-5</a></h3>
<p>Dieser Zeichensatz enth&auml;lt kyrillische Zeichen. Er deckt weitgehend die Sprachen Bulgarisch, Mazedonisch, Russisch, Serbisch und Ukrainisch ab.</p> 

<p><img src="x8559_5.gif" width=289 height=302 border=0 alt="iso 8559-5"></p>


<h3><a class="an" name="a206">iso-8559-6</a></h3>
<p>Dieser Zeichensatz enth&auml;lt Zeichen arabischer Schrift. Die Darstellung der Zeichen in der folgenden Tabelle ist jedoch &quot;abstrakt&quot;, da die Zeichen in der Schriftpraxis variieren, je nachdem, ob sie am Anfang, in der Mitte oder am Ende eines Wortes oder einzeln stehen. Arabisch ben&ouml;tigt spezielle Computer-Software zur Darstellung, da die Schriftrichtung (von rechts nach links) auf heutigen Rechnern normalerweise nicht abbildbar ist.</p>  

<p><img src="x8559_6.gif" width=289 height=302 border=0 alt="iso 8559-6"></p>



<h3><a class="an" name="a207">iso-8559-7</a></h3>
<p>Dieser Zeichensatz enth&auml;lt die Zeichen der neugriechischen Schrift.</p> 

<p><img src="x8559_7.gif" width=289 height=302 border=0 alt="iso 8559-7"></p>


<h3><a class="an" name="a208">iso-8559-8</a></h3>
<p>Dieser Zeichensatz enth&auml;lt die Zeichen der hebr&auml;ischen Schrift. Wie bei der arabischen Schrift ist zur Darstellung dieser Schrift zus&auml;tzliche Computer-Software erfoderlich, da die Schriftrichtung (von rechts nach links) auf heutigen Rechnern normalerweise nicht abbildbar ist.</p>  

<p><img src="x8559_8.gif" width=289 height=302 border=0 alt="iso 8559-8"></p>


<h3><a class="an" name="a209">iso-8559-9 (&quot;Latin-5&quot;)</a></h3>
<p>Dieser Zeichensatz ist speziell f&uuml;r T&uuml;rkisch gedacht. Er basiert auf iso 8559-1, enth&auml;lt jedoch anstelle der isl&auml;ndischen Sonderzeichen t&uuml;rkische Zeichen.</p>

<p><img src="x8559_9.gif" width=289 height=302 border=0 alt="iso 8559-9"></p>



<h3><a class="an" name="a210">iso-8559-10 (&quot;Latin-6&quot;)</a></h3>
<p>Dieser Zeichensatz enth&auml;lt speziell Zeichen f&uuml;r die Sprachen Gr&ouml;nl&auml;ndisch (Inuit) und L&auml;ppisch (Sami).</p>

<p><img src="x8559_10.gif" width=289 height=302 border=0 alt="iso 8559-10"></p>






<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a3">Andere Zeichens&auml;tze</a></h2>

<p>Es gibt etliche andere, zum Teil schon &auml;ltere Zeichens&auml;tze, die Konventionen f&uuml;r einzelne Schriften oder Schriftfamilien definieren, h&auml;ufig landesspezifisch. Einige davon benutzen auch 2 Byte breite, also numerische Zeichenwerte. Hier eine kleine Auswahl:</p>

<p><b>ISO-2022-JP</b> - Japanischer Zeichensatz<br>
<b>greek7-old</b> - altgriechischer Zeichensatz<br>
<b>DIN_66003</b> - deutscher Zeichensatz<br>
<b>DS_2089</b> - d&auml;nischer Zeichensatz<br>
<b>KOI8-R</b> - kyrillischer Zeichensatz (vor allem f&uuml;r Russisch)<br>
<b>GB2312</b> - chinesischer Zeichensatz
</p>

<p>Aus Sicht von HTML ist wichtig, welche Zeichens&auml;tze darin offiziell verwendet werden d&uuml;rfen. Ein Liste erlaubter Zeichensatzangaben finden Sie im Abschnitt <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="thd.htm#a1"><b>Zeichensatzangabe als Meta-Angabe</b></a>.</p>




<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="thc.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="thc.htm"><b>Das Unicode-System</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tha.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tha.htm"><b>Computer und geschriebene Sprache</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="th.htm"><b>Internationalisierung</b></a></nobr></p>

<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>