<html>
<head>
<title>SELFHTML: HTML / Internationalisierung / Downloadbare Schriftarten</title>
<meta name="description" content="(SELFHTML 7.0) Welche Lösungen es derzeit zu downloadbaren Schriften im WWW gibt, also zu der Möglichkeit, auf WWW-Seiten Schriftarten zu erzwingen und diese, wenn beim Anwender nicht vorhanden, dynamisch daownzuloaden und anzuzeigen.">
<meta name="keywords" content="SELFHTML, HTML, Internationalisierung, downloadbare Schriftarten">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="th.htm"><b>Internationalisierung</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Downloadbare Schriftarten</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 border=0 vspace=6 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Allgemeines zu downloadbaren Schriftarten</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Netscape und Bitstream/TrueDoc</b></a> <br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>Microsoft und das Web Embedding Fonts Tool WEFT</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a4"><b>Downloadbare Schriftarten in HTML einbinden</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a5"><b>Andere L&ouml;sungen und Schriftarten im WWW</b></a>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>



<h2 class="Sh2"> <a class="an" name="a1">Allgemeines zu downloadbaren Schriftarten</a></h2>

<p>Downloadbare Schriftarten werden nicht im Sinne des jeweiligen Betriebssystems beim Anwender installiert, sondern direkt in WWW-Seiten als Referenz auf eine Schriftartendatei mit eingebunden. Jede Browser-Software, die downloadbare Schriftarten interpretiert, erkennt solche Schriftarten und stellt sie am Anwenderbildschirm perfekt dar. Dazu wird die Schriftartendatei zusammen mit der HTML-Datei auf den Anwenderrechner &uuml;bertragen. Sie wird jedoch nach derzeitigem Stand nicht auf dem Anwenderrechner installiert, sondern bleibt nur f&uuml;r die Anzeige der betroffenen WWW-Seiten im Arbeitsspeicher des Anwenders. Der Browser kann die Schriftartendaten interpretieren und stellt Texte, die in HTML mit dieser Schriftart formatiert sind, entsprechend dar. Voraussetzung daf&uuml;r ist nat&uuml;rlich eine grafische Benutzeroberfl&auml;che.</p>

<p>Wie bei den meisten neueren Entwicklungen zum WWW-Publishing, so gibt es auch im Fall der downloadbaren Schriftarten zwei inkompatible L&ouml;sungen: die eine stammt von Netscape, die andere von Microsoft. F&uuml;r beide L&ouml;sungen gibt es je eine spezielle Software, die es HTML-Autoren erlaubt, Schriftarten in dem Dateiformat zu erstellen, die der jeweilige Browser unterst&uuml;tzt. Beide Programme erlauben es auch, vorhandene herk&ouml;mmliche Schriftarten wie TrueType- oder Adobe-Schriftarten in das neue Dateiformat zu konvertieren. Um f&uuml;r beide Browser zu schreiben, brauchen Sie beide Programme und m&uuml;ssen f&uuml;r eine gew&uuml;nschte Schriftart beide neuen Schritartendateien erzeugen. In HTML-Dateien k&ouml;nnen Sie dann beide Schriftarten einbinden.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><img src="xnetsi4.gif" width=30 height=30 alt="Netscape 4.0" border="0"> <a class="an" name="a2">Netscape und Bitstream/TrueDoc</a></h2>

<p><img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.bitstream.com/"><b>Bitstream</b></a> ist ein Schriftartenkonzept f&uuml;r plattform&uuml;bergreifendes elektronisches Publizieren und damit auch f&uuml;r den Einsatz im World Wide Web interessant. Bitstream hat zu diesem Zweck eine spezielle Technologie geschaffen: das <b>TrueDoc</b>-Modell. TrueDoc ist ein Entwicklerwerkzeug zum Erzeugen plattformunabh&auml;ngiger Schriftarten. Solche Schriftarten werden nicht im Sinne des jeweiligen Betriebssystems beim Anwender installiert, sondern direkt in elektronische Dokumente mit eingebunden. Jede Betrachter-Software, die TrueDoc interpretiert, erkennt solche Schriftarten und stellt sie am Anwenderbildschirm dar.</p>

<p>Im WWW sind zum Funktionieren dieser Technologie zwei Voraussetzungen erforderlich:</p>
<ol>
<li>Der WWW-Browser mu&szlig; die TrueDoc-Technologie beherrschen,</li>
<li>Die Schriftarten nach dem TrueDoc-Modell m&uuml;ssen nach einer bestimmten Konvention gemeinsam mit HTML-Dateien vom WWW-Server zum WWW-Browser des Anwenders gelangen.</li>
</ol>
<p>Netscape unterst&uuml;tzt ab der Version 4.01 seines Browsers die TrueDoc-Technologie.</p>
<p>
<p>Auf den WWW-Seiten von Bitstream finden Sie zu diesem Thema weitere Informationen:<br>
<img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.bitstream.com/world/index.htm"><b>Netscape und Bitstream TrueDoc</b></a><br>
<img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.bitstream.com/world/dynamic.htm"><b>Bitstream TrueDoc und HTML</b></a></p>

<p>Schriftartendateien dieser Art haben die Dateiendung <tt>.pfr</tt> (<i>&quot;Portable Font Resource&quot;</i>). Um solche Dateien zu erzeugen oder vorhandene Schriftartendateien in solche Schriftartendateien zu konvertieren, brauchen Sie ein entsprechendes Programm, beispielsweise das Programm <b>HexWeb Typograph</b>. Truetype- bzw. Postscriptschriften k&ouml;nnen Sie mit diesem Programm mit Hilfe eines &quot;Character Shape Recorders (CSR)&quot; in eine &quot;Portable Font Resource&quot; umwandeln.</p>

<p>Sie k&ouml;nnen das Programm <b>HexWeb Typograph</b> als Demo-Version auf den WWW-Seiten von <img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.hexmac.com/"><b>HexMac</b></a> downloaden. Das Programm ist f&uuml;r Macintosh und Windows 95 verf&uuml;gbar.</p>

<p>Das Erzeugen der downloadbaren Schriftart wird bei dieser Technologie als &quot;Brennen&quot; bezeichnet. Das Brennen ist n&auml;mlich nicht nur ein reiner Konvertiervorgang zwischen zwei Dateiformaten. Beim Brennen m&uuml;ssen Sie auch die URL-Adresse angeben, unter der Sie die Schriftartendatei zur Verf&uuml;gung stellen wollen. Die Schriftartendatei funktioniert dann nur auf der angegebenen URL-Adresse. Das Klauen von Schriftarten soll dadurch verhindert werden.</p>

<p>Bei Fragen zum Programm <b>HexWeb Typograph</b> wenden Sie sich bitte an den Hersteller, nicht an den Autor dieses Dokuments.</p>






<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><img src="xmsie4.gif" width=30 height=30 alt="MS IE 4.0" border="0"> <a class="an" name="a3">Microsoft und das Web Embedding Fonts Tool WEFT</a></h2>

<p>Als Technologie f&uuml;r downloadbare Schriftarten hat Microsoft das Programm <b>WEFT</b> (<i>Web Embedding Fonts Tool</i>) entwickelt. Der MS Internet Explorer unterst&uuml;tzt ab der Version 4.0 seines Browsers diese Technologie.</p>

<p>Sie k&ouml;nnen das Programm <b>WEFT</b> unterhalb der <img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.microsoft.com/typography/web/embedding/weft/default.htm"><b>Microsoft WEFT Homepage</b></a> downloaden. An der gleichen Stelle finden Sie auch eine Einf&uuml;hrung in die WEFT-Technologie und in die Bedienung des Programms.</p>

<p>WEFT setzt bereits vorhandene WWW-Projekte voraus. Um dieses Programm sinnvoll nutzen zu k&ouml;nnen, erstellen Sie also zuerst Ihr Projekt und verwenden innerhalb Ihrer HTML-Dateien mit den daf&uuml;r &uuml;blichen HTML- oder CSS-Befehlen gew&uuml;nschte Schriftartennamen. Dann k&ouml;nnen Sie den <b>WEFT Wizard</b> starten (Teil von WEFT). Mit diesem Software-Assistenten k&ouml;nnen Sie das Projekt analysieren lassen. Der WEFT Wizard ermittelt die verwendeten Schriftartennamen. Sie k&ouml;nnen ausw&auml;hlen, f&uuml;r welche der Schriftarten Sie ein &quot;Font Object&quot;, sprich eine Schriftartendatei, erstellen m&ouml;chten.</p>

<p>Schriftartendateien, die mit WEFT erzeugt werden, haben die Dateiendung <tt>.eot</tt>. Beim Erzeugen dieser Schriftarten gibt es diverse Optionen, etwa die, ob Sie f&uuml;r jede HTML-Datei eine eigene Schriftart oder eine gemeinsame Schriftart f&uuml;r alle HTML-Dateien w&uuml;nschen.</p>

<p>Beim Erzeugen der EOT-Dateien m&uuml;ssen Sie auch deren Ablageort angeben. Das kann f&uuml;r WWW-Projekte beispielsweise eine FTP-Adresse sein, auf der Sie Dateien ablegen k&ouml;nnen. Ferner geben Sie an, welche URL-Adressen diese Schriftartendateien benutzen d&uuml;rfen. Dies ist eine Ma&szlig;nahme, die verhindern soll, da&szlig; jeder, der will, Ihre Schriftartendateien per Referenz in seinen eigenen Projekten verwendet.</p>

<p>Bei Fragen zum Programm <b>WEFT</b> wenden Sie sich bitte an Microsoft, nicht an den Autor dieses Dokuments.</p>




<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a4">Downloadbare Schriftarten in HTML einbinden</a></h2>

<p>Um innerhalb einer HTML-Datei downloadbare Schriftarten zu verwenden, müssen Sie die Schriftarten mit einem dafür vorgesehenen Befehl referenzieren.</p>

<h3>Beispiel 1 - PFR-Dateien nach HTML-Syntax einbinden:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;head&gt;
&lt;link rel=fontdef src=&quot;http://www.meine.com/fonts/chianti.pfr&quot;&gt;
&lt;/head&gt;&lt;body&gt;
&lt;font face=&quot;Chianti&quot;&gt;Text in Beispielschriftart&lt;/font&gt;
&lt;/body&gt;&lt;/head&gt;&lt;/html&gt;
</pre></td></tr></table><p>

<h3>Beispiel 2 - PFR-Dateien nach CSS-Syntax einbinden:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;html&gt;&lt;head&gt;
&lt;style type=&quot;text/css&quot;&gt;
@font-face { font-family:Chianti XBd BT;
             src:url(http://www.meine.com/fonts/chianti.pfr); }
&lt;/style&gt;
&lt;/head&gt;&lt;body&gt;
&lt;p style=&quot;font-family:Chianti XBd BT&quot;&gt;Text in Beispielschriftart&lt;/p&gt;
&lt;/body&gt;&lt;/head&gt;&lt;/html&gt;
</pre></td></tr></table><p>

<h3>Beispiel 3 - EOT-Dateien nach CSS-Syntax einbinden:</h3>
<table width=100% cellpadding=10><tr><td class="xmpcode" bgcolor=#FFFFE0><pre>
&lt;head&gt;
&lt;style type=&quot;text/css&quot;&gt;
@font-face { font-family:Chianti XBd BT;  
             src:url(http://www.meine.com/fonts/chianti.eot); }
&lt;/style&gt;
&lt;/head&gt;&lt;body&gt;
&lt;p style=&quot;font-family:Chianti XBd BT&quot;&gt;Text in Beispielschriftart&lt;/p&gt;
&lt;/body&gt;&lt;/head&gt;&lt;/html&gt;
</pre></td></tr></table><p>

<h3>Erl&auml;uterung:</h3>

<p>Downloadbare Schriftarten werden im Kopf einer HTML-Datei eingebunden, die solche Schriftarten verwendet.</p>

<p>Eine downloadbare Schriftart nach Bitstream-Technologie (PFR-Datei) k&ouml;nnen Sie entweder mit einem HTML-Befehl (wie im Beispiel 1) oder mit einer CSS Style-Sheet-Angabe (wie im Beispiel 2) einbinden. Benutzen Sie den HTML-Befehl, wenn Sie die Schriftart mit dem <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcdk.htm#a4"><b>HTML-Befehl f&uuml;r Schriftarten</b></a> (<tt>&lt;font face=&gt;</tt>) arbeiten. Wenn Sie dagegen mit <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tdca.htm#a2"><b>Schriftarten in CSS Style-Sheets</b></a> arbeiten, benutzen Sie die Einbindung nach CSS-Syntax. Wenn Sie beide Formen benutzen, binden Sie die Schriftart nach beiden Mustern ein.</p>

<p>Die Style-Sheet-Syntax zum Einbinden von EOT-Dateien nach der Microsoft-Technologie brauchen Sie nicht selbst durchzuf&uuml;hren. Eintr&auml;ge von der Art, wie sie im obigen Beispiel 3 notiert sind, nimmt das Programm WEFT selbst&auml;ndig in den betroffenen Dateien vor. Es ist dann egal, ob Sie die Schriftart innerhalb der HTML-Datei als CSS Style-Sheet-Angabe oder traditionell mit <tt>&lt;font face=&gt;</tt> verwenden. Der MS Internet Explorer 4 erkennt in jedem Fall den Bezug und &uuml;bertr&auml;gt die erforderliche Schriftart mit auf den Rechner des Anwenders.</p>


<h3 class="inf">Beachten Sie:</h3>

<p>Allgemeine Beschreibungen zu den Befehle aus den obigen Beispielen finden Sie innerhalb dieser Dokumentation an folgenden Stellen:</p>

<p><img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tdcb.htm"><b>Schriftarten mit Schriftartendatei in CSS Style-Sheets</b></a> (CSS-Syntax zum Einbinden von Schriftartdateien)<br>
<img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcbd.htm"><b>Logische Beziehungen einer HTML-Datei</b></a> (HTML-Syntax f&uuml;r logische Verkn&uuml;pfung zu anderen Dateien)<br>



<p>Die Bitstream Truetype-Schriftarten werden von WWW-Servern nur dann korrekt an den aufrufenden Browser &uuml;bertragen, wenn in der Konfiguration des WWW-Servers ein entsprechender Mime-Type daf&uuml;r eingetragen ist. Bitten Sie Ihren Webmaster/Provider/Administrator gegebenenfalls, den Eintrag <tt>application/font-tdpfr</tt> f&uuml;r Dateien mit der Endung <tt>.pfr</tt> im WWW-Server vorzunehmen.</p>




<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a4">Andere L&ouml;sungen und Schriftarten im WWW</a></h2>


<p>Die folgenden Verweise f&uuml;hren zu Schriftartensammlungen im WWW und zu Projekten, die sich mit den Themen Internationalisierung und Schriftarten besch&auml;ftigen.</p>

<p><img src="xeng.gif" width=16 height=10 border=0><img src="xdeu.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.isoc.org:8080/"><b>Babel</b></a><br>
Mehrsprachiges Projekt zum Thema Internationalisierung</p>

<p><img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.iso.ch/"><b>ISO</b></a><br>
International Organization for Standardization</p>

<p><img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.unicode.org/"><b>Unicode</b></a><br>
Die Homepage des Unicode-Konsortiums</p>

<p><img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.isoc.org/guest/zakon/languages/"><b>Hobbes' Language World</b></a><br>
Verweisliste zum Thema Computer und menschliche Sprachen</p>

<p><img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.crpht.lu/~carrasco/winter/"><b>WInter's</b></a><br>
Verweisliste zum Thema Internationalisierung und Mehrsprachigkeit</p>

<p><img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.w3.org/Fonts/"><b>W3 Fonts</b></a><br>
Verweisliste zum Thema Schriftarten auf den Seiten des W3-Konsortiums</p>

<p><img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.bitstream.com/cyberbit.htm"><b>Cyberbit</b></a><br>
Cyberbit - Schriftensystem f&uuml;r Windows 95/NT, das etliche Zeichens&auml;tze und Unicodes abdeckt und dazu die Codepage-Funktionen von Windows nutzt. Isg. 5 Freeware-Download-Pakete (jedes ca. 7,5 MB, entpackt eine Truetype-Schriftart von mehr als 13 MB) zu bekannten Alphabetsprachen weltweit, vereinfachtem Chinesisch, traditionellem Chinesisch, Japanisch und Koreanisch. Eine Readme-Datei, die in jedem Paket enthalten ist, informiert &uuml;ber Installation und Verwendung. Versionen f&uuml;r andere Betriebssysteme sind in Vorbereitung.</p> 

<p><img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.microsoft.com/typography/"><b>Microsoft Typography</b></a><br>
Microsoft's Abteilung f&uuml;r alles rund um Schriftarten</p>

<p><img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://babel.uoregon.edu/FontLayout/FontMain.html"><b>Babel Fonts</b></a><br>
Gro&szlig;e Schriftartensammlung f&uuml;r Windows und Mac</p>

<p><img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.sil.org/computing/fonts/"><b>SIL Fonts</b></a><br>
Gro&szlig;e Schriftartensammlung f&uuml;r verschiedene Betriebssysteme</p>




<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tia.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tia.htm"><b>WWW-gerechte Grafiken</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="the.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="the.htm"><b>Benannte Zeichen in HTML</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="th.htm"><b>Internationalisierung</b></a></nobr></p>

<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>