<html>
<head>
<title>SELFHTML: Grafik / WWW-gerechte Grafiken</title>
<meta name="description" content="(SELFHTML 7.0) Welche Grafik-Dateiformate f&uuml;r Grafiken in HTML besonders geeignet sine.">
<meta name="keywords" content="SELFHTML, Grafik, www-gerechte Grafiken, JPEG, JPG, GIF, PNG">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="ti.htm"><b>Grafik</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>WWW-gerechte Grafiken</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Grafikformate im WWW</b></a> <br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Pixel und Vektoren</b></a>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="a1">Grafikformate im WWW</a></h2>

<p>Im WWW haben sich zwei Dateiformate f&uuml;r Grafiken durchgesetzt, die von allen modernen Browsern &quot;inline&quot;, also im eigenen Fenster angezeigt werden k&ouml;nnen: die Formate GIF und JPEG. Bei beiden Formaten handelt es sich um pixelorientierte Formate. Die St&auml;rken beider Formate liegen jedoch auf unterschiedlichen Gebieten. Dazu kommt ein neues, vielversprechendes Format, das noch in der Entwicklung ist, aber die Vorteile von GIF und JPEG in sich vereint: das PNG-Format.</p>

<h3><a class="an" name="a11">Das GIF-Format</a></h3>

<p>Das GIF-Format gilt als das &quot;Haus-&quot;Format von CompuServe und wurde speziell f&uuml;r den Online-Einsatz entwickelt. Es zeichnet sich durch eine hohe Komprimierungsdichte aus (zum Vergleich: Bitmap-Dateien im BMP-Format sind bei gleichem Inhalt durchschnittlich zehnmal bis drei&szlig;ig mal so umfangreich wie GIF-Dateien).</p>

<p>Der jetzt g&uuml;ltige Standard des GIF-Formats ist das sogenannte &quot;89er-Format&quot;. Dieses Format bietet drei M&ouml;glichkeiten an, die das GIF-Format f&uuml;r den Einsatz im WWW besonders interessant machen:</p>

<ul>
<li>Die M&ouml;glichkeit, eine Datei &quot;interlaced&quot; abzuspeichern. Eine Grafik, die so abgespeichert ist, wird beim Laden nicht zeilenweise eingelesen und aufgebaut, sondern schichtweise. Gerade bei der Online-&uuml;bertragung ist das sehr hilfreich. Denn so erscheint die Grundstruktur der Grafik sehr schnell am Bildschirm des Anwenders. Beim weiteren Einlesevorgang wird die Grafik dann immer deutlicher und feiner aufgel&ouml;st am Bildschirm angezeigt.</li>
<li>Die M&ouml;glichkeit, mehrere Grafiken in einer einzigen Grafikdatei zu speichern, verbunden mit Optionen zur Steuerung der Einzelgrafiken. Mit Hilfe dieses Features des GIF-Formats sind <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tid.htm"><b>animierte Grafiken</b></a> realisierbar.</li>
<li>Die M&ouml;glichkeit, eine Farbe, die in der Grafik vorkommt, als &quot;transparent&quot; zu definieren. Mit Hilfe dieses Features lassen sich <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tie.htm#a1"><b>transparente Hintergr&uuml;nde bei Grafiken definieren</b></a>, wodurch Sie auf WWW-Seiten sehr reizvolle Effekte erzielen k&ouml;nnen.</li>
</ul>

<p>Ein Nachteil des GIF-Formats ist, da&szlig; es maximal 256 Farben pro Datei speichern kann. Ein Pluspunkt ist dagegen, da&szlig; GIF-Grafiken verlustfrei komprimieren. Aufgrund seiner Charakteristik ist das GIF-Format f&uuml;r hochaufl&ouml;sende Grafiken wie Fotos oder fein strukturierte <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tic.htm#a4"><b>Wallpaper-Hintergr&uuml;nde</b></a> nicht so sehr geeignet. Ideal ist das GIF-Format f&uuml;r <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tic.htm#a1"><b>Buttons</b></a>, <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tic.htm#a2"><b>Dots</b></a>, <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tic.htm#a3"><b>Bars</b></a>, <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tic.htm#a5"><b>Symbole</b></a> und <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tic.htm#a6"><b>Cliparts</b></a>.</p>

<h3><a class="an" name="a12">Das JPEG-Format</a></h3>

<p>Bei JPEG, entwickelt von der <b>J</b>oint <b>P</b>hotographic <b>E</b>xpert <b>G</b>roup, handelt es sich um ein Grafikformat, das auf dem Komprimierungsalgorithmus DCT (Diskrete Cosinus Transformation) in Verbindung mit der Huffman-Kodierung basiert. Da dieses Verfahren zun&auml;chst nur f&uuml;r statische Grafiken von Bedeutung war, entstand das gleichnamige Dateiformat f&uuml;r Bilder. Mittlerweile wird der JPEG-Algorithmus auch auf Videos angewendet und hat das zukunftsweisende Video-Format MPEG hervorgebracht.</p>

<p>Das JPEG-Grafikformat komprimiert ebenfalls sehr gut und hat gegen&uuml;ber dem GIF-Format den Vorteil, da&szlig; es pro Bild bis zu 16,7 Millionen Farben speichern kann. Der Nachteil ist, da&szlig; JPEG mit Verlust komprimiert, d.h. je h&ouml;her der Komprimierfaktor, desto schlechter die Qualit&auml;t der Grafik. Aufgrund seiner Charakteristik eignet sich das JPEG-Format vor allem zum WWW-gerechten Abspeichern von eingescannten Fotos, aber auch f&uuml;r andere Grafiken, in denen sehr feine Farbverl&auml;ufe vorkommen.</p>

<p>Beim JPEG-Format k&ouml;nnen Sie bei besseren Grafikprogrammen zwei Parameter selbst bestimmen:</p>
<ul>
<li><b>Die DPI-Dichte:</b> Das ist die Punktdichte (dpi = dots per inch). Bei JPEG-Dateien, die Sie f&uuml;r die Anzeige in WWW-Seiten ben&ouml;tigen, reicht ein Wert zwischen 70 und 100 dpi.</li>
<li><b>Den Kompressionsfaktor:</b> Je h&ouml;her der Kompressionsfaktor, desto schlechter die Bildqualit&auml;t. Ein Komprimierungsfaktor von 5 bis 10 ist f&uuml;r eine gute Bildqualit&auml;t ein sinnvoller Wert.</li>
</ul>

<p>Es gibt eine Variante von JPEG-Grafiken, sogenannte &quot;progressive JPEG-Grafiken&quot;. Dabei wird, &auml;hnlich wie beim GIF-Format in der Variante &quot;interlaced&quot;, zuerst eine vollst&auml;ndige, aber noch undeutliche Fassung der Grafik am Bildschirm aufgebaut. Das erste, noch nicht ganz deutliche Bild kann bereits am Bildschirm angezeigt werden, nachdem etwa 15% der Grafikdatei an den aufrufenden WWW-Browser &uuml;bertragen wurden.<br>
Netscape kann in neueren Versionen progressive JPEG-Dateien korrekt anzeigen. Infos im WWW gibt es zum Beispiel unter <img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://webreference.com/jpeg/"><b>Progressive Jpeg</b></a>.</p>

<h3><a class="an" name="a13">Das PNG-Format</a></h3>

<p>PNG bedeutet <b>P</b>ortable <b>N</b>etwork <b>G</b>raphic (ausgesprochen: PING). Es handelt sich um ein Grafikformat, das eigens f&uuml;r den Einsatz im WWW konzipiert wurde. PNG soll alle Vorteile von GIF und JPEG in sich vereinen:</p>
<ul>
<li>PNG komprimiert verlustfrei wie das GIF-Format</li>
<li>PNG unterst&uuml;tzt 16,7 Mio. Farben wie das JPEG-Format</li>
<li>PNG ist wie GIF und JPEG plattformunabh&auml;ngig</li>
<li>PNG unterst&uuml;tzt transparente Hintergrundfarben wie das GIF-Format</li>
<li>PNG erlaubt das Abspeichern zus&auml;tzlicher Information in der Grafikdatei, z.B. Autor- und Copyrighthinweise</li>
</ul>

<p>Im WWW finden Sie die <img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.boutell.com/boutell/png/"><b>PNG Specification</b></a>.</p> 





<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2">Pixel und Vektoren</a></h2>


<p>Die beiden Standard-Formate f&uuml;r Grafiken im WWW, GIF und JPEG, sind beide pixelorientiert. Um ansprechende Grafiken zu erzeugen, ist es jedoch in vielen F&auml;llen besser oder sogar unerl&auml;&szlig;lich, ein vektororientiertes Grafikprogramm, z.B. Corel Draw, zu benutzen. Solche Programme haben den Vorteil, da&szlig; man damit grafische Objekte, z.B. Rechtecke, Kreise, Polygone oder  Schriftz&uuml;ge erstellen und objektorientiert manipulieren kann. Gute Vektorprogramme bieten eine F&uuml;lle von M&ouml;glichkeiten an, Grafikobjekte zu manipulieren, z.B. mit 3D-Effekten, Farbverl&auml;ufen oder &quot;wehenden Schatten&quot; zu versehen.</p> 

<p>Wenn Sie professionelle WWW-Grafiken selbst erstellen wollen, brauchen Sie unbedingt ein solches Vektorprogramm. In der Windows-Welt ist Corel Draw hierbei das f&uuml;hrende Produkt, unter Macintosh ist z.B. Adobe Illustrator eine gute Wahl. Solche Produkte sind in der Regel Profi-Ware und kosten mehrere hundert, manchmal auch weit &uuml;ber tausend Mark.</p>

<p>Um die Grafiken, die Sie mit einem solchen Programm erstellen, in eines der WWW-Formate GIF oder JPEG zu bekommen, k&ouml;nnen Sie den Weg der Konvertierung w&auml;hlen. Noch einfacher und effizienter aber ist es, ein Programm zu haben, mit dem man einzelne Bildschirmausschnitte anderer ge&ouml;ffneter Programme &quot;einfangen&quot; und abfotografieren kann, um sie dann in einem der beiden WWW-Formate abzuspeichern. Unter MS-Windows ist hierf&uuml;r beispielsweise Paintshop Pro, ein Shareware-Programm mit Profiqualit&auml;ten, ein ideales Werkzeug.</p>

<p>Viele Shareware-Programme und Demos f&uuml;r die Grafikerstellung und Grafikbearbeitung k&ouml;nnen Sie im WWW downloaden. N&auml;heres hierzu im Abschnitt <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tbce.htm"><b>Grafikprogramme</b></a>.</p>





<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tib.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF><img src="x3.gif" width=15 height=10 border=0> <a href="tib.htm"><b>Farbtiefen und Farbpaletten</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="thf.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="thf.htm"><b>Downloadbare Schriften</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="ti.htm"><b>Grafik</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>