<html>
<head>
<title>SELFHTML: Grafik / Farbtiefen und Farbpaletten</title>
<meta name="description" content="(SELFHTML 7.0) Grafiken f&uuml;r WWW-Seiten: die unterschiedlichen Farbtiefen bei GIF und JPEG und die Grafik-Paletten beim GIF-Format.">
<meta name="keywords" content="SELFHTML, Grafik, www-gerechte Grafiken, JPEG, JPG, GIF, Farbtiefe, Farbpalette, Palette">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="ti.htm"><b>Grafik</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Farbtiefen und Farbpaletten</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Farbtiefen</b></a> <br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Farbpaletten</b></a>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="a1">Farbtiefen</a></h2>


<p>Farbtiefe bedeutet, wie viele verschiedene Farbt&ouml;ne in einer Grafikdatei gespeichert werden. Bei Pixelformaten gibt es heute folgende typische Farbtiefen:</p>

<ul>
<li>2 Farben (schwarz/wei&szlig;)</li>
<li>16 Farben</li>
<li>256 Farben</li>
<li>16,7 Mio. Farben</li>
</ul>

<p>Das GIF-Format unterst&uuml;tzt 2, 16 und 256 Farben, das JPEG-Format 16,7 Mio. und 23,7 Mio. Farben. Da&szlig; in einer Datei so viele Farben gespeichert werden k&ouml;nnen, bedeutet aber noch lange nicht, da&szlig; Anwender tats&auml;chlich so viele Farben sehen. Denn wie viele Farben beim Anwender angezeigt werden k&ouml;nnen, h&auml;ngt von der eingesetzten Hardware (Grafikkarte, Bildschirm) ab. Nur die wenigsten Anwender verf&uuml;gen &uuml;ber Hardware, mit deren Hilfe volle 16,7 Mio. Farben angezeigt werden k&ouml;nnen. Viele Standard-PCs bieten bei arbeitsgerechter Bildschirmaufl&ouml;sung auch heute nicht mehr als 256 Farben an. Bei etwas besserer Ausstattung werden h&auml;ufig auch 16.000, 32.000 oder 64.000 Farben angezeigt, was f&uuml;r alle Computerbesitzer, die viele Grafiken betrachten (also auch f&uuml;r WWW-Surfer) unbedingt zu empfehlen ist.</p>

<h3><a class="an" name="a11">Farbmodelle</a></h3>

<p>Um Farbwerte in einer Grafikdatei zu speichern, m&uuml;ssen die Farben in einer computergerechten Form beschrieben werden, n&auml;mlich als Zahlen. Dabei gibt es verschiedene Modelle, mit Hilfe von Zahlen den Wert von Farben zu beschreiben. Die beiden bekanntesten Modelle sind:</p>

<ul>
<li><b>Das RGB-Modell:</b> Beim RGB-Modell wird eine Farbe durch ihre Anteile an den drei Grundfarben Rot, Gr&uuml;n und Blau definiert. Jede Farbe hat also einen Rotwert, einen Gr&uuml;nwert und einen Blauwert. Jeder der drei Werte wird durch Zahlen zwischen 0 und 255 definiert. Der Wert 0 bedeutet: keinen Anteil an der betreffenden Grundfarbe, der Wert 255 bedeutet: maximalen Anteil an der betreffenden Grundfarbe. Ein <font color=#000099><b>dunkles Blau</b></font> hat nach diesem Schema z.B. die Farbwerte 0,0,153. (0 rot, 0 gr&uuml;n, 153 blau). Mit diesem Schema k&ouml;nnen bis zu 16,7 Mio. unterschiedliche Farben definiert werden.</li>

<p><img src="xrgb.gif" width=400 height=200 border=0 alt="RGB-Modell"></p>

<li><b>Das HSB-Modell</b>: Auch bei diesem Modell gibt es drei definierende Zahlenwerte. <b>H</b> steht f&uuml;r <i>Hue</i> (<i>Farbton</i>), <b>S</b> f&uuml;r <i>Saturation</i> (<i>S&auml;ttigung</i>), und <b>B</b> f&uuml;r <i>Brightness</i> (<i>Helligkeit</i>). Farbt&ouml;ne k&ouml;nnen Werte zwischen 0 und 359 annehmen, S&auml;ttigung und Helligkeit Werte zwischen 0 und 255. Auf diese Weise lassen sich ca. 23,6 Mio. Farben definieren.</li>

<p><img src="xhsb.jpg" width=400 height=200 border=0 alt="HSB-Modell"></p>

</ul>

<p>F&uuml;r WWW-gerechte Grafiken ist das RGB-Modell ma&szlig;geblich. Wenn Sie zum Erstellen von WWW-Grafiken mit einem Grafikprogramm arbeiten, da&szlig; mehrere Farbmodelle kennt, halten Sie sich an das RGB-Modell.</p>

<p>In HTML werden die 256 m&ouml;glichen Werte f&uuml;r RGB-Werte in Hexadezimalform (0 bis FF) notiert. Mehr hierzu im Kapitel <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcae.htm#a2"><b>Hexadezimale Angabe von Farben</b></a>.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2">Farbpaletten</a></h2>


<p>Im GIF-Format k&ouml;nnen Sie pro GIF-Datei aus den 16,7 Mio. m&ouml;glichen Farben des RGB-Farbmodells maximal 256 Farben &quot;aussuchen&quot; und abspeichern. Bei einer solchen Farbauswahl spricht man von einer Farbpalette.</p>

<p>Theoretisch kann jede der 256 Farben beliebige RGB-Werte haben, d.h. es sind auch &quot;krumme&quot; Farbwerte wie 71,217,34 denkbar. F&uuml;r WWW-gerechte GIF-Grafiken sollten Sie sich jedoch an ein Standard-Schema halten, das auch von Netscape optimal interpretiert wird. Bei diesem Schema sind alle Farben erlaubt, deren RGB-Werte durch 51 dividierbar sind. R(ot), G(r&uuml;n) und B(lau) sollten danach also einen der Werte 0, 51, 102, 153, 204 oder 255 (hexadezimal: 00, 33, 66, 99, CC oder FF) haben. Ein erlaubter Wert ist danach z.B. <font color=#FF33CC><b>255,51,204 (hexadezimal: FF,33,CC)</b></font>. Auf diese Weise ergeben sich 6 x 6 x 6 m&ouml;gliche Farben, also 216. Die verbleibenden 40 Farben k&ouml;nnen Sie als &quot;eiserne Reserve&quot; betrachten. Wenn Sie f&uuml;r einzelne Grafiken bestimmte, fehlende Farbt&ouml;ne brauchen, k&ouml;nnen Sie  unbenutzte Farben der Palette mit der gew&uuml;nschten Farbe definieren.</p>

<p><a class="an" name="a21"><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel"></a><br>
<a href="tiba.htm"><b>Anzeigebeispiel: die 256 (216) Standardfarben</b></a></p>

<p>Wenn Sie Ihre Anspr&uuml;che an die Hardware des Endanwenders noch weiter zur&uuml;ckschrauben wollen, k&ouml;nnen Sie sich auch auf Grafiken beschr&auml;nken, die eine 16-Farbpalette enthalten. Auch dabei gilt: theoretisch kann jede der 16 Farben einer solchen Farbpalette beliebige Farbwerte haben. Es gibt jedoch 16 Farben, die von jedem VGA-kompatiblen Bildschirm angezeigt werden k&ouml;nnen. In MS Windows sind das deshalb auch die 16 Grundfarben. Bei einer Beschr&auml;nkung auf 16 Farben ist es daher sinnvoll, mit diesen 16 Grundfarben zu arbeiten.</p>

<p><a class="an" name="a22"><img src="xview.gif" width=30 height=20 border=0 alt="Beispiel"></a><br>
<a href="tibb.htm"><b>Anzeigebeispiel: die 16 Grundfarben</b></a></p>



<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tic.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF><img src="x3.gif" width=15 height=10 border=0> <a href="tic.htm"><b>Typische Grafiksorten f&uuml;r WWW-Seiten</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tia.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tia.htm"><b>WWW-gerechte Grafiken</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="ti.htm"><b>Grafik</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>