<html>
<head>
<title>SELFHTML: Projektverwaltung / WWW-Projekte bekannt machen</title>
<meta name="description" content="(SELFHTML 7.0) Welche M&ouml;glichkeiten Sie haben, Ihr WWW-Projekt bekannt zu machen.">
<meta name="keywords" content="SELFHTML, Projekte, publizieren">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tj.htm"><b>Projektverwaltung</b></a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>WWW-Projekte bekannt machen</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Allgemeines</b></a> <br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Projekte bei Suchdiensten anmelden</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>Sonstige Bekanntmachungsstrategien</b></a>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="a1">Allgemeines</a></h2>

<p>Nachdem Sie ein neues Projekt im WWW publiziert haben, wei&szlig; niemand au&szlig;er Ihnen und Personen, denen Sie die Adresse pers&ouml;nlich mitteilen, etwas von der Existenz des Projekts. Damit Ihr Projekt wirklich auffindbar, und besser noch, bekannt wird, m&uuml;ssen Sie es bekannt machen. Dazu gibt es verschiedene M&ouml;glichkeiten, die in diesem Abschnitt beschrieben werden.</p>

<p>Bitte beherzigen Sie folgende allgemeine Regeln:</p>
<ul>
<li>Seien Sie nicht marktschreierisch. Das mag niemand und erreicht eher das Gegenteil von dem, was Sie sich w&uuml;nschen.</li>
<br>&#160;
<li>Trachten Sie nicht so sehr danach, da&szlig; m&ouml;glichst viele Leute Ihre Seiten besuchen, sondern eher danach, da&szlig; die Besucher begeistert sind, sich freiwillig l&auml;ngere Zeit in Ihrem Projekt aufhalten und gerne wiederkommen. Bekanntheit und ein guter Name sind n&auml;mlich zweierlei, und es ist besser f&uuml;r das Internet, wenn es Ihnen vor allem auf den guten Namen ankommt.</li>
<br>&#160;
<li>Bleiben Sie auf dem Boden, wenn Ihr Projekt tats&auml;chlich bekannter wird. Das WWW ist nicht Hollywood. &Uuml;berheblichkeit und Star-Gehabe werden mit Nichtachtung und Abwendung gestraft.</li>
</ul>

<p>Eine sch&ouml;ne kleine Einf&uuml;hrung zum Thema stammt von Hendrik Scholz: <img src="xdeu.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.toppoint.de/~hscholz/bekannt/"><b>WWW-Seiten bekannt machen</b></a>.</p>




<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2">Projekte bei Suchdiensten anmelden</a></h2>

<p>Bei den folgenden internationalen Suchdiensten sollten Sie Ihr Projekt auf jeden Fall anmelden:</p>

<p><img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.altavista.digital.com/av/content/addurl.htm"><b>Altavista</b></a> (Eingabeformular)
<br>
<img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.lycos.com/addasite.html"><b>Lycos</b></a> (Eingabeformular)
<br>
<img src="xdeu.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.lycos.de/search/addasite.html"><b>Lycos</b></a> (Eingabeformular)
<br>
<img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.excite.com/Info/add_url.html"><b>Excite</b></a> (Eingabeformular)
<br>
<img src="xdeu.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.excite.de/info/add_url.html"><b>Excite</b></a> (Eingabeformular)
<br>
<img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.einet.net/cgi-bin/annotate?/galaxy"><b>Einet Galaxy</b></a> (Eingabeformular)
<br>
<img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.infoseek.com/AddUrl?pg=DCaddurl.html"><b>Infoseek</b></a> (Eingabeformular)
<br>
<img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://webcrawler.com/WebCrawler/SubmitURLS.html"><b>WebCrawler</b></a> (Eingabeformular)
<br>
<img src="xdeu.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.dino-online.de/anmeldung/anmeldung.html"><b>DINO</b></a> (Schrittweise Anleitung)
<br>
<img src="xdeu.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://vroom.web.de/web/html/new.html"><b>WEB.DE</b></a> (Schrittweise Anleitung)
</p>

<p>Es gibt ferner Dienste, bei denen Sie sich in etlichen Suchdiensten gleichzeitig eintragen k&ouml;nnen:</p>

<p>
<img src="xdeu.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.intercomme.de/index.html"><b>Alpha Search</b></a> (Verweis zum Anmelden folgen)
<br>
<img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.submit-it.com/"><b>Submit-it</b></a> (Formulare f&uuml;r viele Suchdienste)
<br>
<img src="xeng.gif" width=16 height=10 border=0>&nbsp;<a target="_top" href="http://www.the-vault.com/easy-submit/"><b>The Vault</b></a> (Formulare f&uuml;r viele Suchdienste)
</p>

<p>Das Eintragen bei allen hier angef&uuml;hrten Suchdiensten ist kostenlos. Beachten Sie aber, da&szlig; die angef&uuml;hrten Suchdienste ganz unterschiedliche Technologien verwenden. Bei einigen Suchdiensten k&ouml;nnen Sie zum Beispiel die gew&uuml;nschte Kurzbeschreibung f&uuml;r Ihr Projekt selbst angeben. Bei anderen Diensten k&ouml;nnen Sie nur die URL-Adresse Ihres Projekts angeben. Um bei solchen Diensten mit selbst formulierten Kurzbeschreibungen aufzutauchen und unter bestimmten Suchbegriffen bevorzugt auffindbar zu sein, sollten Sie die M&ouml;glichkeit nutzen, <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcbc.htm"><b>Meta-Angaben</b></a> f&uuml;r solche Suchdienste in Ihren HTML-Dateien zu notieren.</p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a3">Sonstige Bekanntmachungsstrategien</a></h2>


<p>Ein Eintrag in Suchdiensten bedeutet lediglich, da&szlig; Ihr Projekt auffindbar ist. Bekannt wird es dadurch noch lange nicht. Um wirklich bekannt zu werden im Internet, sollten Sie sich aktiv an der Kommunikation im Internet oder in Online-Diensten, zu denen Sie Zugang haben, beteiligen. Beteiligen Sie sich an Diskussionen in Newsgroups, in CompuServe- oder AOL-Foren usw. Richten Sie Ihren Newsreader oder Ihre Zugangssoftware so ein, da&szlig; am Ende jedes Diskussionsbeitrags die URL-Adresse Ihres Projekts steht. Notieren Sie dort aber bitte keine Romane. Die Adresse gen&uuml;gt. Das Interesse an der Adresse sollte aus Ihren Diskussionsbeitr&auml;gen erwachen. Suchen Sie sich Bereiche und Diskussionsthemen aus, bei denen Sie Feuer fangen, bei denen Sie Engagement entwickeln k&ouml;nnen, und in denen Sie kompetent sind. Weisen Sie in solchen Diskussionen aber nicht dauernd auf Ihre Homepage hin. Es gen&uuml;gt, die Adresse an jedem Nachrichtenende zu erw&auml;hnen.</p>

<p>Bei neuen, professionellen Projekten sind auch Pressemitteilungen angebracht. Wenn es sich um Computer-orientierte Projekte handelt, sind PC-Fachzeitschriften zum Beispiel eine gute Adresse. Wenn es sich um ein Hobby anderer Art handelt (Radfahren, Angeln, Tauchen, Reisen usw.), k&ouml;nnen Sie eine Pressemitteilung an entsprechende Fachmagazine verfassen. Bei elektronischen Magazinen k&ouml;nnen Mitteilungen an Life-Style-Magazine erfolgen. Die Pressemitteilung kann per Post, per Fax oder per E-Mail erfolgen. Adressen erfahren Sie aus dem Impressum des jeweiligen Publikationsorgans. Bitte schreiben Sie aber nicht gleich wegen Ihrer neuen Goldhamster-Homepage an die Frankfurter Allgemeine.</p>

<p>Wenn Sie als Unternehmen ohnehin Anzeigen in Zeitungen, Zeitschriften, Fachpublikationen oder audiovisuellen Massenmedien schalten, plazieren Sie dort auch die Homepage-Adresse. Oft gen&uuml;gt es, die URL-Adresse ohne jeden Kommentar an einer geeigneten Stelle zu plazieren. Wer wei&szlig;, was eine Internet-Adresse ist, wei&szlig; sofort, was gemeint ist, und den anderen k&ouml;nnen Sie es an der Stelle ohnehin nicht erkl&auml;ren.</p>

<p>Wenn Sie viel Kundenverkehr haben, legen Sie Handzettel mit einer Kurzvorstellung Ihrer Homepage aus. Achten Sie auch darauf, die Adresse auf Ihrer Visitenkarte, auf Ihren Briefb&ouml;gen, Ihren Faxvordrucken usw. mit abzudrucken. Vergessen Sie aber bei all diesen Aktivit&auml;ten nie, da&szlig; Ihr Projekt auch Erwartungen weckt, die es zumindest halten sollte, besser noch, weit &uuml;bertreffen sollte.</p>



<table cellpadding=4 cellspacing=1 width=100%>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr>
<tr><td bgcolor=#EEEEEE class="doc" align=right width=110>weiter:<a href="tje.htm"><img src="xgnext.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF><img src="x3.gif" width=15 height=10 border=0> <a href="tje.htm"><b>Zugriffe kontrollieren</b></a>
</td></tr>
<tr>
<td bgcolor=#EEEEEE class="doc" align=right width=110>zur&uuml;ck:<a href="tjc.htm"><img src="xgprev.gif" width=10 height=10 border=0 hspace=10></a></td>
<td bgcolor=#FFFFFF width=100%><img src="x3.gif" width=15 height=10 border=0> <a href="tjc.htm"><b>WWW-Projekte publizieren</b></a>
</td>
</tr>
<tr><td colspan=2 bgcolor=#EEEEEE class="doc">&#160;</td></tr>
</table>
<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a>&#160;
<img src="x2.gif" width=16 height=13 border=0> <a href="tj.htm"><b>Projektverwaltung</b></a></nobr></p>
<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>