<html>
<head>
<title>SELFHTML: Wie fange ich an?</title>
<meta name="description" content="(SELFHTML 7.0) Wie Sie diese Dokumentation als Anf&auml;nger benutzen k&ouml;nnen">
<meta name="keywords" content="SELFHTML, Anf&auml;nger">
<link rel=stylesheet type="text/css" href="wselfhtm.css"> 
</head>
<body bgcolor=#FFFFFF text=#000000 link=#AA5522 vlink=#772200 alink=#000000>

<p><nobr><a class="an" name="top"><img src="x2.gif" width=16 height=13 border=0></a> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a></nobr></p>
<hr noshade size=1>
<table cellpadding=4 cellspacing=1 width=100%>
<tr>
<td bgcolor=#EEEEEE class="doc" width=110><img src="xweb.gif" width=106 height=109></td>
<td bgcolor=#EEEEEE class="doc" valign=bottom width=100%><h2>Wie fange ich an?</h2></td>
</tr>
<tr>
<td bgcolor=#EEEEEE class="doc" valign=top align=center>
<img src="x5.gif" width=30 height=20 vspace=6 border=0 alt="Diese Seite ist ein Dokument mit Informationstext">
</td>
<td bgcolor=#FFFFFF valign=top nowrap>

<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Worum geht es hier eigentlich?</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Was mu&szlig; ich erst mal wissen?</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>In welcher Reihenfolge sollte ich lernen?</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a4"><b>Wie werde ich zum Profi?</b></a><br>
</p>

</td>
</tr><tr><td colspan=2 bgcolor=#EEEEEE class="doc"><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="a1">Worum geht es hier eigentlich?</a></h2>

<p>Was Sie gerade am Bildschirm haben, ist eine ziemlich umfangreiche Dokumentation, in der es darum geht, wie man Seiten f&uuml;r das Internet oder auch f&uuml;r ein firmeninternes Intranet erstellt. Solche Seiten zu erstellen ist keine Hexerei, die nur ein paar Computer-Freaks beherrschen. Wenn Sie etwas guten Willen und Lust mitbringen, k&ouml;nnen Sie das &quot;Handwerk&quot; durchaus erlernen. Dabei k&ouml;nnen Sie erst mal klein anfangen und ein wenig ausprobieren. Wenn Sie dann Gefallen an der Sache finden, k&ouml;nnen Sie nach und nach mehr dazulernen.</p>

<p>Von dieser Seite aus k&ouml;nnen Sie gef&uuml;hrte &quot;Touren&quot; durch die vorliegende Dokumentation unternehmen. Die Touren wollen Ihnen den Einstieg erleichtern. Bei allen Touren erscheint ein zweigeteiltes Anzeigefenster. Links k&ouml;nnen Sie Verweise ausw&auml;hlen, die zu der Tour geh&ouml;ren. Rechts werden dann Seiten angezeigt, die Sie durch Anklicken der Verweise im linken Fenster aufrufen. Es handelt sich um normale Seiten, die zu dieser Dokumentation geh&ouml;ren, und die Sie auch ganz normal &uuml;ber die Einstiegsseite von SELFHTML erreichen.</p>

<p><a name="tour1" class="an">Wenn</a> Sie SELFHTML noch nie vorher besucht oder benutzt haben, sollten Sie sich erst mal mit den &quot;Rahmenbedingungen&quot; dieser Dokumentation vertraut machen. Keine Angst, das sind nur zwei Seiten. Rufen Sie dazu die folgende Tour 1 auf:</p>

<p><a href="tpa.htm" target="_top"><img src="xtour1.jpg" width=120 height=30 alt="Tour 1" border="0"></a></p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a2">Was mu&szlig; ich erst mal wissen?</a></h2>

<p>SELFHTML ist keine Einf&uuml;hrung in die Bedienung Ihres Computers. Es wird auch kein Grundlagenwissen vermittelt. Sie sollten also beispielsweise wissen, was eine Datei und was ein Ordner/Verzeichnis ist, und da&szlig; es sehr unterschiedliche Arten von Dateien gibt. Sie sollten schon mal mit verschiedenen Programmen gearbeitet haben, eines oder mehrere davon etwas besser kennen und wissen, da&szlig; es unterschiedliche Programme f&uuml;r unterschiedliche Aufgaben gibt.</p>

<p>Ihr WWW-Browser, mit dem Sie das hier lesen, ist ebenfalls ein Programm auf Ihrem Rechner oder Ihrem lokalen Netzwerk. Daten, die im Anzeigefenster des Browsers angezeigt werden, sind Dateien, die irgendwo abgespeichert sind. Der Speicherort kann auf einem fernen Rechner im Internet liegen, im Intranet Ihrer Firma oder Organisation, auf einer gerade eingelegten CD-ROM oder auch auf der Festplatte Ihres Rechners.</p>

<p>Zum Verst&auml;ndnis von SELFHTML ist es von Vorteil, wenn Sie schon &ouml;fters im Internet &quot;gesurft&quot; sind. Der Vorteil ist, da&szlig; Sie dann schon diverse Internet-Seiten gesehen haben und mehr Vergleichsm&ouml;glichkeiten und Anregungen f&uuml;r eigene Ideen haben. SELFHTML richtet sich jedenfalls an Leute, die den Wunsch haben, selbst Seiten im Internet oder im Firmen-Intranet zu publizieren. &quot;Internet-Seiten&quot;, &quot;WWW-Seiten&quot;, &quot;Web-Seiten&quot; usw. sind &uuml;brigens verschiedene Ausdr&uuml;cke f&uuml;r die gleiche Sache - es handelt sich einfach um bestimmte Sorten von Dateien.</p>

<p><a name="tour2" class="an">Bevor</a> Sie so richtig zur Sache schreiten, sollten Sie sich ein wenig einstimmen. Will meinen, Sie sollten erst mal einen &Uuml;berblick &uuml;ber die Themen gewinnen, um die es hier geht. Um sich einen &Uuml;berblick &uuml;ber das Internet, das World Wide Web und den Weg zum Publizieren eigener Internet-Seiten zu verschaffen, rufen Sie die folgende Tour 2 auf:</p>

<p><a href="tpb.htm" target="_top"><img src="xtour2.jpg" width=120 height=30 alt="Tour 2" border="0"></a></p>


<p><a name="tour3" class="an">Als</a> n&auml;chstes m&uuml;ssen Sie wissen, welche Dateiformate und Sprachen es daf&uuml;r gibt und was die Besonderheiten der einzelnen Sprachen sind. Rufen Sie die folgende Tour 3 auf, um Sprachen und Dateitypen f&uuml;r Internet-Seiten kennenzulernen.</p>


<p><a href="tpc.htm" target="_top"><img src="xtour3.jpg" width=120 height=30 alt="Tour 3" border="0"></a></p>


<p><a name="tour4" class="an">Bevor</a> Sie loslegen mit dem Erstellen eigener Seiten, werden Sie noch ein paar Fragen zu erforderlicher Software, Arbeitsbedingungen usw. haben. Rufen Sie dazu die folgende Tour 4 auf.</p>


<p><a href="tpd.htm" target="_top"><img src="xtour4.jpg" width=120 height=30 alt="Tour 4" border="0"></a></p>


<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a3">In welcher Reihenfolge sollte ich lernen?</a></h2>

<p>Es gibt immer mehrere Wege, und vor allem ist Lernen h&auml;ufig etwas Individuelles. Hier wird Ihnen lediglich ein Weg vorgeschlagen, wie Sie Ihre ersten Schritte in HTML machen k&ouml;nnen. Dazu m&uuml;ssen Sie wissen, wie Sie auf Ihrem Computer zwischen mehreren ge&ouml;ffneten Anwendungen wechseln k&ouml;nnen. Denn Sie werden &ouml;fters zwischen Editor und zwei ge&ouml;ffneten Browser-Instanzen hin und herwechseln.</p>

<p>F&uuml;r Ihre ersten Schritte in HTML k&ouml;nnen Sie nun Ihren HTML-Editor aufrufen. Falls Sie noch keinen haben, k&ouml;nnen Sie auch einen Texteditor aufrufen, m&ouml;glichst aber keine Textverarbeitungsprogramme wie Word oder dergleichen. Windows-Anwender k&ouml;nnen zum Beispiel den Notepad-Editor aufrufen, der zu Windows geh&ouml;rt. Um effizienter arbeiten zu k&ouml;nnen, sollten Sie sich allerdings auf die Dauer einen richtigen HTML-Editor besorgen.</p>

<p>Lassen Sie den Browser mit diesem Dokument ge&ouml;ffnet. So haben Sie stets Hilfe parat.</p>

<p>Erzeugen Sie mit dem Editor eine neue, leere Datei und speichern Sie die Datei unter einem Dateinamen (<tt>*.htm</tt> oder <tt>*.html</tt>) ab, zum Beispiel <tt>erste.htm</tt>. Wechseln Sie danach wieder zur Anzeige dieses Dokuments.</p>

<p>&Ouml;ffnen Sie nun eine zweite Instanz Ihres WWW-Browsers (in der ersten Instanz wird ja dieses Dokument angezeigt, und das soll am Bildschirm bleiben). Den Men&uuml;befehl zum &Ouml;ffnen einer zweiten Browser-Instanz finden Sie normalerweise im File-Men&uuml;/Datei-Men&uuml; des Browsers.</p>

<p>Zweite Browser-Instanz erfolgreich ge&ouml;ffnet? Gut. Dann wechseln Sie zu der zweiten Browser-Instanz und &ouml;ffnen Sie damit lokal die zuvor erzeugte und abgespeicherte HTML-Datei. Der Befehl zum lokalen &Ouml;ffnen von Dateien befindet sich normalerweise ebenfalls im File-Men&uuml;/Datei-Men&uuml; des Browsers. Wenn die erzeugte HTML-Datei noch leer ist, zeigt der Browser beim &Ouml;ffnen dieser Datei ein leeres Anzeigefenster an.</p>

<p>Nun haben Sie Ihre Arbeitsumgebung: In dem ge&ouml;ffneten Editor k&ouml;nnen Sie Ihre erste HTML-Datei erstellen. Mit der Browser-Instanz, mit der Sie diese HTML-Datei ge&ouml;ffnet haben, k&ouml;nnen Sie jederzeit kontrollieren, was Sie im Editor &quot;verbrochen&quot; haben. Um Ihre Eingaben jeweils zu kontrollieren, w&auml;hlen Sie im Editor den Befehl zum Speichern der HTML-Datei. Dann wechseln Sie zu der Browser-Instanz, in der die HTML-Datei angezeigt wird. Zum Anzeigen der ge&auml;nderten HTML-Datei w&auml;hlen Sie im Browser den Reload-Befehl zum Aktualisieren des angezeigten Bildschirminhalts.</p>

<p><a name="tour5" class="an">Zwischendurch</a> sollten Sie dann auch mal zu dieser Browser-Instanz hier wechseln. Denn hier finden Sie die HTML-Befehle beschrieben, die Sie in den Editor eingeben k&ouml;nnen. Die folgende Tour 5 f&uuml;hrt Sie durch die wichtigsten Grundlagen von HTML. Kleiner Tip noch: selektieren Sie HTML-Quelltextbeispiele, die im Verlauf der Tour angezeigt werden, hier im Browser mit der Maus. Kopieren Sie den selektierten Text &uuml;ber die Zwischenablage Ihres Computers in Ihren (HTML)-Editor.</p>

<p><a href="tpe.htm" target="_top"><img src="xtour5.jpg" width=120 height=30 alt="Tour 5" border="0"></a></p>



<table bgcolor=#EEEEEE class="doc" width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a><a href="#bottom"><img src="xgdown.gif" width=14 height=10 border=0></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="a4">Wie werde ich zum Profi?</a></h2>

<p>Am meisten lernen Sie, wenn Sie sich ernsthaft ein Projekt &uuml;berlegen, das Sie realisieren wollen, und das Sie auch tats&auml;chlich im WWW publizieren wollen. Es kann eine pers&ouml;nliche oder kommerzielle Homepage sein, ein Fan-Projekt f&uuml;r irgendjemanden oder irgendetwas, ein Liebhaberprojekt wie das Pr&auml;sentieren einer Sammlung, das Vorstellen Ihrer Heimatgemeinde, Ihrer Schule, Ihres Vereins usw. &Uuml;berlegen Sie sich, welche Inhalte Sie bringen m&ouml;chten, wie Sie die Inhalte auf mehrere Seiten verteilen und wie Sie die Seiten verlinken, so da&szlig; der Anwender gut in dem Projekt navigieren kann.</p>

<p>Lernen Sie bei der Arbeit die &uuml;brigen Elemente von <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="tc.htm"><b>HTML</b></a> kennen. Folgen Sie ruhig auch einmal einem der zahlreichen Verweise innerhalb der HTML-Dokumentation, die zu der Dokumentation &uuml;ber <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="td.htm"><b>CSS Style-Sheets</b></a> f&uuml;hren.</p>

<p><a name="tour6" class="an">Die</a> letzte Tour 6 bringt Sie zu Seiten, die in fortgeschrittenes HTML und weiterf&uuml;hrende Themen einf&uuml;hren.</p>

<p><a href="tpf.htm" target="_top"><img src="xtour6.jpg" width=120 height=30 alt="Tour 6" border="0"></a></p>


<p>Die Seiten, die Sie im Verlauf der sechs Touren kennenlernen oder kennengelernt haben, sind nat&uuml;rlich nicht die einzigen innerhalb on SELFHTML. Aber da sind Sie sicher schon selbst hintergekommen. Nach den hier angebotenen Touren sind Sie hoffentlich in der Lage, selbst&auml;ndig Internet-Seiten zu erstellen und SELFHTML zu Rate zu ziehen, wenn Sie nach der L&ouml;sung f&uuml;r ein Problem suchen. Viel Erfolg!</p>


<br>&#160;
<table bgcolor=#EEEEEE width=100%><tr><td>
<a href="#top"><img src="xgoup.gif" width=14 height=10 border=0></a>
</td></tr></table>

<hr noshade size=1>
<p><nobr><img src="x2.gif" width=16 height=13 border=0> <a href="selfhtml.htm"><b>SELFHTML</b></a>/<a href="tq.htm" target="_parent">Quickbar</a></nobr></p>

<p><nobr><a class="an" name="bottom">&copy; 1998</A> <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></nobr></p>


</body>
</html>