@DATABASE opium.newmail.ru:666/16s.htm
@WORDWRAP

@NODE MAIN
@TITLE " Ave Satanas..."
 
   @{" " link "15s.guide/MAIN"}@{"../pau.gif" link "../pau.gif/MAIN"}
Назад    Черная Библия "Книга Люцифера
 (Воздух)"    @{" " link "17s.guide/MAIN"}@{"../pau0.gif" link "../pau0.gif/MAIN"}
Дальше 

Черная месса 

&nbsp;Ничто не ассоциируется с Сатанизмом сильнее, чем Черная Месса. Заявление о том, что самая богохульная из всех религиозных церемоний является ничем иным, как литературным вымыслом, требует, по крайней мере, объяснений, но ничего не может быть правдивее. 

&nbsp;Популярная концепция Черной Мессы такова: отлученный от церкви священник стоит пред алтарем, который являет собой обнаженная женщина с раздвинутыми ногами и выставленным напоказ влагалищем, в каждой из протянутых рук сжимающая по черной свече, приготовленной из жира некрещеных детей; на ее животе стоит чаша с мочой (или кровью) проститутки. Перевернутое распятие висит над алтарем, а треугольные гостии из зараженного спорыньей хлеба или покрытая черными пятнами репа благословляются священником и макаются во влагалище женщины-алтаря. Затем, рассказывают нам, призывы к Сатане и различным демонам уступают место набору молитв и псалмов, прочитанных задом наперед и пересыпанных непристойностями - все это исполняется в "защитной" пентаграмме, нарисованной на полу. Если появляется Дьявол, то он предстает в виде нетерпеливого мужчины с головой черного козла на плечах. После следуют такие действия, как самобичевание, сжигание молитвенников, куннилингус, феллацио и поцелуи в основном нижних конечностей тела - все под аккомпанемент сквернословных цитат из Библии и харканья на распятие! Если во время ритуала может быть убит ребенок - еще лучше; ведь всем известно, что это любимый вид спорта Сатанистов! 

&nbsp;Если все это вам кажется отталкивающим, то успех репортажей с черных месс, призванных поддержать преданность лону церкви, легко понятен. Ни один "порядочный" человек не мог не принять сторону инквизиции после рассказов о подобном богохульстве. Пропагандисты церкви хорошо исполняли свои обязанности, информируя публику о ереси и гнусностях, творимых язычниками, катарами, богомилами, тамплиерами и иже с ними; тех, кто из-за дуалистических философий и подчас Сатанинской логики подлежали уничтожению. 

&nbsp;Рассказы о похищаемых Сатанистами некрещеных детях для использования их в мессах были эффективны не только в пропагандистском плане, но были и источниками обогащения церкви (имеется в виду плата за крещение). Ни одна христианская мать не могла, услышав эти истории о дьявольском киднэппинге, отказаться от должного и немедленного крещения своего ребенка. 

&nbsp;Еще одна грань человеческой натуры проявлялась в том, что художник или писатель с похотливым воображением мог упражнять все свои самые непристойные фантазии в изображении деятельности еретиков. Цензор, в чьи обязанности входит ознакомление с порнографией для предупреждения других, является современным эквивалентом средневекового летописца непристойных деяний Сатанистов (и, конечно же, их современных журналистских двойников). Ходит слушок, что самая полная порнографическая библиотека в мире находится в Ватикане! Поцелуй зада Дьявола во время "традиционной" черной мессы легко узнаваем как предшественник современного термина, используемого для описания того, кто через обращение к эго другого человека хочет добиться от него материальных выгод, Так как все Сатанинские церемонии были направлены на очень материальные цели, oscularum infame (поцелуй позора) рассматривался как символический жест, имеющий целью добиться скорее плотского, нежели духовного успеха. 

&nbsp;Бытует мнение, что Сатанинская церемония или служба всегда называется Черной Мессой. Черная Месса НЕ является церемонией, практикуемой Сатанистами, Сатанист нашел бы ей только одно применение - в качестве психодрамы. Идя далее, следует отметить, что Черная Месса не обязательно подразумевает, что все ее участники - Сатанисты. По своей сути, Черная Месса - пародия на религиозную службу Римской Католической Церкви, но также может быть вольно переложена на сатиру в отношении любой другой религиозной церемонии. 

&nbsp;Для Сатаниста Черная Месса в своем богохульстве ортодоксальных ритуалов не является чересчур далеко зашедшей. Службы всех сложившихся религий сами есть пародии на старые ритуалы язычников, поклонявшихся земному и плотскому. В попытках десексуализировать и дегуманизировать языческие веры, люди духовной веры позднее выправили оригинальные значения ритуалов и превратили их во вкрадчивые эвфемизмы, называемые теперь "истинной мессой". Даже ЕСЛИ бы Сатанист проводил каждую ночь, исполняя Черную Мессу, он не смог бы разыграть большую комедию, чем аккуратный посетитель церкви, бездумно присутствующий на своей "Черной Мессе" -его личной мистификации искренних и эмоциональных ритуалов языческой древности. 

&nbsp;Любая церемония, считающаяся Черной Мессой, должна была эффективно шокировать и оскорблять чувства людей, поскольку именно эти качества определяли успех ее использования в угоду церкви. В средние века хула на церковь была шокирующей. Теперь же, церковь уже не предстает в грозном обличье времен инквизиции. Традиционная Черная Месса более не является вызывающим спектаклем для дилетантов, коим она уже была однажды. Если Сатанист желает создать ритуал, дабы надругаться над неким установлением с целью розыгрыша психодрамы, он тщательно выберет тот, который нынче не модно пародировать. Тем самым, он наступит на настоящую священную корову. 

&nbsp;Черная Месса сегодня могла бы состоять из издевательств над восточным мистицизмом, психиатрией, психодслическим движением, ультра-либерализмом и т.д, и т.п. Патриотизм нуждается в защите, наркотики и их гуру - в облитии грязью, бескультурные активисты - в обожествлении, а упадок экклезиастских теологий может получить Сатанинское ускорение. 

&nbsp;Маг-Сатанист всегда был катализатором реакции для сплавления популярных верований, и в этом случае, церемония в виде Черной Мессы может послужить далеко идущим магическим целям. 

&nbsp;В 1666 году весьма интересные события происходили во Франции в связи со смертью Франсуа Маневра, архитектора, использовавшего в своих творениях трапецию, чья геометрия стала прообразом домов с привидениями, и, по чьему проекту был построен Версаль. Слава последней из очаровательных священниц Сатаны, Жанны-Марии Буавье (мадам Гнием) постепенно затмевалась ее ярой противницей и бессердечной деловой женщиной Катрин Дешэ, известной еще как Ля Вуазэн, В прошлом эта особа была косметичкой, которая, погрязши в абортах и изготовлении самых действенных ядов для дам, желающих убрать неугодных мужей или любовников, нашла вошедшее в поговорку внезапное пристрастие в огненных обстоятельствах проведения "месс нуар"< 

&nbsp;Смело можно сказать, что 1666-ой год вошел в историю как год проведения первой "коммерческой" Черной Мессы! В районе к югу от Сен-Дени, который нынче называется Ля Гаренн, большой, обнесенный высокой стеной дом был куплен Ля Вуазэн и оснащен аптекой, камерами, лабораторией и,- часовней. Вскоре, не только для знати, но и для менее важных дилетантов стало de rigueur (De rigueur (фр.) - согласно этикету, обязательно для поддержания статуса, (прим. перев.)) присутствовать и принимать участие в проводимом там виде службы, упомянутом ранее в этой главе. Организованное там шарлатанство попало в историю под названием "настоящей Черной Мессы". 

&nbsp;Когда Ля Вуазэн была наконец арестована 13-го марта 1679 года (по странному совпадению, - в церкви Пресвятой Богоматери Благовещения), клеймо уже было выковано. Упадочная деятельность Ля Вуазэн отдалила торжество Сатанизма на многие годы. 

&nbsp;Сатанизм на потеху позднее появился в Англии. в середине XVIII века в виде Ордена Мэдменхэмских Францисканцев сэра Фрэнсиса Дэшвуда, в просторечии именуемого Клубом Адского Пламени. Отказавшись от кровопролития и свечей из детского жира предыдущих столетий, сэр Фрэнсис вершил ритуалы, переполненные хорошего грязного веселья и, без сомнения, придал яркую и безобидную форму психодраме для многих ведущих людей своего времени. Интересным ответвлением от линии сэра Фрэнсиса стал им же организованный Клуб Дилетантов, перенявший свою атмосферу у Клуба Адского Пламени. 

&nbsp;Реабилитацию Сатанизму принес XIX век ее слабыми попытками "белых" волшебников практиковать "черную" магию. Это был очень парадоксальный период для Сатанизма; такие писателя как Бодлер и Гюйсман, несмотря на одержимость злом казались довольно добрыми людьми. Для широкой публики Дьявол приобрел облик Люцифера и постепенно превратился в некоего джентльмена из гостиной. То была эра "экспертов" по черным искусствам, таких, как Элифас Ливай а также бесчисленных медиумов, которые своим подбором духов и демонов преуспели в затуманивании мозгов тех, кто сегодня называет себя парапсихологами! 

&nbsp;Из всего того, к чему Сатанизм имеет отношение, самыми близкими ему по духу являются нео-языческие ритуалы Герметического Ордена Золотого Рассвета и более поздних - Ордена Серебряной Звезды Элистера Краули (A.'.A.'. - Argentum Astrum) и Орденом Восточных Тамплиеров (О.Т.О.) (Ordo Templi Orientis - Краули подражал немецкой секте с этим названием, основанной и 1902 году и практиковавшей некоторые из принципов, изложенных далее в этой книге), параноидально отрицавшим всякую причастность к Сатанизму, несмотря на утвержденный самим Краули личный образ в качестве Зверя из книги Откровений. Кроме очаровательной поэзии, альпинизма и поверхностного знания некоторых магических безделушек, жизнь Краули явила собой пример позерства и попыток казаться хуже, чем он был на самом деле. Как и его современник, Преподобный (?) Монтегю Саммерс, Краули, без сомнения, провел свою жизнь с прижатым к щеке языком, но сегодняшние последователи Краули ухитряются прочесть эзотерический смысл в каждом его слове. 

&nbsp;С этими обществами постоянно конкурировали секс-клубы, использовавшие Сатанизм в качестве обоснования своей деятельности; это продолжается и по сей день, чему репортеры бульварных газет должны быть несказанно рады. 

&nbsp;Если создается впечатление, что Черная Месса есть изобретенное церковью шоу для развращенной и коммерческой реальности для заполнения прорех в средствах массовой информации, как, наконец, психодрама для дилетантов и иконокластов..._ ДЛЯ ЧЕГО же она нужна в истинной природе Сатанизма - и кто тогда практиковал настоящую Сатанинскую магию все эти годы, начиная с 1666-го? 

&nbsp;Ответ на этот вопрос кроется в другом вопросе. Практикует ли человек, считающий себя Сатанистом, Сатанизм В ЕГО ИСТИННОМ СМЫСЛЕ, или это точка зрения тех, кто придерживается других убеждений. Часто говорится и, почти всегда это верно, что все книги о Дьяволе написаны агентами Бога. Поэтому легко понять, какая особая порода дьяволопоклонников была выведена усилиями теологов. "Злой" персонаж прошлых лет вовсе не обязательно практиковал НАСТОЯЩИЙ Сатанизм. Также нельзя назвать его живым воплощением не имеющей границ гордыни или самовозвышения, что являлось в послеязыческом мире церковным определением зла. Вместо всего этого он является плодом позднейшей и более искусной пропаганды. 

&nbsp;Псевдо-сатанист всегда умудряется появляться на протяжении современной истории со своими Черными Мессами, различающимися по степени богохульства, но НАСТОЯЩЕГО Сатаниста не так легко узнать. 

&nbsp;Было бы чрезмерным упрощением сказать, что все мужчины и женщины, добившиеся успехов на этой земле, не зная того, практиковали Сатанизм: но жажда земного триумфа и вытекающей отсюда жаждой его реализации, без сомнения, являются основанием, по которому Св. Петр показал бы большим пальцем вниз. Если попытка богача попасть в рай представляется столь же трудной задачей, как для верблюда пройти через игольное ушко; если любовь к деньгам - корень всех зол, то мы можем предположить, что все самые могущественные люди на земле - самые что ни на есть Сатанисты. Это относится и к финансовым воротилам, промышленникам, и к папам римским, поэтам, диктаторам и всем разношерстным принимателям решений и полководцам мировой деятельности. 

&nbsp;Иногда, через "утечку информации" мы узнаем, что некий загадочный мужчина или загадочная женщина "любительствуют" в черных искусствах. Они, конечно же преподносятся как "таинственные" личности истории. Такие имена как Распутин, Захаров, Калиостро, Розенберг и им подобные - звенья, или ключи к, так сказать, истинному наследию Сатаны -, наследию, возвышающемуся над этническими, расовыми и экономическими различиями и временными идеологиями. Сатанисты всегда правили миром, и будут править всегда, как бы их не называли. Одно не подлежит сомнению: стандарты, философия и практические дела, изложенные на этих страницах, использовались самыми ясномыслящими и могущественными людьми на свете. В тайных мыслях каждого человека, мотивированных ясным и незамутненным разумом, обитает потенциал Сатаниста, и так было во все времена. Знак рогов явится теперь многим, а не лишь над избранным; и да выйдет вперед маг, дабы быть узнанным. 
 ---

 ---

 ---

 ---

 ---

@endnode
