@DATABASE opium.newmail.ru:666/6s.htm
@WORDWRAP

@NODE MAIN
@TITLE " Ave Satanas..."
 
   @{" " link "5s.guide/MAIN"}@{"../pau.gif" link "../pau.gif/MAIN"}
Назад    Черная Библия "Книга Люцифера
 (Воздух)"    @{" " link "7s.guide/MAIN"}@{"../pau0.gif" link "../pau0.gif/MAIN"}
Дальше 

Бог, которому ты поклоняешься, может быть тобой. 

&nbsp;Все религии духовного характера придуманы человеком. Ничем иным, как своим плотским мозгом, он сотворил целую систему богов. У человека есть эго, его скрытое "я" и, лишь потому, что не в силах смириться с ним, он вынужден обособлять его вне себя в некоем великом спиритуальном создании, именуемым "Богом". 

&nbsp;Богу дозволено делать то, что запрещено человеку, как, например, - убивать людей, творить чудеса ради удовлетворения своих собственных потребностей, управлять целым миром, не неся за это никакой видимой ответственности и т.д. и т.п. Если человеку нужен такой Бог и он признает его, значит, он поклоняется творению рук человеческих. То есть, ОН ПОКЛОНЯЕТСЯ ЧЕЛОВЕКУ. СОЗДАВШЕМУ БОГА. Не является ли более осмысленным поклонение тому Богу, которого он сам создал в соответствии с собственными эмоциональными потребностями - тому, кто наилучшим образом представляет его целиком и полностью плотское существо, имеющее навязчивую идею первым делом изобрести себе Бога? 

&nbsp;Если человек настаивает на обособлении своей скрытой сущности в виде "Бога", тогда зачем бояться своего истинного "я"; боясь "Бога" - зачем обращаться к самому себе, обращаясь к "Богу" - зачем обособляться от "Бога" ДЛЯ ТОГО, ЧТОБЫ ОТПРАВЛЯТЬ РИТУАЛЫ И РЕЛИГИОЗНЫЕ ЦЕРЕМОНИИ В СВОЕ ИМЯ? 

&nbsp;Человек нуждается в ритуале и догме, но ничто не указывает на то, что обособленный Бог необходим, дабы исполнять ритуалы и церемонии в честь Бога! Не может ли статься так, что, сокращая расстояние между собой и своим "Богом", человек видит выползающего на свет демона гордыни - само олицетворение Люцифера? Он более не может рассматривать себя в двух частях - плотской и духовной, а видит, как они сливаются в одно целое, и, затем,- к своему великому ужасу, что эти две части есть плотские - И БЫЛИ ТАКОВЫМИ ВСЕГДА! Затем, он либо начинает ненавидеть себя до самой своей смерти - день за днем, или отрицает кто он есть на самом деле. 

&nbsp;Возненавидев себя, человек выискивает все новые и все более сложные духовные пути "просвещения" в надежде, что сможет вновь разделить себя в поисках более сильных и более удаленных "богов", могущих покарать его бедную страдальческую сущность. Если же он принимает себя, но осознает, что ритуал и церемония есть очень важные способы, которые изобретенные человеком религии используют для поддержания веры во лжи, то ему становится ясно, что ТА ЖЕ ФОРМА РИТУАЛА поддержит его веру в правде - примитивное великолепие, придающее сознанию собственной царственной сущности дополнительный смысл. 

&nbsp;Когда религиозная вера во лжи убывает, это означает, что человек стал ближе к себе и дальше от "Бога", ближе к "Дьяволу". Если это то, что представляет собой Дьявол, и человек проживает свою жизнь в храме Дьявола и сухожилия Сатаны двигают его плотью, тогда он либо сбегает от кудахтанья и придирок праведников, либо гордо встает в тайных местах и манипулирует одержимыми недомыслием массами через свою Сатанинскую силу в ожидании того дня, когда он выйдет из тени, провозглашая: "Я - САТАНИСТ! ПРЕКЛОНИТЕСЬ ЖЕ, ИБО Я ЕСТЬ ВЫСОЧАЙШЕЕ ВОПЛОЩЕНИЕ ЧЕЛОВЕЧЕСКОЙ ЖИЗНИ!"< @{"bp.gif" link "bp.gif/MAIN"}
 ---

 ---

 ---

 ---

 ---

@endnode
