<HTML>
<HEAD>
<TITLE>AHG - Astra&amp;Hotbird.Guide</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" BACKGROUND="../BACK/Sat4.JPG">
<BR>
<CENTER><TABLE BORDER="0" ALIGN="center" WIDTH="95%">
<TR>
<TD>
<HR SIZE="2" ALIGN="CENTER">
<P ALIGN="center"><FONT SIZE="+2" COLOR="Blue"><B><A NAME="Vorwort">Vorwort</A></B></FONT><FONT COLOR="Blue"><B>
</B></FONT></P>
<P>Astra&amp;Hotbird.Guide ist haupts&#228;chlich als Transponderbelegungsliste f&#252;r die beidenSatellitensysteme ASTRA 1 und EUTELSAT Hot Bird gedacht, die f&#252;r denDirektempfang im deutschsprachigen Raum am wichtigsten sind. Die Endung Guide im Titel dieses Dokuments stammt noch aus der Zeit als Astra&amp;Hotbird.Guide ausschliesslich im  Hypertext-Verfahren AmigaGuide erstellt wurde.Als Alternative zum AmigaGuide-Dokument habe ich ab dieser Ausgabe das Ganze auch in einerHTML-Version erstellt. Geplant ist Astra&amp;Hotbird.Guide zu aktuallisieren sobald die Anzahl der eingetretenenVer&#228;nderungen das Erscheinen einer neuen Ausgabe rechtfertigt.<BR>

Ber&#252;cksichtigt sind dabei alle
H&#246;rfunk- und Fernsehprogramme die zum Erstellungsdatum, &#252;ber die genannten Satellitensysteme aufSendung waren oder von denen mit ziemlicher Sicherheit feststand das diese bald auf Sendung gehenw&#252;rden.
Astra&amp;Hotbird.Guide hatte ich zun&#228;chst f&#252;r meinen eigenen Gebrauch geschrieben, weil mir die allgemein &#252;blichen Satellitenbelegungstabellen zu ungenau oder aber zu un&#252;bersichtlich waren.Erg&#228;nzend hierzu habe ich noch eine allgemeine Einf&#252;hrung &#252;ber den Satellitenempfang und einigeerg&#228;nzende Grafiken eingef&#252;gt. <BR>

Sollten Sie Fehler finden oder Ihnen irgendetwas unklar erscheinen, wenden siesich bitte an den <A HREF="#Autor">Autor</A>.</P>
<HR>
<P ALIGN="center"><FONT SIZE="+2" COLOR="Blue"><A NAME="Aktuell">Aktualit&#228;t</A></FONT>
</P>
<UL>
<LI><FONT COLOR="Purple">Analoge Programme und ADR-Programme</FONT>
<FONT COLOR="Green"></FONT></LI>
</UL>
<P>F&#252;r alle aufgef&#252;hrten analogen H&#246;rfunk- und Fernsehprogramme, sowie die digitalenADR-Radioprogramme basiert Astra&amp;Hotbird.Guide auf eigenen Beobachtungen und ist damit am Tagder Fertigstellung der jeweiligen Ausgabe auf den neuesten Stand.<BR>
</P>
<UL>
<LI><FONT COLOR="Purple">Digitale Fernsehprogramme</FONT>
</LI>
</UL>
<P>F&#252;r die digitalen Fernsehprogramme die in der DVB-Norm MPEG 2 ausgestrahlt werden, kannich mangels eigenen Digital-Receivers, Sie nur eingeschr&#228;nkt mit aktuellen Daten versorgen. Die Daten der digitalen Fernsehprogramm sind den offiziellen Frequenzlisten von Astra und Eutelsat entnommen. In einzelnen F&#228;llen lagen auch Angaben der Programmveranstalter vor.</P>
<P><B>Das Datum an dem die jeweilige Version fertiggestellt wurde befindet sich immer auf der ersten Seite vonAstra&amp;Hotbird.Guide.</B>
</P>
<P>
<HR>
</P>
<P ALIGN="center"><FONT SIZE="+2" COLOR="Blue"><A NAME="Autor">Autor</A></FONT>
</P>
<P><IMG BORDER="2" SRC="../BILDER/HFL.JPG" ALT="Hartmut" ALIGN="LEFT">Astra&amp;Hotbird.Guide habe ich mit der gr&#246;sstm&#246;glichen Sorgfalt erstellt und auch auf seineFunktion hin getestet. Nat&#252;rlich k&#246;nnen trotz aller M&#252;he Fehler bei einem Dokument dieserGr&#246;ssenordnung letztlich nicht g&#228;nzlich ausgeschlossen werden. Sollten Sie also Fehler in diesemGuide finden wenden Sie sich an den Autor mit einer m&#246;glichst genauen Beschreibung des
aufgetretenen Fehlers. Dies gilt f&#252;r Fehler aller Art, also sowohl f&#252;r funktionelle - als auch
f&#252;r inhaltliche Fehler.
Fehlermeldungen, Anregungen und W&#252;nsche richten Sie bitte schriftlich an:
</P>
<P ALIGN="center">Hartmut Lasch<A HREF="/BILDER/HFL.JPG"></A><BR>

Auweg 3<BR>

D-97654 Bastheim<BR>

Bundesrepublik Deutschland
</P>
<P>Sollten Sie Fragen haben, auf die Sie eine Antwort erwarten, so legen Sie bitte ausreichendR&#252;ckporto bei. Dies sind innerhalb Deutschlands 1,10 DM in Briefmarken. Sollten Sie aus demAusland schreiben legen Sie bitte einen Internationalen Antwortschein (IRC) bei. <BR>
<BR>
<BR>
</P>
<HR>
<P ALIGN="center"><FONT SIZE="+2" COLOR="Blue"><A NAME="Recht">Rechtliches</A></FONT><FONT COLOR="Blue"><A NAME="Recht"></A></FONT>
</P>
<UL>
<LI><FONT COLOR="Maroon">Status</FONT>
</LI>
</UL>
<BLOCKQUOTE>
<P>   Astra&amp;Hotbird.Guide ist FREEWARE<BR>

   Das heisst ich erwarte keine Gegenleistungen in irgendeiner Form.
</P>
</BLOCKQUOTE>
<UL>
<LI><FONT COLOR="Maroon">Urheberrecht</FONT>
</LI>
</UL>
<BLOCKQUOTE>
<P>Alle Rechte f&#252;r Astra&amp;Hotbird.Guide bleiben bei seinem <A HREF="#Autor">Autor.</A><BR>

Dies bedeutet: Astra&amp;Hotbird.Guide darf nicht ohne die ausdr&#252;ckliche
schriftliche Zustimmung des Autors ver&#228;ndert werden.
Die &#220;bersetzung in andere Sprachen ist gestattet.
Einige Namen, die in diesem Guide benutzt werden, sind Warenzeichen oder
eingetragene Warenzeichen. Die Nennung dieser Namen bedeutet nicht, da&#223; sie
frei benutzt werden d&#252;rfen.<BR>

Auf folgende Rechte wird besonders hingewiesen:<BR>

   Viewtek &copy; 1992-1994 Thomas Krehbiel, All Rights Reserved
<BR>

AmigaGuide und Amiga sind eingetragene Warenzeichen von Amiga International<BR>

   ASTRA ist eingetragenes Warenzeichen der Societe Europeenne des Satellites
<BR>

Hot Bird ist eingetragenes Warenzeichen von EUTELSAT<BR>

Die Rechte f&#252;r die Grafiken bzw. Bilder die in Astra&amp;Hotbird.Guide verwendet werden liegen, wenn
nicht anders angegeben, bei den Satellitenbetreibern SES und EUTELSAT welche in Deutschland durchdie Firmen ASTRA-Marketing GmbH in Eschborn und pr bonn, repr&#228;sentiert werden und freundlicherweisedie Nutzung ihres Bildmaterials in Astra&amp;Hotbird.Guide gestattet haben.
</P>
</BLOCKQUOTE>
<UL>
<LI><FONT COLOR="Maroon">Verteilung</FONT>
</LI>
</UL>
<BLOCKQUOTE>
<P>Astra&amp;Hotbird.Guide darf frei verteilt werden, solange folgende Bedingungenerf&#252;llt werden:<BR>

Jede Weitergabe mu&#223; das komplette Verzeichnis Astra&amp;Hotbird.Guide umfassen.
Astra&amp;Hotbird.Guide darf frei weitergegeben werden &#252;ber InterNet, Mailboxen,Software-Bibliotheken wie die von Aminet und Fred Fish, sowie &#252;ber alle
anderen allgemein zug&#228;nglichen elektronischen Verbreitungswege.Der kommerzielle Vertrieb von Astra&amp;Hotbird.Guide wird hiermit ausdr&#252;cklichuntersagt!
Die Verteilung auf den CD-ROM Serien wie Aminet, Meating Pearls und Fred Fish
wird hiermit ausdr&#252;cklich erlaubt.
</P>
</BLOCKQUOTE>
<UL>
<LI><FONT COLOR="Maroon">Gew&#228;hrleistungsausschluss</FONT>
</LI>
</UL>
<BLOCKQUOTE>
<P>Der Autor &#252;bernimmt keine Verantwortung f&#252;r Sch&#228;den, die durch Benutzung vonAstra&amp;Hotbird.Guide auftreten. Insbesondere f&#252;r besch&#228;digteSatellitenempfangsanlagen wird keine Gew&#228;hrleistung &#252;bernommen.
</P>
</BLOCKQUOTE>
<P>
<HR>
</P>
<P ALIGN="center"><FONT SIZE="+2" COLOR="Blue"><A NAME="Danke">Danke</A></FONT><FONT COLOR="Blue"><A NAME="Danke"></A></FONT>
</P>
<P>Folgenden Personen und Firmen m&#246;chte ich besonders danken:<FONT SIZE="-1"></FONT>
</P>
<UL>
<LI>Mein besonderer Dank gilt meinem Freund Manfred Tiede f&#252;r seinegraphischen Arbeiten, seine Ratschl&#228;ge und seine wertvolle moralische Unterst&#252;tzung.
</LI>
</UL>
<UL>
<LI>Herrn Thomas Krehbiel dessen Anzeigeprogramm Viewtek vonder AmigaGuide-Version von Astra&amp;Hotbird.Guide zum Anzeigen von Bildern verwendet wird.<BR>
Viewtek &copy; 1992-1994 Thomas Krehbiel, All Rights Reserved

</LI>
</UL>
<UL>
<LI>Jean-Michel Forgeas f&#252;r den Amiga-Texteditor AZ
</LI>
</UL>
<UL>
<LI>Der deutschen EUTELSAT Agentur und der Agentur  pr bonn f&#252;r ihrInformationsmaterial und die freundlicherweise erteilte Genehmigung zurNutzung des zur Verf&#252;gung gestellten Bildmaterials.
</LI>
</UL>
<UL>
<LI>Der ASTRA-Marketing GmbH in Eschborn f&#252;r ihr Informationsmaterial und
die freundlicherweise erteilte Genehmigung zur Nutzung des zur Verf&#252;gunggestellten Bildmaterials.
</LI>
</UL>
<P>
<HR>
</P>
</TD>
</TR>
</TABLE></CENTER>
</BODY>
</HTML>