<HTML>
<HEAD>
<TITLE>AHG - Astra Digital Radio</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" BACKGROUND="../BACK/ADR.jpg">
<BR>
<CENTER><TABLE BORDER="0" ALIGN="center" WIDTH="95%">
<TR>
<TD>
<HR>
<P ALIGN="center"><FONT SIZE="5" COLOR="Blue" FACE="Times New Roman">Astra Digital Radio</FONT>
</P>
<P><FONT FACE="Times New Roman" SIZE="3">H&#228;ufig wissen die Besitzer einer Satellitenempfangsanlage nicht, das es auchviele Radiostationen gibt die ihre Sendungen &#252;ber Satellit ausstrahlen. Dabeisind die Radioprogramme welche &#252;ber Satellit ausgestrahlt werden weitaus mehr als nur eine billige Zugabe zu den Fernsehprogrammen. Seit dem Sp&#228;tsommer
1995 gibt es neben der bereits bew&#228;hrten analogen Spielart des Satellitenradiosauch ein digitales Verfahren auf dem Markt, das Astra Digital Radio (ADR).
</FONT><BR>
<FONT FACE="Times New Roman" SIZE="3">
Bei ADR werden die Daten der digitalisiertenen Radioprogramme nach
MPEG1-Layer2 (Musicam) reduziert. Diese Datenreduktion geschieht, grob gesagtdurch das Weglassen von T&#246;nen die ohnehin nicht zu h&#246;ren sind, da sie von
lauteren Kl&#228;ngen &#252;berdeckt werden. Durch diese Datenreduzierung ist es jetztm&#246;glich ein Stereoradioprogramm auf einem herk&#246;mmlichen Mono-Tonuntertr&#228;gerunterzubringen, wodurch weit mehr Radioprogramme als bisher ausgestrahltwerden k&#246;nnen. Uns, den H&#246;rern bietet ADR dar&#252;berhinaus einen ausgezeichnetenKlang, der sich durchaus mit dem einer Compact Disc messen kann. Allenfallssensibele Ohren sind in der Lage das Fehlen der oben erw&#228;hnten Kl&#228;nge zubemerken. Neben den Radioprogrammen k&#246;nnen &#252;ber ADR, zus&#228;tzlich nochBegleitinformationen mit ausgestrahlt werden wie Namen von Musiktiteln,Interpreten, RDS-Daten und &#228;hnlichem. Statt der Radioprogramme sind auch
reine Datenkan&#228;le denkbar.
Besonders f&#252;r den deutschsprachigen Raum lohnt es sich, einen ADR-Empf&#228;nger
zu kaufen, da eine Vielzahl von Programmen von &#246;ffentlich-rechtlichen undprivaten Stationen auf Sendung sind. Diese H&#246;rfunksender benutzen ADR h&#228;ufig auch f&#252;r die Zuf&#252;hrung ihrer Programme zu ihren terrestrischen Sendeanlagen. <BR>
Beim Kauf von ADR-Empf&#228;ngern haben Sie die </FONT><A HREF="Adraus.htm" TARGET="_self"><FONT FACE="Times New Roman" SIZE="3">Auswahl</FONT></A><FONT FACE="Times New Roman" SIZE="3"> zwischen dem reinenADR-Tuner als Baustein f&#252;r Ihre HiFi-Anlage und dem analogen
Satellitenreceivern mit eingebautem ADR-Modul. Achten Sie bitte darauf das
das Ger&#228;t Ihrer Wahl einen Eingangsfrequenzbereich von 950 bis 2050 MHz hat.Die Tonuntertr&#228;ger sollten sich von 0,36 bis 8,82 MHz abstimmen lassen umauch f&#252;r den Fall ger&#252;stet zu sein das ADR-Programme in Zukunft auf einemganzen Transponder ausgestrahlt werden. Bis jetzt werden nur Tonuntertr&#228;gerim Bereich von 6,12 bis 8,46 MHz genutzt. Ein automatischer Sendersuchlauf
mit automatischer Speicherung ist bei allen Ger&#228;ten Standart. Um den Klangdes ADR-Receivers voll geniesen zu k&#246;nnen sollten Sie Ihn an IhreHiFi-Anlage anschliessen.
</FONT></P>
<HR>
</TD>
</TR>
</TABLE></CENTER>
</BODY>
</HTML>