<HTML>
<HEAD>
<TITLE>AHG - Analoge Verbreitung</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" BACKGROUND="../BACK/Sat3.jpg">
<BR>
<CENTER><TABLE BORDER="0" ALIGN="center" WIDTH="95%">
<TR>
<TD>

<HR>
<P ALIGN="center"><FONT SIZE="5" COLOR="Blue" FACE="Times New Roman">Analoge Programmausstrahlung</FONT>
</P>
<P><FONT FACE="Times New Roman" SIZE="3">Auch wenn alle Welt vom digitalen Rundfunk und Fernsehen redet, so ist doch f&#252;r die breite Massezur Zeit und wohl auch f&#252;r die n&#228;here Zukunft der analoge Programmempfang die Regel. </FONT><BR>
<FONT FACE="Times New Roman" SIZE="3">
Genauso wie beimterrestrischen Fernsehempfang und dem Kabelfernsehen ist auch bei der Ausstrahlung &#252;ber Satellitin den meisten L&#228;ndern Europas, die Norm PAL und deren modifizierter Ableger PALplus zur&#220;bertragung im Einsatz. Allerdings wird hierbei um gegenseitige Beeintr&#228;chtigungen zu vermeiden, bei derAusstrahlung ein anderer Frequenzbereich eingesetzt, f&#252;r den ein spezieller Empf&#228;nger ben&#246;tigt wird. Die modernen Satelliten-Receiver benutzen den Frequenzbereich von 950 bis 2150 MHz, derauch als 1. Zwischenfrequenz bezeichnet wird, da die eigentliche Sendefrequenzen, auf denen
Fernsehsatelliten ihre Programme abstrahlen, weitaus h&#246;her liegen und vor dem Zuf&#252;hren zumReceiver vom LNB konvertiert werden.</FONT><BR>
<FONT FACE="Times New Roman" SIZE="3">
Ein weiterer Unterschied zur terrestrischen Abstrahlung besteht auch bei der Art der
Audio&#252;bertragung &#252;ber Satellit. Neben dem Videosignal k&#246;nnen &#252;ber einen Transponder noch eineReihe von Tonuntertr&#228;gern genutzt werden. Tonuntertr&#228;ger erm&#246;glichen neben der Ausstrahlung desFernsehtons auch die Verbreitung von mehreren Radioprogrammen oder das Senden des Fernsehtons inverschiedenen Sprachversionen. In der Regel wird in einem Abstand von 6,50 MHz oder 6,60 MHz vomVideosignal ein Haupttonuntertr&#228;ger in Mono ausgestrahlt. Zus&#228;tzlich ist meist auf 7,02 MHz und7,20 MHz ein Tonuntertr&#228;gerpaar f&#252;r den Fernsehstereoton aufgeschaltet. Auf denHaupttonuntertr&#228;ger verzichten in zunehmenden Ma&#223;e viele Fernsehsender. Dar&#252;ber hinaus stehenbis zu sieben weitere Tonuntertr&#228;ger im Bereich 7,38 bis 8,46 MHz f&#252;r analoge Radioprogrammeoder alternative Fernseht&#246;ne bereit. Bis auf den Haupttonuntertr&#228;ger wird zur Audio&#252;bertragung das Panda-Wegner-Verfahren benutzt. Beim Panda-Wegner-Verfahren wird das Tonsignal senderseitigkomprimiert und auf der Empf&#228;ngerseite dekomprimiert wobei sich der Frequenzhub verringert unddadurch weniger Platz f&#252;r den Tonuntertr&#228;ger ben&#246;tigt wird. Die Tonqualit&#228;t ist vergleichbar mitder einer UKW-Ausstrahlung. Anstatt der analogen Tonuntertr&#228;ger lassen sich auch eineReihe digitaler Tonuntertr&#228;ger (Astra Digital Radio) schalten.
</FONT></P>
<HR>
</TD>
</TR>
</TABLE></CENTER>
</BODY>
</HTML>