<HTML>
<HEAD>
<TITLE>AHG - SES und ASTRA</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" BACKGROUND="../BACK/Astra.jpg">
<BR>
<CENTER><TABLE BORDER="0" ALIGN="center" WIDTH="95%">
<TR>
<TD>
<HR>

<P ALIGN="center"><FONT SIZE="5" COLOR="Blue" FACE="Times New Roman">SES und ASTRA</FONT></P>
<P ALIGN="left"><IMG BORDER="0" SRC="../BILDER/ASTRA.JPG" ALIGN="LEFT"><FONT FACE="Times New Roman" SIZE="3">Im luxemburgischen </FONT><A HREF="Betzdorf.htm" TARGET="_self"><FONT FACE="Times New Roman" SIZE="3">Betzdorf </FONT></A><FONT FACE="Times New Roman" SIZE="3">hat die Betreibergesellschaft
des ASTRA-Satellitensystems, die Societe Europeenne des Satellites (SES) ihren Sitz. Auf den ASTRA-Satelliten
werden seit Anfang 1989 H&#246;rfunk- und Fernsehprogramme europaweit &#252;bertragen.
Der Betrieb des Systems erfolgt auf Grundlage einer Konzession des Grossherzogtums Luxemburg, die zun&#228;chst bis zum Jahr
2010 g&#252;ltig ist, und die Option auf eine Verl&#228;ngerung beinhaltet. Die Konzession berechtigt die SES, auf Ihren
Satelliten Fernseh- und H&#246;rfunkprogramme, sowie andere audiovisuelle Dienste zu &#252;bertragen.
Durch zwei &#246;ffentlich-rechtliche Finanzinstitute ist das Grossherzogtum Luxemburg, indirekt
mit etwa 20% am Aktienkapital der SES beteiligt. Der Rest
des Eigenkapitals verteilt sich auf internationale private Investoren.</FONT><BR>
<FONT FACE="Times New Roman" SIZE="3">
Schon als die SES im M&#228;rz 1985 als erstes privates Satellitenunternehmen in Europa gegr&#252;ndet wurde, standen
die Bed&#252;rfnisse der europ&#228;ischen Fernsehzuschauer und der Programmveranstalter im Mittelpunkt.
Aus diesem Grund entwickelte die SES ein v&#246;llig neues Konzept f&#252;r das Satellitenfernsehen, bei dem eine Vielzahl von
attraktiven Radio- und Fernsehprogrammen f&#252;r die verschiedenen europ&#228;ischen Sprachm&#228;rkte von nur noch einer
Orbitposition aus abgestrahlt werden. Erreicht wurde dies durch das Kopositionieren mehrerer Satelliten auf einer
einzigen Position, was von der SES als ersten Satellitenbetreiber praktiziert wurde und nunmehr auch von einigen anderen
Satellitenbetreibern nachgemacht wird. F&#252;r den Endverbraucher bedeutet das, das er mit leicht installierbaren und
daher kosteng&#252;nstigen Empfangsger&#228;t die &#252;ber ASTRA ausgestrahlten Programme direkt empfangen kann.</FONT><BR>
<FONT FACE="Times New Roman" SIZE="3">
Zur Zeit wird eine Satellitenposition auf  19,2&#176; Ost  genutzt, eine zweite soll ab 1998 auf 28,2&#176; Ost gestartet werden.
Auf der Orbitposition 19,2&#176; Ost sollen, im </FONT><A HREF="Astra1.htm" TARGET="_self"><FONT FACE="Times New Roman" SIZE="3">Endausbau</FONT></A><FONT FACE="Times New Roman" SIZE="3">, acht Satelliten mit 120 aktiven Transpondern kopositioniert
sein. Die vier Satelliten ASTRA 1A bis 1D dienen zur Zeit der analogen Ausstrahlung von Programmen, w&#228;hrend die drei
Satelliten ASTRA 1E bis 1G f&#252;r digitale Signalverbreitung verwendet werden. Der achte Satellit, ASTRA
1H ist nach aktuellen Planungen als Systemreserve gedacht. W&#228;hrend die vier Satelliten ASTRA 1A bis 1D noch mit den
herk&#246;mmlichen LNBs zu empfangen sind, ist zum Empfang der Satelliten ASTRA 1E bis 1F ein </FONT><A HREF="Lnbbild.htm" TARGET="_self"><FONT FACE="Times New Roman" SIZE="3">Universal-LNB</FONT></A><FONT FACE="Times New Roman" SIZE="3">
erforderlich, welches f&#252;r den gesamten Frequenzbereich von 10700 bis 12750 MHz geeignet ist.</FONT><BR>
<FONT FACE="Times New Roman" SIZE="3">
Heute besch&#228;ftigt der Konzern &#252;ber 180 Mitarbeiter aus vierzehn verschiedensten Nationen und unterschiedlichen
Kulturen, die ihre F&#228;higkeiten f&#252;r hochspezialisierte Aufgaben an vorderster Front der Entwicklung der Satellitentechnologien
und der wirtschaftlichen Nutzung des Satellitenfernsehens einsetzen.</FONT></P>
<BR>
<P><FONT FACE="Times New Roman" SIZE="3">
Weitere Informationen erhalten Sie bei:</FONT><BR>
</P>
<BR>
<P ALIGN="center"><FONT FACE="Times New Roman" SIZE="3">ASTRA-Marketing GmbH</FONT><BR>
<FONT FACE="Times New Roman" SIZE="3">
Mergenthalerallee 79-81</FONT><BR>
<FONT FACE="Times New Roman" SIZE="3">
D-65670 Eschborn</FONT><BR>
</P>
<P ALIGN="center">Internet: <A HREF="http://www.astra.lu" TARGET="_blank">www.astra.lu</A></P>
<BR>
<HR>
</TD>
</TR>
</TABLE></CENTER>
</BODY>
</HTML>