<HTML>
<HEAD>
<TITLE>AHG - Digitale Satellitenreceiver</TITLE>
</HEAD>
<BODY BACKGROUND="../BACK/AHG.jpg">

<CENTER><TABLE BORDER="0" ALIGN="center" WIDTH="95%">
<TR>
<TD>
<HR>
<P ALIGN="center"><FONT SIZE="5" COLOR="Blue" FACE="Times New Roman">Digitale Empf&#228;nger</FONT>
</P>
<P><FONT FACE="Times New Roman" SIZE="3">Anders als bei den analogen Receivern ist bei den digitalen Empf&#228;ngern das Angebot an Ger&#228;ten
noch ziemlich d&#252;rftig. Hierzu kommt auch noch das die Receiver, weil noch in geringen St&#252;ckzahlenproduziert, im Vergleich zu analogen Empf&#228;ngern recht teuer sind.
</FONT><BR>
<FONT FACE="Times New Roman" SIZE="3">
Bekanntestes Ger&#228;t zur Zeit ist die d-box, die zum Empfang des Pay-TV-Pakets DF1 (ab 1998
Premiere Digital) vertrieben wird. Bei der d-box, handelt es sich um einen digitalenSatellitenempf&#228;nger mit einem eingebauten Conditional Access Modul zur Entschl&#252;sslung desDF1-Programmangebots. Die d-box basiert auf dem DVB-Receiver Mediamaster 9500 des finnischen
Elektronikkonzerns Nokia und unterscheidet sich von diesem lediglich durch die spezielleDF1-Software, die &#252;brigens automatisch &#252;ber Satellit aktuallisiert wird. Letzteres ist wichtigda derzeit ein Teil der </FONT><A HREF="DBOX.htm" TARGET="_self"><FONT FACE="Times New Roman" SIZE="3">Anschlussm&#246;glichkeiten</FONT></A><FONT FACE="Times New Roman" SIZE="3"> die das Ger&#228;t
bietet von der aktuellen Software noch nicht unterst&#252;tzt werden. Zwar k&#246;nnen Sie die d-box,
sollten Sie nur Interesse an frei zu empfangenden Programmen haben, auch betreiben ohne daf&#252;rein Abbonement abzuschliessen, jedoch kann dann nicht ausgeschlossen werden das Sie nach einemUpdate der d-box-Software nichts mehr zu sehen bekommen. Besser ist es auf jene digitalenSatellitenreceiver zu warten die nicht von einem Pay-TV-Anbieter vertrieben werden. Angek&#252;ndigt
sind derartige Ger&#228;te unter anderem von den Firmen Grundig, TechniSat, Lemon, Kathrein, Thomson,Pace und einigen anderen. Einige Empf&#228;nger werden noch 1997 erscheinen, jedoch ist damit zurechnen das in den Regalen der Fachh&#228;ndler und Elektronikm&#228;rkte erst im Laufe des Jahres 1998
vermehrt DVB-Receiver auftauchen werden. Um Ihnen bei der Auswahl etwas zu helfen sindnachfolgend die wichtigsten Merkmale von Satellitenempf&#228;ngern stichpunktartig aufgelistet:
</FONT></P>
<UL>
<LI><FONT COLOR="Navy" FACE="Times New Roman" SIZE="3">Eingangsfrequenzbereich mindestens von 950 bis 2150 MHz
</FONT></LI>
<LI><FONT COLOR="Navy" FACE="Times New Roman" SIZE="3">Anzeige aller Einstellparameter auf dem Fernsehbildschirm (OSD)
</FONT></LI>
<LI><FONT COLOR="Navy" FACE="Times New Roman" SIZE="3">Einzeltr&#228;gerempfang (SCPC)
</FONT></LI>
<LI><FONT COLOR="Navy" FACE="Times New Roman" SIZE="3">Abspeicherm&#246;glichkeit aller Einstellparameter f&#252;r jeden Programmplatz
</FONT></LI>
<LI><FONT COLOR="Navy" FACE="Times New Roman" SIZE="3">Mindestens 3 Scartbuchsen
</FONT></LI>
<LI><FONT COLOR="Navy" FACE="Times New Roman" SIZE="3">Audioausgang mit Cinchbuchsen
</FONT></LI>
<LI><FONT COLOR="Navy" FACE="Times New Roman" SIZE="3">UHF-Modulator zum Anschluss &#228;lterer Fernsehger&#228;te
</FONT></LI>
<LI><FONT COLOR="Navy" FACE="Times New Roman" SIZE="3">Durchschleifm&#246;glichkeit f&#252;r 1.Zwischenfrequenz zum Analogreceiver
</FONT></LI>
<LI><FONT COLOR="Navy" FACE="Times New Roman" SIZE="3">Bei Multifeedempfang zwei Eing&#228;nge f&#252;r Satellitenantenne oder Diseqc-Schaltung
</FONT></LI>
<LI><FONT COLOR="Navy" FACE="Times New Roman" SIZE="3">14/18 Volt Schaltspannung
</FONT></LI>
<LI><FONT COLOR="Navy" FACE="Times New Roman" SIZE="3">22 kHz-Schaltfrequenz
</FONT></LI>
<LI><FONT COLOR="Navy" FACE="Times New Roman" SIZE="3">Netzschalter
</FONT></LI>
<LI><FONT COLOR="Navy" FACE="Times New Roman" SIZE="3">Automatischer Sendersuchlauf und -speicherung</FONT>
</LI>
</UL>
<P><FONT FACE="Times New Roman" SIZE="3">Des weiteren sind folgende Sonderausstattungen m&#246;glich:
</FONT></P>
<UL>
<LI><FONT COLOR="Navy" FACE="Times New Roman" SIZE="3">Timer
</FONT></LI>
<LI><FONT COLOR="Navy" FACE="Times New Roman" SIZE="3">VPS
</FONT></LI>
<LI><FONT COLOR="Navy" FACE="Times New Roman" SIZE="3">ShowView
</FONT></LI>
<LI><FONT COLOR="Navy" FACE="Times New Roman" SIZE="3">Kindersicherung
</FONT></LI>
<LI><FONT COLOR="Navy" FACE="Times New Roman" SIZE="3">eingebautes Conditional Access Modul f&#252;r Pay-TV (z.B.:Irdeto)
</FONT></LI>
<LI><FONT COLOR="Navy" FACE="Times New Roman" SIZE="3">eingebauter Analogreceiver
</FONT></LI>
<LI><FONT COLOR="Navy" FACE="Times New Roman" SIZE="3">Common Interface zum Betrieb mehrerer Conditional Access Module</FONT>
</LI>
</UL>
<P><FONT FACE="Times New Roman" SIZE="3">Sollten Sie bereits eine Satellitenempfangsanlage besitzen, achten Sie bitte darauf das einUniversal-LNB montiert ist, da die meisten digitalen Programme im Oberband (11700 bis 12750 MHz)ausgestrahlt werden.
</FONT></P>
<HR>
</TD>
</TR>
</TABLE></CENTER>
<P>&nbsp;</P>
</BODY>
</HTML>