<HTML>
<HEAD>
<TITLE>DiSEqC - Das digitale Steuerungssystem</TITLE>
</HEAD>
<BODY LINK="#0000ff" VLINK="#800080" BACKGROUND="../BACK/Sat3.jpg">

<CENTER><TABLE BORDER="0" ALIGN="center" WIDTH="98%">
<TR>
<TD VALIGN="MIDDLE">
<HR>
<FONT SIZE="5" COLOR="#0000ff">
<P ALIGN="CENTER">DiSEqC </P>
</FONT>
<P>Sowohl auf <B>Astra</B> als auch auf <B>Hot Bird</B> wird seit Mitte der neunziger Jahre zunehmend das <I>High Band </I>zur Ausstrahlung von Programmen f&#252;r den Direktempfang verwendet. F&#252;r Einzelanlagen gibt es Receiver mit zwei Antenneneing&#228;ngen und 22 kHz-Schaltung, mit denen der Empfang problemlos m&#246;glich ist. Schwieriger war das bislang wenn nur ein Kabel zum Satellitenreceiver verlegt werden sollte oder eine Mehrteilnehmeranlage zu erstellen war. Nun ist die Verteilung sowohl des <I>Low Bands</I> als auch des <I>High Bands</I> von beiden Satellitensystemen  mittels <A HREF="Multi2.htm">DiSEqC</A> (Digital Satellite Equipment Control) auf einfache Weise m&#246;glich. DiSEqc wurde von <B>Philips</B> und <B>Eutelsat</B> gemeinsam entwickelt und steht allen Herstellern von Empfangsger&#228;ten als offener Standard zur Verf&#252;gung. Dieses neue Steuersystem nutzt die 22 kHz-Technik, indem auf diesen Tr&#228;ger digitale Telegramme aufmoduliert werden. Empfangen und ausgewertet werden diese digitalen Telegramme vom <A HREF="Disbild.htm">DiSEqC</A>-f&#228;higen Multiswitch oder LNB. DiSEqC-Multischalter und -LNB k&#246;nnen nur durch Satellitenreceiver mit DiSEqC angesteuert werden. Unterschieden werden derzeit die nachfolgend aufgelisteten DiSEqC-Versionen:</P>
<TABLE BORDER="0" ALIGN="DEFAULT" WIDTH="100%">
<TR>
<TD WIDTH="5%"><B> </B></TD>
<TD WIDTH="15%"><B> </B></TD>
<TD ALIGN="CENTER" WIDTH="80%"><B> </B></TD>
</TR>
<TR>
<TD COLSPAN="2"><FONT COLOR="Maroon">DiSEqC 1.0</FONT></TD>
<TD></TD>
</TR>
<TR>
<TD></TD>
<TD COLSPAN="2">Durch DiSEqC 1.0 k&#246;nnen bei, bis zu vier verschiedene Satellitenantennen, die beiden Polarisationsebenen und die beiden Frequenzb&#228;nder angesteuert werden. Es gibt bereits viele Satellitenreceiver und Multischalter die DiSEqC 1.0 ausger&#252;stet sind.</TD>
</TR>
<TR>
<TD COLSPAN="2"><FONT COLOR="Maroon">DiSEqC 2.0</FONT></TD>
<TD></TD>
</TR>
<TR>
<TD></TD>
<TD COLSPAN="2"> Durch DiSEqC 2.0 k&#246;nnen bei, bis zu vier verschiedene Satellitenantennen, die beiden Polarisationsebenen und die beiden Frequenzb&#228;nder angesteuert werden. Zus&#228;tzlich gibt es eine Art R&#252;ckkanal, &#252;ber den Informationen von der Antennenanlage, wie beispielsweise die Oszillatorfrequenzen der verschiedenen LNB's oder deren Anzahl,  an den Receiver zur&#252;ckfliessen. Auch wird es m&#246;glich drehbare Antennen nur &#252;ber das Koaxialkabel anzusteuern. W&#228;hrend Multischalter bereits von versciedenen Herstellern angeboten werden, sind Receiver mit DiSEqC 2.0 noch rar.</TD>
</TR>
<TR>
<TD COLSPAN="2"><FONT COLOR="Maroon">DiSEqC 2.1</FONT></TD>
<TD></TD>
</TR>
<TR>
<TD></TD>
<TD COLSPAN="2">Entspricht DiSEqC 2.0, mit dem Unterschied das bei, bis zu 64 verschiedene Satellitenantennen, die beiden Polarisationsebenen und die beiden Frequenzb&#228;nder angesteuert werden k&#246;nnen. Haupteinsatzgebiet d&#252;rften daher  Wohnblocks mit verschiedenen Nationalit&#228;ten und Hotels sein.</TD>
</TR>
<TR>
<TD COLSPAN="2"><FONT COLOR="Maroon">DiSEqC 3.0</FONT></TD>
<TD></TD>
</TR>
<TR>
<TD></TD>
<TD COLSPAN="2">Diese Version ist f&#252;r Einkabelanlagen vorgesehen bei denen die Antennensteckdosen in Reihe geschaltet sind. DiSEqC 3.0 ist derzeit noch nicht auf dem Markt.</TD>

</TR>
</TABLE>



</TD>
</TR>
</TABLE></CENTER>
<P>&nbsp;
</P>
</BODY>
</HTML>