<HTML>
<HEAD>
<TITLE>AHG -- DVB - Digital Video Broadcasting</TITLE>
</HEAD>
<BODY BACKGROUND="../BACK/dvb.jpg">

<CENTER><TABLE BORDER="0" ALIGN="CENTER" WIDTH="95%">
<TR>
<TD>
<HR>
<BR>
<P ALIGN="center"><B><FONT SIZE="5" COLOR="Blue">DVB - Digital Video Broadcasting</FONT></B></P>

<P ALIGN="LEFT"><IMG BORDER="0" SRC="../BILDER/dvb.jpg" ALIGN="LEFT">Unter<I> Digital Video Broadcasting (DVB)</I><B>, </B>meist auch als <I>Digitales Fernsehen</I> bezeichnet, versteht man die digitale &#220;bertragung von Fernseh- und Radioprogrammen und anderen Daten. Das eigentliche Fernsehbild ist jedoch immer noch analogen Ursprungs und mu&#223; daher zun&#228;chst digitalisiert werden. Dabei fallen, bedingt durch rasche Abfolge von Einzelbildern, sehr grosse <A HREF="Kompbild.htm" TARGET="_self">Datenmengen</A> (bei PAL &#252;ber 200 Mbit/s) an, wodurch die ben&#246;tigte Bandbreite (Platzbedarf) auf einem Satellitentransponder ansteigt. Im Empf&#228;nger wird das ankommende digitale Signal wieder in ein analoges umgewandelt, damit unsere Fernseher es auch darstellen k&#246;nnen. Die Digitalisierung alleine w&#252;rde also eher Nach- als Vorteile bringen. Sinnvoll ist diese erst, wenn zus&#228;tzlich zur Digitalisierung eine Komprimierung erfolgt, um den Platzbedarf auf einem Satellitentransponder zu senken. Als weltweiten Standard f&#252;r die Komprimierung hat man sich auf die Norm <I>MPEG-2</I> verst&#228;ndigt. Bei <I>MPEG-2</I> werden nur die Bildinhalte &#252;bertragen die sich gegen&#252;ber dem vorhergehenden Einzelbild ver&#228;ndert haben, der Rest des Bildes kommt aus dem Speicher des Receivers. In bestimmten Abst&#228;nden wird zur Sicherheit die volle Bildinformation &#252;bertragen. Auf diese Weise k&#246;nnen bis zu <A HREF="MPEG.htm" TARGET="_self">zw&#246;lf</A> Fernsehprogramme &#252;ber einen Transponder ausgestrahlt werden, wobei die genaue Anzahl von der Art der Programme abh&#228;ngt. So ben&#246;tigen Sportsendungen, wegen der schnell wechselnden Bildinhalte, mehr Platz als eine Talkshow. Durch DVB werden verschiedene neuartige Dienste angeboten, welche haupts&#228;chlich aus Kostengr&#252;nden bislang nicht m&#246;glich waren. Den gr&#246;&#223;ten Nutzen der Digitaltechnik haben daher zun&#228;chst erstmal die Programmanbieter, denn die &#220;bertragungskosten eines digitalen Programms betragen nur noch einen Bruchteil eines analogen. Mit dem MPEG-2-Verfahren k&#246;nnen nicht nur Fernsehprogramme &#252;bertagen werden, sondern auch H&#246;rfunkprogramme und Datenkan&#228;le.<BR>
Digitale Fernsehausstrahlungen finden  &#252;ber  Astra 1 auf den Satelliten Astra 1E, 1F und 1G im Frequenzbereich von 10700 bis 12750 MHz (High-Band) statt, w&#228;hrend analoge Abstrahlungen  im Low-Band zwischen 10700 bis 11,700 MHz geschehen. Anders ist dies bei Eutelsats Hot Bird wo auch im Low-Band digitale Sender zu finden sind. Das liegt haupts&#228;chlich daran das bei Eutelsat, aufgrund der h&#246;heren Bandbreite der Transponder im Low-Band, die M&#246;glichkeit besteht, auf einem Transponder neben einem analogen Fernsehproramm auch ein bis zwei digitale auszustrahlen. Zum Empfang von High- und Low-Band eignen sich nur neuere LNB's, sogenannte Universal-LNBs. <BR>
  </P>
<HR>
</TD>
</TR>
</TABLE></CENTER>
</BODY>
</HTML>