<HTML>
<HEAD>
<TITLE>AHG - EUTELSAT</TITLE>
</HEAD>
<BODY BACKGROUND="../BACK/Eutlog.jpg">

<CENTER><TABLE BORDER="0" ALIGN="CENTER" WIDTH="95%">
<TR>
<TD>
<HR>
<P ALIGN="center"><FONT SIZE="5" COLOR="Blue">EUTELSAT</FONT>
</P>
<P><IMG BORDER="0" SRC="../BILDER/EUTLOG.JPG" ALT="Logo" ALIGN="LEFT">EUTELSAT wurde bereits im Jahr 1977 gegr&#252;ndet, mit der Hauptaufgabe Satellitenf&#252;r station&#228;re und  mobile Kommunikation zu betreiben. Die urspr&#252;nglicheAnzahl der Mitgliedsl&#228;nder stieg von 17 auf inzwischen 45 Staaten an.Besitzer von EUTELSAT sind aber nicht die Mitgliedsstaaten oder derenRegierungen, sondern die Signatare. Dies sind in der Regel nationale private oder staatliche Telekommunikationsunternehmen. Als oberstesEntscheidungsgremium wurde folglich der Rat der Signatare gebildet derzusammentritt, um &#252;ber gesch&#228;ftliche und finanzielle Strategien zu diskutieren, und um Satellitenprojekte und -einsatzm&#246;glichkeiten sowie neueDienstleistungsangebote zu er&#246;rtern. Sobald die im Anfang 1996 beschlossene &#196;nderung der EUTELSAT-Konvention von allen Mitgliedsstaaten ratifiziert istwird es m&#246;glich, das mehr als ein Signatar f&#252;r jedes Mitgliedsland beitritt,wodurch sich EUTELSAT auf die weiter zunehmende Liberalisierung des
Telekommunikationswesens in Europa einrichtet.Unter dem derzeitigen
Generaldirektor Jean Grenier wurde im Jahr 1995 ein Umsatz von 275 Millionen
ECU erzielt. <BR>
EUTELSAT-Satelliten werden f&#252;r nationale und internationale,
station&#228;re und mobile Kommunikationsdienste wie etwa Telefonie, Telegraphie,Telex, Fax, Daten&#252;bermittlung, Videotext, H&#246;rfunk- und Fernseh&#252;bertragungen
genutzt. Die Organisation bietet dar&#252;ber hinaus auch weitere spezielleTelekommunikationsdienste an, wie H&#246;rfunk- und Fernsehsatellitendienste,
Navigationsdienste, Weltraumforschungsdienste, meteorologische Dienste und
die Fernerkundung von Bodensch&#228;tzen. F&#252;r weiter Informationen wenden Sie sichbitte direkt an <A HREF="#ADRESSE">EUTELSAT</A>.
</P>
<P><FONT SIZE="+1" COLOR="Maroon">Zur Zeit werden folgende Dienste &#252;bertragen:</FONT>
</P>
<UL>
<LI><A HREF="#DTH">Fernsehen und H&#246;rfunk f&#252;r Kabeleinspeisung und Satellitendirektempfang (DTH)</A>
</LI>
<LI><A HREF="#EBU">Eurovisionssendungen und Euroradio der EBU</A>
</LI>
<LI><A HREF="#SNG">Satellitengest&#252;tzte Nachrichten&#252;bertragung (SNG)</A>
</LI>
<LI><A HREF="#TELEFON">Nationales und internationales Fernsprechen</A>
</LI>
<LI><A HREF="#COMM">Gesch&#228;ftskommunikation</A>
</LI>
<LI><A HREF="#TRACS">Mobile Kommunikation zu Lande und auf der See (EUTELTRACS)</A>
</LI>
</UL>
<HR>
<P ALIGN="center"><FONT SIZE="4" COLOR="Green"><A NAME="DTH">Fernsehen und H&#246;rfunk f&#252;r Kabeleinspeisung und Satellitendirektempfang (DTH)</A></FONT>
</P>
<P>Die &#220;bertragung von analogen und digitalen Fernseh- und Radioprogrammen viaEUTELSAT findet in der Regel auf Basis einer 24-st&#252;ndigen Transponderanmietungstatt. Auf EUTELSAT-Satelliten werden zur Zeit mehr als 100 Fernseh- und70 H&#246;rfunkprogramme ausgestrahlt. Diese k&#246;nnen &#252;ber Direktempfangsanlagen,Kabelanschluss und Gemeinschaftsantennen empfangen werden. Derzeit empfangenmehr als 55 Millionen Haushalte Programme von der Hot Bird-Position 13&#176; Ost &#252;ber einender genannten &#220;bertragungswege.Der leistungsstarke <A HREF="../BILDER/ECSS.JPG">Superbeam</A>  der EUTELSAT II-Satellitenserie erlaubt in West- und Zentraleuropa den Satellitenempfang mit Antennen von 60 cm Durchmesser, w&#228;hrend f&#252;r den
<A HREF="../BILDER/ECSW.JPG">Widebeam</A> noch 80cm ben&#246;tigt werden. Programme die mittels des <A HREF="../BILDER/HB1.JPG">Super-Widebeam</A> von Hot Bird 1ausgestrahlt werden, k&#246;nnen von Irland bis zur Ukraine mit Antennen von 70 cm Durchmesserempfangen werden. Gleiches gilt auch f&#252;r den <A HREF="../BILDER/HB2W.JPG">Widebeam </A>der Satelliten Hot Bird 2 bis 5, deren<A HREF="../BILDER/HB2S.JPG">Superbeam</A> soll in grossen Teilen Europas schon mit Antennen unter 50 cm Durchmesser empfangenwerden k&#246;nnen.
</P>
<HR>
<P ALIGN="center"><FONT SIZE="4" COLOR="Green"><A NAME="EBU">Eurovisions&#252;bertragungen der EBU</A></FONT>
</P>
<P>Die European Broadcasting Union (EBU) benutzt bereits seit 1984EUTELSAT-Satelliten f&#252;r ihre t&#228;glichen Eurovisions&#252;bertragungen, den
Euroradio-Dienst bietet die EBU seit 1989 an.
Der Programmaustausch innerhalb der EBU erfolgt &#252;ber 4&#189; Widebeam-Transponder des Satelliten EUTELSAT2-F4. Damit stehen der EBU f&#252;r ihre &#220;bertragungen sechs digitale Fernsehkan&#228;le in Studioqualit&#228;t und diedazugeh&#246;renden Ton- und Radiokan&#228;le zur Verf&#252;gung. Die vergr&#246;sserte Reichweite des Widebeam vonEUTELSAT 2-F4 erm&#246;glicht es der EBU, mit einem einzigen Satelliten alle 62 aktiven Mitglieder aus 48 Staatenin Europa, Nordafrika und dem Nahen Osten zu erreichen.
</P>
<HR>
<P ALIGN="center"><FONT SIZE="4" COLOR="Green"><A NAME="SNG">Satellitengest&#252;tzte Nachrichten&#252;bertragung (SNG)</A></FONT>
</P>
<P>Programmanbieter nutzen EUTELSAT-Transponder f&#252;r die satellitengest&#252;tzteNachrichten&#252;bermittlung mittels transportabler Erdfunkstellen. EUTELSATbetreibt eine Buchungsstelle, die Antr&#228;ge f&#252;r die satellitengest&#252;tzte
Fernseh&#252;bertragung und die zeitlich begrenzte Transponder-Anmietungkoordiniert. Auf der Hot Bird-Position 13&#176; Ost finden solche &#220;bertragungen seit Herbst1995 nur noch sehr selten statt, da inzwischen alle Transponder zur Ausstrahlung von H&#246;rfunk- und Fernsehprogrammen ben&#246;tigt werden.</P>
<HR>
<P ALIGN="center"><FONT SIZE="4" COLOR="Green"><A NAME="TELEFON">Nationales und internationales Fernsprechen</A></FONT>
</P>
<P>&#220;ber vier Transponder und ein Netz von 19 Erdfunkstellen &#252;bertr&#228;gt EUTELSATeuropaweit &#246;ffentliches digitales Fernsprechen und versorgt so insgesamt 22L&#228;nder. Das Netzwerk wird zur Zeit in Osteuropa ausgeweitet (Russland,Aserbeidschan, Ukraine). Im Bereich des &#246;ffentlichen Fernsprechens istausserdem eine 24-st&#252;ndige Transponderanmietung m&#246;glich.
So nutzen z.B. Tele Denmark einen Transponder f&#252;r ihre nationaleFernsprechverbindung zu den F&#228;r&#246;er-Inseln in der Nordsee und Spanien einen Transponder zur Daten&#252;bertragung. Nat&#252;rlich laufen diese Telefondienste &#252;berdie anderen EUTELSAT-Satelliten, da daf&#252;r auf den Hot Birds kein Platz freiist.
</P>
<HR>
<P ALIGN="center"><FONT SIZE="4" COLOR="Green"><A NAME="COMM">Gesch&#228;ftskommunikation</A></FONT>
</P>
<P>Insgesamt 17 Transponder (sechs Transponder auf EUTELSAT 2-F2, zehnTransponder auf EUTELSAT 2-F4 und ein Transponder auf EUTELSAT 2-F3) werdenf&#252;r SMS-Dienste (Satellite Multiservices System) genutzt.
Zu den Anwendungen von SMS-Diensten z&#228;hlen unter anderem Ferndruck,Videokonferenzen, Daten&#252;bermittlung, Zivilschutz, Computerverbindungen und
vieles mehr. Die Anwender erhalten einen Anschluss an das SMS-Netz entweder
&#252;ber eine von mehreren Teilnehmern genutzte Antenne (z.B. an einem Teleport)oder &#252;ber eine individuelle vor Ort.
</P>
<HR>
<P ALIGN="center"><FONT COLOR="Green" SIZE="4"><A NAME="TRACS">Mobile Kommunikation zu Lande und auf der See (EUTELTRACS)</A>
</FONT></P>
<P>EUTELTRACS ist ein satellitengest&#252;tzter mobiler Kommunikationsdienst f&#252;r Land-
und Wasserfahrzeuge, welcher im Zwei-Wege-Service arbeitet.Dadurch, wird beispielsweise f&#252;r Speditionen, Fuhr- und Schiffsunternehmen der
Nachrichtenaustausch und die Standortbestimmung in ganz Europa und Nordafrikasowie dem Nahen Osten erm&#246;glicht. Auf zwei EUTELSAT-Satelliten steht Kapazit&#228;tf&#252;r bis zu 45000 Fahrzeuge zur Verf&#252;gung; mit einem zus&#228;tzlichen Transponderkann diese Anzahl verdoppelt werden. Im Bereich des Strasseng&#252;terverkehrswerden derzeit 11000 Terminals betrieben, und mehr als 100 Fischereischiffeaus vier L&#228;ndern der Europ&#228;ischen Union sind bereits mit EUTELTRACS
ausger&#252;stet.<BR>
Der Signalaustausch f&#252;r EUTELTRACS zwischen Erde und Satellit wird von
EUTELSAT &#252;ber das eigene Satelliten-Kontrollzentrum in Rambouillet gesteuert.Nationale und regionale Dienstleistungsunternehmen vermarkten das System f&#252;r
den Endverbraucher. Terminals und die dazugeh&#246;rende Software werden voneinem Joint-Ventur-Unternehmen, der Firma Alcatel Qualcomm angeboten.</P>
<HR>
<P ALIGN="center"><FONT SIZE="5" COLOR="Green"><A NAME="ADRESSE">Adressen</A></FONT><FONT SIZE="4" COLOR="Green">
</FONT></P>
<P ALIGN="center"><FONT SIZE="4" COLOR="Maroon">Deutsche EUTELSAT Agentur:</FONT>
</P>
<P ALIGN="center">EUTELSAT<BR>
Werder
<BR>
27321 Thedinghausen</P>
<P ALIGN="center">Telefon: 04204 - 913232<BR>
e-mail: agentur-de@eutelsat.de<BR>
Internet: <A HREF="http://www.eutelsat.de" TARGET="_blank">www.eutelsat.de</A></P>
<P>&nbsp;</P>
<P ALIGN="center"><FONT SIZE="4" COLOR="Purple">EUTELSAT Zentrale:</FONT>
</P>
<P ALIGN="center">EUTELSAT<BR>
70, rue Balard
<BR>
F-75502 Paris Cedex 15</P>
<P ALIGN="center">Telefon: 0033 1 53 98 47 47<BR>
Internet: <A HREF="http://www.eutelsat.org" TARGET="_blank">www.eutelsat.org</A></P>
<HR>
</TD>
</TR>
</TABLE></CENTER>
<P>&nbsp;</P>
</BODY>
</HTML>