<HTML>
<HEAD>
<TITLE>AHG - Kabel und Bauteile f&#252;r Satellitenanlagen</TITLE>
</HEAD>
<BODY BACKGROUND="../BACK/Sat3.jpg">

<CENTER><TABLE BORDER="0" ALIGN="center" WIDTH="95%">
<TR>
<TD>
<HR>
<P ALIGN="center"><FONT COLOR="Blue" SIZE="5">Kabel &amp; Bauelemente</FONT>
</P>
<P>Auf keinen Fall vernachl&#228;ssigt werden d&#252;rfen die Bauteile zwischen LNBF und Empf&#228;nger umVerluste bei der Signalst&#228;rke vorzubeugen, die eine Verschlechterung der Empfangsqualit&#228;tbedeuten w&#252;rden. Grundregel f&#252;r alle Bauteile die Sie in Ihrer Empfangsanlage verwenden ist dasdiese mindestens f&#252;r den Frequenzbereich von 950 bis 2150 MHz geeignet sind.
</P>
<UL>
<LI><FONT SIZE="4" COLOR="Olive">Kabel</FONT><BR>
In  einer Satellitenempfangsanlage sollte ausschliesslich doppeltgeschirmtes Koaxialkabel (75 Ohm)f&#252;r die Verbindung der einzelnen Komponenten miteinander verwendet werden. Dabei ist darauf zuachten, da&#223; das Kabel auf den k&#252;rzest m&#246;glichen Weg zum jeweiligen Anschluss gelegt wird. Diesist wichtig da selbst die besten Kabel mit zunehmender L&#228;nge die Signalst&#228;rke kontinuierlichabschw&#228;chen. Ab etwa zwanzig Meter Kabell&#228;nge wird ein Verst&#228;rker unerl&#228;sslich.Sorgen Sie f&#252;r saubere Verbindungen und feste Verlegung der Kabel. Bei allen Kabelverbindungenim Freien sollten Sie auf den bestm&#246;glichen Schutz gegen N&#228;sse achten. Das hierf&#252;r ben&#246;tigteMaterial ist im Fachhandel und bei den einschl&#228;gigen Versandh&#228;usern erh&#228;ltlich.
</LI>
</UL>
<UL>
<LI><FONT SIZE="4" COLOR="Olive">Stecker</FONT><BR>
F&#252;r die Verbindung der Antennenkabel mit den einzelnen Bausteinen in einer
Satellitenempfangsanlage werden meistens F-Stecker verwendet. Der F-Stecker ist eine einfacheMetallh&#252;lse mit einem Innengewinde und einer &#220;berwurfmutter. Mit diesen F-Steckern ist einefeste Verschraubung des Kabels mit dem jeweiligen Bauteil m&#246;glich. Seltener zu finden sind
in Sat-Anlagen Koaxialstecker- und buchsen.
</LI>
</UL>
<UL>
<LI><FONT SIZE="4" COLOR="Olive">Multischalter</FONT><BR>
Voraussetzung f&#252;r eine Empfangsanlage mit mehreren Teilnehmern ist die gleichzeitige
Bereitstellung beider Polarisationsebenen und beider Frequenzb&#228;nder f&#252;r die einzelnenSatellitenempf&#228;nger, so da&#223; jeder Teilnehmer sein individuelles Wunschprogramm frei w&#228;hlen kann. Zu diesem Zweck wirdein Empfangssystem mit getrennten Ausg&#228;ngen f&#252;r beide Polarisationsebenen und Frequenzb&#228;nderverwendet. Die vier Ausg&#228;nge des LNB werden mit Hilfe von Koaxialkabeln mit einem Multischalter
(Multiswitch) verbunden, an dem die einzelnen Empf&#228;nger sternf&#246;rmig angeschlossen sind. Jeder
einzelne Empf&#228;nger kann durch Steuerspannung und Schaltfrequenz dem Multiswitch die f&#252;r dasjeweilige Programm erforderliche Polarisationsart und Frequenzband signalisieren, die dannindividuell durchgeschaltet werden. Verschiedene Hersteller bieten auch Multischalter an die dasEinschleifen eines terrestrischen Antennensignals gestatten.
</LI>
</UL>
<UL>
<LI><FONT SIZE="4" COLOR="Olive">Antennensteckdose</FONT>
<BR>
Antennensteckdosen erm&#246;glichen das schnelle Abkoppeln des Receivers von der Antenneanlage. N&#246;tig
ist das bei Arbeiten an der Antennenanlage um Kurzschl&#252;sse zu verhindern, und bei Gewittern umden Satelliten-Receiver und die angeschlossenen Ger&#228;te vor eventuell auftretenten &#220;berspannungenzu sch&#252;tzen. Zus&#228;tzlich dient die Antennensteckdose auch als Antennenweiche damit die amMultischalter eingespeisten terrestrischen Signale wieder von den Satellitensignalen getrennt werden. F&#252;r die Installation in Satellitenempfangsanlagen gibt es zwei verschiedene Variantenvon Antennensteckdosen. Die Erste besitzt neben den Buchsen f&#252;r terrestrisches Radio undFernsehen, noch eine F-Buchse f&#252;r den Satellitenempfang und wird mit einem Antennenkabelversorgt. Wenn neben dem Satellitenempf&#228;nger ein Videorecorder mit eingebauten Satellitenreceiver, ein Twin-Receiver, ein ADR-Tuner oder eine Multifeed-Anlage betrieben werden
soll, so bietet sich die zweite Variante an, die mit einer zweiten F-Buchse genau das erm&#246;glicht.Versorgt wird diese Steckdose mit zwei Antennenkabeln um zwei voneinander unabh&#228;ngigeSatellitensignale zuf&#252;hren zu k&#246;nnen.
</LI>
</UL>
<HR>
</TD>
</TR>
</TABLE></CENTER>
</BODY>
</HTML>