<HTML>
<HEAD>
<TITLE>AHG - LNBF</TITLE>
</HEAD>
<BODY BACKGROUND="../BACK/Lnbf.jpg">

<CENTER><TABLE BORDER="0" ALIGN="CENTER" WIDTH="95%">
<TR>
<TD>
<HR>
<P ALIGN="center"><FONT SIZE="5" COLOR="Blue">LNB</FONT></P>
<P>Wie bereits erw&#228;hnt senden ASTRA und Hot Bird ihre Signale mit relativ hohen Frequenzen im<A HREF="Lnbbild.htm" TARGET="_self">Ku-Band</A> (10,7 bis 12,75 GHz) zur Erde. Jedoch lassen sich Signale, mit derart hohen Frequenzen,nicht mehr &#252;ber die normalen Antennenkabel verteilen. Wollte man diese hohen Frequenzen direktan den Empf&#228;nger weiterleiten, w&#228;ren daf&#252;r teure Spezialkabel notwendig, die zudem auch nochschwierig zu verlegen sind. Kosteng&#252;nstiger und technisch relativ einfach ist es, die vom
Satelliten kommenden Signale, in einen niedrigeren Frequenzbereich (950 bis 2150 MHz)umzuwandeln. Hierf&#252;r ist an jeder Satellitenantenne der Low Noise Block Converter (LNB bzw. LNC)angebracht. Neben der Frequenzumwandlung erfolgt im LNB auch die Polarisationsumschaltung unddie Schaltung zwischen oberen und unteren Frequenzbereich.<BR>
Die g&#228;ngigste Bauform des LNB ist das <A HREF="Lnbf.htm" TARGET="_self">LNBF</A>, also das LNB mit fest integrierten Feedhorn. DiesesFeedhorn b&#252;ndelt die von der Satellitenantenne reflektierten Signale und f&#252;hrt sie dem LNB zu.F&#252;r den Empfang von ASTRA und Hot Bird ben&#246;tigen Sie lineare LNBs, also Konverter welche mitvertikaler und horizontaler Polarisation arbeiten. Die Umschaltung zwischen diesen beidenPolarisationsebenen erfolgt dabei durch eine Schaltspannung, 14 Volt f&#252;r die vertikale und18 Volt f&#252;r die horizontale Polarisation. Die oben erw&#228;hnte Umschaltung zwischen Ober- undUnterband geschieht durch eine auf die Schaltspannung aufmodulierte Schaltfrequenz von 22 kHzdurch die das Oberband aktiviert wird. Ohne die Schaltfrequenz ist das Unterband aktiv, wodurches m&#246;glich ist an solchen LNB's auch &#228;ltere Receiver zu betreiben, die dann nat&#252;rlich nur dieProgramme empfangen k&#246;nnen die im Unterband senden. Beachten Sie bitte beim Kauf eines LNB'sdarauf das Sie ein Universal-LNB erwerben, da derzeit auch noch LNB'sangeboten werden, welche nur das Unterband empfangen k&#246;nnen. Wichtig sind Universal-LNB's zumEmpfang des digitalen Fernsehens, da nur bei diesen die f&#252;r MPEG 2 notwendige Frequenzstabilit&#228;t
garantiert ist.<BR>
F&#252;r Universal-LNB gibt es drei Varianten die es zu unterscheiden gilt:
</P>
<OL>
<LI><FONT SIZE="4" COLOR="Fuchsia">Single Universal LNB</FONT><BR>
Besitzt einen Ausgang und ist f&#252;r den Anschluss eines einzigen Receivers gedacht.
</LI>
<LI><FONT SIZE="4" COLOR="Fuchsia">Twin Universal LNB</FONT><BR>
Besitzt zwei Ausg&#228;nge zum Betrieb von zwei Empf&#228;ngern, welche voneinander unabh&#228;ngig betrieben
werden k&#246;nnen.
</LI>
<LI><FONT SIZE="4" COLOR="Fuchsia">Quatro Universal LNB</FONT><BR>
Dieses LNB wird nicht direkt mit der 22 kHz Schaltfrequenz angesteuert. Vielmehr werden die
Signale der verschiedenen Polarisationsebenen &#252;ber vier Ausg&#228;nge getrennt zu einemMultischalter gef&#252;hrt und von dort aus an die einzelnen Receiver einer Mehrteilnehmeranlageverteilt.
</LI>
</OL>
<P>Sollten Sie eine &#228;ltere Empfangsanlage mit einem Universal-LNB aufr&#252;sten wollen, gilt es denDurchmesser des Feedhorns zu beachten an dem das LNB befestigt wird. Allgemein &#252;blich sind dabeiDurchmesser von 23 mm und 40 mm, seltener 60 mm. Einige Hersteller (z.B.: Kathrein, Astro) vonSatellitenanlagen haben den Haltearm f&#252;r das LNB jedoch so konstruiert, das nur die LNB aus dem eigenenHause passen, was f&#252;r den Kunden dieser Fabrikate bedeutet das er fast den doppelten Preis daf&#252;r
berappen darf.
</P>
<HR>
</TD>
</TR>
</TABLE></CENTER>
</BODY>
</HTML>