<HTML>
<HEAD>
<TITLE>AHG - Multifeed</TITLE>
</HEAD>
<BODY BACKGROUND="../BACK/Offset.jpg" TEXT="000000" BGCOLOR="c0c0c0">
<CENTER><TABLE BORDER="0" ALIGN="center" WIDTH="98%">
<TR>
<TD>
<HR>
<P ALIGN="center"><FONT SIZE="5" COLOR="Blue">Multifeedanlagen</FONT></P>
<P><FONT COLOR="Black" SIZE="3" FACE="Times New Roman">Eine Multifeed-Anlage ist eine Satelliten-Anlage, die mehrere dicht nebeneinander liegende Satelliten zugleich mit nur einer Sch&#252;ssel empf&#228;ngt. Zur Erweiterung des Astra-Programmangebots eignen sich besonders die leistungsstarken Hot Bird-Satelliten auf der Position 13&#176; Ost.<BR>
Multifeed beruht auf einer physikalischen Eigenschaft von Parabolspiegeln. Der Antennenreflektor hat eine Fl&#228;chenform, bei der die parallel zur Achse einfallenden Strahlen vollst&#228;ndig in einen Punkt, den sogenannten Brennpunkt  des Paraboloiden, reflektiert werden. Dabei gilt der physikalische Grundsatz:
<B>Einfallswinkel = Ausfallswinkel</B>. Folglich treffen, nicht achsenparallel einfallende Strahlen, sich nicht mehr in diesem <I>Brennpunkt</I>.
Schwenkt man die einfallenden Strahlen langsam aus der Achsenrichtung des Paraboloiden, wandert der <I>Brennpunkt</I> unter Aufl&#246;sungserscheinungen in die entgegengesetzte <A HREF="Multbild.htm">Richtung</A>. Also verh&#228;lt sich ein Parabolspiegel  &#228;hnlich wie ein Brennglas, 
in dem allerdings der <I>Brennpunkt</I> auf der Seite liegt, die der Einstrahlung abgewandt ist.<BR>
Wird an der Satellitenantenne, im Bereich au&#223;erhalb des exakten Brennpunktes, ein zweites LNB montiert, <I>schielt</I> es gewisserma&#223;en im Vergleich zum zentralen LNB. Es kann dabei nicht die volle Fl&#228;che der Sch&#252;ssel genutzt werden, deshalb empfiehlt es sich, die Sch&#252;ssel eine Nummer gr&#246;&#223;er zu w&#228;hlen als bei der Einzelanlage, also mindestens 85 cm (besser 100 cm). Wenn man von einem Richtungsversatz absieht, ist die Richtcharakteristik der Antenne &#228;hnlich derjenigen, die mit dem exakt im Brennpunkt montierten Speisesystem erzielt wird. Das Schwenken der Hauptkeule nutzt man also zum Ausrichten der Antenne auf zwei oder mehrere Satelliten. Ausgerichtet wird die Anlage immer auf den schw&#228;chsten Satelliten,    beim Empfang von Astra und Hot Bird also auf 13&#176; Ost.  Die LNB's werden an einen Receiver mit zwei Antenneneing&#228;gen  angeschlossen. Bei Mehrteilnehmeranlagen wird <A HREF="diseqc.htm">DiSEqC</A> zur Ansteuerung verwendet, was nat&#252;rlich vorraussetzt das Receiver und Multiswitch daf&#252;r geeignet sind. </FONT></P>
<HR>
</TD>
</TR>
</TABLE></CENTER>

</BODY>
</HTML>