<HTML>
<HEAD>
<TITLE>DiSEqC - Das digitale Steuerungssystem</TITLE>
</HEAD>
<BODY LINK="#0000ff" VLINK="#800080" BACKGROUND="../BACK/AHG.jpg">

<CENTER><TABLE BORDER="0" ALIGN="center" WIDTH="98%">
<TR>
<TD VALIGN="MIDDLE">
<HR>
<FONT SIZE="5" COLOR="#0000ff">
<P ALIGN="CENTER">DiSEqC </P>
</FONT>
<P>Sowohl auf <B>Astra</B> als auch auf <B>Hot Bird</B> wird seit Mitte der neunziger Jahre zunehmend das <I>High Band </I>zur Ausstrahlung von Programmen f&#252;r den Direktempfang verwendet. F&#252;r Einzelanlagen gibt es Receiver mit zwei Antenneneing&#228;ngen und 22 kHz-Schaltung, mit denen der Empfang problemlos m&#246;glich ist. Schwieriger war das bislang wenn nur ein Kabel zum Satellitenreceiver verlegt werden sollte oder eine Mehrteilnehmeranlage zu erstellen war. Nun ist die Verteilung sowohl des <I>Low Bands</I> als auch des <I>High Bands</I> von beiden Satellitensystemen  mittels DiSEqC (Digital Satellite Equipment Control) auf einfache Weise m&#246;glich. DiSEqc wurde von <B>Philips</B> und <B>Eutelsat</B> gemeinsam entwickelt und steht allen Herstellern von Empfangsger&#228;ten als offener Standard zur Verf&#252;gung. Dieses neue Steuersystem nutzt die 22 kHz-Technik, indem auf diesen Tr&#228;ger digitale Telegramme aufmoduliert werden. Empfangen und ausgewertet werden diese digitalen Telegramme vom DiSEqC-f&#228;higen Multiswitch oder LNB. DiSEqC-Multischalter und -LNB k&#246;nnen nur durch Satellitenreceiver mit DiSEqC angesteuert werden. Unterschieden werden derzeit die nachfolgend aufgelisteten DiSEqC-Versionen:</P>
<TABLE BORDER="0" ALIGN="DEFAULT" WIDTH="100%">
<TR>
<TD WIDTH="5%"><B> </B></TD>
<TD WIDTH="15%"><B> </B></TD>
<TD ALIGN="CENTER" WIDTH="80%"><B> </B></TD>
</TR>
<TR>
<TD ALIGN="CENTER" COLSPAN="2"><FONT COLOR="Maroon">DiSEqC 1.0</FONT></TD>
<TD></TD>
</TR>
<TR>
<TD></TD>
<TD COLSPAN="2">Durch DiSEqC 1.0 k&#246;nnen bei, bis zu vier verschiedene Satellitenantennen, die beiden Polarisationsebenen und die beiden Frequenzb&#228;nder angesteuert werden. Es gibt bereits viele Satellitenreceiver und Multischalter die DiSEqC 1.0 ausger&#252;stet sind.</TD>
</TR>
<TR>
<TD ALIGN="CENTER" COLSPAN="2"><FONT COLOR="Maroon">DiSEqC 2.0</FONT></TD>
<TD></TD>
</TR>
<TR>
<TD></TD>
<TD COLSPAN="2"> Durch DiSEqC 2.0 k&#246;nnen bei, bis zu vier verschiedene Satellitenantennen, die beiden Polarisationsebenen und die beiden Frequenzb&#228;nder angesteuert werden. Zus&#228;tzlich gibt es eine Art R&#252;ckkanal, &#252;ber den Informationen von der Antennenanlage, wie beispielsweise die Oszillatorfrequenzen der verschiedenen LNB's oder deren Anzahl,  an den Receiver zur&#252;ckfliessen. Auch wird es m&#246;glich drehbare Antennen nur &#252;ber das Koaxialkabel anzusteuern. </TD>
</TR>
<TR>
<TD ALIGN="CENTER" COLSPAN="2"><FONT COLOR="Maroon">DiSEqC 2.1</FONT></TD>
<TD></TD>
</TR>
<TR>
<TD></TD>
<TD COLSPAN="2"></TD>
</TR>
<TR>
<TD ALIGN="CENTER" COLSPAN="2"><FONT COLOR="Maroon">DiSEqC 3.0</FONT></TD>
<TD></TD>
</TR>
<TR>
<TD></TD>
<TD></TD>
<TD></TD>
</TR>
</TABLE>



</TD>
</TR>
</TABLE></CENTER>
<P>
ffffffffffffffffff




</P>
<P>ersetzt die herk&#246;mmlichen Schaltkriterien 14/18 Volt und 22 kHz und hebt deren Beschr&#228;nkungen auf maximal 4 Schaltzust&#228;nde auf. </P>
<P ALIGN="JUSTIFY">Bisher waren f&#252;r die Umschaltungen von Polarisationsebene, Satellitenwahl oder f&#252;r die Steuerung einer drehbaren Antenne ganz unterschiedliche Signale erforderlich. Damit ist jetzt Schlu&#223;: EUTELSAT hat gemeinsam mit Philips ein zukunftsweisendes digitales System entwickelt. Sein Name: DiSEqC (Digital Satellite Equipment Control). DiSEqC kann eine Vielzahl von Steuer- und Schaltfunktionen &#252;bernehmen und nutzt dabei den ohnehin in jedem Satellitenreceiver vorhandenen Mikroprozessorchip.</P>
<P>DiSEqC arbeitet mit digitalen Schaltsignalen, die auf einen 22 KHz Tr&#228;ger aufmoduliert werden. Somit lassen sich alle 8 Eing&#228;nge eines DiSEqC-Multischalters ansteuern. F&#252;r die terrestrischen Frequenzen, also UKW und VHF/UHF-Fernsehen, ist ebenfalls ein Eingang vorgesehen. Das DiSEqC-System ist in seinem Vollausbau bidirektional ausgelegt, z.B. meldet ein Schalter seinen aktuellen Schaltzustand an den Receiver. Bis es soweit ist, vergeht wohl noch einige Zeit.</P>
<P>&nbsp;</P>
<P>DiSEqC-Multischalter k&#246;nnen nur durch Satellitenreceiver mit DiSEqC gesteuert werden. Mit heutigen Satellitenreceivern, die an solchen Anlagen betrieben werden sollen, sind einige Einschr&#228;nkungen in der Programmauswahl hinzunehmen. Die komplette DiSEqC-Technik wird erst im Laufe des Jahres auf den Markt kommen.</P>
<P ALIGN="JUSTIFY"><B><FONT FACE="Xerox Sans Serif Wide" SIZE="2">So funktioniert DiSEqC<BR>
		</FONT></B><FONT FACE="Xerox Sans Serif Narrow" SIZE="3"><BR>
	</FONT>    </P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">Bislang arbeiten Satellitenreceiver eher konzeptionslos, wenn es um die Steuerung von Peripherieger&#228;ten und Anlagenteilen geht: 13/17 V f&#252;r die Wahl der Polarisationsebene, in &#228;lteren Anlagen elektrische oder magnetische Polarizer, 22 kHz f&#252;r die Anwahl des Satelliten, diverse Steuersignale in drehbaren Anlagen -</P>
<P ALIGN="JUSTIFY">Verwirrung ist vorprogrammiert. Hinzu kommt, da&#223; die bisherige Technik kaum noch weitere Schaltm&#246;glichkeiten zul&#228;&#223;t - so etwa beim Empfang von mehreren Satellitensystemen, wobei jeweils auch</P>
<P ALIGN="JUSTIFY">noch auf High- und Low-Band umgeschaltet werden mu&#223;.</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P>F&#252;r das neu entwickelte DiSEqC-System ist dies alles kein Problem mehr, Grenzen bei den Schaltm&#246;glichkeiten werden aufgehoben und zudem die Umschaltung in einer Satellitenempfangsanlage erheblich vereinfacht. DiSEqC nutzt die 22 kHz-Technik, indem auf diesen Tr&#228;ger digitale Telegramme aufmoduliert werden. Wie eine Kommandozentrale &#252;bernimmt der in jedem Satellitenreceiver eingebaute Mikroprozessor die zentrale Steuerfunktion (Master). Weitere digitale Schaltkreise, die dieser Mastereinheit untergeordnet sind, werden in die zu steuernden Ger&#228;te<FONT FACE="Xerox Sans Serif Narrow" SIZE="3"> e</FONT>ingebaut. Hauptaufgabe des Systems ist es, auf einfache Weise Umschaltungen vorzunehmen. Die digitale Technik bietet aber noch mehr: Peripherieger&#228;te teilen ihrerseits dem Masterchip Funktion und Zustand mit. Daraus ergeben sich f&#252;r den Konsumenten weitere Vorteile: Die Bedienung und Programmierung eines Satellitenreceivers wird wesentlich vereinfacht. Dar&#252;ber hinaus registriert die zentrale Steuerung Fehlfunktionen und informiert den Nutzer dar&#252;ber. Die Parameter von DiSEqC wurden k&#252;rzlich endg&#252;ltig festgelegt und stehen allen interessierten Herstellern von Empfangsger&#228;ten als offener Standard zur<BR>
Verf&#252;gung. Es wird erwartet, da&#223; bereits im n&#228;chsten Jahr erste Empfangsanlagen auf den Markt kommen, die nach dem DiSEqC-System arbeiten.</P>

<P>DiSEqC steuert alles</P>
<P>	Bisher waren f&#252;r die Umschaltungen von Polarisationsebene, Satellitenwahl oder f&#252;r die Steuerung einer drehbaren Anlage ganz unterschiedliche Signale erorderlich. Damit ist jetzt Schlu&#223;.Eutelsat entwickelte gemeinsam mit Philips ein digitales System,genannt DiSEqC (Digital SatelliteEquipment Control), das eine Vielzahl von Steuer- und Schaltfunktionen &#252;bernehmen kann und dabei den ohnehin in jedem Satellitenreceiver vorhandenen Mikrocomputerchip nutzt.<BR>
13/18 V f&#252;r die Wahl der Polarisationsebene, in &#228;lteren Anlagen elektrische oder magnetische Polarizer, 22 kHz f&#252;r die Anwahl des Satelliten, diverse Steuersignale in drehbaren Anlagen - reichlich verwirrend und eher konzeptionslos arbeiten heutzutage Satellitenreceiver, wenn es um die Steuerung von Peripherieger&#228;ten und Anlagenteilen geht. Hinzu kommt, da&#223; diese Technik kaum noch weitere Schaltm&#246;glichkeiten zul&#228;&#223;t - so etwa beim Empfang von zwei Satellitensystemen, wo jeweils auch noch auf High- und Low-Band umgeschaltet werden soll. Das neu entwickelte DiSEqC-System kennt hier keine Grenzen mehr und vereinfacht zudem dieUmschaltungen in einer Satellitenempfangsanlage erheblich. Es nutzt die 22-kHz-Technik, indem auf diesen Tr&#228;ger digitale Telegramme aufmoduliert werden. Die zentrale Steuerfunktion(Master) &#252;bernimmt der in jedem Satellitenreceiver eingebaute Mikrocomputer. Weitere dieser Mastereinheit untergeordnete digitale Schaltkreise sind in den zu steuernden Ger&#228;ten eingebaut.<BR>
Hauptaufgabe des System ist es zwar, auf einfache Weise Umschaltungen vorzunehmen, die digitale Technik bietet aber noch mehr. So teilen die Peripherieger&#228;te ihrerseits dem Masterchip Funktion und Zustand mit. Daraus ergeben sich f&#252;r den Konsumenten weitere Vorteile: Die Bedienung und Programmierung eines Satellitenreceivers wird wesentlich einfacher, indem  beispielsweise die Oszillatorfrequenz des Empfangskonverters nicht mehr eingegeben werden mu&#223;, sondern vom System selbst erkannt wird. Dar&#252;ber hinaus registriert die zentrale Steuerung Fehlfunktionen und kann korrgierend eingreifen.<BR>
Im DiSEqC-System lassen sichinsgesamt acht Eing&#228;nge steuern. Neben den &#252;blichen Umschaltungen, wie Polarisationsebene, Polarizer oder Satellitensystem, kann damit auch eine drehbare Anlage bedient werden - DiSEqC ist abw&#228;rtskompatibel. Das bedeutet, da&#223; &#228;ltere,  mit 22-kHz-Umschaltung ausger&#252;stete,  Ger&#228;te weiterhin benutzt werden<BR>
  k&#246;nnen, allerdings ohne die  Schaltm&#246;glichkeiten von DiSEqC.<BR>
 Die Parameter von DiSEqC
  wurden k&#252;rzlich endg&#252;ltig festgelegt und stehen allen interessierten Firmen als offener Standard<BR>
	 zur Verf&#252;gung. Es ist damit zu  rechnen, da&#223; erste DiSEqC-Empfangsanlagen im Fr&#252;hjahr 1996  auf den Markt kommen.</P>
</BODY>
</HTML>