<HTML>
<HEAD>
<TITLE>AHG - Satelliten</TITLE>
</HEAD>
<BODY BACKGROUND="../BACK/Sat3.jpg">

<CENTER><TABLE BORDER="0" ALIGN="center" WIDTH="95%">
<TR>
<TD>
<HR>
<P ALIGN="center"><FONT SIZE="5">Die Satelliten</FONT>
</P>
<P>Im Prinzip stellen die modernen <A HREF="Satall.htm">Kommunikationssatelliten</A> nichts anderes als Funkt&#252;rme am Himmel
dar, die im Gegensatz zu denen auf der Erde, eine bedeutend gr&#246;ssere Fl&#228;che versorgen k&#246;nnen.<BR>
Damit man diese <A HREF="Satbild.htm" TARGET="_self">Satelliten</A> mit einfachen, festinstallierten Antennen empfangen kann, m&#252;ssen sie
von der Erde aus gesehen, stets an der gleichen Stelle am Himmel stehen. Das wird erreicht,indem die Satelliten in 36.000 Kilometer H&#246;he, direkt &#252;ber dem &#196;quator positioniert, sichsynchron mit der Umdrehungsgeschwindigkeit der Erde auf ihrer Umlaufbahn bewegen. Ist dies der
Fall dann stehen die k&#252;nstlichen Erdtrabanten f&#252;r einen Betrachter auf der Erde immer an der
gleichen Stelle, man spricht von geostation&#228;ren Satelliten. Die genaue Position l&#228;&#223;t sich durcheinen H&#246;henwinkel (Elevation) und L&#228;ngenwinkel (Azimut) beschreiben. Dies gilt f&#252;r alleFernsehsatelliten und die meisten Telekommunikationssatelliten, die im geostation&#228;ren Orbitpositioniert sind.<BR>
Bevor die Satelliten &#252;berhaupt TV- und Radioprogramme ausstrahlen k&#246;nnen, m&#252;ssen sie von den
<A HREF="Uplink.htm" TARGET="_self">Bodenstationen</A> (Erdfunkstellen) mit Diesen versorgt werden. Die Bodenstation, peilt mit einergrossen Parabolantenne einen Satelliten an und sendet durch das im Brennpunkt der Sch&#252;sselangebrachte Speisesystem die Programme exakt geb&#252;ndelt ins Weltall (Uplink). Der Satellitschickt die Signale, nach Verst&#228;rkung und Konvertierung in den vorgesehenen Frequenzbereich
wieder zur Erde zur&#252;ck (Downlink), allerdings geschieht dies mit einer relativ geringerenSendeleistung, die sich zudem auf ein sehr gro&#223;es Gebiet, die Ausleuchtzone (Footprint) verteilt.Daher ist hochwertige Empfangstechnik auf der Erde gefragt, damit die sehr schwachenSatellitensignale ohne St&#246;rungen zu empfangen sind. In den Footprints sind die Satelliten miteiner bestimmten Antennenmindestgr&#246;&#223;e zu empfangen. Sie betr&#228;gt in Mitteleuropa zum Empfangvon ASTRA zirka 60 Zentimeter, f&#252;r den Empfang der Hot Bird Satelliten von EUTELSAT sollte man70 Zentimeter vorsehen. Zu den R&#228;ndern der Ausleuchtzonen werden die Signale schw&#228;cher, und esm&#252;ssen dann gr&#246;ssere Antennen montiert werden. Die Betreiber der Satelliten geben Prospekteheraus in denen die <A HREF="Ausleucht.htm" TARGET="_self">Ausleuchtzonen</A> f&#252;r die jeweiligen Satelliten grafisch dargestellt sind.<BR>
So wie die terrestrisch ausgestrahlte Radio- und Fernsehprogramme, werden auch die &#252;ber Satellitgesendeten Programme mit Hilfe elektromagnetischer Wellen transportiert, nur geschieht dies ineinem anderen, weitaus h&#246;heren Frequenzbereich. Terrestrische Programme nutzen Frequenzen von47 bis 862 MHz, Satellitenprogramme solche von 10.700 bis 12.750 MHz, entsprechend 10,7 bis12,75 GHz (1 GHz = 1.000 MHz).In Mitteleuropa k&#246;nnen Sie derzeit Satelliten von etwa dreizig Positionen, zwischen 80&#176; Ost und 40&#176; West,empfangen . Interressant f&#252;r den deutschsprachigen Raum, sind von diesen ganzen Satelliten,nur noch die zwei Satellitensysteme, mit denen sich auch dieses Dokument besch&#228;ftigt - ASTRA auf 19,2&#176; Ost und EUTELSAT Hot Bird auf 13&#176; Ost. Beide Satelliten lassen sich,  dank ihrer nahe beieinanderliegenden Positionen, bequemmit einer <A HREF="multi.htm">Multifeedanlage</A> empfangen. Durch die ASTRA-Satelliten werden die meistendeutschsprachigen Fernsehprogramme, frei und unverschl&#252;sselt ausgestrahlt. Leider ist das beim
&#252;berwiegenden Teil der fremdsprachigen Programme nicht so, diese sind bis auf wenige Ausnahmen
&#252;ber ASTRA nur verschl&#252;sselt zu empfangen. Anders ist dies bei den Satelliten des HotBird-Systems auf denen uns auch sehr viele freiempfangbare fremdsprachige Programme erreichen,welche einen recht guten Einblick in die Kultur anderer L&#228;nder gestatten. Sollten Sie nur an dendeutschsprachigen Programmen Interesse besitzen, so sind Sie bei Hot Bird ebenfalls gut bedient,da hier einige Programme zu finden sind die nicht &#252;ber ASTRA ausgestrahlt werden.
</P>
<HR>
</TD>
</TR>
</TABLE></CENTER>
</BODY>
</HTML>