<html>
<body background="../../images/fondtexte2.jpg"  border="0">
<a name="haut"</a>
<a href="31villesetcodepostaux.html#t"target="description"><font color="brown">Toulouse</font></a> (Altitude : de 115 &agrave; 263 m)
<pre>   
<hr>
 D&eacute;partement : <a href="entetehautegaronne.html"Target="description">Haute-Garonne </a>           R&eacute;gion : <a href="../entetemidipyrene.html"Target="description">Midi-Pyr&eacute;n&eacute;es</a>

Code Postaux : 31 000, 31 100, 31 200, 31 300, 31 400 et 31 500

   Habitants : 443 103 Toulousains (en 2007)
  Superficie : 118,30 Km2 

   Situation : &agrave; 6 Km <a href="blagnac.html"target="description">Blagnac</a>, 21 km <a href="muret.html"target="description">Muret</a>, 91 km <a href="saintgaudens.html"target="description">Saint-Gaudens</a>,
               112 Km <a href="stbertrandco.html"target="description">St-Bertrand-de-Comminges</a> 

      Climat : temp&eacute;r&eacute; doux d'automne au printemps et assez chaud et sec en &eacute;t&eacute;. 

     Plus... :
<hr>
</pre>

<table>
<tr>
<td>
<a href="basiliquestcerninjpg.html"><img src="images/basiliquestcernin.jpg" ALT="La basilique" width="53" height="82" border=0</a><br>
</td>
<td>
<b>La Basilique Saint-Sernin :</b> (11&egrave;me-13&egrave;me si&egrave;cle)<br>
<br>
Cette &eacute;glise romane, la plus vaste d'occident, renferme les reliques du martyr Saint Saturnin.<br>
</td>
</tr>
</table>
<br><br>
<b> Le mus&eacute;e Saint-Raymond :</b><br>
<br>
Le mus&eacute;e pr&eacute;sente l'une des plus riches collections de sculptures antiques d'Europe (avec une galerie exceptionnelle de portraits romains), mais pas seulement, puisqu'il pr&eacute;sente &eacute;galement des monnaies antiques et la ville antique de Tolosa.<br>
<br><br> 
<b>La cath&eacute;drale Saint-&Auml;tienne :</b> (13&egrave;me-18&egrave;me si&egrave;cle)<br>
<br><br>
<b>Le Capitole :</b> (16&egrave;me-19&egrave;me si&egrave;cle)<br>
<br>
Il accueil aujourd'hui l'H&ocirc;tel de Ville et le Th&eacute;&acirc;tre National du Capitole.<br>
Sa fa&ccedil;ade et ses 8 colonnes de marbre rose, sa cour Henri IV (t&eacute;moin de l'assassinat du Duc de Montmorency) et la
"Salle des Illustres" inspir&eacute;e par la Galerie Farn&egrave;se de Rome.<br>
<br><br>
<b>L'H&ocirc;tel d'Ass&eacute;zat :</b> (&eacute;difi&eacute; au 16&egrave;me si&egrave;cle)<br>
<br><br>
<b>L'H&ocirc;tel de Clary :</b> (16&egrave;me-17&egrave;me si&egrave;cle)<bR>
<br><br
<b>L'H&ocirc;tel du vieux raisin :</b> (16&egrave;me si&egrave;cle)<br>
<br><br>
<b>L'&eacute;glise et le clo&icirc;tre des Jacobins :</b> (16&egrave;me si&egrave;cle)<br>
<br><br>
<b>L'&eacute;glise Notre-Dame-de-la-Dalbade :</b> (16&egrave;me si&egrave;cle).<br>
<br>
Sur sa fa&ccedil;ade on peut voir une reproduction (de Gaston Virebent) en c&eacute;ramique du couronnement de la vierge (de Fra Ang&eacute;lico) datant de 1874.<br>
<br><br>
<b>Le Z&eacute;nith de Toulouse :</b> (2&egrave;me salle de France apr&egrave;s Paris-Bercy)<br>
<br>
Une architecture en forme de vaisseau orbital, m&ecirc;lant l'aluminium et le verre, cette salle propose 9 000 places au public...<br>
<br><br>
<b>L'&eacute;glise de la Daurade :</b> (19&egrave;me si&egrave;cle)<br>
<br>
Et son &eacute;tonnante Vierge Noire !<br>
<br><br>
<b>L'&eacute;glise Notre-Dame-du-Taur :</b> (14&egrave;me si&egrave;cle)<br>
<br><br>
<b>Le mus&eacute;e des Augustins :</b><br>
<br><br>
<a name="espace"</a>
<b>La Cit&eacute; de l'espace :</b> (sur 3,5 hectares) <br>
<br>
Plongez-vous au coeur de la conqu&ecirc;te spatiale, simuler le lancement d'une fus&eacute;e, devenez spationaute, effectuez une mission dans l'espace, ou encore observez la terre &agrave; bord d'un engin spatial ( 2.000 m2 d'expositions th&eacute;matiques).<br> 
On peut voir la Fus&eacute;e Ariane V sur son pas de tir, la Station MIR et un plan&eacute;tarium...<br>
<br><br>
<b>Le mus&eacute;e des Augustins :</b> (Install&eacute; depuis 1793 dans le couvent des Augustins)<br>
<br>
il offre l'un des plus beaux ensembles monastiques des 14&egrave;me et 15&egrave;me si&egrave;cles. Fonds unique au monde de sculptures romanes il pr&eacute;sente &eacute;galement une collection d'oeuvres de Rodin, Camille Claudel et Maillol. Ainsi que des toiles de Manet, Toulouse-Lautrec, Vuillard et Manguin...<br>

<br><br>
<b>La Fondation Bemberg :</b><br>
<bR><br>
<b> Le mus&eacute;e Georges Labit (Mus&eacute;e des Arts Asiatiques) :</b><br>
<br><br>
<b>Le mus&eacute;e Paul Dupuy (Mus&eacute;e d'Art du Languedoc) :</b><br>
<br>
Et ses collections d'horlogerie, de cabinets de m&eacute;trologie et d'arts graphiques...<br> 
<br><br>
<b>Les Abattoirs (Espace d'Art Moderne et Contemporain) :</b><br>
<br>
Une collection qui compte 2000 oeuvres, peintures, gravures, photographies... <br>
<br><br>
<b>Le Centre National de Calcul de M&eacute;t&eacute;o-France :</b><bR>
<br>
 Install&eacute; &agrave;  Toulouse depuis 1982.<br>
<br><br>
<A HREF="#haut">Haut de page</A>
</html>
