<html>
<head>
<title>Amiga C Kurs f&uuml;r Einsteiger</title>
<META NAME="description" CONTENT="Amiga C Kurs f&uuml;r Einsteiger">
<META NAME="keywords"    CONTENT="C, Amiga, Programmierung, Kurs, Einsteiger, StormC">
<META NAME="author"      CONTENT="Norman Walter">

<script language="JavaScript" src="JavaScript/C-Kurs_Kapitel.js" type="text/javascript">
</script>

</head>
<body bgcolor="black" link="#DDDDDD" vlink="#BBBBBB">
<center>
<TABLE>
<TD VALIGN="TOP" ALIGN="TOP" WIDTH="140">
<CENTER>
<A HREF="index.html" NAME="Home"><IMG SRC="Home.png" ALT="Home" BORDER="0"></A><BR>
<A HREF="download.html" NAME="Downloads"><IMG SRC="Download.png" ALT="Downloads" BORDER="0"></A><BR>
<A HREF="Links.html" NAME="Links"><IMG SRC="Links.png" ALT="Links" BORDER="0"></A><BR>
<a href="cgi-bin/GB_SHOW.cgi" method="POST"><img SRC="guestbook.png" BORDER=0 alt="Guestbook"></a>
<p>
<A HREF="http://www.norman-interactive.com/email_feedback.html">
<IMG SRC="@.png" Border="0" Alt="e-mail"><BR><small>e-mail</small></A><BR>
<p>

<img src="C-Kurs/C-Kurs_sm.png" alt="Amiga C Kurs f&uuml;r Einsteiger" vspace="20"><BR>

<NOSCRIPT>
<font color="red">
Diese Seite ben&ouml;tigt JavaScript.
Entweder Ihr Browser unterst&uuml;tzt kein JavaScript, oder Sie haben es deaktiviert.
</font>
</NOSCRIPT>

<SCRIPT LANGUAGE="JavaScript">
<!--

  erzeuge_Kapitel(1);

//-->
</SCRIPT>

<p>
</CENTER>
</TD>
<TD VALIGN="TOP" ALIGN="TOP" WIDTH="400" HEIGHT="600">
<center>
<p>
<BR>
<font color="white">

<img src="C-Kurs/C-Kurs.png" alt="Amiga C Kurs f&uul,r Einsteiger"><BR>
</center>
<p>
<font color="gray"><H2>Erste Schritte</H2></font><BR>
<p>
Wir wollen mit einer kurzen Einf&uuml;hrung in die Entwicklerumgebung
StormC beginnen.
<p>
Nachdem Sie StormC gestartet haben erscheint eine kleine Leiste auf dem Bildschirm.<BR>
<p>
<center>
<img src="C-Kurs/StormC_Leiste.png" alt="Leiste"><BR>
</center>
<p>
Fahren Sie mit dem Mousepointer &uuml;ber die Icons. Es erscheint ein Hilfetext im
unteren Bereich des Fensters, der die Bedeutung der einzelnen Icons erkl&auml;rt.
<p>
Klicken Sie nun auf das Icon "Neues Projektfenster &ouml;ffnen".
Es &ouml;ffnet sich nun der sogenannte Projekt-Assistent.
W&auml;hlen Sie bei "Projekt-Typ" "C-Programm" aus. Tragen Sie in das Feld
"Name" "HelloWorld" ein. Klicken Sie jetzt das Datei-Auswahl Icon im Feld
"Projekt Schublade" an. Es &ouml;ffnet sich nun ein Requester.
W&auml;hlen Sie das Lauferk oder die Partition (z.B. Work:) aus, wo Ihr Projekt
gespeichert werden soll. Legen Sie nun eine neue Schublade an. W&auml;hlen Sie dazu
"Neue Schublade anlegen..." aus dem Pull Down Men&uuml; unter "Steuerung" aus.
Geben Sie nun einen Namen f&uuml;r die neue Schublade an, z.B. "C-Kurs".
<p>
<center>
<img src="C-Kurs/Projekt-Assistent.png" Alt="Projekt-Assistent">
</center>
</center>
<p>
Wenn Sie alle Felder ausgef&uuml;llt haben, klicken Sie auf "Ok".
Es erscheint ein Requester. Best&auml;tigen Sie mit "Erzeugen".
<p>
<center>
<img src="C-Kurs/Systemmeldung.png" alt="Systemmeldung">
</center>
<p>
Nun &ouml;ffnet sich automatisch das Projektfenster.
Das Projektfenster erm&ouml;glicht es auf einfache Weise, alle zu
einem Projekt dazgeh&ouml;rigen Dateien zu verwalten. Unter "Quelltext"
ist eine - momentan noch leere - Datei Namens "HelloWorld.c" eingetragen.
In "Programm" steht der Name des ausf&uuml;hrbaren Programms.
Unter "Bibliotheken" stehen die Bibliotheken, die zu dem ausf&uuml;hrbaren
Programm dazugelinkt werden. Dieser Teil interessiert uns im Moment noch nicht.
Es sollte standardm&auml;&szlig;ig "storm.lib" und "amiga.lib" eingetragen sein.
<p>
<center>
<img src="C-Kurs/Projektfenster.png">
</center>
<p>
Klicken Sie nun im Projektfenster unter "Quelltexte" auf "HelloWorld.c".
Es &ouml;ffnet sich nun ein leeres Editor-Fenster. Damit im Editor bestimmte
Schl&uuml;sselw&ouml;rter farbig markiert werden, w&auml;hlen wir aus dem
Pulldown-Men&uuml; "Einstellungen/Text" aus. W&auml;hlen das Feld "Farbmarkierungen"
aus und setzen Sie die H&auml;ckchen wie auf diesem Bild:
<p>
<center>
<img src="C-Kurs/Texteinstellungen.png" "Texteinstellungen">
</center>
<p>
Best&auml;tigen Sie mit "Benutzen".
<p>
Jetzt k&ouml;nnen wir unser erstes C-Programm in das Editor-Fenster eingeben.
Wir fangen mit einem einfachen "Hello, World!" an.
<p>
<center>
<img src="C-Kurs/HelloWorld.png" alt="Hello, World!">
</center>
<p>
Alles was zwischen <TT>/*</TT> und <TT>*/</TT> steht, geh&ouml;rt zum Kommentar und wird bei der
&Uuml;bersetzung des Programms ignoriert. Man sollte im Quelltext immer dazuschreiben,
um was es sich handelt. Kommentare k&ouml;nnen auch im Programmtext gesetzt werden.
Dies ist besonders hilfreich, wenn man nach l&auml;ngerer Zeit wieder einen alten Code
betrachtet, oder wenn man einen Quelltext weitergibt.
<p>
Mit der Zeile <TT>#include &lt;stdio.h&gt;</TT> wird die Header-Datei f&uuml;r die Standard Ein- und Ausgabe
eingebunden. Diese Header Datei enth&auml;t sogenannte Funktionsprototypen. Was das ist,
werden wir zu einem sp&auml;teren Zeitpunkt besprechen. Sie sollten Sich f&uuml;r den Moment
nur merken, da&szlig; diese Zeile immer ben&ouml;tigt wird, wenn man Textein- oder Ausgaben benutzt.
<p>
Was nun folgt, ist das Hauptprogramm. Wir wollen uns hier an den ANSI-Standard f&uuml;r C halten,
deshalb ist dem Schl&uuml;sselwort "main" der <a href="C-Kurs_Datentypen.html">Datentyp</a> <TT>int</TT> vorangestellt.
In einem C-Programm mu&szlig; stets eine Hauptfunktion Namens <TT>main</TT> vorkommen.
In C wird immer der Datentyp des R&uuml;ckgabewerts einer Funktion dem Funktionsnamen vorangestellt.
Im Falle der main-Funktion ist dies nach ANSI-Standard der Datentyp int, das bedeutet Integer (= Ganzzahl).
Nach der Funktionsbezeichnung <TT>main</TT> sehen wir in runden Klammern ein weiteres Schl&uuml;sselwort, n&auml;mlich
<TT>void</TT>, was soviel bedeutet wie "nichts". In C wird bei der Deklaration der Funktion nach dem Funktionsnamen
in runden Klammern angegeben, welche Parameter die Funktion hat und von welchem Datentyp diese sind
(dazu werden wir noch sp&auml;ter kommen). Im Fall unseres "HelloWorld" m&uuml;&szlig;en keine Parameter &uuml;bergeben werden,
deshalb steht hier void (= nichts).
<p>
Alles, was zwischen den geschweiften Klammern steht, geh&ouml;rt zu unserer main-Funktion.
Bei unserem einfachen Beispiel sind das nur zwei Zeilen. In der ersten Zeile rufen wir
die Funktion <TT>printf</TT> mit Parameter "Hello, World!" auf. Die Funktion "printf" dient dazu,
einen String (= Zeichenfolge) auf der Console auszugeben. Der Inhalt eins solchen Strings
steht zwischen Anf&uuml;hrungszeichen. Ein Funktionsaufruf wird in C immer mit Semikolon abgeschlossen.
In der n&auml;chsten Zeile verlassen wir die Funktion <TT>main</TT> schon wieder. Als R&uuml;ckgabewert setzten wir 0,
was im Fall von <TT>main</TT> bedeutet, da&szlig; das Programm ohne Fehler beendet wurde. Wir merken uns f&uuml;r sp&auml;ter vor,
da&szlig; man die main-Funktion auch mit einem anderen Wert verlassen kann, um dem Betriebssystem Fehler
zu signalisieren.
<p>
Jetzt wollen wir aus unserem Quelltext ein ausf&uuml;hrbares Programm erzeugen.
Klicken Sie dazu in der Programmleise auf das Icon "Projekt &uuml;bersetzen und starten".
Wenn Sie alles richtig gemacht haben, wird das Programm &uuml;bersetzt und gestartet und es
erscheint ein kleines Consolen-Fenster mit der Textausgabe.
<p>
<center>
<img src="C-Kurs/Storm_Console.png" alt="Storm_Console">
</center>
<p>
Falls Sie sich vertippt haben sollten, erscheint ein Fehler-Fenster, welches Ihnen
genau zeigt, in welcher Zeile der Fehler liegt und was Sie falsch gemacht haben.
<p>
</TD>
</TABLE>

</body>
</html>
