<html>
<body  background="../images/fondtexte2.jpg">
District austral : <font color="brown">Archipel Crozet</font>
<pre>     
<hr>
  Territoire <a href="../enteteoutremer.html"target="description">Outre-Mer</a> : <a href="../taaf/taaf.html"Target="description">Les T.A.A.F.</a>

Les &icirc;les de l'archipel : &icirc;le de la Possession&nbsp;(environ 150 km2, culmine &agrave; 934 m),&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
&nbsp;&nbsp;                       &icirc;le de l'Est&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(environ 130 km2, culmine &agrave; 1050 m),
&nbsp;&nbsp;                       &icirc;le des Pingouins&nbsp;&nbsp;&nbsp; (environ 3 km2, culmine &agrave; 340 m),
&nbsp;&nbsp;                       &icirc;le aux Cochons&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (environ 67 km2, culmine &agrave; 826 m),
&nbsp;&nbsp;                       &icirc;lots des Ap&ocirc;tres&nbsp;&nbsp;&nbsp; (environ 2 km2, culmine &agrave; 289 m).
 
             Habitants : les 20 scientifiques de la base permanente !

            Superficie : 350 Km2
            
             Situation : dans l'oc&eacute;an Indien, &agrave; 1098 km de Marion,
                         1475 km de Kerguelen, 2262 km de Saint-Paul,
                         2318 km d'Amsterdam, 2915 km de la R&eacute;union...


                Climat : oc&eacute;anique, tr&egrave;s humide et frais.

                  Plus : la base permanente -> Alfred Faure (altitude 131 m) sur 
                         l'&icirc;le de la Possession
<hr>
</pre>
<b>1772 :</b> Marion Dufresne d&eacute;couvre l'archipel !<br>



 et est li&eacute; &agrave; l'&eacute;volution g&eacute;n&eacute;rale de l'oc&eacute;an Indien.<br> 
<br>
Le plateau de Crozet orient&eacute; WNW-ESE (approximativement 1200 km x 600 km) 
se compose de deux ensembles :<br> l'un &agrave; l'Ouest et immerg&eacute;e (-500 m / -3000 m ; -50 Ma)
l'autre &agrave; l'Est (500 km x 600 km) comportant une zone orientale avec les stratovolcans
 des &icirc;les de la Possession (-9 Ma &agrave; actuel) et de l'Est (-10 Ma/-0.1 Ma), s&eacute;par&eacute;e
 par une d&eacute;pression d'une zone occidentale d'o&ugrave; &eacute;mergent les &icirc;les des Pingouins (-1 Ma),
 des Cochons (-0.4 Ma/actuel) et des Ap&ocirc;tres (-5.5 Ma /-2.5 Ma). Il est as&eacute;ismique et
 surmonte un plancher oc&eacute;anique dat&eacute; du Cr&eacute;tac&eacute; sup&eacute;rieur (-70 Ma / -80 Ma) par les 
anomalies magn&eacute;tique 31 (N) et 33 (S).<br>
<br>
Les &eacute;v&eacute;nements les plus anciens des &icirc;les oc&eacute;aniques de l'archipel de Crozet 
(&icirc;les de la Possession, de l'Est, des Pingouins, aux Cochons, des Ap&ocirc;tres) 
remontent &agrave; environ 10 millions d'ann&eacute;es pour l'&icirc;le de l'Est ...<br>
<br>
L'&icirc;le de l'Est , outre les basaltes alcalins contenant des enclaves ultrabasiques et basiques  montre des faci&egrave;s plutoniques issus d'une diff&eacute;renciation magmatique par cristallisation fractionn&eacute;e...<br>
<br>
Le stratovolcan de l'&icirc;le de la Possession s'est &eacute;difi&eacute; en 5 phases volcaniques <br>
- la formation du substratum du volcan (cendres et pyroclastites de
 la s&eacute;rie des Moines)<br>
- entre -9 et -2 millions d'ann&eacute;es la constitution 
du stratovolcan a&eacute;rien (coul&eacute;es et produits d&eacute;tritiques et complexe filonien). 
Apr&egrave;s une p&eacute;riode d'&eacute;rosion et de remaniement des mat&eacute;riaux pr&eacute;c&eacute;dents, se mettent
 en place, &agrave; l'ouest<br> 
- des filons radiaires (-1 Ma) et (4) des basaltes de 
plateau (-0.5 Ma). Apr&egrave;s les glaciations et les ph&eacute;nom&egrave;nes d'&eacute;rosion se manifeste<br>
- un volcanisme explosif accompagn&eacute; d'une tectonique cassante<br>
<br>
Le stratovolcan de l'&icirc;le aux Cochons s'est &eacute;difi&eacute; &agrave; partir de deux phases volcaniques :<br>
- la 1&egrave;re (-0.4 Ma -0.2 Ma), donne br&egrave;ches volcaniques et coul&eacute;es magmatiques<br> 
- la 2&egrave;me (-0.2 Ma &agrave; actuel), d&eacute;bute par des effondrements puis se poursuit par des 
  coul&eacute;es de lave tr&egrave;s fluide, des &eacute;ruptions violentes avec projections de bombes et
  de petites pierres...<br>
<br>
L'&icirc;le des Pingouins repr&eacute;sente les restes du flanc d'un volcan &eacute;merg&eacute;, mis en place
il y a environ 1 million d'ann&eacute;es.<br>
<br>
Le stratovolcan des Ap&ocirc;tres n'est plus repr&eacute;sent&eacute; que par des &icirc;lots, t&eacute;moins du flanc
 du volcan effondr&eacute; !<br>      
 <br>
</body>
</html>

