<html>
<body  background="../images/fondtexte2.jpg">
<a name="a"></a>
<table>
<tr>
<td>
District austral : Archipel Kerguelen
</td>
<td>
 <a href="cartekerguelen.html"target="description"><img src="images/iconkerguelen.jpg" alt="la carte de l'Archipel de Kerguelen" border="0"</a>
</td>
</tr>
</table>
<hr>
Territoire <a href="../enteteoutremer.html"target="description">Outre-Mer</a> : <a href="taaf.html"target="description">TAAF</a><br>
<pre>
          Superficie :

           Situation :
<hr>
</pre>
<b>13 f&eacute;vrier 1772 :</b> Yves Joseph de Kerguelen de Tr&eacute;marec d&eacute;couvre l'archipel<br>
<br>
 Les &icirc;les Kerguelen (de nature volcaniques) sont situ&eacute;es dans l'oc&eacute;an Indien. 
L'archipel se compose d'une grande &icirc;le (La Grande Terre : 6700 km&sup2;) et de nombreuses
&icirc;les et &icirc;lots (550 km&sup2;).<br>
<br>
les &icirc;les Kerguelen, ont un climat de type subantarctique.<br>
<br>
Une cote tr&egrave;s d&eacute;coup&eacute;e avec de nombreuses presqu'&icirc;les, des barri&egrave;res naturelles et 
des provinces g&eacute;ologiques diverses, d&eacute;finissent des r&eacute;gions aux paysages vari&eacute;s.<br>
<br>
La v&eacute;g&eacute;tation y est rase, non arbor&eacute;e (vents violents > 200 km/h).<br>
<br>
La faune end&eacute;mique comprend des mammif&egrave;res marins (c&eacute;tac&eacute;s, delfinid&eacute;s, pinnip&egrave;des,
otaries) et de nombreux oiseaux (manchots, albatros, ...). <br>
Certaines esp&egrave;ces terrestres introduites se sont bien acclimat&eacute;es : <br>
<br>
 - le lapin (introduit au XIX&egrave;me si&egrave;cle volontairement pour fournir de la nourriture
en cas de naufrage), pr&eacute;sent partout dans l'archipel sauf dans certaines &icirc;les (dont
 l'&icirc;le de l'Ouest et les &icirc;les Nuageuses). Sa concentration est relativement faible
 &agrave; l'ouest et au nord de la grande terre.<br>
<br>


 - les souris et les rats (introduits accidentellement, sans doute au XIX&egrave;me si&egrave;cle),
 pr&eacute;sent partout dans l'archipel sauf dans certaines &icirc;les (dont l'&icirc;le de l'Ouest et
 les &icirc;les Nuageuses).<br>
<br>

 - le chat domestique, introduit volontairement sur la base dans les ann&eacute;es 50, &agrave; 
l'origine pour chasser les rats de Port-aux-Fran&ccedil;ais. Un seul couple est l'origine
 de la population actuelle. Pr&eacute;sence sur la grande terre, sauf dans l'ouest et le
 nord (p&eacute;ninsules Rallier-du-Baty et Loranchet).<br>
<br>


 - le renne, introduit volontairement dans les ann&eacute;es 50. Pr&eacute;sence &eacute;parse sur la
 grande terre. Les individus vivent en troupeaux plus ou moins importants (jusqu'&agrave;
 plusieurs centaines d'individus observ&eacute;s). Les opinions sur l'impact &eacute;cologique de
 cette esp&egrave;ce sur l'archipel sont assez contradictoires.<br>
<br>


 - le mouflon de Corse, introduit volontairement dans les ann&eacute;es 50. Pr&eacute;sent 
uniquement sur une &icirc;le du golfe du Morbihan (l'&icirc;le Haute) sur laquelle l'impact
 sur la v&eacute;g&eacute;tation et l'&eacute;rosion est important.<br>
<br>


 - le mouton, introduit volontairement dans les ann&eacute;es 50. Pr&eacute;sent uniquement sur
 deux &icirc;les du golfe du Morbihan (l'&icirc;le Longue et l'&icirc;le aux Moules). L'impact de
 l'esp&egrave;ce sur la v&eacute;g&eacute;tation est important (pr&eacute;sence de gramin&eacute;es par exemple).
 Les moutons sur l'&icirc;le longue sont exploit&eacute;s pour fournir de la nourriture sur les
 bases.<br>
<br>


En dehors des mammif&egrave;res, les autres esp&egrave;ces introduites sont les truites de mer
 dans les rivi&egrave;res de la grande terre (impact n&eacute;gligeable puisqu'il n'y a pas 
d'esp&egrave;ces locales de poisson d'eau douce), plusieurs esp&egrave;ces d'insectes, de 
plantes et de champignons.<br>
<br>


       
<a name="p"></a>
<table>
<td>
<A HREF="#a"<font color="#FF0000">haut de page</font> </A><br>
</tD>
<td>
<center>
<img src="images/ileskerguelen.jpg">
</center>
</td>
</tr>
</table>

 
</body>
</html>

