<html>
<body background="../images/fondtexte4.jpg">


Territoire <a href="../enteteoutremer.html"target="description">Outre-Mer</a> : <font color="brown">T.A.A.F.</font> (Terres Australes et Antarctiques Fran&ccedil;aises)
<pre>
<hr>
 4 districts : <a href="ilessaintpauletamsterdam.html"target="description">&icirc;les Saint-Paul et Amsterdam</a>, <a href="archipelcrozet.html"target="description">l'archipel Crozet</a>,
               <a href="archipelkerguelen.html"target="description">l'archipel Kerguelen</a> (ou &icirc;les de la D&eacute;solation)
               <a href="laterreadelie.html"target="description">la Terre Ad&eacute;lie</a> 

  Superficie : 432 000 Km2
   Habitants : uniquement habit&eacute;s par le personnel des missions scientifiques 
               (120 personnes en tout)

      Climat : Les sites polaires consistent en espaces de glaciers illimit&eacute;s.
               Les districts insulaires offrent des sites d&eacute;sol&eacute;s &agrave; la 
               v&eacute;g&eacute;tation rare.

   Situation : &agrave; 4 000 Km de l'Afrique et de l'Australie et &agrave; 2 000 Km de la
               banquise antarctique.

        Plus : la philat&eacute;lie (les TAAF disposent d'&eacute;missions de vignettes qui 
               leur sont propres)
<hr>


La vie locale est r&eacute;duite &agrave; la vie confin&eacute;e de techniciens isol&eacute;s pendant de
longs mois dans leur univers conditionn&eacute;...
Quand au tourisme, c'est &agrave; bord du Marion-Dufresne, l'un des navires(120 m de
long) de la flotille nationale qu'il faut embarquer, pour avoir la chance de
voir les importantes colonies d'albatros, p&eacute;trels et manchots qui se regroupent
sur certaines &icirc;les...
<table>
<tr>
<td>
<a href="manchots.html"><img src="images/m_royaux4.jpg" width="54" height="82" border="0"</a>
</td>
<td>
<a href="nurserie_royaux1jpg.html"><img src="images/nurserie_royaux1.jpg" width="119" height="82" border="0">
</td>
<td>
<a href="m_papou4jpg.html"><img src="images/m_papou4.jpg" width="129" height="81" border="0">
</td>
</tr>
</table>
<b>Histoire</b>

 La seconde guerre mondiale mit en &eacute;vidence l'int&eacute;r&ecirc;t strat&eacute;gique des quelques 
terres du sud de l'Oc&eacute;an Indien et la n&eacute;cessit&eacute; d'y &eacute;tablir des stations
 m&eacute;t&eacute;orologiques.

<b>Le 6 ao&ucirc;t 1955 :</b> cr&eacute;ation les Terres Australes et Antartiques (TAAF) qui 
                 deviennent Territoire sp&eacute;cial d'Outremer.

          <b>1959 :</b> Trait&eacute; de l'Atlantique concernant le statut particulier 
                 de l'Antartique qui devient aire internationale libre, r&eacute;serv&eacute;e
                 aux travaux et exp&eacute;ditions scientifiques internationaux, &agrave;
                 l'exclusion de toute activit&eacute; industrielle et commerciale.

          <b>1972 :</b> les TAAF sont associ&eacute;s &agrave; l'Union Europ&eacute;enne (hors la 
                 comp&eacute;tence des zones de p&ecirc;che.) 

   <b>Depuis 1978 :</b> la France d&eacute;tient l'exclusivit&eacute;e du domaine maritime 
                 autour des Terres Australes soit 1 750 000 km2...<br>

          <b>1996 :</b> l'administration des TAAF est fix&eacute;e &agrave; Saint-Pierre de
                 La R&eacute;union. Elle est g&eacute;r&eacute;e par un Administrateur sup&eacute;rieur, un
                 Conseil consultatif, un Comit&eacute; scientifique, un Comit&eacute; de 
                 l'Environnement polaire. 

Une flotte de 6 navires est affect&eacute;e aux dessertes des scientifiques
 (2 transporteurs, 3 militaires et 1 vedette oc&eacute;anographique).

La p&ecirc;che (grands poissons glaciaires (l&eacute;gine), le saumon, le krill, crustac&eacute; de
haute mer,et les algues abondantes) constitue la presque totalit&eacute; de l'&eacute;conomie... 

 </pre>   
<br><br><br><br><br><br>


 
 
</body>
</html>