<HTML>
<HEAD>
<TITLE>Space 2063</TITLE>
</HEAD>

<BODY TEXT="#FFFFFF" BGCOLOR="#000000" LINK="#FFFF00" VLINK="#00FFFF" ALINK="#C0FFC0" BACKGROUND="stars.gif">

<BR>
<CENTER><FONT SIZE=+2><FONT COLOR="#FFFF00"><B><U>Vanessa Damphousse</U></B></FONT></FONT></CENTER>
<BR><BR>
<TABLE WIDTH=100% BORDER=0 COLS=3>
<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Rang:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>First Lieutenant, 58th Squadron, US Marine Corps</B></FONT></TD>
<TH COLSPAN=1 ROWSPAN=7 WIDTH=300 VALIGN=CENTER><IMG SRC="pics/damphousse.jpg" BORDER=0 ALT="Lanei Chapman alias Vanessa Damphousse"></TH>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Rasse:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>Afroamerikanerin</B></FONT></TD>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Alter:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>23 Jahre</B></FONT></TD>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Heimatstadt:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>New York</B></FONT></TD>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Wildcards-Rufnahme:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>Ace of Hearts (Herz Ass)</B></FONT></TD>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Seriennummer:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>943-20-02419</B></FONT></TD>
</TR>

<TR>
<TH COLSPAN=2 ALIGN=LEFT VALIGN=TOP><B><FONT SIZE=+3>V</FONT></B><FONT SIZE=+1>anessa verbrachte vier Jahre auf der Cal Tech und studierte Ingeneurswissenschaften. Ihr Vater war Chefingeneur in einer Nuklearanlage. Dadurch erwachte ihr Interessa an diesem Beruf. Da sie auch an seiner Seite arbeitete und ihn in mehreren Sommern unterst&uuml;tzte, gewann sie fr&uuml;h Erfahrung. Sie ist der T&uuml;ftler unter den Marines - sie wei&szlig;, wie man Ger&auml;te zusammenbaut und auseinandernimmt und kann so aus mancher Patsche helfen. Au&szlig;erdem ist sie eine Anlaufstelle f&uuml;r ihre Kameraden, immer offen, gutgelaunt, unparteiisch. Die anderen nennen sie ironisch &quot;damn fool&quot; (verdammte N&auml;rrin), weil sie es nicht aufgegeben hat, nach dem Sinn des Lebens zu suchen.</FONT></TH>
</TR>

</TABLE>

<HR WIDTH="100%" NOSHADE SIZE=1 COLOR=#FFFFFF>

<BR>
<FONT SIZE=+1><B>Mit viel Energie und Leidenschaft machen sie sich daran ihre Ziele zu verwirklichen. Wer? Vanessa Damphousse - und Lanei Chapman!</B></FONT>
<BR><BR>
<FONT SIZE=+1>Lanei kam in Los Angeles zur Welt. Sie hat drei Br&uuml;der und bekam fr&uuml;hzeitig Kontakt zur Welt des Films - sie spielte in Werbespots. Ihr Deb&uuml;t hatte sie mit 13 in einem Clip f&uuml;r &quot;Kentucky Fried Chicken (Kentucky schreit Ficken???)&quot;. Doch auch wenn ihre Eltern sie zu manchem Casting schleppten, bestanden sie genauso beharrlich darauf, da&szlig; sie nebenbei ordentlich f&uuml;r die Schule lernte.</FONT>
<BR>
<FONT SIZE=+1>Keine Frage, da&szlig; sich Lanei auf dem Dartmouth College in New Hampshire sofort f&uuml;r jeden Schauspielkurs einschrieb. Sie machte nicht nur einen Abschlu&szlig; in Spanisch, sondern schrieb auch ihr erstes Theaterst&uuml;ck <B>HOME RUN</B>, mit dem sie sogar den dritten Preis des des Annual Short Play-Wettbewerbs in Los Angeles gewinnen konnte. Es wurde inspiriert davon, wie sie als kleines M&auml;dchen den Tod ihres Gro&szlig;vaters verarbeiten mu&szlig;te.</FONT>
<BR>
<FONT SIZE=+1>Wieder zu Hause, wurde sie von der Los Angeles Cultural Short Play Competition gefragt, ob sie es nicht selbst inszenieren wollte. Sie wollte schon, aber wie? Ihre Tante wu&szlig;te Rat, kannte sie doch eine Schauspielerin namens Chip Fields, der das St&uuml;ck prompt zugeschickt wurde. Ihr gefiel es, und sie wollte die Rolle der Mutter &uuml;bernehmen und auch f&uuml;r den Rest der Besetzung sorgen. Ihre Tochter Kim schlug sie f&uuml;r die Enkelin vor.</FONT>
<BR>
<FONT SIZE=+1>Trotz eines Achtungserfolgs &uuml;bte Lanei nun erst mal ihren erlernten Beruf aus und arbeitete als Kinderg&auml;rtnerin. Als sie aber merkte, da&szlig; ihr das Spielen immer wichtiger wurde, wechselte sie auf die filmhochschule der University of Southern California, auf der sie drei Jahre lang sowohl Filmwissenschaft als auch Schauspiel studierte.</FONT>
<BR>
<FONT SIZE=+1>Dort produzierte das alleinstehende Multitalent auch den Kurzfilm <B>APEARANCES</N>, wieder mit Kim Fields in der Hauptrolle. Au&szlig;erdem spielte sie in Kinofilmen mit wie <B>WHITE MEN CAN&acute;T JUMP, PRETTY HATTIE&acute;S BABY</B> und <B>THE IMPORTANCE OF BEING EARNEST</B>, mini Serien wie <B>THE JACKSONS: AN AMERICAN DREAM</B> oder <B>THE SECRETS OF LAKE SUCCESS</B>, TV-Filmen wie <B>THE MARY THOMAS STORY</B> und hatte Gastrollen in den Serien <B>SEINFELD, CHINA BEACH, THE WONDER YEARS, TRUE COLORS</B> und <B>STAR TREK: THE NEXT GENERATION</B>.</FONT>
<BR>
<FONT SIZE=+1>Als Ensign Rager war sie in zwei Folgen an der Seite von Picard und co. zu sehen gewesen: <B>BESUCH VON DER ALTEN ENTERPRISE</B> (Ep. 130) und <B>IN DEN SUBRAUM ENTF&Uuml;HRT</B> (Ep. 131). &quot;Ich denke, ich sagte sieben Mal &acute;Aye, Sir&acute; in meiner ersten Episode&quot;, schmunzelt sie und schw&auml;rmt noch heute davon, was es ihr bedeutete, solchen Schauspielgr&ouml;&szlig;en wie Patrick Stewart, Jonathan Frakes oder Brent Spiner bei der Arbeit &uuml;ber die Schulter schauen zu k&ouml;nnen.</FONT>
<BR><BR>
<FONT SIZE=+1>Da winkte ihre gro&szlig;e Chance - wieder im All: Casting von <B>SPACE: ABOVE AND BEYOND</B>. Beim Vorsprechen traf Lanei zum ersten mal auf Kristen Cloke, die mit ihr denselben Agenten teilt. Ironie des Schicksals, da&szlig; beide Anw&auml;rterinnen engagiert wurden. Doch bis dahin war es f&uuml;r Lanei ein langer Weg: zuerst das Vorsprechen vor FOX-Talenttester Randy Stone (Begeisterung!), dann vor Regisseur David Nutter (Begeisterung!), nun vor den Produzenten Wong &amp: Morgan (Begeisterung!), schlie&szlig;lich das nervenaufreibende Finale vor den Verantwortlichen des Senders (Begeisterung!). Jetzt endlich auch bei Lanei Chapman: Begeisterung!</FONT>
<BR>
<FONT SIZE=+1>Am Anfang war ihre Rolle noch recht klein. Im Pilotfilm war sie kaum mehr als eine Stichwortgeberin, aber trotzdem war sie von Anfang an als Dauerrolle vorgesehen. Beim Vorsprechen mu&szlig;te sie, obwohl si sich f&uuml;r Damphousse gemeldet hatte, S&auml;tze von Shane Vansen sprechen, da nicht genug Dialoge von Damphousse vorlagen. Das war schwierig f&uuml;r Lanei, weil die S&auml;tze eng mit Shanes Charakter verbunden waren, aber sie konnte so ihr grunds&auml;tzliches Talent zeigen.</FONT>
<BR>
<FONT SIZE=+1>Bald wurde ihr klar, wie sehr die Autoren bei einer Serie die Rolle den Schauspieleren auf den Leib zu schreiben versuchen. W&auml;hrend des Pilotfilms war sie zwar nicht allzu besch&auml;ftigt, wurde vom Morgan und Wong aber in viele Gespr&auml;che verwickelt. Schon in der ersten Episode merkte sie, wie ihr bis dahin offener Seriencharakter sich ver&auml;ndert hatte. Elemente ihres eigenen Charakters waren eingeflossen und hatten Vanessa Damphousse zu einer Fiktion von Lanei Chapman geformt. So hatte Lanei das Problem, da&szlig; sie die Uni und die Filmerei unter einen Hut bringen mu&szlig;te, prompt kam auch Damphousse frisch von der &quot;Schul&quot;bank.</FONT>
<BR>
<FONT SIZE=+1>Da&szlig; der Pilotfilm in Australien gedreht wurde, verschaffte ihr Heimweh, aber auch eine starke Identit&auml;t mit Vanessa Damphousse, die ebenfalls weit weg von zu Hause war. Es schweifte die ganze junge Crew zusammen, denn da sie ihrer Freunde und ihres anderen Umfelds beraubt waren, besch&auml;ftigten sie sich notgedrungen miteinander. So verhielten sich Darsteller und Rollen in gewisser Weise identisch.</FONT>
<BR>
<FONT SIZE=+1>Man wurde zu einer gro&szlig;en Familie. Nat&uuml;rlich gibt es auch da Differenzen, aber der gegenseitige Respekt lie&szlig; eine Diskussion nie in eine barsche Auseinandersetzung abgleiten. Besonders Kristen Cloke wurde ihr eine gute Freundin - zumal, wenn sich die drei m&auml;nnlichen Kollegen in eine Art Herrenclub zur&uuml;ckzogen - und half Lanei ihre onehin hohe Telefonrechnung (Lanei nach Hause telefonieren!) nicht die ganze Gage auffressen zu lassen.</FONT>
<BR>
<FONT SIZE=+1>Als die Serie in Kalifornien weitergedreht wurde, erledigte sich das Problem mit dem Heimweh, und Lanei hatte auch wieder ein bi&szlig;chen Gelegenheit, sich ihren anderen Interessen zu widmen und belegte einen Kurs, in dem sie das Drehbuchschreiben erlernte.</FONT>
<BR><BR>
<FONT SIZE=+1>Auch wenn ihr Engagement bei den Space Marines mittlerweile wieder aufgel&ouml;st ist, hat Lanei doch wichtige Erfahrungen f&uuml;r sich verbuchen k&ouml;nnen. Als sie das erste Mal bei Au&szlig;enaufnahmen unter der sengenden australischen Sonne ihren Helm aufhatte, sich von dem metall bedr&auml;ngt f&uuml;hlte, schlecht h&ouml;rte, zu schwitzen anfing, von der Feuchtigkeit gepiesackt, von Atemnot gequ&auml;lt und von der Belastung niedergedr&uuml;ckt wurde und trotzdem stolz dastehen und spielen sollte, da erhielt sie unbezahlbare Lehrstunden im Konzentriertsein unter extremen Bedingungen.</FONT>
<BR>

<HR WIDTH="100%" NOSHADE SIZE=1 COLOR=#FFFFFF>

</BODY>
</HTML>
