<HTML>
<HEAD>
<TITLE>Space 2063</TITLE>
</HEAD>

<BODY TEXT="#FFFFFF" BGCOLOR="#000000" LINK="#FFFF00" VLINK="#00FFFF" ALINK="#C0FFC0" BACKGROUND="stars.gif">

<A CLASS="AN" NAME="TOP">
<BR>
<CENTER><FONT SIZE=+3><FONT COLOR="#FFFF00"><B><U>SPACE 2063 - ABOVE AND BEYOND</U></B></FONT></FONT></CENTER>
<BR><BR><BR>
<FONT SIZE=+1><B>Dies ist die dramatische Geschichte der &quot;Wildcards&quot; Nathan West, Shane Vansen, Cooper Hawkes, Vanessa Damphousse und Paul Wang, f&uuml;nf junge Piloten, die im Jahre 2063 unter Colonel Tyrus Cassius McQueen auf dem Raumschiff Saratoga Dienst tun. Sie haben keine Zeit, um friedlich neue Welten zu erforschen, denn die Erde befindet sich urpl&ouml;tzlich in einem furchtbaren intergalaktischen Krieg mit einer bisher unbekannten au&szlig;erirdischen Gro&szlig;macht, von der die Terraner nicht mehr wissen, als da&szlig; sie ihre Kolonien mitleidlos vernichten...</B></FONT>
<BR><BR>
<FONT SIZE=+1>Das ist die Grundlage der bisalng teuersten Science-Fiction-Serie der TV-Geschichte: <B>SPACE: ABOVE AND BEYOND</B>, die unter dem Titel <B>SPACE 2063</B> auch deutsche Wohnzimmer in Sch&uuml;tzengr&auml;ben verwandelte. Der US-Sender FOX hoffte, nach seiner Erfolgsserie <B>AKTE X</B> einen weiteren phantastischen Quotenrenner produzieren zu k&ouml;nnen. Um auf Nummer Sicher zu gehen bediente man sich auch gleich bei den <B>X-FILES</B>, um die besten Serienproduzenten zu bekommen.</FONT>
<BR>
<FONT SIZE=+1>Eine der bedrohlichsten X-Akten war ja <B>EIS</B>. Dieses klaustrophobische Kammerspiel, in dem das Personal einer Forschungsstation von au&szlig;erirdischen Parasiten befallen wird, machte Agent Mulders Devise &quot;Traue niemanden&quot; zum nervenzerfetzenden Zetralthema.</FONT>
<BR>
<FONT SIZE=+1>Verantwortlich f&uuml;r Drehbuch und Produktion dieses Fernseh-Juwels zeichneten sich die Produzenten Glen Morgan und James Wong, die als Autoren-Duo zwei wichtige St&uuml;tzpfeiler f&uuml;r die Qualit&auml;t von <B>AKTE X</B> waren. Doch w&auml;hrend der zweiten Staffel stiegen beide aus - gerade, als die Serie enen &quot;GOLDEN GLOBE&quot; kassiert hatte!</FONT>
<BR>
<FONT SIZE=+1>Denn eine andere Aufgabe war Ihnen noch verlockender erschienen: das All nach eigenen Vorstellungen zu formen, zu besiedeln und zu zerst&ouml;ren - in einer eigenen Weltraumserie! Ein Jahr zuvor war FOX BROADCASTING mit diesem Angebot an sie herangetreten. Die Chefin des Senders wollte nach dem Welterfolg von <B>STAR TREK - THE NEXT GENERATION</B> auch eine Weltraum-Show in ihren Reihen haben. Der Wunsch der Dame hie&szlig; <B>TOP GUN</B> im Weltall.</FONT>
<BR><BR><BR>




<A CLASS="AN" NAME="A1"><CENTER><FONT SIZE=+2><FONT COLOR="#FFFF00"><U>DAS KONZEPT</U></FONT></FONT></CENTER>
<BR><BR>
<FONT SIZE=+1>Morgan und Wong verzogen den mund. Eine Space Opera, das sagte ihnen schon zu, aber nicht als oberfl&auml;chlicher Heldenjubel, sondern als d&uuml;steres Kriegsdrama. Die beiden hatten n&auml;mlich nicht eine weitere positive Zukunftsvision &agrave; la <B>STAR TREK</B> oder <B>BABYLON 5</B> im SInn, sondern eine harsche Schauerm&auml;r &uuml;ber Angst und Terror, bei der sie sich auf den klassischen Antikriegsfilm <B>IM WESTEN NICHTS NEUES</B>, die episch-melancholischen Soldaten-Western eines John Ford, die epische Zweiter-Weltkriegs-Serie <B>COMBAT!</B>, die &auml;u&szlig;erst zerm&uuml;rbende Tauchfahrt <B>DAS BOOT</B> oder die angstdurchweichte Kriegsstimmung von <B>ALIEN</B> berufen wollten.</FONT>
<BR><BR>
<FONT SIZE=+1><B>SPACE</B> sollte wie <B>AKTE X</B> eine Serie werden, die mit Furcht und Entsetzen spielt, die langsam Abgr&uuml;nde sichtbar macht, das Grauen vorsichtig lokalisiert, nur allm&auml;hlich dem Zentrum des Schreckens n&auml;her kommt. <B>SPACE 2063</B> sollte das Kriegsdrama und -trauma der Zukunft werden und dabei genau wie die legend&auml;ren Kavallerie-Western von John Ford (<B>BIS ZUM LETZTEN MANN, DER TEUFELSHAUPTMANN, DER SCHWARZE FALKE</B>) auch Probleme der Gegenwart reflektieren, nur da&szlig; die Weite des Westens durch die Tiefe des Weltalls und die barbarischen Indianer durch fremdartige Au&szlig;erirdische ersetzt w&uuml;rden.</FONT>
<BR>
<FONT SIZE=+1>Trotzdem war klar, da&szlig; die Bedingungen des Senders zum Teil erf&uuml;llt werden mu&szlig;ten, weshalb man wie in <B>TOP GUN</B> junge Rekruten, die von der Ausbildung an die Front gelangten, in den Mittelpunkt stellte. Man w&auml;hlte f&uuml;r die Wildcards bewu&szlig;t einen Mix aller Rassen, ohne auf irgendwelche rassischen Differenzen einzugehen. Die sollten als &uuml;berwunden dargestellt werden, um dem Zuschauer - egal ob gelb, schwarz, wei&szlig; oder rot - v&ouml;llige Gleichheit zu signalisieren.</FONT>
<BR>
<FONT SIZE=+1>V&ouml;llige? Nicht ganz! Um trotzdem eine Rassenproblematik ins Konzept zu bekommen, erschuf man sich k&uuml;nstliche Menschen, sogenannte In Vitros, die abf&auml;llig und beleidigend auch &quot;Tanks&quot; genannt werden. Ein Konflikt, der ja ebenfalls in der Gegenwart fu&szlig;t, da der Eingriff des Menschen in die &quot;Sch&ouml;pfung&quot; bereits heute hei&szlig; diskutiert wird.</FONT>
<BR>
<FONT SIZE=+1>Das Nebeneinander von echten und k&uuml;nstlichen Menschen spielt eine gro&szlig;e Rolle in <B>SPACE</B>. Das deutlichste Unterscheidungsmerkmal ist, da&szlig; die &quot;In Vitros&quot; ihren Nabel am Nacken haben. Sie werden durch k&uuml;nstliche Befruchtung gezeugt und wachsen in Brutk&auml;sten heran, bis sie das 18. Lebensjahr erreicht haben. Dann werden sie aus ihrem jahrelangen Schlaf erweckt. Da sie nie die z&auml;rtliche Bindung einer Familie oder eines Freundeskreises erfahren haben, sind sie gef&uuml;hllos, gleichg&uuml;ltig und egoistisch. Sie wurden vor allem geschaffen, um die gef&auml;hrlichen Als zu vernichten.</FONT>
<BR>
<FONT SIZE=+1>&quot;Al&quot; steht f&uuml;r &quot;Artifical Intelligence&quot - k&uuml;nstliche Intelligenz. Diese schon fr&uuml;her entwickelten Lebewesen sind eine Art Personal-Computer in menschlicher Gestalt, und verf&uuml;gen &uuml;ber gro&szlig;e k&ouml;rperliche Kraft. Urspr&uuml;nglich konnten sie nur abstrakte Denkprozesse nachempfinden, ohen selbst kreativ zu sein. Ein irrer Forscher aber gab ihnen durch einen Virus die M&ouml;glichkeit zu lernen, und sie lernten als erstes, da&szlig; sie nicht l&auml;nger Diener, sondern Herrn sein wollten und begehrten gegen die Menschen auf. Mord und Zerst&ouml;rung waren waren die Folge. Man schuf die &quot;In Vitros&quot;, um sie zu stoppen. Inzwischen sind diese dabei, sich Gleichberechtigung zu erk&auml;mpfen - aber im Gegensatz zu den Als nicht mit Feuer und Schwert!</FONT>
<BR><BR>
<FONT SIZE=+1>F&uuml;r <B>SPACE</B> wurden ausschlie&szlig;lich junge unbekannte Darsteller f&uuml;r die Hauptrollen engagiert. Sie erleichtern einem vorwiegend jungem Publikum die Identifikation mit den Helden. Viele der unverbrauchten Gesichter sollten durch die Serie sehr Popul&auml;r werden, vor allem Kristen Cloke, Rodney Rowland, Morgan Weisser, aber auch der &quot;Oldie&quot; James Morrison brachte viele Fan-Herzen zum Schmelzen.</FONT>
<BR>
<FONT SIZE=+1>Ob Menschen oder &quot;In Vitros&quot; - wichtig war f&uuml;r Morgan und Wong, da&szlig; es differenziert dargestellte Charaktere sind, die in der Armee aufeinandertreffen und wider alle Erwartung (es herrscht Frieden auf der Erde, au&szlig;erirdische Rassen sind keine bekannt) mit dem Tod konfrontiert werden, als kriegerische Aliens, die &quot;Chigs&quot;, auftauchen. Da viele Veteranen-Piloten in den ersten K&auml;mpfen verschlissen wurden, m&uuml;ssen die Greenhorns in die H&ouml;lle der Schlacht. Jeder hat einen schwarzen Fleck in seiner Vergangenheit, der sein weiteres Leben &uuml;berschattet.</FONT>
<BR>
<FONT SIZE=+1>Das Besondere an <B>SPACE</B> war, da&szlig; es sich stark von der unproblematischen, friedensseligen Zukunft des Raumschiffs Enterprise und seiner psychisch gefestigten Charaktere unterschied. Glen Morgan erkl&auml;rte dazu frech: &quot;Diese Serie ist eigentlich f&uuml;r meinen Dad. Mein Dad sagte n&auml;hmlich immer: &quot;Wei&szlig;t du, Sohn, ich m&ouml;chte wirklich gern <B>STAR TREK</B> anschauen - aber all die Kerle mit gro&szlig;en Ohren!&quot;&quot;</FONT>
<BR>
<FONT SIZE=+1>Morgan und Wong sahen ihre Serie auch gar nicht in erster Linie als Science Fiction sondern als Kriegsfilm. Da&szlig; es eine moderne Art von Kriegsfilm ist, bei der Frauen und M&auml;nner nebeneinander k&auml;mpfen und viel Abenteuer und auch Melodram reingemischt wird, anstatt nur martialische Szenen aneinanderzureihen, versteht sich. Die Produzenten nannten als eines ihrer Vorbilder die US-Serie <B>COMBAT!</B> &uuml;ber eine Einheit, die den Zweiten Weltkrieg &uuml;berstehen mu&szlig;.</FONT>
<BR>
<FONT SIZE=+1><B>COMBAT!</B> war ein TV-Hit, der vom 02.10.1962 bis zum 14.05.1967 lief - mit insgesamt 152 Episoden, die oft von bekannten Regisseuren inszeniert wurden und diverse popul&auml;re Gaststars hatten. Bei uns ist diese TV-Serie aus naheliegenden Gr&uuml;nden nie gelaufen, erz&auml;hlte sie doch die Geschichte einer US-Truppe, die 1944 in Frankreich einen t&auml;glichen &quot;Klein&quot;krieg gegen die deutsche Kriegsmaschinerie f&uuml;hrt.</FONT>
<BR>
<FONT SIZE=+1><B>COMBAT!</B> war keine kampfverherrlichende Action-Show, sondern darum bem&uuml;ht, Schrecken und Wahnsinn des Krieges in n&uuml;chternen Bildern festzuhalten. Es wurde aufgezeigt, wie Soldaten und Zivilisten als Spielball der M&auml;chtigen in ein Inferno aus Schmerz und Tod hineingezogen werden, in dem der nackte &Uuml;berlebenskampf bald nur noch die einzige Motivation ist.</FONT>
<BR>
<FONT SIZE=+1>Morgan, der den <B>X-FILES</B> noch mit einem halben Auge nachweinte, wollte die Perspektive des kleinen Soldaten zeigen, &quot;der mitten in der Schlacht die milit&auml;rischen Ziele aus den Augen verliert und nur noch daran denkt, sich und seine Freunde zu retten&quot;. Und James Wong wollte, da&szlig; sich der Zuschauer einmal fragt: &quot;Woran glaubst du eigentlich? Wof&uuml;r w&auml;rst du bereit dein Lebn zu opfern?&quot;</FONT>
<BR>
<FONT SIZE=+1>Glen Morgan meinte abschlie&szlig;end: &quot;<B>SPACE</B> ist wie <B>COMBAT</B> im All. Sicher werden auch einige Leute sagen, es sei wie Robert A. Heinleins Roman <B>STARSHIP TROOPERS</B> oder Joe Haldemans Roman <B>DER EWIGE KRIEG</B>, und das ist ganz o.k., denn das sind ja auch Science-Fiction-Kriegsgeschichten.&quot;</FONT>
<BR><BR>
<FONT SIZE=+1>Drehort des Pilotfilms war Australien. Den Pilot inszenierte David Nutter, ebenfalls ein alter Bekannter aus <B>AKTE X</B> (u.a. Regisseur von <B>EIS</B>), der allerdings im Gegensatz zu Morgan und Wong und zum anf&auml;nglichen &Auml;rger von <B>X-FILES</B>-Erfinder Chris Carter ohne rechtzeitige Vorank&uuml;ndigung aus der Hitserie ausgestiegen war.</FONT>
<BR>
<FONT SIZE=+1>Nutter mu&szlig;te im Fr&uuml;hjahr 1995 in sechs Wochen Drehzeit eine F&uuml;lle unterschiedlicher Sets bew&auml;ltigen: von einer Air-Force-Basis, auf der die Grundausbildung stattfand, bis zu hitzflirrenden Sabdd&uuml;nen in der W&uuml;ste, die den Mars repr&auml;sentierten. Die letzte und gr&ouml;&szlig;te Herausforderung war die finale Schlacht im Weltraum, bei der einiges an Blue-Screen-Arbeit anfiel.</FONT>
<BR>
<FONT SIZE=+1>Allerding fand bei <B>SPACE</B> die Blue Screen nur noch Verwendung, wenn Schauspieler in die Szene integriert waren, Dann sa&szlig;en sie z.B. in einem Cockpit, das vor einer blauen Wand stand, die sp&auml;ter mit dem Sternenhimmel gef&uuml;llt wurde. Alle reinen Raumschiff-Szenen hatten weder was mit fliegenden Modellen noch mit Blue Screen zu tun. Diese Effektaufnahmen kamen n&auml;mlich direkt aus der Hexenschmiede des Computers, sind also &quot;computer-generated-images&quot;, sogenannte CGIs.</FONT>
<BR>
<FONT SIZE=+1>Nutter war mit dem Pilot zu <B>SPACE</B> nur bedingt zufrieden. Da die Macher wechselnde Zugest&auml;ndnisse aus der FOX-Riege &uuml;ber sich ergehen lassen mu&szlig;ten, wurden immer wieder neue Priorit&auml;ten gesetzt: &quot;Die ersten wollten, da&szlig; der Pilotfilm ein milit&auml;risches Training zeigt, die n&auml;chsten mehr Gags und High Tech, und die letzten fanden, es sei zu wenig Drama drin.&quot; Aber Nutter war &uuml;berzeugt, da&szlig; sich diese Anlaufschwierigkeiten im Veraluf der Serie legen w&uuml;rden.</FONT>
<BR>
<FONT SIZE=+1>Als die FOX-Verantwortlichen einen Rohschnitt des Pilotfilms zu sehen bekamen, waren sie zu frieden mit dem spektakul&auml;ren Werk und orderten zw&ouml;lf weitere Episoden. Schlau wie sie waren, hatten Morgan und Wong im Pilotfilm die abenteuerlichen Sternenkriegselemente betont, die sich der Sender so w&uuml;nschte, und begannen erst im Verlauf der Serie den kampfesfrohen <B>TOP GUN</B>-Einflu&szlig; abzumildern und alles in D&uuml;sternis zu tauchen.</FONT>
<BR>
<FONT SIZE=+1>Nach dem O.k. machten sich Morgan und Wong daran, den Autoren- und Regisseure-Stab f&uuml;r <B>SPACE</B> zusammenszustellen. Jetzt stie&szlig; Marilyn Osborn hinzu, die nicht nur f&uuml;r den Fantasy-&Uuml;berraschungserfolg <B>EIN HAUCH VON HIMMEL</B> gearbeitet, sondern auch bereits die gelungene X-Akte <B>VERWANDLUNGEN</B> geschrieben hatte.</FONT>
<BR>
<FONT SIZE=+1>Zur Freude der Schauspieler, die im abgelegenen Australien ein von ihren Familien abgeschnittenes Dasein hatten f&uuml;hren m&uuml;ssen (was freilich ihrer authentischen Darstellung sehr zugute kam), wechselte man nun nach Los Angeles, da die weite Entfernung und die verschiedenen Zeitzonen die Arbeit an einer w&ouml;chentlichen Serie erschwert h&auml;tten. Die kompletten Sets wurden deshalb per Schiff nach L.A. transportiert, wo am 17.Juli 1995 die Dreharbeiten begannen.</FONT>
<BR><BR><BR>



<A CLASS="AN" NAME="A2"><CENTER><FONT SIZE=+2><FONT COLOR="#FFFF00"><U>DIE EFFEKTE</U></FONT></FONT></CENTER>
<BR><BR>
<FONT SIZE=+1>Nach dem Willen der Produzenten Morgan und Wong solle die Effekte von <B>SPACE 2063</B> durch eine atemberaubende Computer-Animation entstehen. Tricktechnisch sollte das Beste geboten werden. Dabei hatte alles in der K&uuml;che von Ken Stranahan begonnen. Der SFX-Spezialist besa&szlig; drei Computer, und sein Kollege Tim McHugh immerhin einen. Macht zusammen vier. Die stellten sie in Kens K&uuml;che und produzierten fast ein Jahr lang zwischen Kocht&ouml;pfen, Herdlappen und Geschirrschr&auml;nken aufwendige Spezialeffekte.</FONT>
<BR>
<FONT SIZE=+1>Stranahan und McHugh hatten sich bei der produktion des Pilotfilms von <B>SEAQUEST</B> kennengelernt. Als die Abenteuer des U-Boots als Serie weiterproduziert wurden, ging McHugh, der bereits bei <B>KAMPFSTERN GALACTICA</B> und <B>BUCK ROGERS</B> mitgetrickst hatte, von Bord, w&auml;hrend Stranahan f&uuml;r die gesamte erste Staffel anheuerte. Ein gutes Jahr sp&auml;ter kam McHugh wieder auf Stranahan zu, und kurz darauf taten sich die zwei zusammen und gr&uuml;ndeten ihre Effekteschmiede &quot;Area 51&quot;. (UFO-Kenner wissen, da&szlig; dieser Begriff ein strenggeheimes Regierungsgel&auml;nde in Nevada bezeichnet.)</FONT>
<BR>
<FONT SIZE=+1>Sie hatten bald ihre ersten Jobs, u.a. bei <B>DEEP SPACE NINE</B> und Clive Barkers <B>LORD OF ILLUSIONS</B>. Es dauerte nicht lange, da mu&szlig;ten sie aus der K&uuml;che raus und sich auch technisch und personell erweitern. Erst recht, als ihre Laufbahn durch die Beteiligung an <B>SPACE</B> gekr&ouml;nt wurde.</FONT>
<BR><BR>
<FONT SIZE=+1>Bei <B>SPACE 2063</B> war Ken Stranahan &quot;digital animation supervisor&quot;, Tim McHugh &quot;visual effects producer&quot; und ihr Kollege Glenn Campbell &quot;visual effects supervisor&quot;. McHugh und Campbell entschieden &uuml;ber das Ambiente der Serie und beeinflu&szlig;ten mit ihrer Arbeit auch die Rasanz der Action. Glenn Campbell mu&szlig;te als &quot;supervisor&quot; am Set anwesend sein, um die Dreharbeiten mit den Schauspielern zu &uuml;berwachen - vor allem, was Aufnahmen vor einer Blue Screen betrifft, jener blauen Wand, in die sp&auml;ter am Computer der tats&auml;chliche, aber k&uuml;nstlich erzeugte Hintergrund hineinkopiert wird. Campbell achtete darauf, da&szlig; das, was gedreht wird, sp&auml;ter mit dem Material der SFX-K&uuml;nstler am Computer kombinierbar ist.</FONT>
<BR>
<FONT SIZE=+1>Die f&uuml;hrenden K&ouml;pfe von &quot;Area 51&quot;, Ken Stranaham und Tim McHugh, wollten sich mit ihrer Arbeit von <B>BABYLON 5</B> absetzen, der anderen popul&auml;ren Serie, die einzig auf CGIs zur&uuml;ckgreift. Jeder Fan von Jerry Doyle oder Claudia Christian wei&szlig;, da&szlig; die <B>BABYLON 5</B>-CGIs etwas sehr K&uuml;nstliches an sich haben (wie ja &uuml;berhaupt die ganze Atmosph&auml;re der Station und die vielen skurrilen Aliens). Das pa&szlig;t zwar vorz&uuml;glich zu der intelligenten Spacecenter-Serie, h&auml;tte aber einer dunklen Schauerm&auml;r wie <B>SPACE</B> eher geschadet.</FONT>
<BR>
<FONT SIZE=+1>Darum gab es f&uuml;r die beiden SFX-K&uuml;nstler nur eins: DIe Effekte mu&szlig;ten so echt sein, da&szlig; sie geradezu photorealistisch wirken w&uuml;rden, d.h. obwohl sie am Computer gemacht werden, sollten sie so wirklichkeitsgetreu aussehen, da&szlig; sich der Zuschauer erstaunt an den Kopf fassen und murmeln w&uuml;rde: &quot;Wow, wo haben die das gedreht?&quot;</FONT>
<BR>
<FONT SIZE=+1>F&uuml;r die Rauchiffe mu&szlig;te &quot;Area 51&quot; eng mit Produktionsdesigner Bernhard Hides zusammenarbeiten, der das Design von Schiffen, Geb&auml;uden oder R&auml;umen entwarf. Da man sich aber schon von Beginn an zusammensetzte und &uuml;ber das Aussehen der Zukunft diskutierte, flossen Ideen von beiden Seiten in das Endprodukt ein. So hielt sich Animationsk&uuml;nstler Scott Wheeler beim Alien-Schiff zwar relativ genau an die Zeichnungen der Designer, doch die sind eben nur zweidimensional und k&ouml;nnen erstens nicht alles zeigen und zweitens wirkt manches an einem dreidimensionalen Objekt ganz anders.</FONT>
<BR>
<FONT SIZE=+1>Solche Schw&auml;chen &auml;nderte Wheeler dann selbst oder konstruierte Seitenteile, die in keiner Zeichnung vorgegeben waren. Er verbesserte das, was bei einem sich auf dem Bildschirm bewegenden Objekt falsch wirken w&uuml;rde. Auch bei der Saratoga kam es zu einer Zusammenarbeit. Ihr grunds&auml;tzliches Aussehen kam von den Produktionsdesignern, aber einzelne Details (z.B. wie sich T&uuml;ren &ouml;ffnen) wurden von den Animationsk&uuml;nstlern entworfen.</FONT>
<BR><BR>
<FONT SIZE=+1>Die Saratoga mu&szlig;te sogar zwei Wochen, bevor die Film-Aufnahmen am Computer erstellt werden sollten, noch einmal neu &quot;zusammengebaut&quot; werden. Die Produktionsdesigner roefen n&auml;mlich pl&ouml;tzlich bei &quot;Area 51&quot; an, redeten erst um den hei&szlig;en Brei herum und erkl&auml;rten dann etwas kleinlaut, da&szlig; es ja seit langem auch noch ein alternatives Design f&uuml;r die Saratoga g&auml;be (das &quot;Area 51&quot; bis dahin nicht einmal zu Gesicht bekommen hatte!), welches die meisten eigentlich ja viel sch&ouml;ner finden w&uuml;rden.</FONT>
<BR>
<FONT SIZE=+1>Langer Rede kurzer Sinn: Ob man nicht vielleicht besser dieses Design zur Grundlage n&auml;hme, da die Saratoga schlie&szlig;lich das Stammschiff der Serie sei und Woche f&uuml;r Woche &uuml;ber den Bildschirm flimmern werde? Animationsk&uuml;nstler Karl Denham und seine Kollege sahen das auch ein, aber die Arbeit begann jetzt praktisch noch mal von vorne. Immerhin konnte man manche Teile der alten Version nehmen und modifiziert weiterverwenden.</FONT>
<BR>
<FONT SIZE=+1>Da Morgan und Wong bei <B>SPACE</B> den d&uuml;steren Look von <B>AKTE X</B> weiterf&uuml;hren wollten, ist der Weltraum vor allem ein schwarzes unheimliches Nichts, aus dem sich nur Planeten abheben. Selbst die rasant herand&uuml;senden Kriegsraumschiffe f&uuml;gen sich mit ihren unauff&auml;lligen Farben ins d&uuml;stere Welt(all)bild ein. Der eher harmlose, farbenfrohe Sternenkrieg &agrave; la <B>STAR WARS</B> wird mit dem d&uuml;steren Nihilismus von <B>ALIEN</B> gekreuzt!</FONT>
<BR>
<FONT SIZE=+1>Als Vorlage pr&auml;sentierten Morgan und Wong &quot;Area 51&quot; aber auch Kriegsfilme &uuml;ber den 2.Weltkrieg. Das harte kompromi&szlig;lose Schwarzwei&szlig; dieser alten Streifen sollte in Farbe &uuml;bertragen werden. W&auml;hrend die dominierende Science-Fiction-Serie <B>STAR TREK</B> jahrelang ein sauberes lichtes All gepredigt hat, betont <B>SPACE</B> im Sog der mysteri&ouml;sen X-Akten das Schwarz des Sternenhimmels und die dunklen Schatten auf fremden Welten.</FONT>
<BR>
<FONT SIZE=+1>Und so n&auml;hert sich <B>SPACE</B> f&uuml;r einen Farbfilm sehr stark den Hell-Dunkel-Kontrasten eines Schwarzwei&szlig;films, wenn das Schwarz des Alls und das Wei&szlig; von Sonnen oder Planeten aufeinandertreffen. W&auml;hrend die Schiffe der Vereinigten Erde immerhin &quot;nur&quot; tarnfarben sind, schimmern die Schiffe der Aliens sogar in - Schawrz!</FONT>
<BR>
<FONT SIZE=+1>&quot;Schwarze Raumschiffe im Weltall sind ja nicht gerade ein gro&szlig;artiger Einfall&quot;, schmunzelt Scott Wheeler, einer der Animationsk&uuml;nstler, die bei &quot;Area 51&quot; hinterm Computer sitzen. Er l&ouml;ste das Problem, indem er das Schiff entweder so filmte, da&szlig; es ein Lichteinfall von seinem Hintergrund absch&auml;lte, oder - wenn das nicht m&ouml;glich war - ein leichtes blaues Flimmern um das Schiff legte, damit es so von der Pechschw&auml;rze abgetrennt w&uuml;rde.</FONT>
<BR>
<FONT SIZE=+1>Die Jungs (und nat&uuml;rlich das M&auml;del: Clare Ragge) von &quot;Area 51&quot; haben sogar Einflu&szlig; auf die Handlung genommen. Die Schlacht gegen die Aliens im Asteroideng&uuml;rtel war urspr&uuml;nglich kaum zu sehen. Die Raumschiffe werden zusammengeschissen - Schnitt - auf der Saratoga lobt der Colonel: &quot;Gute Arbeit, Jungs, fliegt heimw&auml;rts!&quot; Aber dann schlugen die CGI-Fachleute vor, das Ganze doch etwas spektakul&auml;rer zu gestalten und entwarfen am Computer all die dramatischen Fighter-Gefechte, die sich nun zu einer hei&szlig;en Schlacht in der K&auml;lte des Alls zusammenf&uuml;gen und James Wong ein erstauntes &quot;Mann, ist das cool!&quot; entlockten.</FONT>
<BR><BR>
<FONT SIZE=+1>Um einen gr&ouml;&szlig;tm&ouml;glichen Realismus zu erreichen, gingen die CGI-Zauberer sogar soweit, den am Computer simulierten Kamerabewegungen bewu&szlig;t etwas von ihrer Leichtigkeit und Eleganz zu nehmen. Wenn man mit einer echten kamera einem vorbeirasenden Formel-1-Rennwagen zu folgen versucht, wird man gro&szlig;e Schwierigkeiten haben, das Gescho&szlig; im Bild zu behalten. Obwohl es bei computererzeugten Aufnahmen logischerweise kein Problem ist, jedem Objekt m&uuml;helos zu folgen, weil ja sowieso alles simuliert ist, versuchte man auch bei den bewegten CGI-Aufnahmen das Gef&uuml;hl zu erwecken, als w&uuml;rde die Kamera einen vorbeirasenden Fighter gerade noch im Blick behalten.</FONT>
<BR>
<FONT SIZE=+1>Realismus war immer das oberste Gebot, auch darin waren moderne Klasiker wie <B>STAR WARS</B> und <B>ALIEN</B> ein Vorbild. Gegenst&auml;nde m&uuml;ssen auch mal gebraucht aussehen, der Verschlei&szlig; von Bauten, Stationen, Schiffen mu&szlig; sichtbar werden, und wo Verschmutzung oder Verwitterung angebracht sind, sollen sie auch zu finden sein.</FONT>
<BR>
<FONT SIZE=+1>Tim McHugh ist stolz darauf, da&szlig; sich die <B>SPACE</B>-Welt stark von anderen SF-Filmen unterscheidet: &quot;Unsere Raumschiffe haben Brandmale und versengte, schmierige Flecken, man kann die Nieten an der Au&szlig;enh&uuml;lle erkennen.&quot;</FONT>
<BR>
<FONT SIZE=+1>Allein f&uuml;r die ersten drei Episoden kreierte Computer-Zauberer Ken Stranahan bereits &uuml;ber 150 CGIs. F&uuml;r das &Uuml;berlebenstraining auf dem Mars mu&szlig;ten Bild f&uuml;r Bild die Farben der australischen landschaft ver&auml;ndert werden: Der eigentlich wei&szlig;e Sand wurde rot eingef&auml;rbt, der blaue Himmel pink.</FONT>
<BR>
<FONT SIZE=+1>Insgesamt waren acht Computer am Werk, um die Welt von <B>SPACE</B> perfekt zu illustrieren. Zum Vorteil der Computeranimation geh&ouml;rt es auch, da&szlig; Raumschiffe nicht mehr wie bei konventionellen Trickaufnahmen eine matte Oberfl&auml;che haben. Das war fr&uuml;her Pflicht, weil jedes Gl&auml;nzen Reflexe im blauen Hintergrund verursacht, die die Blue-Screen-Effekte ruiniert oder zumindest unsinnig erschwert h&auml;tte. Bei CGIs aber k&ouml;nnen Raumschiffe endlich schimmern.</FONT>
<BR>
<FONT SIZE=+1>Es ist kaum zu glauben, da&szlig; aus einer nicht sonderlich gro&szlig;en Kochk&uuml;che eine der hei&szlig;esten Hexenk&uuml;chen der hochmodernen Computer-Effekte geworden ist. <B>SPACE 2063</B> setzt neue Ma&szlig;st&auml;be f&uuml;r SFX auf dem heimischen Bildschirm. Aber diese glanzvollen Effekte kosten auch Geld und haben mit den grandiosen Kulissen dazu beigetragen, da&szlig; <B>SPACE</B> am Ende im Weltall verlorenging. Wie mancher <B>SPACE</B>-Schauspieler wurden mittlerweile auch Mitarbeiter von &quot;Area 51&quot; f&uuml;r <B>AKTE X</B> verpflichtet (z.B. Glen Campbell f&uuml;r Ep.76 <B>HOME</B>).</FONT>
<BR><BR><BR>



<A CLASS="AN" NAME="A3"><CENTER><FONT SIZE=+2><FONT COLOR="#FFFF00"><U>DAS ENDE</U></FONT></FONT></CENTER>
<BR><BR>
<FONT SIZE=+1><B>SPACE: ABOVE AND BEYOND</B> lief sich in den USA gut an, so da&szlig; nach dem Pilotfilm eine komplette Staffel (22.Episoden) produziert wurde. In Deutschland startete die Serie bei dem kleineren Privatsender VOX, und ist inzwischen auch bei Pro 7 zu sehen.</FONT>
<BR>
<FONT SIZE=+1>Begleitet wurde <B>SPACE</B> bei uns von einer gro&szlig;en Werbekampagne in allen Fachzeitschriften, wobei man neben den &uuml;blichen positiven Anzeigen auch bewu&szlig;te Negativwerbung ver&ouml;ffentlichte. So rief unter der Aufschrift BOYKOTTIERT SPACE! ein fiktiver Verein zur Wahrung sauberer Bildschirme dazu auf, diese unmoralische Ami-Serie auf gar keinen Fall einzuschalten. Auch wenn die Rechnung der Marktstrategen insofern aufging, da&szlig; mancher emp&ouml;rte Leser aus purem Trotz <B>SPACE</B> einschaltete, rutschten die Quoten immer mehr in den Keller.</FONT>
<BR>
<FONT SIZE=+1>Obwohl sich ein begeistertes Fanpublikum fand, in dem trotz der kriegerischen Thematik &uuml;berraschend viele Frauen waren, so gelang es <B>SPACE</B> doch nicht, in Deutschland die so wichtige breite Masse f&uuml;r sich zu gewinnen, die z.B. bei <B>AKTE X</B> neben den harten Fans zu den w&ouml;chentlichen Einschaltern z&auml;hlt.</FONT>
<BR>
<FONT SIZE=+1>Frauen als emanzipierte Soldatinnen darzustellen, verschaffte der Serie wohl die gro&szlig;e Popularit&auml;t bei den weiblichen Zuschauern. Vor allem Shane Vansen wurde f&uuml;r viele zur Heldin und Vorbildfigur, eine Rolle, die mancher Fan auch auf Kristen Cloke &uuml;bertrug, was der jungen Schauspielerin freilich weniger gefiel.</FONT>
<BR>
<FONT SIZE=+1>Als Quoten und damit Werbeeinnahmen die hohen Kosten nicht tragen wollten, ereilte die Serie trotz des hohen Kultcharakters der Todessto&szlig; von Seien FOX TELEVISION. Ausgerechnet das angepeilte und auch voll erf&uuml;llte hohe technische Niveau, hatte einer Serie das Genick gebrochen, die trotz einiger Landserbanalit&auml;ten auf dem Weg zu einer der anspruchsvollsten Sternensagas des TV-Kosmos war.</FONT>
<BR><BR>
<FONT SIZE=+1>Glen Morgan und James Wong nannten <B>SPACE: ABOVE AND BEYOND</B> immer eine Kriegsserie, und das stimmte auch, denn mehr als es je eine andere Science-Fiction-Serie oder ein -Film geschafft hat, vertiefte sich diese brillante Serie in die Psyche zuk&uuml;nftiger Soldaten. Aber wer denkt, <B>SPACE</B> w&auml;re eine Kriegstreiber-Serie, der irrt gewaltig. <B>SPACE</B> verharmloste den Kampf nicht wie <B>STAR WARS</B> zu einer lustigen Phaser-Ballerei, sondern es zeigte die Angst, den Schmerz, den ganzen Irsinn, den ein solcher Krieg mit sich bringt.</FONT>
<BR>
<FONT SIZE=+1><B>SPACE</B> war eine Serie, die die Schattenseiten des Lebens nicht aussparte. Hier war nicht einfach alles Friede, Freude, Eierkuchen. Die Figuren von <B>SPACE</B> waren keine furchtlosen Abzieh-Helden, sondern ganz normale Menschen, die ihre pers&ouml;hnlichen Probleme und gleichzeitig ihren Job bew&auml;ltigen mu&szlig;ten. Die Schatten der Vergangenheit lasteten auf jedem von ihnen - und es kam darauf an, sie im rechten Moment zu verjagen, um &uuml;berleben zu k&ouml;nnen.</FONT>
<BR>
<FONT SIZE=+1>Diese Figuren sind uns vertraut geworden wie alte Bekannte: Nathan West, der seine Freundin Kylen verloren hat und verzweifelt nach ihr Ausschau h&auml;lt; Shane Vansen, die noch so oft von der Ermordung ihrer Eltern gequ&auml;lt wird und das Grauen in sich bew&auml;ltigen mu&szlig;; der In Vitro Cooper Hawkes, der immer wieder aufbegehrt, aber von seiner Sehnsucht nach einer Familie getrieben wird und in Colonel McQueen einen Vaterersatz und in Shane eine &quot;Schwester&quot; findet...</FONT>
<BR>
<FONT SIZE=+1>Nach einem guten, aber nicht &uuml;berw&auml;ltigenden Pilotfilm hatte sich die Serie - trotz einiger Durchh&auml;nger im Mittelteil - kontinuierlich weiterentwickelt. Als sie ein bi&szlig;chen schw&auml;cher zu werden schien, erholte sie sich pl&ouml;tzlich noch einmal in einem wahrhaft furiosen Finale, das die Akteure in h&ouml;chste Gefahr brachte und dann den Zuschauer mitten im Regen stehen lie&szlig;!</FONT>
<BR>
<FONT SIZE=+1>Offenbar kam das Aus f&uuml;r die Serie so &uuml;berraschend, da&szlig; Glen Morgan und James Wong keine M&ouml;glichkeit mehr hatten, die letzten Folgen umzuschreiben und <B>SPACE</B> zumindest noch zu einem runden Ende zu f&uuml;hren. Deswegen findet alles ein aufregendes Cliffhanger-Ende, das nat&uuml;rlich Anreiz f&uuml;r eine zweite Staffel bieten sollte.</FONT>
<BR>
<FONT SIZE=+1>Eine zweite Staffel, die es aber nicht mehr geben sollte ...</FONT>
<BR>
<FONT SIZE=+1>Andererseits deutet auch manches darauf hin, da&szlig; Morgan und Wong den Braten gerochen haben, zwar noch nicht offiziell vom Ende ihrer Serie erfahren hatten, aber wohl sp&uuml;rten, da&szlig; ihnen der Aufwand bei dieser Quotenkonstellation das Genick brechen w&uuml;rde.</FONT>
<BR>
<FONT SIZE=+1>Warum sonst sollten sie pl&ouml;tzlich gegen Ende der Staffel so wichtige Geheimnisse l&uuml;ften wie das Aussehen der Chigs und die Verbindung zwischen Aerotech und Aliens. Und warum sonst sollen sie pl&ouml;tzlich friedliche Kl&auml;nge mitten im brutalen Krieg ert&ouml;nen lassen?</FONT>
<BR>
<FONT SIZE=+1>Da&szlig; sie trotzdem zu einemso negativen Ende griffen, l&auml;ge - so geht diese Spekulation weiter - weniger daran, da&szlig; dies als Cliffhanger zur Spannungssteigerung gedacht sei, sondern Morgan und Wong wollten alle Br&uuml;cken hinter sich abrei&szlig;en und durch den mutma&szlig;lichen Tod ihrer Helden verhindern, da&szlig; jemand anders das von ihnen kreierte Serienkind fortf&uuml;hren w&uuml;rde.</FONT>
<BR><BR>
<FONT SIZE=+1>Sah es eine Zeitlang so aus, als w&uuml;rde FOX bei den <B>SPACE</B>-Wiederholungen noch einmal die Zuschauerresonanz testen und eventuell eine schlecht laufende Serie kippen, um <B>SPACE</B> doch noch weiterzuf&uuml;hren, so besiegelte der endg&uuml;ltige Abri&szlig; der Kulissen alle Hoffnungen auf eine Fortsetzung. Es ist auch fraglich, ob FOX <B>SPACE</B> eines Tages in TV-Film-Form wieder aufleben l&auml;&szlig;t wie beim ebenfalls voreilig von FOX eingestellten <B>ALIEN NATION</B>, denn <B>SPACE</B> ist halt um Klassen teurer. Wo wir schon wieder bei den leidigen Quoten w&auml;ren...</FONT>
<BR>
<FONT SIZE=+1>Immerhin haben Invasions-Stories seit <B>INDEPENDEMCE DAY</B> ja in Film und Fernsehen Hochkonjunktur, und so mancher fragt sich, wie FOX so bl&ouml;d sein konnte und eine aus dem Programm schmei&szlig;en konnte. Es gibt ein zwetes Ger&uuml;cht, bei dem gemunkelt wird, man h&auml;tte das ungeliebte <B>SPACE</B>, das f&uuml;r den Geschmack des Senders viel zu d&uuml;ster und schattig geraten w&auml;re, aus dem Weg ger&auml;umt, um einer anderen TV-Invasion den Weg zu bahnen, der Fernsehserie zum FOX-Hit <B>INDEPENDENCE DAY</B>, der als wahrer Jubeltrubelfreiheitskampf den sonnigen Gem&uuml;tern der Fox-Bosse onehin n&auml;her l&auml;ge.</FONT>
<BR>
<FONT SIZE=+1>Glen Morgan und James Wong jedenfalls sind l&auml;ngst wieder zu den <B>X-FILES</B> zur&uuml;ckgekehrt und arbeiten dort mit einer Frische, als w&auml;ren sie nie fort gewesen. F&uuml;r ihre einstigen Sch&uuml;tzlinge sorgen sie nebenher auch ein bi&szlig;chen: Kristen Cloke und Morgan Weisser durften jeweils in einer ihrer X-Akten auftreten, w&auml;hrend sich James Morrison in <B>MILLENIUM</B> zeigte.</FONT>
<BR>
<FONT SIZE=+1>Morrison hat auch in einem Interview ein bi&szlig;chen &uuml;ber den mutma&szlig;lichen <B>SPACE</B>-Fortgang verraten. Laut &quot;Colonel McQueen&quot; wurden Morgan und Wong vom Sender wirklich kalt erwischt, planten eigentlich, den spektakul&auml;ren Cliffhanger mit seinen dunklen Schicksalsschl&auml;gen zu Beginn der 2. Staffel aufzuhellen und hatten auch sonst einiges ausget&uuml;ftelt.</FONT>
<BR>
<FONT SIZE=+1>Morrison erkl&auml;rt zu dem kompromi&szlig;losen Finale: &quot;Das Drehbuch wurde geschrieben, bevor wir von der Absetzung erfuhren, und die Dreharbeiten waren bereits abgeschlossen. Ich sprach mit Glen Morgan und James Wong dar&uuml;ber, was in der n&auml;chsten Season mit McQueen geschehen w&uuml;rde - er sollte eigentlich zur Erde zur&uuml;ckkehren und sich dort mit der zivilen Seite seines Charakters besch&auml;ftigen. Nach vier oder f&uuml;nf Folgen w&auml;re er dann wieder an die Front zur&uuml;ckgekehrt.&quot;</FONT>
<BR>
<FONT SIZE=+1>Und was ist mit den anderen? Mit Vansen, Damphousse und Wang? &quot;Die T&uuml;r f&uuml;r eine Fortsetzung sollte offengelassen werden, so da&szlig; Vansen und Damphousse wohl &uuml;berlebt haben. Was Wang betrifft - nun, in dem Skript, das ich las, wurde auch er nicht get&ouml;tet. Ich denke, die Staffel sollte einfach als Cliffhanger enden - und so, wie ich es sehe, tut sie das auch ...&quot;</FONT>
<BR><BR>
<FONT SIZE=+1>Wir wollen hoffen, da&szlig; James Morrison recht hat und einst der Tag kommen wird, an dem doch noch ein TV-Film diese offene Ende Schli&szlig;t und damit der ambitionierten Science-Fiction-Serie mit ihrer tollen Mischung aus Kriegsdrama, Sternen-Alptraum und Pers&ouml;hnlichkeitsfindung einen ad&auml;quaten Abschlu&szlig; gibt.</FONT>



<A CLASS="AN" NAME="BOTTOM">
</BODY>
</HTML>
