<HTML>
<HEAD>
<TITLE>Space 2063</TITLE>
</HEAD>

<BODY TEXT="#FFFFFF" BGCOLOR="#000000" LINK="#FFFF00" VLINK="#00FFFF" ALINK="#C0FFC0" BACKGROUND="stars.gif">

<BR>
<CENTER><FONT SIZE=+2><FONT COLOR="#FFFF00"><B><U>Nathan West</U></B></FONT></FONT></CENTER>
<BR><BR>
<TABLE WIDTH=100% BORDER=0 COLS=3>
<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Rang:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>First Lieutenant, 58th Squadron, US Marine Corps</B></FONT></TD>
<TH COLSPAN=1 ROWSPAN=7 WIDTH=300 VALIGN=CENTER><IMG SRC="pics/west.jpg" BORDER=0 ALT="Morgan Weisser alias Nathan West"></TH>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Rasse:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>Wei&szlig;er</B></FONT></TD>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Alter:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>22 Jahre</B></FONT></TD>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Heimatstadt:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>unbekannt</B></FONT></TD>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Wildcards-Rufnahme:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>King of Hearts (Herz K&ouml;nig)</B></FONT></TD>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Seriennummer:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>unbekannt</B></FONT></TD>
</TR>

<TR>
<TH COLSPAN=2 ALIGN=LEFT VALIGN=TOP><B><FONT SIZE=+3>N</FONT></B><FONT SIZE=+1>athan wollte zusammen mit seiner Freundin Kylen Celina den Planeten Tellus erschlie&szlig;en. Beide sollten an Bord eines Kolonisierungsschiffes sein. Doch dann verlor er seinen Platz an &quot;Tanks&quot;. Kylen mu&szlig;te allein reisen. Nathans einzige Hoffnung, sie wiederzusehen, bestand darin, sich zum US Marine Corps zu melden. W&auml;hrend der Ausbildung erreicht die Erde eine entsetzliche Nachricht: Unbekannte Au&szlig;erirdische haben Tellus verw&uuml;stet. Die meisten Bewohner sind tot. Es gibt keine Spur von Kylen. Ist sie tot? Wurde sie von den Au&szlig;erirdischen entf&uuml;hrt? Die 58. Schwadron des Marine Corps, in der Nathan dient, bricht zu einem ungewissen Krieg gegen einen unbekannten Feind auf.</FONT></TH>
</TR>
</TABLE>

<HR WIDTH="100%" NOSHADE SIZE=1 COLOR=#FFFFFF>

<BR>
<FONT SIZE=+1><B>F&uuml;r Morgan Weisser ist es wichtig, da&szlig; sein Serienheld dieselben Ideale vertritt, die auch er sich angeeignet hat: Kameradschaft, Tapferkeit, Gerechtigkeitssinn, und vor allem eine unzerst&ouml;rbare moralische Integrit&auml;t.</B></FONT>
<BR><BR>
<FONT SIZE=+1>Morgan wurde in Los Angeles geboren, wo er noch heute lebt. Sein Dad ist der Charakterschauspieler Norbert Weisser (der u.a. in Steven Spielbergs <B>SCHINDLERS LISTE</B> mitspielte). Morgan begann seine Karriere auf den Brettern, die die Welt bedeuten.</FONT>
<BR>
<FONT SIZE=+1>Seinen gr&ouml;&szlig;ten Erfolg verbuchte er mit dem Theaterst&uuml;ck <B>BEING AT HOME WITH CLAUDE</B>, f&uuml;r das er den Los Angeles Drama Critics Award erhielt. Fast gleichzeitig ergatterte er immer mehr Film-Rollen, im Billif-SF-Film <B>CITY LIMITS</B>, in <B>EXTREME CLOSE-UP, LONG ROAD HOME, STAY THE NIGHT, SHORTCUT TO PARADISE</B>. Au&szlig;erdem trat er im actionreichen Zukunftsspektakel <B>Rollerboys</B> ander Seite von Corey Haim und Patricia Arquette auf und neben sexy Sternchen Shannen Doherty in <B>A BURNING PASSION: THE MARGARET MITCHELL STORY</B>. Auch in TV-Serien wie <B>LAW AND ORDER und CHINA BEACH</B> hatte er kleine Auftritte, beor er sich in die weite des Alls aufmachte.</FONT>
<BR>
<FONT SIZE=+1>Nach eigenem Bekunden lernte er durch die Arbeit an <B>SPACE</B> und damit einhergehende langfristige Identifizierung mit einer Figur sehr viel hinzu. Um Nathan West &uuml;berzeugend zu gestalten, versuchte Morgan, seine eigenen Ehrgef&uuml;hle in den Charakter zu &uuml;bertragen und ihm so den Stempel seiner Pers&ouml;hnlichkeit aufzudr&uuml;cken. Besonderen Wert legte er auf Wests pr&auml;zisen Gerechtigkeitssinn und seine strikte moralische Ausrichtung.</FONT>
<BR>
<FONT SIZE=+1>Seiner Ansicht nach sollte Nathan Wests Plichtbewu&szlig;tsein auch seine Suche nach der vermi&szlig;ten Geliebten Kylen &uuml;berdecken. Es war von Anfang an Morgans Wunsch, da&szlig; ihr tragischer Verlust nicht zum Dauerhandlungsstrang w&uuml;rde: &quot;Ich hatte keine Lust, in jeder Folge ihr Bild anzustarren und zu flennen.&quot; Ein Mann wie Nathan West mu&szlig; in allererster Linie seinen Job machen, und er wird den Jammer um die verlorene Liebe verdr&auml;ngen, solange er nicht mit direkten Informationen konfrontiert wird.</FONT>
<BR><BR>
<FONT SIZE=+1>Um die soldatische Seite ihrer Rollen zu verinnerlichen, versorgten sich die darsteller der &quot;Wild Cards&quot;, wie die Piloten genannt werden (der so ruhige wie attraktive Morgan ist nat&uuml;rlich der Herzk&ouml;nig!), nicht nur mit allerlei Materialien &uuml;ber das Leben, K&auml;mpfen und T&ouml;ten echter Marines, sondern wurden auch von einem waschechten Frontk&auml;mpfer &quot;ausgebildet&quot;, der diverse Eins&auml;tze auf dem Buckel hatte.</FONT>
<BR>
<FONT SIZE=+1>Dieser Mann erwies sich freilich als eisenfressender Landser aus dem bilderbuch, der s&auml;mtliche Klischees eines Jenseits von Gut und B&ouml;se existierenden &Uuml;berlebensfighters zu erf&uuml;llen schien. Er trillte die jungen Akteure nicht nur mir geifernder Feldwebel-Stimme bis kurz vor den psychischen Kollaps (da&szlig; wohl selbt R. Lee Ermey, der Ausbilder aus dem Pilotfilm, vor Neid erbla&szlig;t w&auml;re), sondern berichtete seinen &quot;Rekruten&quot; auch mit einem angsteinfl&ouml;&szlig;enden Glitzern in den Augen davon, wie es ist, wenn man selbst angeschossen wird, oder zusehen mu&szlig;, wenn es einen seiner Kameraden trifft.</FONT>
<BR>
<FONT SIZE=+1>Die Freude, die bei der Vorstellung des T&ouml;tens und Get&ouml;tetwerdens das Gesicht ihres &quot;Kompanief&uuml;hrers&quot; &uuml;berzog, befremdete die jungen Schauspieler immens. Um dem ganzen die Krone aufzusetzen, unterlie&szlig; es ihr Ausbilder nicht, ihnen mit bierernster Miene eine d&uuml;stere Warnung mit auf den Weg zu geben: &quot;Ich verspreche euch, da&szlig; ich eure Spur aufnehmen und euch alle t&ouml;ten werde, wenn ihr das Marine Corps nicht in einem positiven Licht zeigen solltet!&quot;</FONT>
<BR>
<FONT SIZE=+1>Nach diesem etwas unangenehmen Auftakt seines Soldatenlebens geno&szlig; es Morgan aber sehr, da&szlig; er nicht in einer dieser Heile-Welt-Serien mitspielen sollte, sondern eine d&uuml;stere bedrohliche zukunft erkunden durfte. Ihm war sofort klar, da&szlig; Morgan und Wong, die vorher zu den St&uuml;tzpfeilern der <B>X-FILES</B> geh&ouml;rt hatten, die Mythologie dieser Erfolgsserie in <B>SPACE</B> einbringen w&uuml;rden. Hier wie dort geht es um das Dunkle, Fremdartige und Unbekannte, und die Frage, inwieweit die Regierung mit den mysteri&ouml;sen Aliens unter einer Decke steckt, kristallisiert sich ebenfalls in beiden Serien schnell heraus.</FONT>
<BR>
<FONT SIZE=+1>Morgan glaubt auch, da&szlig; diese d&uuml;stere Atmosph&auml;re eine ziemliche &Uuml;berraschung f&uuml;r die Damen und Herren von FOX gewesen sei, die eher eine knallbunte, effekttrunkene Space Opera wollten. Mit dem Pilotfilm hatten Morgan und Wong diese Vorgabe klugerweise ja auch erf&uuml;llt, aber ihre Serie danach immer st&auml;rker in die von ihnen gew&uuml;nschte Richtung getrieben und <B>SPACE</B> zu einem traumatischen Nachtst&uuml;ck drau&szlig;en in der Schw&auml;rze des Alls werden lassen.</FONT>
<BR>
<FONT SIZE=+1>Vielleicht war es nicht zuletzt das &Uuml;berhandnehmen dieser d&uuml;steren Momente, das FOX dazu bewog, das Interesse an <B>SPACE</B> zu verlieren. Morgan und Wong wanderten zu <B>AKTE X</B> zur&uuml;ck. Wie zufrieden die beiden Top-Schreiber mit Morgan Weisser waren, zeigte sich bald daran, da&szlig; sie ihm eine interessante Gastrolle in einer der von ihnen verfa&szlig;ten <B>X-FILES</B> verschafften.</FONT>
<BR><BR>
<FONT SIZE=+1>So spielte er in Episode 80: &quot;<B>MUSINGS OF A CIGARETTE SMOKING MAN</B>&quot; Lee Harvey Oswald, den Mann, der John F. Kennedy erschossen haben soll. Eine ganz andere Rolle also als die des aufrechten Soldaten, aber ein weiterer Beweis f&uuml;r die Vielseitigkeit von Morgan Weisser. Wer wei&szlig;, wielleicht wird der junge, besonnene Sternenkrieger am Ende mal ein so versierter Charakterschauspieler wie sein Dad.</FONT>
<BR>

<HR WIDTH="100%" NOSHADE SIZE=1 COLOR=#FFFFFF>

</BODY>
</HTML>
