<HTML>
<HEAD>
<TITLE>Space 2063</TITLE>
</HEAD>

<BODY TEXT="#FFFFFF" BGCOLOR="#000000" LINK="#FFFF00" VLINK="#C0C0C0" ALINK="#C0FFC0" BACKGROUND="stars.gif">

<CENTER><B><U><FONT SIZE=+3>23.F&uuml;r immer Treu</FONT></U></B></CENTER>

<CENTER><FONT SIZE=+2>(...tell your Moms we done Our best)</FONT></CENTER>
<BR><BR>

<CENTER><TABLE BORDER=0 CELLSPACING=0 CELLPADDING=0 COLS=2 WIDTH="100%">

<TR>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Regie:</FONT></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Thomas J. Wright</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGTH=20><FONT SIZE=+1>Buch:</FONT></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Glen Morgan &amp; James Wong</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGTH=20><FONT SIZE=+1>Darsteller:</FONT></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Amanda Douge (Kylen)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Harriet Sansom Harris (Diane Hayden)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Don Pugsley (Colonel Rabwin)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>J. Patrick McCormack (Shaffner)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Derek Mark Lochran (Chig-Botschafter)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>David Jean Thomas (General Alcott)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Robert Crow (Lt. Fruitty)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Elliot Woods (Waffenspezialist)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Steve Monroe (Ingenieur)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Lisa Talerico (Sgt. Parker)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Reggie Hayes (Wallace)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Nilla Westerlund (Reporterin)</FONT></TD>
</TR>

</TABLE>
</CENTER>

<HR WIDTH="100%" NOSHADE SIZE=1 COLOR=#FFFFFF>
<BR>

<FONT SIZE=+1>Endlich kommt es zu Friedensgespr&auml;chen mit den Au&szlig;erirdischen. Der Chig-Botschafter fordert, da&szlig; Alan Wayne, Chef der Aerotech, dabei sein solle. Daf&uuml;r wollen die Aliens menschliche Gefangene freilassen. Doch w&auml;hrend der Gefangenentransport heimfliegt, bezichtigt der Botschafter der Chigs Wayne einer Verschw&ouml;rung und st&uuml;rzt sich auf ihn: Eine Explosion ersch&uuml;ttert das Schiff - und der schreckliche Krieg entbrennt aufs neue...</FONT>
<BR><BR>
<FONT SIZE=+1><B>Wow! Zum Finale brennen Morgan und Wong ein Feuerwerk an Ideen ab! Zuerst wird das Thema Frieden diskutiert, und die Entwurzelung angedeutet, die die Soldaten, trotz allem Abscheu vor dem Krieg, durch ein Ende desselben erfahren. Sie k&ouml;nnen sich gar nicht richtig dar&uuml;ber freuen, da&szlig; Frieden kommt und ihr Geschwader wieder aufgel&ouml;st wird. Sie beginnen zu begreifen, da&szlig; sie dieses enge Band der Freundschaft nie wieder haben werden, da&szlig; sich ihre Wege wohl f&uuml;r immer trennen werden. Wests ironischer Kommentar zum Thema: &quot;Coopers Bl&auml;hungen werden mir jedenfalls nicht fehlen.&quot;</B></FONT>
<BR><BR>
<FONT SIZE=+1><B>Der vermeintliche Friedensproze&szlig; nimmt eine dramatische Wende, als offenkundig wird, da&szlig; Aerotech Dreck am Stecken hat und es zum Konflikt zwischen dem Chig-Botschafter und dem Aerotech-Vertreter kommt. Die Wildcards m&uuml;ssen wieder in die Schlacht, und Morgan und Wong st&uuml;rzen unsere Helden in ein furioses Finale, bei dem vier der sechs Hauptdarsteller ihr Leben zu lassen scheinen. Man hat schon den Eindruck, da&szlig; die beiden Produzenten wu&szlig;ten, da&szlig; es ihrer Serie an den Kragen ging und von vornherein ein Ende vorbereiteten, das einen d&uuml;ster-blutigen Schlu&szlig;punkt setzt, wie ihn noch keine SF-Serie gekannt hat (aber zugleich wird alles so ungewi&szlig; gelassen, da&szlig; ein Weiterleben der Stars m&ouml;glich w&auml;re).</B></FONT>
<BR><BR>
<FONT SIZE=+1><B>Am Ende kriegt Nathan endlich Kylen wieder, aber nachdem er so lange mit der 58. Schwadron gelebt hat, mu&szlig; erst einmal die Entfremdung &uuml;berwunden werden. Grandios ist die Schlu&szlig;einstellung, bei der Cooper und Nathan wortlos in ihren Betten liegen und traurig in die Luft starren, w&auml;hrend die Kamera nach oben wegf&auml;hrt.</B></FONT>
<BR><BR>
<CENTER><IMG SRC="pics/semper-fidelis.gif"></CENTER>
<BR>
<HR WIDTH="100%" NOSHADE SIZE=1 COLOR=#FFFFFF>

</BODY>
</HTML>
