<HTML>
<HEAD>
<TITLE>Space 2063</TITLE>
</HEAD>

<BODY TEXT="#FFFFFF" BGCOLOR="#000000" LINK="#FFFF00" VLINK="#C0C0C0" ALINK="#C0FFC0" BACKGROUND="stars.gif">

<CENTER><B><U><FONT SIZE=+3>19.Bacchus</FONT></U></B></CENTER>

<CENTER><FONT SIZE=+2>(R &amp; R)</FONT></CENTER>
<BR><BR>

<CENTER><TABLE BORDER=0 CELLSPACING=0 CELLPADDING=0 COLS=2 WIDTH="100%">

<TR>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Regie:</FONT></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Thomas J. Wright</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGTH=20><FONT SIZE=+1>Buch:</FONT></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Jule Selbo</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGTH=20><FONT SIZE=+1>Darsteller:</FONT></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Janet Gunn (Suzie)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Coolio (Casino-Empfang)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Jennifer Crystal (Krankenschwester)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Julius Branca (Barkeeper)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Tucker Smallwood (Comm. Ross)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>David Duchovny (Billard-Spieler Alvin El)</FONT></TD>
</TR>

</TABLE>
</CENTER>

<HR WIDTH="100%" NOSHADE SIZE=1 COLOR=#FFFFFF>
<BR>

<FONT SIZE=+1>Bei einem Gefecht mit den Chigs wird Cooper verwundet. Ein Arzt gibt ihm darauf Amphetamine, die In Vitros sofort abh&auml;ngig machen. McQueen, der schon selbst eine solche Sucht durchgemacht hat, hat ein Auge auf ihn, kann aber nicht verhindern, da&szlig; Cooper sich immer neue gr&uuml;ne Pillen verschafft. Da das 58. total ausgebrannt und &uuml;berm&uuml;det ist, darf es sich f&uuml;r einige Tage auf dem Vergn&uuml;gungsschiff Bacchus erholen, das f&uuml;r jeden Geschmack etwas Tolles zu bieten hat...</FONT>
<BR><BR>
<FONT SIZE=+1><B>Wieder einmal werden in der Serie Probleme, die w&auml;hrend eines Krieges auftreten, verarbeitet. Da ist einmal das zunehmende Ausgebranntsein der Soldaten, die von Schlacht zu Schlacht eilen, bis sie psychisch am Ende sind und der in der Realit&auml;t oft damit einhergehende Drogenkonsum, der einen das Grauen vergessen l&auml;&szlig;t, das einen umgibt (der in dieser Folge aber zuf&auml;llig ausgel&ouml;st wird).</B></FONT>
<BR><BR>
<FONT SIZE=+1><B>Die Episode erlaubt denn auch einen tiefen Blick ins Innere der Figuren. Herrlich, wenn sie zu Beginn nach einer Schlacht alle todm&uuml;de umfallen und einschlafen. Herrlich aber auch zu sehen, was sie auf dem Vergn&uuml;gungsschiff tun. Nachdem <A HREF="pics/space019.html">Damphousse und Wang</A> abgetanzt haben, treffen sie sich in der Basketballhalle, entdecken die gemeinsame Liebe zu Freiw&uuml;rfen und zueinander. Es knistert. McQueen sieht sich mit West eine alte W.C. Fields-Kom&ouml;die an, Cooper hat sein erstes sexuelles Erlebnis (ohne zu ahnen, da&szlig; es eine Nutte ist) und Vansen tritt als coole Billard-Queen auf - und trifft dabei auf keinen geringeren als David Duchovny, der (ohne in den Credits erw&auml;hnt zu werden) als smarter Pool-Spieler brilliert.</B></FONT>
<BR><BR>
<FONT SIZE=+1><B>Erw&auml;hnt sei auch Coopers unschuldige Frage an Nathan (&quot;Ich sehe doch besser aus als Wang, oder?&quot;) sowie der k&ouml;stliche Dialog zwischen Nathan und Shane. West: &quot;Ich bin ein guter Pilot. Der beste, den es hier gibt. Au&szlig;er ...&quot; ;  Vansen: &quot;... Mir!&quot; ; West: &quot;...McQueen!&quot;</B></FONT>
<BR>
<HR WIDTH="100%" NOSHADE SIZE=1 COLOR=#FFFFFF>

</BODY>
</HTML>
