<HTML>
<HEAD>
<TITLE>Space 2063</TITLE>
</HEAD>

<BODY TEXT="#FFFFFF" BGCOLOR="#000000" LINK="#FFFF00" VLINK="#C0C0C0" ALINK="#C0FFC0" BACKGROUND="stars.gif">

<CENTER><B><U><FONT SIZE=+3>21.Die Vergessenen</FONT></U></B></CENTER>

<CENTER><FONT SIZE=+2>(Sugar Dirt)</FONT></CENTER>
<BR><BR>

<CENTER><TABLE BORDER=0 CELLSPACING=0 CELLPADDING=0 COLS=2 WIDTH="100%">

<TR>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Regie:</FONT></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Thomas J. Wright</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGTH=20><FONT SIZE=+1>Buch:</FONT></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Matt Kiene &amp; Joe Reinkemeyer</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGTH=20><FONT SIZE=+1>Darsteller:</FONT></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Granville van Dusen (General Weirick)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>David St. James (Admiral Broden)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>David Jean Thomas (General Alcott)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Edmund L. Shaff (Kaplan)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Jennifer Balgobin (Nachrichtenoffizier)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Kiriyama-Lem (General Ming)</FONT></TD>
</TR>

</TABLE>
</CENTER>

<HR WIDTH="100%" NOSHADE SIZE=1 COLOR=#FFFFFF>
<BR>

<FONT SIZE=+1>Zum Fr&uuml;hst&uuml;ck gibt es ein Steak f&uuml;r die M&auml;nner und Frauen des 58. - Alle blicken betreten. Offenbar steht die Offensive bevor!</FONT>
<BR><BR>
<FONT SIZE=+1>Tats&auml;chlich hat sich das Oberkommando entschlossen, den an die Chigs verlorenen St&uuml;tzpunkt Demios zur&uuml;ckzuerobern, auch wenn man damit rechnet, da&szlig; 80 % der Marines dabei draufgehen werden. Doch dann erweist sich die Eroberung pl&ouml;tzlich als kinderleicht. Bis doch noch ein Inferno aus Alien-J&auml;gern &uuml;ber die Gelandeten hereinbricht.</FONT>
<BR><BR>
<FONT SIZE=+1>Da erf&auml;hrt das Oberkommando, da&szlig; die von dem viel wichtigeren Alien-St&uuml;tzpunkt auf Ixion abgezogen wurden. Um die Situation auszun&uuml;tzen fliegt die Saratoga zum geschw&auml;chten Ixion und l&auml;&szlig;t die Marines allein in der H&ouml;lle zur&uuml;ck...</FONT>
<BR><BR>
<FONT SIZE=+1><B>Zu Beginn steht zu lesen: &quot;F&uuml;r unsere V&auml;ter und Gro&szlig;v&auml;ter auf Guadalcanal 7.August 1942/7. Februar 1943&quot;. Wieder einmal steht der 2. Weltkrieg Pate f&uuml;r Morgan und Wongs Zukunftsversion. Die Situation damals war die gleiche wie jetzt auf Demios. W&auml;hrend sich Commodore Ross nur widerstrebend dem Befehl beugt, seine Leute im Stich zu lassen, hei&szlig;t McQueen den Befehl gut. Nicht, weil ihn das Schicksal seiner M&auml;nner nicht r&uuml;hren w&uuml;rde, sondern weil er wei&szlig;, da&szlig; diese Wenigen (25.000 insgesamt!) Millionen das Leben retten k&ouml;nnen. Durch den Schlag gegen Ixios w&uuml;rde sich der Krieg um zwei Jahre verk&uuml;rzen.</B></FONT>
<BR><BR>
<FONT SIZE=+1><B>Diese dramatische Episode ist Krieg pur, und zum ersten Mal wird das Geschehen in strategischer Breite erz&auml;hlt Wieder einmal erweist sich Shane als wahre F&uuml;hrernatur, die selbst im absoluten Dunkel der Verlassenheit dem zerm&uuml;rbten Rest Vorbild bleibt, w&auml;hrend <A HREF="pics/space021.html">Cooper</A> als erster ausrastet. Toll die Szene, in der die anderen merken, da&szlig; Shane seit zw&ouml;lf Tagen nur noch zum Schein gefunkt hat, weil das Ger&auml;t l&auml;ngst im Eimer war. Ihr verzweifelter Ausruf auf die Vorw&uuml;rfe: &quot;lch habe es satt, f&uuml;r vier Leute die Verantwortung zu tragen.&quot;</B></FONT>
<BR><BR>
<FONT SIZE=+1><B>Am Ende werden die Marines gerettet - aber ihr Vertrauen ist ersch&uuml;ttert.</B></FONT>
<BR>
<HR WIDTH="100%" NOSHADE SIZE=1 COLOR=#FFFFFF>

</BODY>
</HTML>
