<HTML>
<HEAD>
<TITLE>Space 2063</TITLE>
</HEAD>

<BODY TEXT="#FFFFFF" BGCOLOR="#000000" LINK="#FFFF00" VLINK="#C0C0C0" ALINK="#C0FFC0" BACKGROUND="stars.gif">

<CENTER><B><U><FONT SIZE=+3>20.Dead Man Flying</FONT></U></B></CENTER>

<CENTER><FONT SIZE=+2>(Stardust)</FONT></CENTER>
<BR><BR>

<CENTER><TABLE BORDER=0 CELLSPACING=0 CELLPADDING=0 COLS=2 WIDTH="100%">

<TR>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Regie:</FONT></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Jesus Trevino</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGTH=20><FONT SIZE=+1>Buch:</FONT></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Howard Grigsby</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGTH=20><FONT SIZE=+1>Darsteller:</FONT></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Ronald G. Joseph (General Oliver Radford)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Edmund L. Shaff (Kaplan)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Pato Hoffman (James Dark Moon)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Gail O&acute;Grady (Colonel Klingman)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Robert Crow (Officer Crow)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Tocker Smallwood (Commodore Ross)</FONT></TD>
</TR>

</TABLE>
</CENTER>

<HR WIDTH="100%" NOSHADE SIZE=1 COLOR=#FFFFFF>
<BR>

<FONT SIZE=+1>Das 58. soll in den Hangar, aber sie stehen vor verschlossenen T&uuml;ren. Als <A HREF="pics/space020.html">Shane</A> sp&auml;ter ihre Hammerhead untersucht, findet sie ein neues Modul darin. Sabotage? Sie baut es &uuml;berall aus. Kurz darauf begleiten die Wildcards einen Frachter und werden pl&ouml;tzlich von ihm beschossen. Sie schie&szlig;en zur&uuml;ck. Wieder auf der Saratoga droht ihnen deswegen ein Verfahren, doch dann weiht sie der k&uuml;rzlich an Bord gekommene General Radford ein. Der Frachter ist ferngesteuert und kann die Wildcards nur &uuml;ber die Module erkennen. An Bord sitzt der Leichnam des Soldaten James Dark Moon, der k&uuml;rzlich wegen der Ermordung seiner Vorgesetzten zum Tode verurteilt wurde. Er hat fingierte Geheimpapiere &uuml;ber den gro&szlig;en Schlag der Terraner dabei, die den Chigs in die H&auml;nde fallen sollen...</FONT>
<BR><BR>
<FONT SIZE=+1><B>Eine interessante Folge, die mit einer beklemmend inszenierten Hinrichtung beginnt, bei der der Verurteilte qualvoll das Verrinnen seiner Lebenszeit miterlebt. Dieser Mann ist aber kein Serienm&ouml;rder im AKTE X-Stil, sondern ein ungl&uuml;cklicher Navajo, der &uuml;berzeugt war, zum B&ouml;sen geboren zu sein. F&uuml;r General Radford, der auch ein Navajo ist, bedeutet Dark Moon seine andere Seite, das, was er h&auml;tte werden k&ouml;nnen, aber zum Gl&uuml;ck nicht geworden ist. Es bleibt offen, wie es zum Mord kam. Klar ist nur, da&szlig; die Offizierin ihn zuvor zu Unrecht beschuldigt hat. Sein Freund Radford erm&ouml;glicht ihm durch die brisante Aktion posthum vom M&ouml;rder zum Helden zu werden.</B></FONT>
<BR><BR>
<FONT SIZE=+1><B>Das Vorbild dieser Aktion ist eine Finte, welche die Alliierten im 2. Weltkrieg vor der Landung in der Normandie benutzten. In dieser Episode fr&ouml;nen Morgan &amp; Wong n&auml;mlich wieder besonders stark ihrer Vorliebe f&uuml;r die Geschichte des 2.Weltkriegs. Durch die anf&auml;ngliche Ungewi&szlig;heit &uuml;ber das Unternehmen, die der Zuschauer mit den Charakteren teilt, entwickelt sich eine mysteri&ouml;se Stimmung, die einen schnell in den Bann zieht.</B></FONT>
<BR><BR>
<FONT SIZE=+1><B>Cooper hat scheinbar ein Interesse an der Expertin, die das Schiff fernsteuert, aber sie verschwindet wieder, bevor sie sich auch nur ein bi&szlig;chen n&auml;her kommen k&ouml;nnen.</B></FONT>
<BR><BR>
<FONT SIZE=+1><B>Der von ihr erfolgte Hinweis auf Coopers gerade abgeschlossene Therapie gegen Amphetaminmi&szlig;brauch zeigt wieder mal sch&ouml;n die Kontinuit&auml;t der Serie auf. &Auml;hnliches gilt f&uuml;r einen weiteren Auftritt der hei&szlig;geliebten Gitarre von Commodore Ross. Er herrscht einen Soldaten an: &quot;Wenn Sie ihr wehtun, tun Sie mir weh.&quot;</B></FONT>
<BR>
<HR WIDTH="100%" NOSHADE SIZE=1 COLOR=#FFFFFF>

</BODY>
</HTML>
