<HTML>
<HEAD>
<TITLE>Space 2063</TITLE>
</HEAD>

<BODY TEXT="#FFFFFF" BGCOLOR="#000000" LINK="#FFFF00" VLINK="#00FFFF" ALINK="#C0FFC0" BACKGROUND="stars.gif">

<BR>
<CENTER><FONT SIZE=+2><FONT COLOR="#FFFF00"><B><U>Tyrus Cassius McQueen</U></B></FONT></FONT></CENTER>
<BR><BR>
<TABLE WIDTH=100% BORDER=0 COLS=3>
<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Rang:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>Lieutenant Colonel, 58th Squadron, US Marine Corps</B></FONT></TD>
<TH COLSPAN=1 ROWSPAN=7 WIDTH=300 VALIGN=CENTER><IMG SRC="pics/mcqueen.jpg" BORDER=0 ALT="James Morrison alias Tyrus Cassius McQueen"></TH>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Rasse:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>In Vitro</B></FONT></TD>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Alter:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>38</B></FONT></TD>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Heimatstadt:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>Anchorage (Alaska)</B></FONT></TD>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Wildcards-Rufnahme:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>Queen Six</B></FONT></TD>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Erschaffungsort:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>Kappa 9757, Anchorage Anlage, Gen-Pool 13C</B></FONT></TD>
</TR>

<TR>
<TH COLSPAN=2 ALIGN=LEFT VALIGN=TOP><B><FONT SIZE=+3>M</FONT></B><FONT SIZE=+1>cQueen, der kommandierende Offizier der 58. Schwadron, ist ein harter, aber gerechter Vorgesetzter. Selbst wenn seine F&auml;hnriche gegen seinen ausdr&uuml;cklichen Befehl handeln, stellt er sich immer hinter sie, sofern ihre Beweggr&uuml;nde ehrenvoll waren. Schlie&szlig;lich wei&szlig; er, da&szlig; er diese jungen Piloten Tag f&uuml;r Tag in einen Kampf auf Leben und Tod hetzen muﬂ. Obwohl McQueen seinen Rekruten viel Anteilnahme, Liebe und Respekt bezeugt, macht er auch unmiﬂverst&auml;ndlich klar, daﬂ eine Rang-Linie zwischen ihnen herrscht, die keinesfalls &uuml;bertreten werden darf. Denn eine Abweichung der Kommandostruktur w&uuml;rde eine Schw&auml;chung der eigenen Reihen und den Tod vieler Soldaten bedeuten. Sein Gesicht ist zernarbt von vergangenen Schlachten. Er geh&ouml;rte einst zur Elite des 127. Angriffsfl&uuml;gels. McQueen ist so clever wie hart - und er ist ein &quot;In Vitro&quot;,
dessen Leben im Alter von 18 begann.</FONT></TH>
</TR>

</TABLE>

<HR WIDTH="100%" NOSHADE SIZE=1 COLOR=#FFFFFF>

<BR>
<FONT SIZE=+1><B>Obwohl die Jungstars Morgan Weisser und Rodney Rowland ja wirklich &quot;knackige&quot; Burschen sind, ist es ihr Bo&szlig;, der attraktiv grauhaarige James Morrison, dem die Herzen der weiblichen Fans im Sturzflug zuflogen.</B></FONT>
<BR><BR>
<FONT SIZE=+1>James Morrisons Schauspielkarriere begann - seiner sp&auml;teren Rolle als Weltraumsoldat entsprechend mit dramatischen Sterbeszenen, die er als Kind seinem Onkel vorspielte: &quot;Der war w&auml;hrend des Koreakrieges Pilot bei der Air Force&quot;, erz&auml;hlt er l&auml;chelnd, &quot;und wann immer er Fronturlaub bekam, tat ich so als schie&szlig;e ich mir in den Kopf und spielte diese unglaublich dramatischen Todesszenen. Meistens fragte er dann: &acute;Was, zur H&ouml;lle stimmt nicht mit diesem Kind?&acute;, und meine Tante gab zur Antwort: &acute;Naja - er mag dich eben.&acute; - Ich denke ich haben das nur getan um seine Aufmerksamkeit zu bekommen ...&quot;</FONT>
<BR>
<FONT SIZE=+1>Seine Kindheit verbrachte James in einem 200-Seelen-Dorf in Alaska, ehe er die High School in Anchorage besuchte - seine Leidenschaft am Schauspielern und daran, eine - wie er sagt - &quot;Welt der Phantasie und Vorstellungskraft&quot; zu kreiern, blieb jedoch erhalten. Nachdem er ein Studium an der Universit&auml;t von Alaska absolviert hatte, sagte er dem kalten Bundesstaat Adieu und ging nach New York, um sich dort als Schauspieler zu verdingen.</FONT>
<BR>
<FONT SIZE=+1>Der gro&szlig;e Durchbruch auf der B&uuml;hne blieb ihm zwar vorerst versagt, daf&uuml;r bekam er ein Angebot, mit dem renomierten Zirkus Carson and Barnes auf Tournee zu gehen und den Clown zu spielen. Danach kehrte er nach Alaska zur&uuml;ck, wo er sein Engagement am Alaska Repertory Theatre hatte.</FONT>
<BR>
<FONT SIZE=+1>Nach zwei Spielzeiten hatte James erst mal genug - ihm stand der Sinn nach Ver&auml;nderung. Er setzte alles auf eine Karte und siedelte ins Schauspielermekka Los Angeles um. Die erste Theaterrolle, die er dort bekam, war die des Journalisten in <B>EL SALVADOR</B> und trug ihm eine Reihe von B&uuml;hnenpreisen ein - das Tor zur Schauspielkarriere war aufgesto&szlig;en! Es folgten Auftritte in ber&uuml;hmten Theaterst&uuml;cken wie <B>DIE KATZE AUF DEM HEISSEN BLECHDACH, RICHARD III</B> und <B>JULIUS C&Auml;SAR</B>.</FONT>
<BR><BR>
<FONT SIZE=+1>Inzwischen waren auch die Casting-Manager der Filmstudios auf James aufmerksam geworden und boten ihm einzelne Rollen an. Zu seinen Filmen geh&ouml;ren <B>FATAL VISION, UNFINISHED BUSINESS, LAST FLIGHT OUT, AN ENEMY OF THE PEOPLE, WITHOUT WARNING, WHERE ARE MY CHILDREN?, DESERT CROSS</B> und <B>WHITE DWARF</B>. Bekannter d&uuml;rften seine Rollen in der 2.Staffel von <B>FACKELN IM STURM</B> und in Michael Douglas&acute; Amoklauf <B>FALLING DOWN</B> sein. Au&szlig;erdem war er Gaststar in <B>ZUR&Uuml;CK IN DIE VERGANGENHEIT</B>.</FONT>
<BR>
<FONT SIZE=+1>Die Rolle des Marinecorps-Kommandanten McQueen, die ihm darauf angeboten wurde, war seine erste &quot;feste&quot; Rolle. Als es darum ging, den mysteri&ouml;sen Charakter des Colonels, der in der Serie ja auch einer der abf&auml;llig als &quot;Tanks&quot; bezeichneten In Vitros ist, zu gestalten, zeigte James Morrison, da&szlig; er seine Arbeit sehr ernst nimmt und seine langj&auml;hrige B&uuml;hnenerfahrung ihm eine gesundes Selbstbewu&szlig;tsein eingetragen hat: &quot;David Nutter, der beim Pilotfilm Regie f&uuml;hrte, wollte, da&szlig; McQueen ein mysteri&ouml;ser Fremder &agrave; la Clint Eastwood wird, der aus dem Nebel auftaucht und wieder verschindet - aber ich habe ihm das ausgeredet. Schlie&szlig;lich ist die Figur, die ich spiele, ja selbst schon ein Archetyp...&quot;</FONT>
<BR>
<FONT SIZE=+1>James interpretierte die Rolle auf seine Weise - und schuf diesen besonnenen, in sich gekehrten Krieger, in dessen Brust trotz allem ein weiches Herz schl&auml;gt und der hundertprozentig hinter den M&auml;nnern und Frauen seiner Einheit steht. Fans in aller Welt lohnten es ihm mit Hunderten von Zuschriften, die James Morrison zu einem der beliebtesten Genre-Stars machten.</FONT>
<BR>
<FONT SIZE=+1>Interressanterweise tat er, als in Australien der Pilotfilm gedreht wurde, genau das Gegenteil der Jungstars, die viel Zeit miteinander verbrachten. Er hielt sich abseits und erreichte damit im Prinzip das gleiche wie seine Kollegen: Er verwuchs mit seiner Rolle. W&auml;hrend Nathan, Cooper, Shane und die anderen sich allm&auml;hlich kennenlernten, ist McQueen allein schon durch seinen Rang von den anderen abgegrenzt.</FONT>
<BR>
<FONT SIZE=+1>Da&szlig; Glen Morgans und James Wongs ambitionierte Serie schon nach der ersten Staffel das Aus ereilte, traf auch james Morrison hart. Die Schuld an der Absetzung sucht der Schauspieler jedoch nicht bei seinen Kollegen oder Mitarbeitern des Stabs, die seiner Meinung nach ihr bestes gaben. Verfehlte Studiopolitik, mangelnde Produktionsgelder und sinkende Einschaltquoten seien f&uuml;r die Einstellung verantwortlich gewesen.</FONT>
<BR>
<FONT SIZE=+1>&Uuml;ber seine Zukunft braucht sich James Morrison trotz des Endes von <B>SPACE 2063</B> jedenfalls keine Sorgen zu machen - er wurde j&uuml;ngst von <B>AKTE X</B>-Sch&ouml;pfer Chris Carter verpflichtet, einen Part in der Folge <B>DEAD LETTER</B> von dessen neuer Serie <B>MILLENIUM</B> zu &uuml;bernehmen. Au&szlig;erdem wurde sein Regiedeb&uuml;t, der Kurzfilm <B>PARKING</B>, bei dem er auch noch f&uuml;r Drehbuch und Produktion verantwortlich war, k&uuml;rzlich ans Kabelfernsehen verkauft, so da&szlig; der talentierte Mime weitere Aktivit&auml;ten auf diesen Gebieten nicht ausschlie&szlig;t.</FONT>
<BR><BR>
<FONT SIZE=+1>Als James Morrison einst in Shakespeares <B>JULIUS C&Auml;SAR</B> den Casca mimte, wollte der Regisseur, da&szlig; Jmaes den Charakter so spielen sollte wie der Schauspieler Oskar Levant es getan h&auml;tte. (Levant, einer der Hauptdarsteller des Musical-Klassikers <B>EIN AMERIKANER IN PARIS</B>, meinte einmal &uuml;ber seine Rolle in <B>HUMORESKE</B>: &quot;Ich spiele einen unsympathischen Typen - mich selbst.&quot;) James war emp&ouml;rt &uuml;ber die Forderung des Regisseurs. Ein Schauspieler ist nicht dazu da einen anderen zu imitieren. Er empfand es als eine Beleidigung seines Talents: &quot;Ich bin genauso weing Oscar Levant wie Groucho Marx.&quot; Nein Gott sei Dank ist er niemand anders als - James Morrison!</FONT>
<BR>

<HR WIDTH="100%" NOSHADE SIZE=1 COLOR=#FFFFFF>

</BODY>
</HTML>
