<HTML>
<HEAD>
<TITLE>Space 2063</TITLE>
</HEAD>

<BODY TEXT="#FFFFFF" BGCOLOR="#000000" LINK="#FFFF00" VLINK="#C0C0C0" ALINK="#C0FFC0" BACKGROUND="stars.gif">

<CENTER><B><U><FONT SIZE=+3>11.Per Anhalter durchs All</FONT></U></B></CENTER>

<CENTER><FONT SIZE=+2>(The River of Stars)</FONT></CENTER>
<BR><BR>

<CENTER><TABLE BORDER=0 CELLSPACING=0 CELLPADDING=0 COLS=2 WIDTH="100%">

<TR>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Regie:</FONT></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Tucker Gates</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGTH=20><FONT SIZE=+1>Buch:</FONT></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Marylin Osborn</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGTH=20><FONT SIZE=+1>Darsteller:</FONT></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Tasia Valenza (Winslow)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Tucker Smallwood (Ross)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Leslie O&acute;Neill </FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>L. August Richards (Lt. Thomas)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Chris Kirby (Kilcher)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Robert Crow (Reynolds)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Tyrone Battista (Lieutenant)</FONT></TD>
</TR>

</TABLE>
</CENTER>

<HR WIDTH="100%" NOSHADE SIZE=1 COLOR=#FFFFFF>
<BR>

<FONT SIZE=+1>Als ein Schiff mit Vansen, West,  Rowland,  Damphousse, <A HREF="pics/space011.html">Wang</A> und Winslow von Alien-Raketen getroffen wird, k&ouml;nnen sie sich zwar aus der Gefahrenzone retten, aber der Antrieb f&auml;llt aus. F&uuml;hrerlos treibt das Raumschiff durchs All. An Bord wird es k&auml;lter und k&auml;lter, und die Luft geht zur Neige. Dabei ist es ausgerechnet Weihnachten. W&auml;hrend McQueen nach seinen Leuten wie nach der Nadel im Heuhaufen sucht, n&auml;hert sich denen ein Komet...</FONT>
<BR><BR>
<FONT SIZE=+1><B>Die Pre-Sequenz dieser Folge geh&ouml;rt zu den H&ouml;hepunkten von SPACE. Es werden Schwarzwei&szlig;aufnahmen aus dem 1. Weltkrieg gezeigt und mit dem melancholischen Text einer tieftraurigen Stimme unterlegt, die daran erinnert, da&szlig; an Weihnachten 1914 deutsche und franz&ouml;sische Soldaten bei einem Waffenstillstand gemeinsam  Weihnachten feierten. So ein grausamer Krieg wie der 1. und der 2. Weltkrieg solle niemals wieder geschehen - doch da bricht das Feuer des Krieges von 2063 wie ein Sturmwind &uuml;ber den Zuschauer herein.</B></FONT>
<BR><BR>
<FONT SIZE=+1><B>Genial ist auch die Gro&szlig;aufnahme von McQueens Hand, die er vor dem Hintergrund der Sterne nerv&ouml;s zusammenballt. Was danach folgt - eine typische Katastrophensituation - ist arg sentimental geraten. Anl&auml;&szlig;lich des Weihnachtsfestes wird eine verkrampfte Bibelstimmung breitgewalzt, die Sch&ouml;pfungsgeschichte im Weltall verlesen und Cooper der aus der Besserungsanstalt geflohen ist, bevor Weihnachten dran war, bekommt die unbefleckte Empf&auml;ngnis erkl&auml;rt, was ihn zu der Schlu&szlig;folgerung veranla&szlig;t, da&szlig; Jesus Christus ein In Vitro war.</B></FONT>
<BR><BR>
<FONT SIZE=+1><B>Immerhin werden die Helden teils sehr sch&ouml;n charakterisiert:  McQueens &uuml;berm&auml;&szlig;ige Sorge um sein Geschwader Coopers Unsicherheit in Bezug auf &quot;menschliche&quot; Br&auml;uche, <A HREF="pics/space011.html">Wang</A>s Abkehr vom Glauben angesichts der Schrecken des Krieges und Shanes Abneigung gegen Kegeln.</B></FONT>
<BR><BR>
<FONT SIZE=+1><B>Trotzdem ist die Episode nur an Heilig Abend zu ertragen. Marilyn Osborn schwimmt zu sehr im schnulzigen Fahrwasser ihrer fr&uuml;heren Serie EIN HAUCH VON HIMMEL.</B></FONT>
<BR><BR>
<FONT SIZE=+1><B>Zu allem &Uuml;berflu&szlig; hat man in Deutschland den poetischen Originaltitel &quot;Flu&szlig; der Sterne&quot; zu einer bl&ouml;dsinnigen Anspielung auf die Kultserle PER ANHALTER DURCH DIE GALAXIS umgewandelt.</B></FONT>
<BR>
<HR WIDTH="100%" NOSHADE SIZE=1 COLOR=#FFFFFF>

</BODY>
</HTML>
