<HTML>
<HEAD>
<TITLE>Space 2063</TITLE>
</HEAD>

<BODY TEXT="#FFFFFF" BGCOLOR="#000000" LINK="#FFFF00" VLINK="#00FFFF" ALINK="#C0FFC0" BACKGROUND="stars.gif">

<BR>
<CENTER><FONT SIZE=+2><FONT COLOR="#FFFF00"><B><U>Shane Vansen</U></B></FONT></FONT></CENTER>
<BR><BR>
<TABLE WIDTH=100% BORDER=0 COLS=3>
<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Rang:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>First Lieutenant, 58th Squadron, US Marine Corps</B></FONT></TD>
<TH COLSPAN=1 ROWSPAN=7 WIDTH=300 VALIGN=CENTER><IMG SRC="pics/vansen.jpg" BORDER=0 ALT="Kristen Cloke alias Shane Vansen"></TH>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Rasse:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>Wei&szlig;er</B></FONT></TD>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Alter:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>22 Jahre</B></FONT></TD>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Heimatstadt:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>San Diego (Kalifornien)</B></FONT></TD>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Wildcards-Rufnahme:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>Queen of Diamonds (Karo Dame)</B></FONT></TD>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Seriennummer:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>560-51-03318</B></FONT></TD>
</TR>

<TR>
<TH COLSPAN=2 ALIGN=LEFT VALIGN=TOP><B><FONT SIZE=+3>S</FONT></B><FONT SIZE=+1>hane ist Soldatin aus &Uuml;berzeugung. Auch ihre Eltern dienten bei den Marines. Sie wurden von Als brutal &uuml;berfallen und ermordet - vor den entsetzten Augen vone Shane und ihren Schwestern. Sie war damals erst f&uuml;nf Jahre alt. Nun sind die marines ihre neue Familie geworden. Der Verlust ihrer Eltern hat daf&uuml;r gesorgt, da&szlig; sie besonders bem&uuml;ht ist, so etwas nicht noch einmal passieren zu lassen. Noch immer schrickt sie aus dem Schlaf hoch, wenn die grauenvollen Tr&auml;ume sie peinigen, die das schreckliche Ereignis wieder aus ihrem Unterbewu&szlig;tsein hochsp&uuml;len. Wenn sie im Dienst ist, kann sie ihre &Auml;ngste kontrollieren, aber im Schlaf hat selbst die tapfere, untadelige Soldatin nicht mehr alles unter Kontrolle.</FONT></TH>
</TR>
</TABLE>

<HR WIDTH="100%" NOSHADE SIZE=1 COLOR=#FFFFFF>

<BR>
<FONT SIZE=+1><B>Lange Zeit war der Tod ihr Partner. Tag und Nacht mu&szlig;te sie als Shane Vansen damit rechnen, da&szlig; sie ihr Schicksal ereilt. Das &uuml;bertrug sich auch auf Kristen Cloke, die geistig mehr und mehr mit ihrer Rolle verwuchs. Immer wieder die Frage: Wird es ein Morgen geben? Dann eines Tages die Ern&uuml;chterung: Das ist das Ende - </B>SPACE<B> wird eingestellt!</B></FONT>
<BR><BR>
<FONT SIZE=+1>Kristen, die aus Van Nuys im sonnigenUS-Bundesstaat Kalifornien stammt, wollte eigentlich nicht Schauspielerin werden - und ein Teil von ihr kann sich auch heute noch nicht damit abfinden, auf der Mattscheibe Karriere zu machen. So studierte sie die F&auml;cher Psychologie und Literatur an der California State University von Northridge und begann w&auml;hrend ihres Studiums, Skripts und St&uuml;cke f&uuml;r die Schauspielklassen zu verfassen. Zu dieser Zeit entdeckte sie zwei ihrer gro&szlig;en Vorlieben: das Schreiben - und die Schauspielerei.</FONT>
<BR>
<FONT SIZE=+1>Sie nahm selbst Schauspielunterricht und teilte fortan ihre Zeit zwischen B&uuml;hne und Schreibmaschine ein. Nachdem sie aufgrund einiger B&uuml;hnenerfolge sogar einen Agenten gefunden hatte, gab ein alter Freund ihr einen guten Rat: &quot;Vor allem&quot;, so Kristen, &quot;riet er mir, da&szlig; ich nicht zwei Sachen gleichzeitig machen k&ouml;nnte. Also entschlo&szlig; ich mich die Schule zu verlassen und Vollzeitschauspielerin zu werden.&quot;</FONT>
<BR>
<FONT SIZE=+1>Kristens Eltern sahen die Pl&auml;ne ihres T&ouml;chterleins anfangs mit Skepsis - schlie&szlig;lich ist das Showgesch&auml;ft bekannterma&szlig;en eines der h&auml;rtesten Gewerbe der Welt. Aber sie lie&szlig; sich nicht beirren und ergatterte an der Seite von Billy Zane ihren ersten Leinwandauftritt 1991 in dem Science-Fiction-Billigspektakel <B>MEGAVILLE</B>, in dem sie eine Sprengstoffexpertin des Milit&auml;rs spielte. &quot;Meine Schauspielkarriere war ein allm&auml;hlicher Proze&szlig; - kein Erfolg, der &uuml;ber Nacht kam&quot;, sagt Kristen r&uuml;ckblickend - tats&auml;chlich ging es langsam, aber stetig aufw&auml;rts f&uuml;r die h&uuml;bsche Schauspielerin.</FONT>
<BR>
<FONT SIZE=+1>Danach spielte sie in <B>THE MARRYING MAN, STAY TUNED, CAGED FEAR, A PART OF THE FAMILY, MOTHER OF THE BRIDGE</B> und 1996 in <B>THE RAGE</B>. Sie war in den Fernsehserien <B>WINNETKA ROAD</B> und <B>SILK STALKINGS</B> zu sehen und hatte Gastauftritte in so popul&auml;ren Shows wie Ted Dansons <B>CHEERS</B> und Angela Lansburys <B>MORD IST IHR HOBBY</B>, des weiteren zeigte sie sich in <B>DEAR JOHN, DOOGIE HOWSER</B> und Scott Baculas <B>ZUR&Uuml;CK IN DIE VERGANGENHEIT</B>.</FONT>
<BR><BR>
<FONT SIZE=+1>Als James Wong und Glen Morgan die junge Kristen f&uuml;r ihre aufwendiges Science-Fiction-Project <B>SPACE 2063</B> casteten, war sie also kein absoluter No Name mehr, sondern bereits langsam, aber stetig auf dem Weg nach oben. Doch <B>SPACE</B> kr&ouml;nte ihre Karriere fr&uuml;her als erwartet.</FONT>
<BR>
<FONT SIZE=+1>Von der Idee, eine der Hauptrollen in Morgan und Wongs Weltraum-Epos zu spielen, war Kristen sofort angetan - obwohl sie zugibt, kein gro&szlig;er Science-Fiction-Fan zu sein (und nur ein paar Folgen von <B>STAR TREK Classic</B> gesehen zu haben): &quot;Ich betrachte <B>SPACE 2063</B> mehr als eine Kriegs-, denn als Science-Fiction-Serie. Glen und James sind mehr an den dramatischen und menschlichen Aspekten des Krieges und an seinen Auswirkungen interressiert als an der Geschwindigkeit von Triebwerken und den M&ouml;glichkeiten der Weltraumfahrt.&quot;</FONT>
<BR>
<FONT SIZE=+1>Das st&auml;ndige Benutzen von Waffen kam ihr zuerst sehr merkw&uuml;rdig vor, zumal sie zu Hause sehr pazifistisch erzogen wurde. Nat&uuml;rlich ist Kristen klar, da&szlig; es an einem Krieg keine positiven Seiten gibt, aber ihr gefiel an der Serie, da&szlig; sie unsere Erde als eine Einheit zeigt, die &uuml;ber alle rassischen Unterschiede hinwegreicht, da&szlig; hier Menschen portr&auml;tiert wurden, die trotz aller Vorbehalte zusammenwuchsen. Die 58. Schwadron ist wie eine kleine Familie, und ihre Mitglieder tun in erster Linie nichts anderes, als das zu verteidigen, was sie lieben.</FONT>
<BR>
<FONT SIZE=+1>So sieht Kristen den Charakter der Shane Vansen auch nicht so sehr als Action-Heldin, sondern vielmehr als eine junge Frau, deren tragische Backgroud-Geschichte - Shane mu&szlig;te als junges M&auml;dchen mitansehen, wie ihre Eltern brutal ermordet wurden - vor allem Material f&uuml;r interessante psychologische Reflexionen bietet. Bei derartiger Liebe zu detaillierter Charakterzeichnung kommt eben doch ihre Neigung zu Literatur und Drama zum Ausdruck, die Kristen Cloke trotz ihres TV-Erfolges nicht aufgegeben hat.</FONT>
<BR>
<FONT SIZE=+1>Ehrenamtlich blieb sie n&auml;mlich als Artist Director der Alliance Repertory Company t&auml;tig und schreibt nach wie vor selbst B&uuml;hnenst&uuml;cke. &quot;Au&szlig;erdem&quot;, antwortet sie, auf ihre zu&uuml;nftigen Pl&auml;ne befragt, &quot;w&auml;re ich gerne in der Lage, mir Projekte herauszugreifen und auszusuchen und eine gewisse Kontrolle dar&uuml;ber zu haben, was mich anspricht und was nicht. Ich m&ouml;chte gerne Kinofilme machen, zig verschiedene Rollen spielen, meine Pers&ouml;hnlichkeit wandeln und mit den verschiedensten Leuten zusammenarbeiten.&quot;</FONT>
<BR>
<FONT SIZE=+1>Die unglaublich famili&auml;re Atmosph&auml;re am Set von <B>SPACE 2063</B> aber wird auf ewig unverge&szlig;lich bleiben. Die Serien-K&ouml;nige Glen Morgan und James Wong zeigten sich als alles andere denn als absolute Herrscher, sondern besch&auml;ftigten sich eindringlich mit ihren Schauspielern und wurden so zu Kristens Freunden. Ihre jungen Co-Stars Morgan, Rodney und Joel empfindet sie fast schon als Br&uuml;der, und Lanei Chapman, die sie sehr bewundert, ist eine gute Freundin geworden. Um so bedauerlicher, da&szlig; nun ihr aller Schicksal besiegelt scheint.</FONT>
<BR><BR>
<FONT SIZE=+1>Immerhin fand Kristen wie ihr <B>SPACE</B>-Kollege Morgan Weisser dank des phantastischen Eindrucks, den sie bei Morgan und Wong hinterlassen hat, schnell zu einer Gastrolle in <B>AKTE X</B>: in Episode 78 <B>&quot;THE FIELD WHERE I DIED&quot;</B>. Darin geht es um einen selbstzerst&ouml;rerischen Religionskult, um Hypnose und um Seelenwanderung. In dieser Folge erweit sich Kristen als wahres Multitalent, denn sie mu&szlig; diverse Pers&ouml;hnlichkeiten auf einmal spielen. Die US-Kritiker waren vor Begeisterung &uuml;ber ihre ph&auml;nomenale Leistung ganz aus dem H&auml;uschen. Man wird hoffentlich noch viel von ihr h&ouml;ren.</FONT>
<BR>

<HR WIDTH="100%" NOSHADE SIZE=1 COLOR=#FFFFFF>

</BODY>
</HTML>
