<HTML>
<HEAD>
<TITLE>Space 2063</TITLE>
</HEAD>

<BODY TEXT="#FFFFFF" BGCOLOR="#000000" LINK="#FFFF00" VLINK="#C0C0C0" ALINK="#C0FFC0" BACKGROUND="stars.gif">

<CENTER><B><U><FONT SIZE=+3>7.Der unsichtbare Feind</FONT></U></B></CENTER>

<CENTER><FONT SIZE=+2>(The Enemy)</FONT></CENTER>
<BR><BR>

<CENTER><TABLE BORDER=0 CELLSPACING=0 CELLPADDING=0 COLS=2 WIDTH="100%">

<TR>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Regie:</FONT></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Michael Katelman</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGTH=20><FONT SIZE=+1>Buch:</FONT></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Marilyn Osborn</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGTH=20><FONT SIZE=+1>Darsteller:</FONT></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Bob Koherr (der durchgedrehte Marine)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Danny Goldring (Sergeant)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Tucker Smallwood (Ross)</FONT></TD>
</TR>

</TABLE>
</CENTER>

<HR WIDTH="100%" NOSHADE SIZE=1 COLOR=#FFFFFF>
<BR>

<FONT SIZE=+1>Eine ganze Schwadron wird seit kurzem vermi&szlig;t. Die 58. unter Colonel McQueen soll herausfinden, was mit ihr passiert ist. Als man einen fremden Planeten genauer unter die Lupe nimmt, geraten die Soldaten in den Wirkungskreis einer der diabolischsten Geheimwaffen der Aliens: <A HREF="pics/space007.html">Ihre innersten &Auml;ngste werden auf grauenvolle Weise verst&auml;rkt...</A></FONT>
<BR><BR>
<FONT SIZE=+1><B>Hier wollten Morgan &amp; Wong schon zu einem fr&uuml;hen Zeitpunkt an ihren AKTE X-Klassiker EIS anschlie&szlig;en. Die Helden werden mit etwas konfrontiert, das sie zu Handlungen zwingt, die alles andere als heldenhaft sind. An Stelle des &uuml;blichen kameradschaftlichen Verhaltens tritt ein gegenseitiges Mi&szlig;trauen, das die Gruppe zu entzweien und zu vernichten droht. Irgendwann ist die Atmosph&auml;re so mit Konflikt aufgeladen, da&szlig; sich die Freunde jeden Moment an die Gurgel gehen k&ouml;nnten.</B></FONT>
<BR><BR>
<FONT SIZE=+1><B>Marilyn Osborn, die schon AKTE X: VERWANDLUNGEN geschrieben hatte, wurde beauftragt, eine Geschichte zu verfassen, die die Furcht voreinander zum Gegenstand hat, obwohl Morgan &amp; Wong wu&szlig;ten, welches Risiko eine fr&uuml;hzeitige Demontage der Helden haben k&ouml;nnte: &quot;Die Gefahr einer solch d&uuml;steren Episode ist, da&szlig; die Charaktere dadurch ruiniert werden, weil sie etwas so Entsetzliches tun, da&szlig; sie sich nie mehr ganz davon erholen werden. Wie wird er ihnen jemals wieder in die Augen sehen k&ouml;nnen, nachdem er sie mit einer Waffe bedroht hat?&quot; Diese Erfahrung wurde genauso intensiv vermittelt wie in EIS.</B></FONT>
<BR><BR>
<FONT SIZE=+1><B>Als die Episode abgedreht war, erwies sie sich als zu kurz. Autorin Marilyn Osborne wollte noch eine Szene hinzuf&uuml;gen, aber es sollte eine besondere Szene sein. Sie ging zu den Hauptdarstellern und fragte sie, was diese Episode ihnen klargemacht h&auml;tte. Einer meinte: &quot;Ich habe gelernt, wozu jeder wirklich f&auml;hig ist.&quot; Der n&auml;chste: &quot;Egal, wie weit man dich in den Wahnsinn zu treiben versucht, in dir drin bleibt immer ein kleiner Rest geistiger Gesundheit erhalten.&quot; Marllyn Osborne schuf daraus die beeindruckende Schlu&szlig;szene der Folge, in der die Charaktere ihr Res&uuml;mee ziehen.</B></FONT>
<BR><BR>
<FONT SIZE=+1><B>Diese gruselige Folge ist die Lieblingsepisode von Lanei Chapman.</B></FONT>
<BR>
<HR WIDTH="100%" NOSHADE SIZE=1 COLOR=#FFFFFF>

</BODY>
</HTML>
