<HTML>
<HEAD>
<TITLE>Space 2063</TITLE>
</HEAD>

<BODY TEXT="#FFFFFF" BGCOLOR="#000000" LINK="#FFFF00" VLINK="#00FFFF" ALINK="#C0FFC0" BACKGROUND="stars.gif">

<BR>
<CENTER><FONT SIZE=+2><FONT COLOR="#FFFF00"><B><U>Cooper Hawkes</U></B></FONT></FONT></CENTER>
<BR><BR>
<TABLE WIDTH=100% BORDER=0 COLS=3>
<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Rang:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>First Lieutenant, 58th Squadron, US Marine Corps</B></FONT></TD>
<TH COLSPAN=1 ROWSPAN=8 WIDTH=300 VALIGN=CENTER><IMG SRC="pics/hawkes.jpg" BORDER=0 ALT="Rodney Rowland alias Cooper Hawkes"></TH>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Rasse:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>In Vitro</B></FONT></TD>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Alter:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>23 Jahre</B></FONT></TD>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Heimatstadt:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>Philadelphia</B></FONT></TD>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Wildcards-Rufnahme:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>Jack of Spades (Pik Bube)</B></FONT></TD>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Seriennummer:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>948-98-01446</B></FONT></TD>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Erschaffungsort:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>Alpha 3439, Philadelphia Anlage, Gen-Pool 16A</B></FONT></TD>
</TR>

<TR>
<TH COLSPAN=2 ALIGN=LEFT VALIGN=TOP><B><FONT SIZE=+3>C</FONT></B><FONT SIZE=+1>ooper ist kein Mensch, sondern ein &quot;In Vitro&quot;. Er ist k&uuml;nstlich erzeugt worden, wuchs in einem Brutschrank in Labor heran, wurde mit 18 Jahren aufgeweckt und zum Dienst beordert. Als er nachts von &quot;normalen&quot; Menschen gehetzt, gefangen und gequ&auml;lt wurde, konnte er sich dank seiner Kraft befreien, aber als er sich wutentbrannt gegen die Schl&auml;ger wendete, kam eine Polizeistreife hinzu - er wurde festgenommen und zum Dienst bei den Marines verdonnert. Anfangs konnte Cooper weder f&uuml;r seine Kameraden der 58.Schwadron noch f&uuml;r die Erde viel Sympathie empfinden. Seine Aufs&auml;ssigkeit wurde nur noch von seinem Mut &uuml;bertroffen. Aber mit der Zeit lernte der Einzelg&auml;nger, was Freundschaft ist. Und er begriff, da&szlig; Menschen und In Vitros zusammenhalten m&uuml;ssen, da&szlig; es f&uuml;r sie nur eine Zukunft gibt.
Aber so sehr er sich auch der Truppe einverleibt, der wilde Wolf in ihm bleibt immer lebendig.</FONT></TH>
</TR>

</TABLE>

<HR WIDTH="100%" NOSHADE SIZE=1 COLOR=#FFFFFF>

<BR>
<FONT SIZE=+1><B>Seine Kollegen best&auml;tigen, da&szlig; er seiner Rolle verdammt &auml;hnlich ist. Rodney Rowland und Cooper Hawkes gleichen sich in vielen Punkten. Beide sind wild und ungez&auml;hmt, in beiden lodert das Feuer von Protest und Auflehnung, aber im entscheidenden Moment kann man sich auf beide verlassen.</B></FONT>
<BR><BR>
<FONT SIZE=+1>Rodney kam in Newport Beach auf die Welt - nicht in einem Brutkasten, sondern in einem kalifornischen Pfarrhaus, aber wie Cooper Hawkes war er ein rebellischer Charakter, weswegen er f&uuml;r seinen Vater, den Pfarrer, das schwarze Schaf in seiner Kinderherde war. Kaum war er vollj&auml;hrig, verschwand Cooper nach Europa und verdingte sich als Fotomodell.</FONT>
<BR>
<FONT SIZE=+1>Sein Erfolg beim posieren brachte ihn bald zur&uuml;ck ins Land der unbegrenzten M&ouml;glichkeiten, wo er u.a. f&uuml;r Calvin Klein arbeitete, bis ihm Top-Fotograf Bruce Weber vorschlug, es doch auch mal als Schauspieler zu probieren. Der Gedanke lie&szlig; Rodney nicht mehr los. Irgendwie sp&uuml;rte er tief in sich drinnen, da&szlig; das sein n&auml;chster Schritt sein mu&szlig;te. Vor der Kamera zu promenieren hatte ihn damit vertraut gemacht, sich selbst &ouml;ffentlich zu pr&auml;sentieren, aber es war die immer gleiche flache Rolle eines lebenden Ausstellungsst&uuml;ck. Sein alter Hunger nach Erfahrungen erwachte wieder. Er wollte mehr.</FONT>
<BR>
<FONT SIZE=+1>Rodney nahm Stunden, spielte viel Theater in New York und landete in einigen unabh&auml;ngig produzierten Kinofilmen wie <B>FUEL, UNDER THE BOARDWALK</B> und <B>IF SOMEONE HAD KNOWN</B>, bevor er sich zu den <B>SPACE</B>-Marines meldete. K&uuml;rzlich spielte er au&szlig;erdem in <B>MARSHAL LAW</B> den jungen Butchie.</FONT>
<BR><BR>
<FONT SIZE=+1>Randy Stone, der Talentsucher von FOX TELEVISION war auf den jungen Rebellen gesto&szlig;en, der sich keine Schranken auferlegen lassen wollte, und empfand ihn als die Idealbesetzung f&uuml;r den aufs&auml;ssigen, aber auch aufopferungsvollen In Vitro Cooper Hawkes. Stone empfahl Glen Morgan und james Wong seinen neuen Sch&uuml;tzling. Allerdings hatten einige Freunde Rodneys gerade einen schweren Unfall knapp &uuml;berlebt, und das Vorsprechen des davon noch ganz betroffenen Akteurs geriet so dilettantisch, da&szlig; ihn die Serien-Admir&auml;le nicht anheuern wollten.</FONT>
<BR>
<FONT SIZE=+1>Stone bekniete die beiden jedoch so lange, bis sie seiner Entdeckung eine zweite Chance gaben, die Rodney prompt abermals versute, weil er soeben ausgerechnet h&ouml;heres Fieber bekommen hatte. Als Stone immer noch von Rodneys Qualit&auml;ten schw&auml;rmte, stieg Glen Morgan die Galle hoch, und er br&uuml;llte, da&szlig; dieser Typ eine einzige Katastrophe sei und keinen vern&uuml;nftigen Satz rausbek&auml;me. Stone, der immer noch Rodneys erstes Vorsprechen im Hinterkopf hatte, nervte die Serienmacher aber so lange, bis sie einen dritten, aber garantiert letzten Versuch wagten.</FONT>
<BR>
<FONT SIZE=+1>Sie lie&szlig;en ihn gew&auml;hren. Denn irgendwie kam es ihnen auch gar nicht mehr so darauf an, da man onehin bereits plante, einen bekannteren Schauspieler f&uuml;r die Rolle zu engagieren, doch ausgerechnet jetzt, wo ein par Dutzend Verantwortliche des Senders dem bisher so st&uuml;mperhaft auftretenden Ex-Model zusahen, legte er eine Supershow hin, so da&szlig; es jeden instinktiv durchfuhr: Der und nur der ist unser Cooper Hawkes.</FONT>
<BR>
<FONT SIZE=+1>Doch das war noch nicht seine letzte Bew&auml;hrungsprobe: Frisch am Set, nach einem langen Flug nach Australien, bekam er gleich eine schwere Szene verpa&szlig;t, in der er seine neue Kollegin Kristen Cloke k&uuml;ssen mu&szlig;te. Rodney sp&uuml;rte, da&szlig; das der alles entscheidende Moment war. Als er vor der Kamera stand, sah er die unbestechlichen Augen von Glen Morgan auf sich gerichtet und begriff, da&szlig; er nun sehen wollte, ob er bei der Drehhektik bestehen k&ouml;nne.</FONT>
<BR>
<FONT SIZE=+1>Zu allem &Uuml;berflu&szlig; wurde die Szene wiederholt und wiederholt. Bis zum Erbrechen mu&szlig;te er sich anh&ouml;ren, wie Shane ihm von einem Traum erz&auml;hlt, der sie des &ouml;fteren aus dem Schlaf rei&szlig;t. Immer wieder dieselben Worte, immer wieder ihr gequ&auml;ltes Gesicht, immer wieder sein Versuch, die Lippen auf ihren Mund zu dr&uuml;cken, immer wieder ihre abwehrend hochkommenden H&auml;nde.</FONT>
<BR>
<FONT SIZE=+1>Als endlich das erl&ouml;sende Aus kam, war Rodney v&ouml;llig ersch&ouml;pft, psychisch fast am Ende. &quot;Verdammt noch mal&quot; - durchfuhr es ihn - &quot;jetzt haben sie das Ding so oft aufgenommen, weil du es einfach nicht gebracht hast. Du hast die Szene versaut, und Morgan wird dich nun feuern.&quot; Demoralisiert erschien er bei Glen Morgan. Und er sagte - ganz, wie es seine Art ist - ohne gro&szlig;e Emotionen in der Stimme, da&szlig; er schlichtweg begeistert sei.</FONT>
<BR>
<FONT SIZE=+1>Rodney fiel ein Stein vom Herzen. Er hatte &uuml;berhaupt das Ungl&uuml;ck, als letzter am Set einzutreffen, weshalb er manche Torturen, welche die anderen gemeinsam hatten bew&auml;ltigen k&ouml;nnen, nun alleine durchstehen mu&szlig;te, speziell den Schwitzstre&szlig; in den Raumanz&uuml;gen. Aber es spricht f&uuml;r die von Anfang an famili&auml;re Stimmung am Drehort, da&szlig; die noch v&ouml;llig fremden Kollegen sein schweres Schicksal gleich mit wertvollen Tips erleichterten.</FONT>
<BR><BR>
<FONT SIZE=+1>Aller Erfolg hat aber auch seine Schattenseiten. Das merkte Rodney, als die Produktion in Serie ging. Sp&auml;tabends kaputt ins Bett fallen und sich fr&uuml;hmorgens wieder ins Schlachtget&uuml;mmel eines 14-Stunden-Tages st&uuml;rzen - da bleibt keine Zeit f&uuml;r Privatleben. kurz nachdem die Dreharbeiten zu <B>SPACE</B> begonnen hatten, sagte Rodney seinen Freunden: &quot;Von mir h&ouml;rt ihr erst in neun Monaten wieder etwas...&quot;</FONT>
<BR>

<HR WIDTH="100%" NOSHADE SIZE=1 COLOR=#FFFFFF>

</BODY>
</HTML>
