<HTML>
<HEAD>
<TITLE>Space 2063</TITLE>
</HEAD>

<BODY TEXT="#FFFFFF" BGCOLOR="#000000" LINK="#FFFF00" VLINK="#00FFFF" ALINK="#C0FFC0" BACKGROUND="stars.gif">

<BR>
<CENTER><FONT SIZE=+2><FONT COLOR="#FFFF00"><B><U>Paul Wang</U></B></FONT></FONT></CENTER>
<BR><BR>
<TABLE WIDTH=100% BORDER=0 COLS=3>
<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Rang:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>First Lieutenant, 58th Squadron, US Marine Corps</B></FONT></TD>
<TH COLSPAN=1 ROWSPAN=7 WIDTH=300 VALIGN=CENTER><IMG SRC="pics/wang.jpg" BORDER=0 ALT="Joel de la Fuente alias Paul Wang"></TH>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Rasse:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>Asiate</B></FONT></TD>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Alter:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>23 Jahre</B></FONT></TD>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Heimatstadt:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>Chicago</B></FONT></TD>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Wildcards-Rufnahme:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>Joker</B></FONT></TD>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1>Seriennummer:</FONT></TD>
<TD ALIGN=LEFT VALIGN=TOP><FONT SIZE=+1><B>948-30-34828</B></FONT></TD>
</TR>

<TR>
<TH COLSPAN=2 ALIGN=LEFT VALIGN=TOP><B><FONT SIZE=+3>P</FONT></B><FONT SIZE=+1>aul ist ein Fanatiker - aber nur, wenn es um Sport geht! Ansonsten gilt er als sch&uuml;chtern und scheu, ja geradezu introvertiert. Das hei&szlig;t aber nicht, da&szlig; er nicht im Gefecht k&uuml;hles Blut bewahren w&uuml;rde. Seine Kameraden k&ouml;nnen sich auf ihn jederzeit verlassen. Doch nur bei Sport und Spiel geht er voll aus sich raus. Sein einziger Wunsch: Wenn er im Kampf sein Leben lassen sollte, m&uuml;ssen seine Kameraden seine Asche &uuml;ber einem Spielfeld verstreuen.</FONT></TH>
</TR>
</TABLE>

<HR WIDTH="100%" NOSHADE SIZE=1 COLOR=#FFFFFF>

<BR>
<FONT SIZE=+1><B>Die, die ihn n&auml;her kennen, beschreiben ihn als scheu. Seine Kameraden berichten, da&szlig; er nur bei Gespr&auml;chen &uuml;ber Sport so richtig aus sich herausgehe. Von wem hier die Rede ist? Von Paul Wang, dem sch&uuml;chternen Piloten mit dem unwiderstehlichen L&auml;cheln.</B></FONT>
<BR><BR>
<FONT SIZE=+1>Joel de la Fuente spielt diesen Paul Wang, der neben Hikaru Sulu aus <B>STAR TREK</B> und Harry Kim aus <B>STAR TREK - VOYAGER</B> sicher der wichtigste m&auml;nnliche Asiate der Science-Fiction-Serienwelt ist. Joel ist aber kein so scheues Sensibelchen wie sein Charakter, sonst h&auml;tte er nicht in so vielen Produktionen auf der &quot;schutzlosen&quot; Theaterb&uuml;hne brillieren k&ouml;nnen.</FONT>
<BR>
<FONT SIZE=+1>Geboren wurde er in New Hartford im Umkreis von New York, aufgewachsen ist er aber in Chicago. Das erste Mal schnupperte er Theaterluft, als er bei Schulauff&uuml;hrungen als B&uuml;hnenmanager fungierte. Als er aber einmal aus dem Schatten heraustrat und seine erste kleine Rolle im Rampenlicht &uuml;bernahm, wurde er unwiderruflich von der Leidenschaft f&uuml;rs Spielen gepackt und belegte - kaum, da&szlig; er seinen Schulabschlu&szlig; in der Tasche hatte - Kurse im Schauspielprogramm der rennomierten New York University. Dort spielte und spielte und spielte er und begeisterte sein Publikum vor allem als Shakespeares selbstzweiflerischer, zwischen Rachegel&uuml;sten und Todessehnsucht schwankender D&auml;nenprinz <B>HAMLET</B>. Weitere B&uuml;hnenrollen folgten, und in den St&uuml;cken <B>THE TWO GENTLEMEN OF VERONA</B> und <B>ALL&acute;S WELL THAT ENDS WELL</B>
nahm er sogar beim angesehenen allj&auml;hrlichen Shakespeare-Festival im New Yorker Central Park teil. Einen ersten Leinwanderfolg hatte er in dem Film <B>ROOMMATES</B>.</FONT>
<BR><BR>
<FONT SIZE=+1>Sein Engagement f&uuml;r <B>SPACE</B> war ein besonderer Gl&uuml;cksfall f&uuml;r ihn, da f&uuml;r asiatische Schauspieler in amerikanischen Filmen und Serien ja bekannterma&szlig;en nur ein kleiner Freiraum zur Verf&uuml;gung steht. Deswegen trifft das Aus dieser Serie besonders schlimm. Aber wer Joels theatralisches Talent kennt, wei&szlig;, da&szlig; er zumindest auf der B&uuml;hne keine Zukunfts&auml;ngste haben mu&szlig;.</FONT>
<BR>

<HR WIDTH="100%" NOSHADE SIZE=1 COLOR=#FFFFFF>

</BODY>
</HTML>
