<HTML>
<HEAD>
<TITLE>Space 2063</TITLE>
</HEAD>

<BODY TEXT="#FFFFFF" BGCOLOR="#000000" LINK="#FFFF00" VLINK="#C0C0C0" ALINK="#C0FFC0" BACKGROUND="stars.gif">

<CENTER><B><U><FONT SIZE=+3>15.Auge um Auge</FONT></U></B></CENTER>

<CENTER><FONT SIZE=+2>(The angriest Angel)</FONT></CENTER>
<BR><BR>

<CENTER><TABLE BORDER=0 CELLSPACING=0 CELLPADDING=0 COLS=2 WIDTH="100%">

<TR>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Regie:</FONT></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Henry Safran</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGTH=20><FONT SIZE=+1>Buch:</FONT></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Glen Morgan &amp; James Wong</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGTH=20><FONT SIZE=+1>Darsteller:</FONT></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Tasia Valenza (Winslow)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Doug Hutchinson (Elroy El)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Tucker Smallwood (Comm. Ross)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Michael Mantell (Howard Sewell)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Charmin Lee</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>David St. James</FONT></TD>
</TR>

</TABLE>
</CENTER>

<HR WIDTH="100%" NOSHADE SIZE=1 COLOR=#FFFFFF>
<BR>

<FONT SIZE=+1><A HREF="pics/space015.html">Chig von Richthofen</A>, wie die Menschen den geheimnisvollen Flieger getauft haben, konnte noch immer nicht zur Strecke gebracht werden. Solange er da drau&szlig;en ist, kann die Operation Roundhammer, die Zerst&ouml;rung des Heimatplaneten der Chigs, nicht eingeleitet werden. Da entdeckt man eine neue Substanz, mit der man den feindlichen J&auml;ger zerst&ouml;ren k&ouml;nnte. Beim Bau der Rakete kommt es zu einer Explosion. Grund: Sabotage. Kurz darauf entdeckt man einen Al an Bord - Elroy El...</FONT>
<BR><BR>
<FONT SIZE=+1><B>Eine sehr dramatische Folge, die weitgehend aus der Sicht von Colonel McQueen erz&auml;hlt wird. Er zweifelt quasi am Sinn des Lebens, und seine Versuche, wieder zu sich selbst zu finden, verschaffen der Episode eine sehr intensive Ausstrahlung. Man erf&auml;hrt, da&szlig; er schon 15 Jahre im Corps dient und seine Ehe an den Beleidigungen scheiterte, die seiner Frau als Gemahlin eines In Vitro zuteil wurden. Er liest in Homers ILIAS und h&ouml;rt klassische Musik (eine wunderbare Kamerafahrt zeigt seine Zimmereinrichtung). Am Ende steigt er selbst wieder in die Kanzel eines Raumj&auml;gers.</B></FONT>
<BR><BR>
<FONT SIZE=+1><B>KeIly Anne Winslow gesteht ihre Schw&auml;che f&uuml;r den Colonel, blitzt aber nat&uuml;rlich ab, und auch die anderen bekommen zu sp&uuml;ren, da&szlig; McQueen keineswegs ihr Kumpel ist. Winslow hat diesmal mehr Szenen als sonst. Herrlich, wenn die &quot;sexbesessene&quot; Pilotin Shane erkl&auml;rt: &quot;Wenn du&acute;s nicht einmal alle drei Tage tust, drehst du durch.&quot; Darauf Shane cool: &quot;Her mit der Zwangsjacke!&quot;</B></FONT>
<BR><BR>
<FONT SIZE=+1><B>Leider ist dieser Szenenzuwachs f&uuml;r Winslow ein Abschiedsgeschenk. Sie stirbt n&auml;mlich und geht in jene &quot;Dunkelheit und K&auml;lte&quot; ein, die McQueen nach dem Tode w&auml;hnt. &Uuml;berhaupt weicht der christliche Touch von Ep.11 einer nihilistischen Auffassung, die McQueen vertritt, dessen &quot;Sch&ouml;pfer&quot; ja nur irgendein Mensch im Arztkittel war.</B></FONT>
<BR><BR>
<FONT SIZE=+1><B>Ungew&ouml;hnlich f&uuml;r eine US-Serie ist, da&szlig; Fu&szlig;ball gespielt wird (in Form von Soccer). Nathan &amp; Vanessa gegen Paul &amp; Cooper, wobei Cooper sich nicht nur als aufbrausender Verlierer erweist, sondern auch als Unwissender in Sachen Abseits-Regel.</B></FONT>
<BR>
<HR WIDTH="100%" NOSHADE SIZE=1 COLOR=#FFFFFF>

</BODY>
</HTML>
