<HTML>
<HEAD>
<TITLE>Space 2063</TITLE>
</HEAD>

<BODY TEXT="#FFFFFF" BGCOLOR="#000000" LINK="#FFFF00" VLINK="#C0C0C0" ALINK="#C0FFC0" BACKGROUND="stars.gif">

<CENTER><B><U><FONT SIZE=+3>16.Der kleine Bruder</FONT></U></B></CENTER>

<CENTER><FONT SIZE=+2>(Toy Soldier)</FONT></CENTER>
<BR><BR>

<CENTER><TABLE BORDER=0 CELLSPACING=0 CELLPADDING=0 COLS=2 WIDTH="100%">

<TR>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Regie:</FONT></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Stephen Posey</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGTH=20><FONT SIZE=+1>Buch:</FONT></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Marylin Osborn</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGTH=20><FONT SIZE=+1>Darsteller:</FONT></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Marc Worden (Private Neil West)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>David Barrera (2nd Lt. Herrick)</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Christian Hoff</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>P.J. Ochlan</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Al Garrett</FONT></TD>
</TR>

<TR>
<TD WIDTH="50%" HEIGHT=20></TD>
<TD WIDTH="50%" HEIGHT=20><FONT SIZE=+1>Stephen Jang</FONT></TD>
</TR>

</TABLE>
</CENTER>

<HR WIDTH="100%" NOSHADE SIZE=1 COLOR=#FFFFFF>
<BR>

<FONT SIZE=+1>Neue Rekruten treffen auf der Saratoga ein - unter ihnen auch <A HREF="pics/space016.html">Nathans</A> kleiner Bruder Neil. <A HREF="pics/space016.html">Nathan</A> ist nicht gerade begeistert dar&uuml;ber, da&szlig; blutjunge Soldaten sofort vom Training an die Front geschickt werden. Es kommt, wie es kommen mu&szlig;: W&auml;hrend einer Aufkl&auml;rungsmission glaubt Neils &uuml;bereifriger Lieutenant, er und seine Truppe m&uuml;&szlig;ten unbedingt die Helden spielen, und man&ouml;vriert sie in eine ausweglose Situation...</FONT>
<BR><BR>
<FONT SIZE=+1><B>&quot;Der Junge hatte geh&ouml;rt, da&szlig; jeder Mensch in der Schlacht eine Ver&auml;nderung durchmache. In diesem Wandel sah er sein Heil.&quot; - Mit diesem Zitat aus Stephen Cranes ber&uuml;hmtem Roman DIE ROTE TAPFERKEITSMEDAILLE &uuml;ber das brutale Zerplatzen von Illusionen im Gemetzel der Schlacht vor dem Hintergrund des amerikanischen B&uuml;rgerkriegs beginnt eine ergreifende Folge &uuml;ber blutjunge Soldaten, die vom Ruhm auf den Schlachtfeldern tr&auml;umen und von der H&ouml;lle des Krieges &uuml;berrumpelt werden.</B></FONT>
<BR><BR>
<FONT SIZE=+1><B>&quot;Haben wir auch so ausgesehen?&quot; fragt Wang erstaunt, als die Greenhorns ankommen, und Nathan zischt seinen kleinen Bruder zu, was ihn hier erwartet: &quot;Du siehst Blut. Du siehst Schwei&szlig;. Du siehst Plastiks&auml;cke, in die man deine Kameraden steckt.&quot; Ohnm&auml;chtig mu&szlig; er mit ansehen, wie sein leichtgl&auml;ubiger, idealistischer Bruder in diesem Krieg verschlissen wird. Am Ende bleiben ihm nur die Erinnerungen.</B></FONT>
<BR><BR>
<FONT SIZE=+1><B>Da&szlig; Frauen offenbar auch 2063 in m&auml;nnlichen Macho-Augen nicht hundertprozentig gleichgestellt sind, l&auml;&szlig;t die bissige Bemerkung von Nathans Bruder vermuten: &quot;Ein M&auml;dchen macht bei euch den Truppen f&uuml;hrer?!&quot;</B></FONT>
<BR>
<HR WIDTH="100%" NOSHADE SIZE=1 COLOR=#FFFFFF>

</BODY>
</HTML>
