@DATABASE opium.newmail.ru:666/1s.htm
@WORDWRAP

@NODE MAIN
@TITLE " Ave Satanas..."
 
   @{" " link "0s.guide/MAIN"}@{"../pau.gif" link "../pau.gif/MAIN"}
Назад    Сатана, Дъявол, Люцифер... Кто такой Падший Ангел ?
    @{" " link "1_1s.guide/MAIN"}@{"../pau0.gif" link "../pau0.gif/MAIN"}
Дальше 
nbspnbsp Сказки о добром боге, всепрощающем и черезчур положительным, не имели бы той популярности, если б не было полной противоположности богу - неких Темных Сил. Христиане воспринают Сатану как падшего ангела, изгнаного богом, который частенько приходит к людям, чтобы совратить их против истинной веры! Чтоже остается делать кроме как ненавидить Сатану и в страхе замаливать свои грехи, тем самым поправляя материальное положение святош церковников, ожиревших, как свиньи! 
nbspnbspАтеисты или просто сочуствующие христианству воспринимают Дьявола(Сатану) как некое антропоморфное существо, что-то сродни лубочным чертям. Они смеются над Злом, считая себя истинным Добром, но убивают, насилуют и предают... И это истинное лицо Добра! 
nbspnbspСатанисты, в основном, считают Его олицетворением сил природы - Сил Тьмы. Сатана - "многогранный ключ к неведомому". Хотя люди и воспринимают Его по разному, Он один, Он олицетворение зла. Мы и есть зло(eviL), так почему бы не жить(Live), не брать от жизни всё? 
@{"5g.gif" link "5g.gif/MAIN"}
nbspnbspКто же такой Сатана? Пусть каждый поймет это сам... Для этого я привожу дальше книгу Антона Шандора ЛаВея "Сатанинская Библия". Публикуя ее я признаю,что нарушаю права автора, но купить книгу в России(особенно за пределами Москвы)достаточно сложно, и те, для кого она, по сути, предназначена не могут ее прочитать. 
   Антон Шандор ЛаВей
 "@{"b"}Сатанинская Библия@{"ub"}"
 Посвящается Диане
 Copyright (c) 1969 by Anton Szandor LaVey
 Перевод (c) 1991-1997 by Martyn
 Scan, OCR &HTML (c) 1998 Warrax
 Комментарии, сведение текста и HTML (c) 2000 by Opium.
 
 ---

 ---

 ---

 ---

 ---

@endnode
