@DATABASE opium.newmail.ru:666/3s.htm
@WORDWRAP

@NODE MAIN
@TITLE " Ave Satanas..."
 
   @{" " link "2s.guide/MAIN"}@{"../pau.gif" link "../pau.gif/MAIN"}
Назад    Черная Библия "Книга Сатаны"
 (Огонь)    @{" " link "4s.guide/MAIN"}@{"../pau0.gif" link "../pau0.gif/MAIN"}
Дальше 

@{"ks.jpg" link "ks.jpg/MAIN"}
I 
   - Из сей бесплодной пустыни стали и камня я возвышаю свой голос, дабы смогли вы услышать его. Востоку и Западу я подаю знак. Северу и Югу я даю знать: Смерть слабым, богатство сильным! 
   - Откройте глаза, дабы видеть, о, люди, чей разум заплесневел; слушайте меня, недоуменные миллионы! 
   - Ибо я восстаю, чтобы бросить вызов мудрости мира; подвергнуть испытанию "законы" Человека и "Бога"! 
   - Я испрашиваю суть его Золотого Правила и хочу знать, зачем нужны его десять заповедей. 
   - Ни перед одним из твоих печатных идолов я не склоняюсь в смирении и, тот, кто изрек "ты должен", есть мой смертный враг! 
   - Я погружаю свой указующий перст в водянистую кровь твоего бессильного сумасшедшего Спасителя и пишу на его иссеченном терном челе: Вот ИСТИННЫЙ принц зла - царь рабов! 
   - Ни одна седая ложь да не станет правдой для меня, ни одна удушливая догма да не стеснит мое перо! 
   - Я освобождаюсь ото всех условностей, которые не ведут к моему земному благополучию и счастью. 
   - Я воздвигаю в неумолимом посягательстве знамя сильных! 
   - Я впериваюсь в стеклянный глаз твоего страшного Иеговы и тяну его за бороду; я воздымаю топор и вскрываю его изъеденный червями череп! 
   - Я выбрасываю содержимое философски отбеленных гробниц и смеюсь с сардонической яростью! II 
   - Взгляните на распятие - что символизирует оно? Мертвенно-бледная немощность, висящая на куске дерева. 
   - Я испрашиваю все. Стоя пред гноящимися внутри и лакированными снаружи фасадами ваших надменных моральных догм, я пишу на них буквами пылающего презрения: "Прозрите же, ибо все это - обман!"< 
   - Сберитесь же вокруг меня, о, вы, презревшие смерть; и сама земля станет вашей! - обладайте же ею и владейте! 
   - Слишком долго руке мертвеца дозволено было стерилизовать живую мысль! 
   - Слишком долго правое и неправое, добро и зло были извращены лжепророками! 
   - Ни одно вероучение не должно приниматься на основании его "божественной" природы. Религии должны быть подвергнуты сомнению. Ни одна моральная догма не должна приниматься на веру, ни одно правило суждения не должно быть обожествлено. В моральных кодексах нет изначальной святости. Как и деревянные идолы далекого прошлого, они - плод труда рук человеческих, а то, что человек создал, он же может и уничтожить! 
   - Великоразумно не спешить уверовать во что-либо и во все, ибо вера в один лжепринцип есть начало всей глупости 
   - Главный долг всякой новой веры - взрастить новых людей, кои определят ее свободы, поведут к материальному успеху и собьют ржавые засовы и цепи мертвых обычаев, препятствующих здоровому развитию, Теории и идеи, означавшие жизнь, надежду и свободу для наших предков, теперь могут подразумевать разрушение, порабощение и бесчестие для нас! 
   - Ибо, как изменяется все вокруг, так и ни один человеческий идеал не может оставаться неизменным! 
   - Где и когда бы то ни было, ложь, возведенная на трон, да будет свергнута без пощады и жалости, ибо под бременем лживости никому не дано процветать. 
   - Пусть же устоявшиеся софизмы будут лишены трона, выкорчеваны, сожжены и уничтожены, ибо они есть постоянная угроза всему величию мысли и деяния! 
   - Если любая изреченная "правда" удостоверена на деле быть пустым вымыслом, да будет она бесцеремонно вышвырнута в космическую тьму к мертвым богам, мертвым империям, мертвым философиям и другому бесполезному мусору и отбросам! 
   - Самая опасная из всей царствующей лжи есть святая, освященная, привилегированная ложь, - ложь, являющаяся для всех шаблоном правды. Она плодит другие всеобщие ошибки и заблуждения. Она есть гидроголовое древо абсурдности с тысячью корнями - Она есть рак общества! 
   - Ложь, о которой известно, что она - ложь, уже наполовину искоренена, но с ложью, что даже мыслящий человек принимает за правду, с ложью, насажденной маленькому ребенку на коленях матери - с такой ложью бороться опаснее, чем с ползучей чумой! 
   - Общераспространенная ложь есть самый могущественный враг личной свободы. Есть лишь один способ иметь с ней дело: вырезать ее до самой сердцевины, как раковую опухоль. Уничтожить ее корень и ветвь. Истребить ее, пока она не сделала это с нами! 
 ---

 ---

 ---

 ---

 ---

@endnode
