<html>
<body background="../../images/fondtexte2.jpg"  border="0">
<a href="29villesetcodepostaux.html#b"target="description"><font color="brown">Brest</font></a>           (Altitude : 34 m)
<pre>
<hr>
D&eacute;partement : <a href="entetefinistere.html"Target="description">Finist&egrave;re</a>      R&eacute;gion : <a href="../entetebretagne.html"Target="description">Bretagne</a>

Code Postal : 29 200

  Habitants : 156 217 Brestois (en 1999)
 Superficie :

  <a href="carterazjpg.html" target="entete" alt="" >Situation</a> : &agrave; 110 km <a href="quimperle.html"target="description">Quimperl&eacute;</a>

    Plus... : 
<hr>
Bien au chaud au creux d'une des plus belles c&ocirc;tes sauvages de Bretagne, Brest
est le point de d&eacute;part privil&eacute;gi&eacute; pour ceux qui veulent se rendre sur les
magnifiques &icirc;les du Ponant (Mol&egrave;ne, Ouessant, Sein...) !
L'&eacute;t&eacute;, ces eaux sont parcourues par des dauphins joueurs et peu farouches
laissant leur place, l'hiver, aux phoques, beaucoup plus discrets.

Grand port de commerce, c'est aussi le port d'attache d'une grande partie
de la flotte militaire fran&ccedil;aise ! 

<b>Histoire :</b>
Brest, une ville martyris&eacute;e,et quasiment enti&egrave;rement ras&eacute;e par plus de 150
bombardements alli&eacute;s (l'arm&eacute;e allemande ravitaill&eacute;e par sous-marins occupa Brest
jusqu'au derniers jours...) lors de la 2&egrave;me guerre mondiale !
Seul quelques vieux quartiers ont &eacute;t&eacute; miraculeusement &eacute;pargn&eacute;s par le d&eacute;luge de feu de
 1944 (Saint-Martin, Recouvrance, le Ch&acirc;teau)...

Apr&egrave;s guerre, la ville fut reconstruite rapidement selon un plan g&eacute;om&eacute;trique, ce qui 
explique le manque de cachet de l'architecture Brestoise ! 

 Par contre, Les Brestois font preuve d'une hospitalit&eacute; et d'une chaleur l&eacute;gendaires...


<b>Culture et loisirs :</b>

Le Quartz est l'un des th&eacute;&acirc;tres les plus fr&eacute;quent&eacute;s de France !
Le Th&eacute;&acirc;tre de l'Instant montre &eacute;galement un beau dynamisme...

La cin&eacute;math&egrave;que de Bretagne 

Le festival du Film Court.

<b>Oc&eacute;anopolis :</b> c'est le plus grand aquarium marin &agrave; ciel ouvert !
Mais, son r&ocirc;le ne se limite pas au seul divertissement, c'est &eacute;galement un centre
de recherche scientifique sur le milieu marin ainsi qu'un lieu d'h&eacute;bergement et
de soin pour animaux sauvages locaux (phoques, dauphins, oiseaux...).

<b>En &eacute;t&eacute; :</b> Les "Jeudis du Port"  proposent des spectacles de rue, concerts etc...  
 
 
<b>2004</b>(et tous les 4 ans) : La population de Brest quadruple lors du plus grand 
rassemblement de vieux gr&eacute;ements ! Des voiliers de tous &acirc;ges et de toutes tailles 
se rencontrent dans la rade de Brest pour plusieurs jours de r&eacute;gates amicales 
et de f&ecirc;te. 



</pre>

</body>
</html>