<HTML>
<HEAD>
<TITLE>Questions les plus fr&eacute;quentes au sujet de l'Amiga</TITLE>
</HEAD>
<BODY>

<H2>Questions les plus fr&eacute;quentes au sujet de l'Amiga</H2>
<ol>
<h4><li><a href="AmigaFAQ_fr/bases.html">Les bases</h4></a>
<ul>
<li><a href="AmigaFAQ_fr/bases.html#1-1">Que sont le Kickstart, le Workbench et l'AmigaDOS, et quelle est la diff&eacute;rence ?</a>
<li><a href="AmigaFAQ_fr/bases.html#1-2">Qu'est-ce c'est ce multit&acirc;che, duquel on parle tant ?</a>
<li><a href="AmigaFAQ_fr/bases.html#1-3">Mais j'ai entendu dire que Windows 95 avait invent&eacute; le multit&acirc;che !</a>
</ul>

<h4><li><a href="AmigaFAQ_fr/materiel.html">Le mat&eacute;riel</h4></a>
<ul>
<li><a href="AmigaFAQ_fr/materiel.html#2-1">Quels sont les diff&eacute;rents mod&egrave;les Amiga ?</a>
<li><a href="AmigaFAQ_fr/materiel.html#2-2">Quelle est la diff&eacute;rence entre m&eacute;moire Chip et m&eacute;moire Fast ?</a>
<li><a href="AmigaFAQ_fr/materiel.html#2-3">Quelle quantit&eacute; de m&eacute;moire ce trouve dans mon Amiga ?</a>
<li><a href="AmigaFAQ_fr/materiel.html#2-4">Est-ce que je peut utiliser un &eacute;cran VGA pour mon Amiga ?</a>
<li><a href="AmigaFAQ_fr/materiel.html#2-5">Que sont PAL et NTSC, desquels on parle tant ?</a>
<li><a href="AmigaFAQ_fr/materiel.html#2-6">Est-ce que je peut avoir un affichage 16 Mio de couleurs haute r&eacute;solution sur Amiga ?</a>
</ul>

<h4><li><a href="AmigaFAQ_fr/systeme.html">Le syst&egrave;me d'exploitation</h4></a>
<ul>
<li><a href="AmigaFAQ_fr/systeme.html#3-1">Quelle est la derni&egrave;re version du syst&egrave;me de l'Amiga ?</a>
<li><a href="AmigaFAQ_fr/systeme.html#3-2">Quelle version du syst&egrave;me ce trouve dans mon ordinateur ?</a>
<li><a href="AmigaFAQ_fr/systeme.html#3-3">Est-ce que je dois passer à la version 3.1 ?</a>
<li><a href="AmigaFAQ_fr/systeme.html#3-4">Qu'implique le passage à une nouvelle version ?</a>
<li><a href="AmigaFAQ_fr/systeme.html#3-5">Quelles version du syst&egrave;me peuvent fonctionner sur mon ordinateur ?</a>
</ul>

<h4><li><a href="AmigaFAQ_fr/concepts.html">Concepts de base</h4></a>
<ul>
<li><a href="AmigaFAQ_fr/concepts.html#4-1">Qu'est-ce une unit&eacute; (device) ?</a>
<li><a href="AmigaFAQ_fr/concepts.html#4-2">Qu'est-ce un volume (volume) ?</a>
<li><a href="AmigaFAQ_fr/concepts.html#4-3">Qu'est-ce une partition (partition) ?</a>
<li><a href="AmigaFAQ_fr/concepts.html#4-4">Qu'est-ce une assignation (assign) ?</a>
<li><a href="AmigaFAQ_fr/concepts.html#4-5">Que sont tous ces fichiers qui finissent par &quot;.info&quot; ?</a>
<li><a href="AmigaFAQ_fr/concepts.html#4-6">Que sont tous ces fichiers qui finissent par &quot;.library&quot; ?</a>
</ul>

<h4><li><a href="AmigaFAQ_fr/workbench.html">Utiliser le Workbench</h4></a>
<ul>
<li><a href="AmigaFAQ_fr/workbench.html#5-1">Je clique sur l'ic&ocirc;ne &quot;install&quot; et il me dit &quot;Impossible d'ouvrir l'outil install&quot;, pourquoi ?</a>
<li><a href="AmigaFAQ_fr/workbench.html#5-2">Comment est-ce que je peut changer l'image d'une ic&ocirc;ne ?</a>
</ul>

<h4><li><a href="AmigaFAQ_fr/shell.html">Utiliser le Shell</h4></a>
<ul>
<li><a href="AmigaFAQ_fr/shell.html#6-1">Comment ouvrir un Shell ?</a>
<li><a href="AmigaFAQ_fr/shell.html#6-2">Quelles sont les commandes Shell les plus importantes ?</a>
</ul>
<h4><li><a href="AmigaFAQ_fr/config.html">Configuration</h4></a>
<ul>

<li><a href="AmigaFAQ_fr/config.html#7-1">Comment est-ce que je peut arr&ecirc;ter les clics du lecteur de
disquette ?</a>
<li><a href="AmigaFAQ_fr/config.html#7-2">Comment eviter  que les mauvais scripts d'installation ne
remplacent le contenu de LIBS: par des versions plus anciennes ?</a>
<li><a href="AmigaFAQ_fr/config.html#7-3">Comment conna&icirc;tre la version d'une librairie ?</a>
</ul>

<h4><li><a href="AmigaFAQ_fr/mat_supp.html">Mat&eacute;riels suppl&eacute;mentaires</h4></a>
<ul>
<li><a href="AmigaFAQ_fr/mat_supp.html#8-1">Est-ce que je peut utiliser un lecteur Iomega Zip sur mon Amiga ?</a>
<li><a href="AmigaFAQ_fr/mat_supp.html#8-2">Quelle est la mani&egrave;re la moins ch&egrave;re
d'acc&eacute;l&eacute;rer un Amiga non &eacute;tendu ?</a>
<li><a href="AmigaFAQ_fr/mat_supp.html#8-3">Quels types de disques durs fonctionnent avec le contr&ocirc;leur
interne du A1200 ?</a>
<li><a href="AmigaFAQ_fr/mat_supp.html#8-4">Ma carte acc&eacute;l&eacute;ratrice utilise des m&eacute;moires
SIMM 72 broches, quel type ? parit&eacute; ? EDO ?</a>
</ul>

<h4><li><a href="AmigaFAQ_fr/log_supp.html">Logiciels suppl&eacute;mentaires</h4></a>
<ul>
<li><a href="AmigaFAQ_fr/log_supp.html#9-1">Qu'est MUI ?</a>
<li><a href="AmigaFAQ_fr/log_supp.html#9-2">Pourquoi tout le monde parle de MUI ?</a>
<li><a href="AmigaFAQ_fr/log_supp.html#9-3">Qu'est Directory Opus ?</a>
<li><a href="AmigaFAQ_fr/log_supp.html#9-4">Qu'est Executive ?</a>
<li><a href="AmigaFAQ_fr/log_supp.html#9-5">Qu'est ixemul.library ?</a>
<li><a href="AmigaFAQ_fr/log_supp.html#9-6">Qu'est ADE ?</a>
<li><a href="AmigaFAQ_fr/log_supp.html#9-7">Qu'est CyberGraphX (CyberGfx) ?</a>
</ul>

<h4><li><a href="AmigaFAQ_fr/internet.html">L'Internet</h4></a>
<ul>
<li><a href="AmigaFAQ_fr/internet.html#10-1">Quel types de modem fonctionnent avec l'Amiga ?</a>
<li><a href="AmigaFAQ_fr/internet.html#10-2">A quelle vitesse peut fonctionner le port s&eacute;rie ?</a>
<li><a href="AmigaFAQ_fr/internet.html#10-3">Mais Serial Preferences ne me permet pas une vitesse pareille !</a>
<li><a href="AmigaFAQ_fr/internet.html#10-4">Qu'est LHA ? que faire avec tout ces fichiers &quot;.lha&quot; ?</a>
<li><a href="AmigaFAQ_fr/internet.html#10-5">Qu'est Aminet ?</a>
<li><a href="AmigaFAQ_fr/internet.html#10-6">O&ugrave; ce trouvent les sites miroirs Aminet ?</a>
<li><a href="AmigaFAQ_fr/internet.html#10-7">Comment est organis&eacute; Aminet ?</a>
<li><a href="AmigaFAQ_fr/internet.html#10-8">Est-ce que je peut utiliser Netscape Navigator sur mon Amiga ?</a>
</ul>

<h4><li><a href="AmigaFAQ_fr/plateformes.html">Travailler avec d'autres plateformes</h4></a>
<ul>
<li><a href="AmigaFAQ_fr/plateformes.html#11-1">Est-ce que je peut lire des disquettes Amiga sur un PC ?</a>
<li><a href="AmigaFAQ_fr/plateformes.html#11-2">Alors est-ce que je peut lire des disquettes PC sur un Amiga ?</a>
<li><a href="AmigaFAQ_fr/plateformes.html#11-3">Est-ce que l'Amiga peut lire des disquettes Macinthosh ?</a>
<li><a href="AmigaFAQ_fr/plateformes.html#11-4">Est-ce que je peut transf&eacute;rer des fichiers de l'Amiga au
Mac, et vice-versa sans utiliser de logiciel sp&eacute;cial comme CrossMac ?</a>
<li><a href="AmigaFAQ_fr/plateformes.html#11-5">Quand je transf&egrave;re une image de l'Amiga au Mac/PC elle
appara&icirc;t ecras&eacute;e, et quand je la transf&egrave;re du Mac/PC à l'Amiga
elle appara&icirc;t allong&eacute;e, qu'est-ce que je dois faire ?</a>
<li><a href="AmigaFAQ_fr/plateformes.html#11-6">Quand je transf&egrave;re un fichier texte de l'Amiga vers le
PC il est compl&eacute;tement d&eacute;form&eacute;, il manque les sauts de ligne.
Que faire ?</a>
<li><a href="AmigaFAQ_fr/plateformes.html#11-7">Qu'est Shapeshifter ?</a>
<li><a href="AmigaFAQ_fr/plateformes.html#11-8">Comment faire pour se procurer une ROM Mac ?</a>
</ul>

</ol>
<hr>
<h4>Notes:</h4>
<p>
<b>Aide:</b> Si vous avez des contributions, des corrections, des commentaires, etc
ils sont les bienvenus. Envoyez les par e-mail (en français ou anglais) à
joel.juillerat@profora.ch, si vous avez des contributions je me r&eacute;serve le
droit de les utiliser, de les modifier, de les re&eacute;crire, ou de ne pas en tenir
compte. Pensez bien que ce document est destin&eacute; aux d&eacute;butants, il n'est pas
pr&eacute;vu comme &eacute;tant un document d'usage g&eacute;n&eacute;ral.
</p><p>
<b>Responsabilit&eacute;: </b>Ces informations sont pr&eacute;vues pour vous aider. Cependant je
ne suis en aucun cas r&eacute;sponsable des erreurs ou manques. Si votre ordinateur
explose et que votre chat joue avec le feu et le r&eacute;pand dans toute la maison
c'est de votre faute, pas la mienne. Vous ne deviez pas le laisser dormir à c&ocirc;t&eacute;
de votre moniteur.
</p><p>
<b>Notes du traducteur: </b>Ce document est une premi&egrave;re version traduite en français
du texte de Jeremy Nixon, il contient certainement des erreurs, si vous
avez des remarques, suggestions de traductions ou autres envoyez un e-mail à
joel.juillerat@profora.ch. Ce document à &eacute;t&eacute; traduit de l'anglais en utilisant
les termes les plus simples possibles, j'esp&egrave;re qu'il sera lisible par tous, les
termes techniques ont &eacute;galement &eacute;t&eacute; traduits, cependant certains termes sont
plus couramment utilis&eacute;s en anglais, dans ce cas le terme original est indiqu&eacute;
entre parenth&egrave;ses
</p><p>
<b>Remerciements: </b>A tous ceux qui ont envoy&eacute; des suggestions, des id&eacute;es,
 des corrections. Ceci inclus: Michael &lt;shotgun@best.com&gt;, Dirk
 Kocherscheidt &lt;Dirk@chessy.aworld.de&gt;, Roland Bengtsson &lt;roland.bengtsson@mbox3.swipnet.se&gt;,
 Thorsten Behrens &lt;thorsten.behrens@dorunth.hb.north.de&gt;, ainsi
 que Bill Near &lt;wnear@epix.com&gt; l'actuel responsable de ce texte, et
 Jeremy Nixon &lt;jeremy@exit109.com&gt; l'auteur original.
</p>
<p>Cette FAQ est sous copyright (C) 1996 Bill Near, elle a &eacute;t&eacute; traduite
par Joel Juillerat avec l'aimable autorisation de l'auteur.
Vous pouvez publier ce document sous forme &eacute;l&eacute;ctronique, pourvu qu'il
reste complet et inchang&eacute; et qu'il reste gratuit.</p>
</body>
</html>
