<html>
<body background="../../images/fondtexte2.jpg"  border="0">
<a name="a"></a>
<b><a href="ungersheim.html#agenda">AGENDA</a></b><bR>
<br><br>
<b>- 1er mai : </b>Ouverture du clair de mine.<br>
R&eacute;alisation d'un labyrinthe d'argile, de foin , de sable de fer...(tout
les dimanche puis tous les jours en juillet-ao&ucirc;t)<br>
<br>
<b>- 8 mai :</b> Travail de l'apiculteur, tonte des moutons et travail de la laine.<br>
<br>
<b>- 14 mai :</b> Soir&eacute;e forraine, dans le cadre de la nuit des mus&eacute;es<br>
<br>
<b>- 15 mai :</b> <i>Charivari de la Pentec&ocirc;te</i> cort&egrave;ge grim&eacute; et masqu&eacute;, d&eacute;monstration d'adresse par les &eacute;leveurs et dresseurs de chevaux de traits.<br>
<br>
<b>- 22 mai :</b> D&eacute;monstration et initiation de taille de pierre, palissage de vigne et distillation d'eau de vie.<br>
<br>
<b>- 29 mai, 10 juillet, 21 ao&ucirc;t, 2 et 9 octobre :</b> Travail du Charron (secret de fabrication d'une roue de charrette)
<br>
<br>
<b>- 5 juin :</b> Fenaison manuelle et motoris&eacute;e.<br>
<br>
<b>- 12 juin :</b> Pr&eacute;sentation des machines mini&egrave;res de fond.<br>
<br>
<b>- 19 juin :</b> Du travail de l'apiculteur &agrave; la fabrication de pain d'&eacute;pice &agrave; l'ancienne.<br>
Animation folkloriques et march&eacute; paysan.<br>
Travail des tonneliers<br>
<br>
<b>- 26 juin :</b> Cuisson de poteries au four &agrave; bois.<br>
<bR>
<b>- 3 juillet :</b> D&eacute;couverte des c&eacute;r&eacute;ales anciennes.<br>
<br>
<b>- 14, 17, 24 et 31 juillet :</b> Les diff&eacute;rentes techniques de moissons de la premi&egrave;re moiti&eacute; du 20&egrave;me si&egrave;cle.<br>
<br>
<b>- 24 juillet :</b> cerclage de roues de charrette par le forgeron.<br>
<br>
<b>- 31 juillet :</b> Travail des tonneliers.<br>
<br> 
<b>- 7, 14, 21 et 28 ao&ucirc;t :</b> Battage au fl&eacute;au, entrain&eacute; par un man&egrave;ge &agrave; cheval ou par une machine &agrave; vapeur.<br>
<br>
<b>- 10 et 11 septembre :</b> Travail des tailleurs et sculpteurs sur pierre.<br>
<br>
<b>- 18 et 25 septembre :</b> Le vin &agrave; l'honneur.<br>
<br>
<b>- 2 et 9 octobre :</b> Grand march&eacute; paysan de la Saint-Michel.<br>
<br>
<b>- 16 octobre :</b> R&eacute;colte des choux.Cerclage de roues de charrette par le forgeron. <br>
<br>
<b>- 23 octobre :</b> R&eacute;colte des betteraves et leur transformation en sucre.Travail des tonneliers <br>
<br>
<b>- 30 octobre :</b> Cochonnailles d'automne.<br>
<br>
<b>- 13 novembre :</b> D&eacute;guster le vin de l'&eacute;comus&eacute;e juste apr&egrave;s soutirage.<br>
<br>
<b>- No&euml;l :</b> Cultures et croyances autour de Saint-Nicolas et du P&egrave;re No&euml;l<br>
<br>  <bR>
<A HREF="#a"<font color="#FF0000">haut de page</font> </A><br>
</body>
</html>