 <html>
<head>
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>2.9.1 &nbsp; Allgemeines</b></h1>

<p>Sollten Sie ein WACOM-Tablett besitzen, so k&#246;nnen Sie mit Hilfe des
Treibers von Roland Schwingel (Shareware, auf der CD) dieses in Xi-Paint
einbetten. Am Besten funktioniert die Version 1.50 oder h&#246;her. </p>

<p>Eingestellt wird die Unterst&#252;tzung im Fenster &quot;Verf&#252;gbare
Maustreiber&quot; des Xi-Prefs-Programms. Im Hauptprogramm selber sollten
Sie im Drucksensitiv-Fenster das Gadget &quot;Tablett verwenden&quot;
einschalten (&#214;ffnen des Fensters im Men&#252; durch
&quot;Sonstiges/Drucksensitiv-Fenster&quot;). </p>

<p>Bei &quot;Verf&#252;gbare Maustreiber&quot; in Xi-Prefs werden die zum
jeweiligen Ausgabetreiber passenden Anbindungsmodule aufgelistet. Weiters
mu&#223; der Andruck-Bereich des Tabletts eingestellt werden. Dies ist
daher notwendig, da die verschiedenen WACOM-Tabletts (sogar physikalisch)
unterschiedliche Bereiche haben und auch der (die) Treiber ein
W&#246;rtchen mitreden. Daher kann in folgenden Gadgets der Andruck-Bereich
eingestellt werden. </p>

<ul>

<li> <b>Minimum:</b><br> Legt den minimalen Andruckwert fest, wenn der
Stift das Tablett kaum mehr ber&#252;hrt, oder schon davon weg ist. </li>

<li> <b>Schwelle:</b><br> Dieser Wert sollte geliefert werden, wenn man den
Stift ganz leicht dr&#252;ckt. Dies ist der Wert, bei dem der
Spitzenschalter eines neueren WACOM-Tabletts schaltet. </li>

<li> <b>Maximum:</b><br> Legt den maximalen Druckwert fest, der vom Tablett
geliefert werden kann. </li>
</ul>

<p>Manche Werte k&#246;nnen vom verwendeten Treiber geholt werden, andere
m&#252;ssen vom User ermittelt und eingegeben werden. Dazu gibt es meistens
Testprogramme zum Treiber. Beim Treiber auf der CD sind dies die Programme
im Developer-Ordner. Damit kann anhand des Button-Wertes (0 od. 1) z. B.
die mittlere Schwelle herausfinden, in dem man den Stift auf das Tablett
dr&#252;ckt und die ausgegebenen Werte beachtet. Grunds&#228;tzlich gilt:
seien sie lieber konservativ bei der Eingabe von Werten (Minimum eher zu
gro&#223;, Maximum eher zu klein), sonst kann Xi-Paint bei falschen Werten
abst&#252;rzen. </p>

<p>Maustreiber-Module gibt es folgende: <ul> <li> <b>Amiga-Maus:</b><br>
Verwendung der Amiga-Maus und des TablettInterfaces von OS 3.0. Dies
erlaubt die Verwendung jedes Tablett-Treibers, der das Interface
unterst&#252;tzt. Da das OSInterface leider durch einen Designfehler
keinerlei Angaben &#252;ber den Druckbereich macht, m&#252;ssen alle drei
Werte ermittelt und eingegeben werden. </li>

<li> <b>Wacom II-S/IV Tablett:</b><br> Dieser Treiber benutzt das passive
Interface des Treibers von Roland Schwingel auf der CD. Es sollte
mindestens Version 1.50 (auf der CD) benutzt werden, da diese schon den
Wert f&#252;r Minimum und Maximum des Druckes liefert. Die Schwelle
f&#252;r den Spitzenschalter mu&#223; allerdings ermittelt werden, da diese
selbst bei den Tabletts einer Baureihe unterschiedlich sein kann und daher
dem Treiber nicht bekannt ist. </li>

<li> <b>Wacom Active-Interface:</b><br> Diese Variante benutzt das neue
aktive Interface des 1.50 Treibers. Auf Grund der Konzeption funktioniert
es leider nicht zusammen mit den Version, die Intuition-Fenster benutzen,
und wird daher bei diesen Ausgabe-Treibern nicht aufgelistet. Dieses
Tablett-Interface ist das schnellste und erm&#246;glicht die
nat&#252;rlichste Handhabung durch schnelle Reaktion. Es mu&#223; nur der
Wert f&#252;r die Schwelle eingegben werden. </li>

Neu ist jetzt bei allen Treibern, dass die Amiga-Maus und das Tablett
gleichzeitg benutzt werden k&#246;nnen. So kann die Bedienung der Buttons
mit der Maus erfolgen, und das Tablett nur zum Zeichnen verwendet werden.
</p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html>
