<html>
<head>
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>
<h1 align=center><b>7 &nbsp; H&#228;ufig vorkommende Anwender-Fehler</b></h1>

<table border=0 width=100% cellpadding=8>
<tr><td colspan=2> 
Es kommt nur die Meldung &quot;Couldn't open Screen&quot;
</td></tr>
<tr><td valign=top> Abhilfe: </td><td>
XiPrefs starten und eine Grafikkarte und Aufl&#246;sung aussuchen. XiPaint
nochmals starten. 
</td></tr>

<tr><td colspan=2><hr><br>
Es kommt die Meldung &quot;Veraltete oder Demoversion etc.&quot; Manchmal startet
XiPaint hoch - aber es tut sich nichts. In den Men&#252;s ist kein Font etc.
</td></tr>
<tr><td valign=top> Abhilfe: </td><td>
Manche Konfigurationen k&#246;nnen (aus mir unbekannten Gr&#252;nden) einfach die
Libraries aus dem aktuellen Verzeichnis laden. Abhilfe: (Notnagel): Alle Xi
# ?.library nach libs: kopieren. Rechner starten und nochmals XiPrefs
aufrufen, dann XiPaint.
</td></tr>

<tr><td colspan=2><hr><br>
Beim Start ist nur ein grauer Schirm - sonst nichts
</td></tr>
<tr><td valign=top> Abhilfe: </td><td>
Rechte Maustaste dr&#252;cken und in der Men&#252;zeile Toolbar ausw&#228;hlen. Dann Neues
Projekt etc.
</td></tr>

<tr><td colspan=2><hr><br>
Es werden im Browser keine Bilder angezeigt.
</td></tr>
<tr><td valign=top> Abhilfe: </td><td>
Dann gibt es noch keine Minipics. Diese werden mit XiPaint automatisch
erstellt. Nachtr&#228;glich kann man diese im Filerequester erstellen, indem man
auf die Anzeigefl&#228;che im Filerequester klickt. Die Bilddatei mu&#223; nat&#252;rlich
angew&#228;hlt sein.
</td></tr>

<tr><td colspan=2><hr><br>
Es werden gar keine Rahmen oder Bilder im Browser dargestellt, ja es kann
nicht mal ein Bild geladen werden
</td></tr>
<tr><td valign=top> Abhilfe: </td><td>
Dann ist im System-Notebook &quot;Laden&quot; nur z. B. Internal DEEP eingestellt -
Sie haben aber versucht, ein IFF oder anderes Format zu laden. Bitte w&#228;hlen
Sie z. B. XiMulti als Modul zum Laden aus.
</td></tr>

<tr><td colspan=2><hr><br>
Andere Programme k&#246;nnen XiPaint-Bilder nicht laden
</td></tr>
<tr><td valign=top> Abhilfe: </td><td>
Im System-Notebook Sichern das Speicherformat auf z. B. IFF einstellen.
</td></tr>

<tr><td colspan=2><hr><br>
Display (Bildschirm) l&#228;&#223;t sich nicht in der gew&#252;nschten Aufl&#246;sung
einstellen
</td></tr>
<tr><td valign=top> Abhilfe: </td><td>
Schauen Sie in der Retina-Workbench-Emulation im -Paint-Eintrag nach, ob
die ausgesuchte Gruppe auch die Aufl&#246;sung kann, die der Retina-Screen
fordert. Im Zweifelsfall die gr&#246;&#223;te Gruppe ausw&#228;hlen, die angegeben wird,
z. B. Group 30-38kHz 50-91 Hz. <br><br>

Noch besser ist es, wenn dieser Screen nicht emuliert wird, sondern am
Amiga ausgegeben wird. So braucht dieser nur sehr wenig (Retina-)Speicher.
</td></tr>

<tr><td colspan=2><hr><br>
Xi-Paint-Screen geht nicht mehr nach vorne
</td></tr>
<tr><td valign=top> Abhilfe: </td><td>
Aktivieren Sie auf der Workbench irgend ein Fenster. Wechseln Sie dann die
Screens, indem Sie Amiga-M dr&#252;cken oder auf das Backdrop-Gadget klicken.
</td></tr>
<tr><td valign=top> Abhilfe2: </td><td>
Installieren Sie das Programm 'FKey' Ihrer original Amiga OS (&gt;= 2.0)
Disketten. Belegen Sie eine Ihnen sinnvoll erscheinende Taste mit dem
Programm 'xsend'. Dieses Programm befindet sich im Verzeichnis
'XiPaint/User'. Dieses Programm bringt dann auf Knopfdruck den
Xi-Paint-Screen nach vorne.
</td></tr>

<tr><td colspan=2><hr><br>
Durchgehende Linien mit dem Airbrush haben eine starke Unregelm&#228;&#223;igkeit in
der Intensit&#228;t
</td></tr>
<tr><td valign=top> Abhilfe: </td><td>
Ausschalten der AntiAlias-Funtkion im System-Notebook (Seite &quot;Pinsel&quot;).
</td></tr>

<tr><td colspan=2><hr><br>
Xi-Paint kann meine Bilder nicht laden
</td></tr>
<tr><td valign=top> Abhilfe: </td><td>
Standardm&#228;&#223;ig ist der Lader &quot;Internal DEEP&quot; eingestellt. Wenn Sie nun ein
Bild in einem anderen Format als IFF DEEP vorliegen haben, sollten Sie den
Lader &quot;Multipic_Loader&quot; einstellen, da dieser viele verschiedene Formate
kennt. <br><br>

Falls Sie das genaue File-Format Ihrer Bilder kennen, und dieses in der
Lader-Liste gef&#252;hrt wird, k&#246;nnen Sie es auch ohne den Umweg &#252;ber den
&quot;Multipic_Loader&quot; direkt anw&#228;hlen. </td></tr>

</table>
</p>

<hr size=4></td></tr></table></center>
<br>
</body>
</html>

