@DATABASE opium.newmail.ru:666/10s.htm
@WORDWRAP

@NODE MAIN
@TITLE " Ave Satanas..."
 
   @{" " link "9s.guide/MAIN"}@{"../pau.gif" link "../pau.gif/MAIN"}
Назад    Черная Библия "Книга Люцифера
 (Воздух)"    @{" " link "11s.guide/MAIN"}@{"../pau0.gif" link "../pau0.gif/MAIN"}
Дальше 

Любовь и ненависть 

&nbsp;Сатанизм представляет милость к тем. кто заслужил ее, вместо любви, потраченной на льстецов! 

&nbsp;Нельзя любить всех; смешно думать, что это возможно. Если вы любите всех и вся, то теряете естественную способность выбора и превращаетесь в плохого судию характеров и качеств. Если чем-либо пользоваться слишком вольно, оно просто теряет свой истинный смысл. Поэтому, Сатанист верит, что нужно любить сильно и в полной мере тех, кто заслужил вашу любовь, но никогда не подставлять другую щеку врагу своему! 

&nbsp;Любовь - одна из сильнейших эмоций, испытываемых человеком; на втором месте после нее стоит ненависть. Заставлять себя чувствовать любовь без разбора весьма противоестественно. Пытаясь любить всех, вы только принижаете свои чувства к тем, кто нуждается в ней. Подавленная ненависть может привести ко многим физическим и эмоциональным расстройствам. Научившись высвобождать свою ненависть к тем, кто заслужил ее, вы очистите себя от злокачественных эмоций и потребности выплеснуть сдерживаемую ненависть на ваших любимых. 

&nbsp;Следует заметить, что в истории мира не было еще великих движений "любви", которые не заканчивались бы убийством неисчислимого количества людей ради того лишь, чтобы доказать им, сколь любимы они! У всех лицемеров этой земли карманы всегда набиты любовью! 

&nbsp;Каждый фарисейский набожник, утверждающий, что надо любить своего врага, даже будучи оскорбленным им, утешает себя мыслью о том, что врага его постигнет кара божья. Вместо того, чтобы признаться себе в том, что и они сами в силах ненавидеть своих противников и относиться к ним подобающим образом, они говорят: "Значит, на то воля божья" и "молятся" за них. Зачем унижаться, проводя столь неточную политику? 

&nbsp;Сатанизм всегда связывался с безжалостном и жестокостью, но лишь потому, что люди страшились повернуться лицом к правде, а правда состоит в том, что человеческие существа вовсе не такие добрые и не такие любвеобильные. Только потому, что Сатанист признает себя способным и к любви и к ненависти, он считается злобным. Однако, наоборот, именно потому, что он способен выпускать свою ярость через ритуальное выражение, он намного сильнее способен к любви - к более глубокой любви. Искренне распознавая и признавая любовь и ненависть, которые он способен прочувствовать, он не может спутать одно с другим. Тот же, кто не в силах испытать одно из этих чувств, не может в полной мере испытать другое. 
 ---

 ---

 ---

 ---

 ---

@endnode
