@DATABASE opium.newmail.ru:666/4s.htm
@WORDWRAP

@NODE MAIN
@TITLE " Ave Satanas..."
 
   @{" " link "3s.guide/MAIN"}@{"../pau.gif" link "../pau.gif/MAIN"}
Назад    Черная Библия "Книга Сатаны"
 (Огонь)    @{" " link "5s.guide/MAIN"}@{"../pau0.gif" link "../pau0.gif/MAIN"}
Дальше 

III 
   - "Любите друг друга", - сказано в высшем законе, но что за смысл вложен в эти слова? На каком рациональном основании покоится этот стих любви? Почему я не должен ненавидеть врагов моих; ведь если я "возлюблю" их, не отдаст ли это меня в их власть? 
   - Естественно ли для врагов творить добро друг другу, и ЧТО ЕСТЬ ДОБРО? 
   - Может ли изорванная и окровавленная жертва "любить" омытые кровью челюсти, что разрывают ее на части? 
   - Не являемся ли мы все инстинктивно хищными зверьми? Если люди перестанут охотиться друг на друга, смогут ли они продолжать свое существование? 
   - Не являются ли "вожделение" и "плотская страсть" более подходящими терминами для определения "любви" в приложении к продолжению рода человеческого? Не есть ли "любовь" лебезящих священных писаний простой эвфемизм для сексуальной деятельности, или "великий учитель" был восхвалителем евнухов? 
   - Любить врагов своих и творить добро тем, кто ненавидит и использует тебя - не есть ли это презренная философия спаниеля, который перекатывается на спину, когда его пнут? 
   - Ненавидь врагов своих всем сердцем, и, если кто-то дал тебе пощечину по одной щеке, СОКРУШИ обидчика своего в его другую щеку! Сокруши весь бок его, ибо самосохранение есть высший закон! 
   - Подставляющий же другую щеку, есть трусливый пес! 
   - Удар за удар, ярость за ярость, смерть за смерть - и все это с извлечением обильной выгоды! Глаз за глаз, зуб за зуб четырехкратно и стократно! Стань Ужасом для противника своего, и, идя путем своим, он обретет достаточно опыта, над коим следует поразмыслить - этим заставишь ты уважать себя во всех проявлениях жизни и дух твой, - бессмертный дух твой будет жить не в неосязаемом раю, а в мозгах и сухожилиях тех, чьего уважения ты добился. IV 
   - Жизнь есть величайшая милость, смерть - величайшая немилость. И, посему, надо прожить большую часть жизни - ЗДЕСЬ И СЕЙЧАС! 
   - Нет ни небес в сиянии славном, ни ада, где жарятся грешники. Здесь и сейчас день наших вечных мук! Здесь и сейчас наш день наслаждения! Здесь и сейчас наш шанс! Выбери же этот день, этот час, ибо спасителя нет! 
   - Скажи сердцу своему: "Я - сам себе спаситель!"< 
   - Останови на пути их тех, кто преследует тебя. Пусть те, кто замыслили разделаться с тобой, будут отшвырнуты в смятение и бесчестие. Да предстанут таковые как тростинки пред циклоном и да не будет дано им возрадоваться собственному спасению. 
   - Затем все твое существо скажет, исполненное гордостью: "Кто еще на меня? Не был ли я достаточно силен для противников моих? Не освободил ли я сам СЕБЯ своими собственными разумом и телом?"< V 
   - Благословенны сильные, ибо будут они вершить судьбу мира. Прокляты слабые, ибо наследство им - ярмо! 
   - Благословенны могущественные и да почитаемы будут среди людей. Прокляты немощные и да стерты будут с лица земли! 
   - Благословенны смелые и да пребудут они властелинами мира. Прокляты праведно скромные и да растоптаны они будут раздвоенными копытами! 
   - Благословенны победители, ибо победа - основа права. Прокляты покорившиеся, ибо будут они вассалами навек! 
   - Благословенна железная рука и пусть непокорные бегут от нее. Прокляты слабые духом и да будут оплеваны они! 
   - Благословенны презревшие смерть и да будут дни их долги на земле. Прокляты те, кто уповает на богатую жизнь по ту сторону могилы и да сгинут они среди многих! 
   - Благословенны разрушители лженадежд, ибо они есть настоящие Мессии, Прокляты богопочитатели и да будут стрижены как овцы! 
   - Благословенны доблестные, ибо им в награду - великие сокровища. Прокляты уверовавшие в добро и зло, ибо пугаемы они тенями! 
   - Благословенны верующие в свое благо и да никогда в разум их не вселится страх. Прокляты "агнцы господни", ибо будут обескровлены они белее снега! 
   - . Благословен имеющий врагов и да сделают они его героем. Проклят творящий добро тем, кто скалится в ответ ему, ибо будет он презрен! 
   - . Благословенны великие разумом, ибо оседлают они вихри. Прокляты те, кто учит, что ложь есть правда и правда есть ложь, ибо отвратны они. 
   - Трижды прокляты слабые, чья небезопасность делает их опасными и дано будет им служить и страдать! 
   - Ангел самообмана утвердился в душах "праведных" Вечный огонь силы через радость обитает во плоти Сатаниста! 
 ---

 ---

 ---

 ---

 ---

@endnode
