<html>
<body background="../images/fondtexte2.jpg"  border="0">
<font color="brown"><b>Alphonse de Lamartine</b></font> (1790-1869)<br>
<br>
<table>
<tr>
<td>
<img src="images/alphonselamartin.jpg"><br>
</td>
<td>
<br>

 Lamartine est le po&egrave;te de la r&ecirc;verie et de l'&eacute;motion. De son oeuvre vaste restent surtout des pi&egrave;ces lyriques appel&eacute;es M&eacute;ditations po&eacute;tiques, inspir&eacute;es par une forme id&eacute;alis&eacute;e de l'amour. Lamartine est aussi le seul &eacute;crivain fran&ccedil;ais de l'&eacute;poque &agrave; avoir jou&eacute; concr&egrave;tement un r&ocirc;le politique.<br>
<br><br>
 Une jeunesse ais&eacute;e :<br>
<br>
 N&eacute; pr&egrave;s de M&acirc;con en 1790, Alphonse de Lamartine appartient &agrave; la petite noblesse provinciale. Son p&egrave;re &eacute;tait un royaliste convaincu, et sa m&egrave;re issue de la bourgeoisie cultiv&eacute;e. Apr&egrave;s des &eacute;tudes classiques, il m&egrave;ne une vie oisive partag&eacute;e entre son village, <a href="../bourgogne/saoneetloire/milly-lamartine.html"target="description">Milly</a>, et Paris : il y &eacute;crit ses premiers essais litt&eacute;raires, nourri de F&eacute;nelon et Racine, mais admirateur &eacute;galement de Chateaubriand, Byron et P&eacute;trarque. Un s&eacute;jour en Italie (1811-1812) contribue &agrave; son &eacute;ducation esth&eacute;tique et sentimentale.<br>
</td>
</tr>
</table>
<br><br>
 La vie sentimentale :<br>
<br>
 De ses relations avec la Napolitaine Antonella naissent des po&egrave;mes &agrave; la gloire de Graziella; mais leur inspiratrice meurt de la tuberculose en 1815. De retour en France, Lamartine s'ennuie au service du roi Louis XVIII ; il d&eacute;missionne et voyage beaucoup. Son inactivit&eacute; et son d&eacute;sarroi le persuadent qu'il est malade. En cure &agrave; Aix, en Savoie, il rencontre en 1816 Mme Julie Charles, &eacute;pouse d'un physicien connu, Leur amour r&eacute;ciproque mais bref lui inspire ses po&egrave;mes les plus c&eacute;l&egrave;bres, dont le fameux &laquo; Le Lac &raquo;. En 1820, il &eacute;pouse une jeune Anglaise, Maria Anna Elisa Birch, qui sera pour lui une &eacute;pouse d&eacute;vou&eacute;e et admirative.<br>
<br><br>
 Le diplomate et l'homme politique :<br>
<br>
 De 1820 &agrave; 1830, Lamartine exerce des fonctions diplomatiques en Italie. Les &eacute;v&eacute;nements de 1830 infl&eacute;chissent sa ligne de pens&eacute;e : monarchiste au d&eacute;part, il &eacute;volue vers le lib&eacute;ralisme et l'action. Il abandonne la diplomatie pour se lancer dans la politique. Candidat d&eacute;put&eacute; &agrave; Bergues pr&egrave;s de Dunkerque, il &eacute;choue en 1831 mais est finalement &eacute;lu en 1833. Au Parlement, il ne sert aucun parti, pr&eacute;f&eacute;rant si&eacute;ger &laquo; au plafond &raquo; (tout en haut de l'h&eacute;micycle). Son talent, son sens de la formule en font rapidement un orateur r&eacute;put&eacute; et redout&eacute;. Gagn&eacute; par les id&eacute;es r&eacute;publicaines, il se range parmi les opposants &agrave; la monarchie de Louis-Philippe- En f&eacute;vrier 1848, il devient chef du pouvoir ex&eacute;cutif de la France. Ce succ&egrave;s est de courte dur&eacute;e : les &eacute;v&eacute;nements sanglants de juin 1848 d&eacute;truisent les illusions du po&egrave;te. Son &eacute;chec cuisant lors des &eacute;lections pr&eacute;sidentielles de 1851 marque la fin de sa carri&egrave;re politique.<br>
<br><br>
 Une vieillesse d&eacute;munie :<br>
<br>
 De nombreuses dettes de jeu et des soucis financiers assombrissent la fin de sa vie. Lamartine devient une sorte de for&ccedil;at de la litt&eacute;rature : r&eacute;cits, romans, compilations historiques ne lui permettent pourtant pas d'&eacute;chapper &agrave; ses cr&eacute;anciers. Il doit vendre ses biens et accepter l'humiliation d'une &laquo; pension nationale &raquo;. Seule sa relation sentimentale avec sa ni&egrave;ce le r&eacute;conforte quelque peu. Il meurt oubli&eacute; de tous, dans l'&eacute;puisement et le d&eacute;nuement.<br>
<br><br>
 Quelques oeuvres :<br>
<br>
 1820 M&eacute;ditations po&eacute;tiques<br>
1823 Nouvelles M&eacute;ditations po&eacute;tiques<br>
1825 Dernier Chant du p&egrave;lerinage d'Harold<br>
1836 Jocelyne<br>
1839 Recueillements Po&eacute;tiques<br>
</body>
</html>