<html>
<body background="../images/fondtexte2.jpg"  border="0">


<font color="brown"><b>Cl&eacute;ment Ader</b></font> (1841-1925)<br> 
<table>
<tr>
<td>
<img src="images/clementader.jpg"><br>
</td>
<td>
L'un des pères de l'aviation.<br>
<br><br>



<b>- 1855 :</b> (&agrave; <a href="../midipyrennees/hautegaronne/muret.html"target="description">Muret</a>, pr&egrave;s de Toulouse) &agrave; 14 ans, Cl&eacute;ment Ader se lance du haut d'une colline rev&ecirc;tu d'un costume d'oiseau constitu&eacute; d'une grande veste, de quelques m&egrave;tres de lustrine et de 2 b&acirc;tons.<br>
<br>
<b>- 1861 :</b>  il obtient son dipl&ocirc;me d'ing&eacute;nieur en 1861 et devient conducteur de travaux aux Ponts-et-Chaussées <br>
<br>
<b>- 1862 :</b> conducteur de travaux à la Compagnie de Chemins de Fer du Midi.<br>
<br>
</td>
</tr>
</table>
<b>- 1868 :</b> il d&eacute;pose un brevet pour am&eacute;liorer les v&eacute;locip&egrave;des o&ugrave; le cerclage de fer des roues se voit remplacer par un bandage en caoutchouc (qui poss&egrave;de entre autres l'avantage d'&ecirc;tre souple et silencieux).<br> 
Ader se lance alors dans la production de ses "V&eacute;loces-caoutchouc".<br> 
<br><br>
<b>- Le 9 octobre 1890 :</b><br>
<br>
Apr&egrave;s 7 ans de travail, il parvient enfin &agrave; voler, l'Eole fera un bond de 50 m &agrave; 20 cm du sol (dans le parc du ch&acirc;teau d'Armainvilliers en Seine-et-Marne).<br>
<br><br>
<b>L'Eole</b> (en r&eacute;f&eacute;rence au dieu grec des vents) :<br>
<br>
- Les ailes étaient constituées d'une armature en bois recouverte d'une membrane de soie fixée par 6500 boutons! L'envergure totale atteignait 13m70.<br>
<br>
- Le fuselage, recouvert de soie reposait sur 3 roues.<br>
<br>
- L'h&eacute;lice de bambou &agrave; 4 pales &eacute;tait entra&icirc;n&eacute;e par un moteur &agrave; vapeur de 20 chevaux (17,5 kg).<br>
<br><br>
 Il baptisa ce type de v&eacute;hicule <b>un avion</b> (sur la base du mot latin avis qui signifie oiseau).<br> 


</body>
</html>