<html>
<body background="../images/fondtexte2.jpg"  border="0">
<font color="brown"><b>Emile Zola</b></font> (1840-1902)<br>
<br>
<table>
<tr>
<td>
<img src="images/emilezola.jpg"><br>
</td>
<td>
<br>
Zola est le principal repr&eacute;sentant du naturalisme en France. Certaines de ses oeuvres, comme L'Assommoir, lui ont permis de d&eacute;tr&ocirc;ner au firmament des romanciers le g&eacute;ant qu'&eacute;tait Victor Hugo. Magistral romancier prenant fait et cause pour les id&eacute;aux du socialisme, Zola fait &eacute;galement preuve d'un grand courage en militant pour la v&eacute;rit&eacute; dans l'affaire Dreyfus.<br>
<br><br>
</td>
</tr>
</table>
 Une jeunesse difficile :<br>
<br>
 N&eacute; &agrave; Paris d'un p&egrave;re italien, Emile Zola grandit &agrave; Aix-en-Provence ; il a pour camarade celui qui sera le peintre C&eacute;zanne. Lorsqu'il a sept ans, son p&egrave;re meurt. La situation financi&egrave;re de la famille se d&eacute;gradant, les Zola s'installent &agrave; Paris o&ugrave; Emile poursuit ses &eacute;tudes ; il &eacute;choue au baccalaur&eacute;at et est contraint d'accepter des travaux dans les docks puis dans une grande librairie parisienne. Les d&eacute;buts dans l'&eacute;criture Sa fonction de chef de publicit&eacute; chez Hachette lui permet d'une part de compl&eacute;ter. Sa culture g&eacute;n&eacute;rale, d'autre part de rencontrer les grands esprits de son temps : Lamartine, Littr&eacute;, Sainte-Beuve entre autres. Zola se sent &agrave; cette &eacute;poque proche du romantisme et se lance dans le journalisme. Les id&eacute;es de Taine et de Claude Bernard le rapprochent du r&eacute;alisme.<br>

<br><br>
 Le succ&egrave;s du naturalisme :<br>
<br>
 Dans Th&eacute;r&egrave;se Raquin, on devine les premiers accents naturalistes. C'est &agrave; partir de 1868 qu'il va enti&egrave;rement se tourner vers le naturalisme. Comme <A href="honoredebalzac.html"target="description">Balzac</a> dans La Com&eacute;die humaine, il commence un cycle de romans racontant les &eacute;v&eacute;nements et les probl&egrave;mes que conna&icirc;t une famille fran&ccedil;aise sous le second Empire. Apr&egrave;s avoir &eacute;tabli l'arbre g&eacute;n&eacute;alogique de la famille des Rougon-Macquart, Zola travaille avec une r&eacute;gularit&eacute; impressionnante, produisant un roman par an. Le septi&egrave;me volume des Rougon-Macquart. L'Assommoir, qui fait scandale par la description crue des milieux ouvriers, le rend c&eacute;l&egrave;bre. Zola dor&eacute;navant le ma&icirc;tre de l'&eacute;cole naturaliste. Il atteint le sommet de sa carri&egrave;re avec Germinal, qui d&eacute;crit minutieusement l'univers des mineurs. Ayant lui-m&ecirc;me souffert de la pauvret&eacute; dans sa jeunesse, il est de plus en plus attir&eacute; par le socialisme. En 1888, Zola d&eacute;laisse sa femme pour vivre avec Jeanne Rozerot, une ouvri&egrave;re beaucoup plus jeune que lui, dont il a deux enfants. Apr&egrave;s le succ&egrave;s de la B&ecirc;te humaine <br>
en 1890, Zola a du mal &agrave; achever la chronique des Rougon-Macquart : La D&eacute;b&acirc;cle conna&icirc;t encore un fort succ&egrave;s malgr&eacute; tout.<br>
<br><br>
 L'homme de combat :<br>
<br>
 En 1894 d&eacute;bute l'affaire Dreyfus qui secoue la France enti&egrave;re. Rapidement, Zola est convaincu de l'innocence de ce capitaine, condamn&eacute; uniquement parce qu'il est juif. Il prend, violemment parti pour ce dernier, <a href="jaccuse.html"target="description">notamment dans son article, j'accuse, paru le 13 janvier 1898 dans le journal L'Aurore.</a> Condamn&eacute; &agrave; un an de prison, Zola s'exile en Angleterre. &Agrave; son retour, en 1899, il entame un autre cycle d'ouvrages o&ugrave; il fait part de son id&eacute;al humanitaire. En 1902, il meurt asphyxi&eacute; au cours d'un accident suspect, avant d'avoir pu terminer sa derni&egrave;re oeuvre. La m&ecirc;me ann&eacute;e, il s'&eacute;tait vu refuser le premier prix Nobel de litt&eacute;rature pour avoir &eacute;crit Nana, roman jug&eacute; choquant par la morale publique.<br>
<br><br>
 Le d&eacute;terminisme :<br>
<br>
 Principe d'apr&egrave;s lequel tout fait a une cause, et, dans les m&ecirc;mes conditions, les m&ecirc;mes causes produisent les m&ecirc;mes effets. La doctrine naturaliste disciple de Taine, Zola croit &agrave; la subordination de la psychologie &agrave; la physiologie. "Notre h&eacute;ros n'est plus le pur esprit, l'homme abstrait du XVIIIe si&egrave;cle, il est (...) compos&eacute; d'organes et (...) trempe dans un milieu dont il est p&eacute;n&eacute;tr&eacute; &agrave; chaque heure...".<br>
<br>
 a) Le romancier naturaliste soulignera donc particuli&egrave;rement les conditions physiologiques, l'influence des milieux et des circonstances qui, selon lui, d&eacute;terminent la personne humaine.<br>
<br>
 b) Zola s'inspire aussi des id&eacute;es de Claude Bernard sur la biologie, science o&ugrave; l'exp&eacute;rimentation permet de contr&ocirc;ler les hypoth&egrave;ses et de formuler des lois. A son tour, le romancier naturaliste sera un exp&eacute;rimentateur: son exp&eacute;rience consiste &agrave; "faire mouvoir les personnages dans une histoire particuli&egrave;re pour y montrer que la succession des faits y sera telle que le d&eacute;terminisme l'exige." Il &eacute;tudiera "le m&eacute;canisme des faits en agissant sur eux par les modifications des circonstances et des milieux sans jamais s'&eacute;carter des lois de la nature." Les Rougon-Macquart A travers cinq g&eacute;n&eacute;rations successives, Zola a voulu suivre, en observants les lois scientifiques, l'&eacute;volution de toute une famille. Dans Le Docteur Pascal, il nous pr&eacute;sente l'arbre g&eacute;n&eacute;alogique de cette famille, avec, &agrave; l'origine, la Tante Dide, intern&eacute;e comme folle, dont la tare initiale p&egrave;se sur les app&eacute;tits de toute sa descendance et d&eacute;termine "selon les milieux, chez chacun des individus de cette race, les sentiments, les d&eacute;sirs, les 
passions, toutes les manifestations humaines, naturelles et instinctives dont les produits prennent les noms de vertus et de vices". Comme ces personnages partis du peuple se diss&eacute;minent dans toute la soci&eacute;t&eacute; contemporaine, le romancier nous pr&eacute;sente tour &agrave; tour une petite ville de Provence (La Fortune des Rougon), le monde de la finance (La cur&eacute;e; L'argent), les milieux eccl&eacute;siastiques (La Conqu&ecirc;te de Plassans, La faute de l'Abb&eacute; mouret), les politiciens, les ouvriers parisiens (L'Assommoir), le monde des viveurs (Nana) les bourgeois, les grands magasins (Au bonheur des Dames), Les mineurs (Germinal), les artistes (L'Oeuvre), les paysans (La Terre), les chemins de fer (La B&ecirc;te humaine),- la guerre, le m&eacute;decin hant&eacute; par les lois de l'h&eacute;r&eacute;dit&eacute; (Le docteur Pascal). Le temp&eacute;rament &eacute;pique La psychologie des personnages est assez r&eacute;duite. Mais Zola est un incomparable &eacute;vocateur des foules, surtout des foules en mouvement (voir Germinal). Il nous fait aussi percevoir l'existence d'une &acirc;me collective chez ceux qui 
partagent la m&ecirc;me d&eacute;tresse ou la m&ecirc;me exaltation. Les objets eux-m&ecirc;mes re&ccedil;oivent une vie myst&eacute;rieuse: par exemple l'alambic dans L'assommoir, la mine dans Germinal ou la locomotive dans La B&ecirc;te humaine.<br>
<br><br>
 Quelques oeuvres :<br>
<br>
 1867 Th&eacute;r&egrave;se Raquin<br>
1871-93 Les Rougon-Macquart (Cycle de 20 romans)<br>
1877 L'Assommoir<br>
1885 Germinal<br>
1890 La B&ecirc;te Humaine<br>
1880 Le Roman exp&eacute;rimental<br>
 &nbsp;
</body>
</html>