<html>
<body background="../images/fondtexte2.jpg"  border="0">
<font color="brown"><b>Guy de Maupassant</b></font> (1850-1893)<br>
<table>
<tr>
<td>
<br>
<img src="images/guydemaupassant.jpg"><br>
</td>
<td>
<br>
Form&eacute; par Gustave Flaubert mais proche d'Emile Zola Guy de Maupassant est un conteur et un romancier , &agrave; la charni&egrave;re du r&eacute;alisme et du naturalisme. Il excelle &agrave; rendre les hantises et les ab&icirc;mes de la vie int&eacute;rieure.<br>
<br><br>
</td>
</tr>
</table>
 La jeunesse :<br>
<br>
 N&eacute; dans le ch&acirc;teau de Miromesnil &agrave; <a href="../hautenormandie/laseinemaritime/tourvillesurarques.html"target="description">Tourville-sur-Arques</a> (pr&egrave;s de Dieppe), Maupassant vit ses jeunes ann&eacute;es au bord de la mer, seul avec sa m&egrave;re s&eacute;par&eacute;e de son mari. Pendant la guerre de 1870, Maupassant s'engage comme garde mobile et assiste &agrave; la d&eacute;b&acirc;cle de l'arm&eacute;e fran&ccedil;aise.<br>
<br><br>

 L'&eacute;crivain :<br>
<br>
 De 1871 &agrave; 1880, il occupe de petits emplois dans diff&eacute;rents minist&egrave;res, tout en apprenant le m&eacute;tier d'&eacute;crivain aupr&egrave;s de Flaubert, ami d'enfance de sa m&egrave;re. C'est une nouvelle, Boule de Suif, qui lui vaut ses premiers succ&egrave;s. Il s'&eacute;l&egrave;ve tout d'un coup au premier plan de l'actualit&eacute; litt&eacute;raire. De 1880 &agrave; 1891, il publie environ trois cents nouvelles et contes r&eacute;unis en dix-huit volumes, ainsi que six romans.<br>
<br><br>
 La maladie et la mort :<br>
<br>
 La sant&eacute; de Maupassant se d&eacute;t&eacute;riore malgr&eacute; une constitution apparemment robuste, et son &eacute;quilibre intellectuel s'en trouve affect&eacute;. Des hallucinations accompagnent ses angoisses. Apr&egrave;s un suicide manqu&eacute;, il est intern&eacute; dans une maison de sant&eacute; o&ugrave; il meurt fou &acirc;g&eacute; de quarante-trois ans. Il avait dit : &laquo; Je suis entr&eacute; dans la vie litt&eacute;raire comme un m&eacute;t&eacute;ore, j'en sortirai par un coup de tonnerre. &raquo;<br>
<br><br>
 Sa vision du monde :<br>
<br>
 - Elle est pessimiste et d&eacute;sesp&eacute;r&eacute;e. Il n'a aucune confiance dans la vie<br>
<br><br>
 Son esth&eacute;tique :<br>
<br>
 - Elle est diff&eacute;rente de celle de Flaubert. Pour Maupassant, il est impossible d'&eacute;crire de fa&ccedil;on objective. Il consid&egrave;re les enqu&ecirc;tes et la documentation inutile. Chaque &eacute;crivain a une vision diff&eacute;rente de la r&eacute;alit&eacute;, il choisit ce qui le touche et ce qu'y l'int&eacute;resse.<br>
- Peinture de milieux, moeurs, se sont des types diff&eacute;rents.<br>
- Le milieux rustique, bourgeois, employ&eacute;.<br>
<br><br>
 Son &eacute;volution :<br>
<br>
 - 1er reccueil : ses r&eacute;cits sont secs, ils sont critiques, violents en particulier contre les religieux, les bourgeois, les femmes.<br>
- D&eacute;but de la maladie : ses r&eacute;cits sont moins violents et moins moqueurs. Il accorde plus de place &agrave; la bont&eacute;, la vertu, l'&eacute;motion. Il s'int&eacute;resse au modeste.<br>
- fin : l'angoisse et la hantise de l'invisible<br>
<br><br>
 La peur :<br>
<br>
 Nous sommes dans l'&eacute;trange, le surnaturel, le fantastique. C'est le reflet de Maupassant par rapport &agrave; sa maladie. (Le bateau qui &eacute;choue, le fant&ocirc;me)<br>
<br><br>
 Quelques oeuvres :<br>
<br>
 1880 Boule de Suif<br>
1881 La Maison Tellier<br>
1883 Contes de la B&eacute;casse ; Une Vie<br>
1884 Miss Harriet<br>
1885 Bel-Ami<br>
1887 Le Horla ; La Nuit<br>
1888 Pierre et Jean<br>
1889 Fort comme la Mort<br>
1890 Notre Coeur<br>
</body>
</html>