<html>
<body background="../images/fondtexte2.jpg"  border="0">
<b>Honor&eacute; de Balzac</b> (1799-1850)<br>
<br>
<table>
<tr>
<td>
<img src="images/honoredebalzac.jpg"><br>
</td>
<td>
<br><br>


 Balzac est le romancier fran&ccedil;ais le plus productif du XIXe si&egrave;cle. Il veut r&eacute;nover la conception du roman en lui donnant le caract&egrave;re d'une &eacute;tude presque scientifique de la soci&eacute;t&eacute;. Aucune analyse du genre romanesque ne peut n&eacute;gliger l'apport de Balzac.<br>
<br><br>
 Les ann&eacute;es de jeunesse :<br>
<br>
 Honor&eacute; de Balzac est n&eacute; &agrave; <a href="../centre/indreetloire/tours.html"target="description">Tours</a> o&ugrave; son p&egrave;re est administrateur de l'hospice. Il reprochera plus tard &agrave; sa m&egrave;re, qui avait trente-deux ans de moins que son mari, de l'avoir d&eacute;laiss&eacute;, mis en nourrice puis en pension. &Agrave; dix-huit ans, Honor&eacute; poursuit ses &eacute;tudes &agrave; Paris. Il devient clerc chez un avou&eacute;, suit parall&egrave;lement des cours &agrave; la Sorbonne et commence &agrave; se passionner pour la philosophie.<br>
</td>
</tr>
</table>
<br><br>
 Le dur apprentissage :<br>
<br>
 Se sentant une vocation litt&eacute;raire, Balzac s'installe dans une mansarde &agrave; Paris et tente de faire une carri&egrave;re d'&eacute;crivain. Sa premi&egrave;re oeuvre, Cromwell, une trag&eacute;die en vers, est un &eacute;chec. Balzac doit rentrer chez ses parents. Pourtant il n'abandonne pas. Entre 1821 et 1825, il ne cesse d'&eacute;crire, essayant les diff&eacute;rents genres litt&eacute;raires. En 1822, il fait la connaissance de Mme de Berny, deux fois plus &acirc;g&eacute;e que lui ; elle va devenir pour lui la m&egrave;re, l'amante, la confidente et la conseill&egrave;re.<br>
<br><br>
 L'exp&eacute;rience dans les affaires :<br>
<br>
 Ses oeuvres passent n&eacute;anmoins inaper&ccedil;ues et Balzac tente sa chance dans les affaires. Il devient d'abord associ&eacute; d'un libraire et rach&egrave;te ensuite une imprimerie &agrave; Paris. Ce m&eacute;tier lui permet de s'introduire dans les milieux des &eacute;crivains et des &eacute;diteurs, mais au bout de trois ans il fait faillite et est gravement endett&eacute;. Apr&egrave;s cette ruine financi&egrave;re, Balzac &eacute;crit par n&eacute;cessit&eacute;.<br>
<br><br>
 Le succ&egrave;s :<br>

 En 1829 paraissent Le Dernier Chouan et La Physiologie du mariage qui marquent le d&eacute;but de sa carri&egrave;re. Pouss&eacute; par des inspirations litt&eacute;raires mais aussi par un besoin d'argent chronique, Balzac va publier pendant les vingt ann&eacute;es suivantes quatre-vingt-dix romans et nouvelles, trente contes et cinq pi&egrave;ces de th&eacute;&acirc;tre. Il m&egrave;ne une vie d&eacute;bordante d'activit&eacute;s : voyages, fr&eacute;quentations, articles. En 1832, il re&ccedil;oit la premi&egrave;re lettre de &laquo; l'Etrang&egrave;re &raquo; qui admire son oeuvre, une Polonaise, la comtesse Hanska. Elle devient son amie et une longue correspondance s'&eacute;tablit entre eux. Il voyage aussi beaucoup en Europe. Mais il est toujours press&eacute; par les dettes. Un autre journal qu'il a achet&eacute; fait faillite. Balzac trouve la solution dans le roman-feuilleton et publie sous cette forme beaucoup de ses romans.<br>
<br><br>
 L'&eacute;puisement :<br>
<br>
 En 1841, Balzac choisit le titre de Com&eacute;die Humaine pour l'ensemble de son oeuvre et d&eacute;cide de remanier l'ensemble pour lui donner une coh&eacute;rence. En 1850, il &eacute;pouse en Ukraine &Egrave;ve Hanska, dont le mari est mort en 1842. Mais il est d&eacute;j&agrave; affaibli par la maladie, &eacute;puis&eacute; par le travail et meurt quelques semaines apr&egrave;s son retour &agrave; Paris.<br>
<br><br>
 Portrait :<br>
<br>
 - Visage &eacute;norm&eacute;ment caricatur&eacute;: cheveux front, nez.<br>
- Il doit &eacute;crire &eacute;norm&eacute;ment: 90 romans en 20 ans. C'est &agrave; dire 4 romans par an.<br>
- Il travaille la nuit, en buvant des caf&eacute;s tr&egrave;s fort. La journ&eacute;e il visite les salons,<br>
- Il meurt &agrave; 51 ans, tr&egrave;s forte sant&eacute;, pour ce si&egrave;cle.<br>
- Il doit &eacute;crire vite pour honorer ses dettes.<br>
- Il est un grand voyageur.<br>
<br><br>
 Ses amours :<br>
<br>
 - Hanska : une polonaise mari&eacute;e qui lui envoie une lettre : d&eacute;but de leur relation. Il retourne en Ukraine pour la revoir. Veuve, elle l'&eacute;pousera. - Mme Berny : a le r&ocirc;le d'une m&egrave;re, une amante, une confidente, une conseill&egrave;re.<br>
<br>
 - Il adore le luxe : tableaux, meubles anciens, tapis d'orient, repas somptueux, cannes incrust&eacute;es d'or, fr&eacute;quente les salons, ach&egrave;te un appartement pour Hanska &agrave; Paris qu'il d&eacute;core luxueusement.<br>
<br><br>
 Ses deux ambitions:<br>
<br>
 - il veut la gloire, r&eacute;ussite dans l'&eacute;criture.<br>
- faire fortune.<br>
<br><br>
 En quoi consiste le g&eacute;nie de Balzac ?<br>
<br>
 - L'observation : Balzac sait observer et reproduire dans son oeuvre les lieux et les hommes qu'il rencontre. Il restitue la r&eacute;alit&eacute; avec pr&eacute;cision. Ses h&eacute;ros sont des &ecirc;tres de chair et l'&eacute;crivain nous en d&eacute;crit le physique, le costume, la profession, le domicile avec force d&eacute;tails. La Com&eacute;die Humaine est aussi un pr&eacute;cieux document sur la Restauration et la Monarchie de Juillet.<br>
<br>
 - L'imagination : son r&ocirc;le est important car les intrigues des romans de Balzac sont complexes, on y trouve beaucoup de rebondissements. Mais l'imagination est souvent bas&eacute;e sur une solide documentation.<br>
<br>
 - Les id&eacute;es : Balzac est un personnage extr&ecirc;mement curieux: tout l'int&eacute;resse (science, politique, psychologie, philosophie, agriculture, commerce, etc...). Il &eacute;chafaude des th&eacute;ories sur tout. Le roman chez Balzac: une histoire des moeurs.<br>
<br>
Balzac pense que "le Cr&eacute;ateur ne s'est servi que d'un seul et m&ecirc;me patron pour tous les &ecirc;tres organis&eacute;s." Selon lui, la diff&eacute;rence entre les esp&egrave;ces zoologiques est due aux diff&eacute;rences de milieux. Balzac &eacute;tend cette loi aux "esp&egrave;ces sociales" dont il entreprend la description et la classification. Les milieux qu'il &eacute;tudie sont tr&egrave;s vari&eacute;s: Paris, la province, la campagne, les professions, les diff&eacute;rences d'intelligence, la fortune.<br>
<br>
Chaque roman est, en un sens, l'analyse d'une "esp&egrave;ce sociale". Reli&eacute;s les uns aux autres, ses ouvrages donnent une sorte de panorama, d'&eacute;tat des lieux de la soci&eacute;t&eacute; fran&ccedil;aise du XIXe si&egrave;cle. Non seulement Balzac "reproduit" la soci&eacute;t&eacute; dans laquelle il vit mais il veut aussi d&eacute;couvrir les lois qui en r&eacute;gissent le fonctionnement.<br>
<br><br>
 La m&eacute;thode balzacienne :<br>
<br>
 l. La description: la th&eacute;orie des milieux a pour cons&eacute;quence de longues descriptions introductives.
2. Les portraits: Balzac nous pr&eacute;sente ses personnages de l'ext&eacute;rieur, il nous en fait des portraits d&eacute;taill&eacute;s.<br>
<br>
Les v&ecirc;tements, leur visage, leur comportement r&eacute;v&egrave;lent leur caract&egrave;re, leurs passions. M&ecirc;me leur nom est significatif. Chaque personnage est m&ucirc; par une passion qui se transforme souvent en id&eacute;e fixe (amour, ambition, recherche de 1 'absolu, argent, etc...)<br>
<br><br>
 Les types humains :<br>
<br>
 Chaque personnage repr&eacute;sente un type: il incarne un milieu social, un temp&eacute;rament, une passion. Exemples:-le P&egrave;re Goriot est "le Christ de la paternit&eacute;" car il sacrifie tout &agrave; ses filles qui se montreront tr&egrave;s ingrates envers lui.<br>
<br><br>
 Quelques oeuvres :<br>
<br>
 1829 La Physiologie du Mariage<br>
1831 La Peau de chagrin<br>
1834 La Recherche de l'Absolu<br>
1835 Le P&egrave;re Goriot<br>
1829 Les Chouans<br>
1833 Eug&eacute;nie Grandet<br>
1832 Le Colonel Chabert<br>
</body>
</html>