<html>
<body background="../fondtexte2.jpg"  border="0">
Ces pages ont paru dans _L'Aurore_, le 13 janvier 1898. 
<br>
<br>Ce qu'on ignore, c'est qu'elles furent d'abord imprim&eacute;es en une brochure, comme les deux lettres pr&eacute;c&eacute;dentes. Au moment de mettre cette brochure en vente, la pens&eacute;e me vint de donner &agrave; ma lettre une publicit&eacute; plus large, plus retentissante, en la publiant dans un journal. _L'Aurore_ avait d&eacute;j&agrave; pris parti, avec une ind&eacute;pendance, un courage admirables, et je m'adressai naturellement &agrave; elle. Depuis ce jour, ce journal est devenu pour moi l'asile, la tribune de libert&eacute; et de v&eacute;rit&eacute;, o&ugrave; j'ai pu tout dire. J'en ai gard&eacute; au directeur, M. Ernest Vaughan, une grande reconnaissance. - Apr&egrave;s la vente de _L'Aurore_ &agrave; trois cent mille exemplaires, et les poursuites judiciaires qui suivirent, la brochure resta m&ecirc;me en magasin. D'ailleurs, au lendemain de l'acte que j'avais r&eacute;solu et accompli, je croyais devoir garder le silence, dans l'attente de mon proc&egrave;s et des cons&eacute;quences que j'en esp&eacute;rais. 
<hr>
<br>
<br>J'ACCUSE 
<br>
<br>Monsieur le Pr&eacute;sident, 
<br>
<br>Me permettez-vous, dans ma gratitude pour le bienveillant accueil que vous m'avez fait un jour, d'avoir le souci de votre juste gloire et de vous dire que votre &eacute;toile, si heureuse jusqu'ici, est menac&eacute;e de la plus honteuse, de la plus ineffa&ccedil;able des taches? 
<br>
<br>Vous &ecirc;tes sorti sain et sauf des basses calomnies, vous avez conquis les coeurs. Vous apparaissez rayonnant dans l'apoth&eacute;ose de cette f&ecirc;te patriotique que l'alliance russe a &eacute;t&eacute; pour la France, et vous vous pr&eacute;parez &agrave; pr&eacute;sider au solennel triomphe de notre Exposition Universelle, qui couronnera notre grand si&egrave;cle de travail, de v&eacute;rit&eacute; et de libert&eacute;. Mais quelle tache de boue sur votre nom - j'allais dire sur votre r&egrave;gne - que cette abominable affaire Dreyfus! Un conseil de guerre vient, par ordre, d'oser acquitter un Esterhazy, soufflet supr&ecirc;me &agrave; toute v&eacute;rit&eacute;, &agrave; toute justice. Et c'est fini, la France a sur la joue cette souillure, l'histoire &eacute;crira que c'est sous votre pr&eacute;sidence qu'un tel crime social a pu &ecirc;tre commis. 
<br>
<br>Puisqu'ils ont os&eacute;, j'oserai aussi, moi. La v&eacute;rit&eacute;, je la dirai, car j'ai promis de la dire, si la justice, r&eacute;guli&egrave;rement saisie, ne la faisait pas, pleine et enti&egrave;re. Mon devoir est de parler, je ne veux pas &ecirc;tre complice. Mes nuits seraient hant&eacute;es par le spectre de l'innocent qui expie l&agrave;-bas, dans la plus affreuse des tortures, un crime qu'il n'a pas commis. 
<br>
<br>Et c'est &agrave; vous, monsieur le Pr&eacute;sident, que je la crierai, cette v&eacute;rit&eacute;, de toute la force de ma r&eacute;volte d'honn&ecirc;te homme. Pour votre honneur, je suis convaincu que vous l'ignorez. Et &agrave; qui donc d&eacute;noncerai-je la tourbe malfaisante des vrais coupables, si ce n'est &agrave; vous, le premier magistrat du pays? 
<br>
<br>La v&eacute;rit&eacute; d'abord sur le proc&egrave;s et sur la condamnation de Dreyfus. 
<br>
<br>Un homme n&eacute;faste a tout men&eacute;, a tout fait, c'est le lieutenant-colonel du Paty de Clam, alors simple commandant. Il est l'affaire Dreyfus tout enti&egrave;re; on ne la conna&icirc;tra que lorsqu'une enqu&ecirc;te loyale aura &eacute;tabli nettement ses actes et ses responsabilit&eacute;s. Il appara&icirc;t comme l'esprit le plus fumeux, le plus compliqu&eacute;, hant&eacute; d'intrigues romanesques, se complaisant aux moyens des romans-feuilletons, les papiers vol&eacute;s, les lettres anonymes, les rendez-vous dans les endroits d&eacute;serts, les femmes myst&eacute;rieuses qui colportent, de nuit, des preuves accablantes. C'est lui qui imagina de dicter le bordereau &agrave; Dreyfus; c'est lui qui r&ecirc;va de l'&eacute;tudier dans une pi&egrave;ce enti&egrave;rement rev&ecirc;tue de glaces; c'est lui que le commandant Forzinetti nous repr&eacute;sente arm&eacute; d'une lanterne sourde, voulant se faire introduire pr&egrave;s de l'accus&eacute; endormi, pour projeter sur son visage un brusque flot de lumi&egrave;re et surprendre ainsi son crime, dans l'&eacute;moi du r&eacute;veil. Et je n'ai pas &agrave; tout dire, qu'on cherche, on trouvera. Je d&eacute;clare simplement 
que le commandant du Paty de Clam, charg&eacute; d'instruire l'affaire Dreyfus, comme officier judiciaire, est, dans l'ordre des dates et des responsabilit&eacute;s, le premier coupable de l'effroyable erreur judiciaire qui a &eacute;t&eacute; commise. 
<br>
Le bordereau &eacute;tait depuis quelque temps d&eacute;j&agrave; entre les mains du colonel Sandherr, directeur du bureau des renseignements, mort depuis de paralysie g&eacute;n&eacute;rale. Des &laquo;fuites&raquo; avaient lieu, des papiers disparaissaient, comme il en dispara&icirc;t aujourd'hui encore; et l'auteur du bordereau &eacute;tait recherch&eacute;, lorsqu'un _a priori_ se fit peu &agrave; peu que cet auteur ne pouvait &ecirc;tre qu'un officier de l'&eacute;tat-major, et un officier d'artillerie: double erreur manifeste, qui montre avec quel esprit superficiel on avait &eacute;tudi&eacute; ce bordereau, car un examen raisonn&eacute; d&eacute;montre qu'il ne pouvait s'agir que d'un officier de troupe.<br>
<br>
On cherchait donc dans la maison, on examinait les &eacute;critures, c'&eacute;tait comme une affaire de famille, un tra&icirc;tre &agrave; surprendre dans les bureaux m&ecirc;mes, pour l'en expulser. Et, sans que je veuille refaire ici une histoire connue en partie, le commandant du Paty de Clam entre en sc&egrave;ne, d&egrave;s qu'un premier soup&ccedil;on tombe sur Dreyfus. A partir de ce moment, c'est lui qui a invent&eacute; Dreyfus, l'affaire devient son affaire, il se fait fort de confondre le tra&icirc;tre, de l'amener &agrave; des aveux complets. Il y a bien le ministre de la Guerre, le g&eacute;n&eacute;ral Mercier, dont l'intelligence semble m&eacute;diocre; il y a bien le chef de l'&eacute;tat-major, le g&eacute;n&eacute;ral de Boisdeffre, qui para&icirc;t avoir c&eacute;d&eacute; &agrave; sa passion cl&eacute;ricale, et le sous-chef de l'&eacute;tat- major, le g&eacute;n&eacute;ral Gonse, dont la conscience a pu s'accommoder de beaucoup de choses. Mais, au fond, il n'y a d'abord que le commandant du Paty de Clam, qui les m&egrave;ne tous, qui les hypnotise, car il s'occupe aussi de spiritisme, d'occultisme, il converse avec les esprits. On ne saurait concevoir les 
exp&eacute;riences auxquelles il a soumis le malheureux Dreyfus, les pi&egrave;ges dans lesquels il a voulu le faire tomber, les enqu&ecirc;tes folles, les imaginations monstrueuses, toute une d&eacute;mence torturante.<br>
<br>
Ah! cette premi&egrave;re affaire, elle est un cauchemar, pour qui la conna&icirc;t dans ses d&eacute;tails vrais! Le commandant du Paty de Clam arr&ecirc;te Dreyfus, le met au secret. Il court chez madame Dreyfus, la terrorise, lui dit que, si elle parle, son mari est perdu. Pendant ce temps, le malheureux s'arrachait la chair, hurlait son innocence. Et l'instruction a &eacute;t&eacute; faite ainsi, comme dans une chronique du XVe si&egrave;cle, au milieu du myst&egrave;re, avec une complication d'exp&eacute;dients farouches, tout cela bas&eacute; sur une seule charge enfantine, ce bordereau imb&eacute;cile, qui n'&eacute;tait pas seulement une trahison vulgaire, qui &eacute;tait aussi la plus impudente des escroqueries, car les fameux secrets livr&eacute;s se trouvaient presque tous sans valeur. Si j'insiste, c'est que l'oeuf est ici, d'o&ugrave; va sortir plus tard le vrai crime, l'&eacute;pouvantable d&eacute;ni de justice dont la France est malade. Je voudrais faire toucher du doigt comment l'erreur judiciaire a pu &ecirc;tre possible, comment elle est n&eacute;e des machinations du commandant du Paty de Clam, comment le g&eacute;n&eacute;ral 
Mercier, les g&eacute;n&eacute;raux de Boisdeffre et Gonse ont pu s'y laisser prendre, engager peu &agrave; peu leur responsabilit&eacute; dans cette erreur, qu'ils ont cru devoir, plus tard, imposer comme la v&eacute;rit&eacute; sainte, une v&eacute;rit&eacute; qui ne se discute m&ecirc;me pas. Au d&eacute;but, il n'y a donc, de leur part, que de l'incurie et de l'inintelligence. Tout au plus, les sent-on c&eacute;der aux passions religieuses du milieu et aux pr&eacute;jug&eacute;s de l'esprit de corps. Ils ont laiss&eacute; faire la sottise.<br>
<br>
Mais voici Dreyfus devant le conseil de guerre. Le huis clos le plus absolu est exig&eacute;. Un tra&icirc;tre aurait ouvert la fronti&egrave;re &agrave; l'ennemi pour conduire l'empereur allemand jusqu'&agrave; Notre-Dame, qu'on ne prendrait pas des mesures de silence et de myst&egrave;re plus &eacute;troites. La nation est frapp&eacute;e de stupeur, on chuchote des faits terribles, de ces trahisons monstrueuses qui indignent l'Histoire; et naturellement la nation s'incline. Il n'y a pas de ch&acirc;timent assez s&eacute;v&egrave;re, elle applaudira &agrave; la d&eacute;gradation publique, elle voudra que le coupable reste sur son rocher d'infamie, d&eacute;vor&eacute; par le remords. Est-ce donc vrai, les choses indicibles, les choses dangereuses, capables de mettre l'Europe en flammes, qu'on a d&ucirc; enterrer soigneusement derri&egrave;re ce huis clos? Non! il n'y a eu, derri&egrave;re, que les imaginations romanesques et d&eacute;mentes du commandant du Paty de Clam. Tout cela n'a &eacute;t&eacute; fait que pour cacher le plus saugrenu des romans-feuilletons. Et il suffit, pour s'en assurer, d'&eacute;tudier attentivement l'acte d'accusation, lu 
devant le conseil de guerre.<br>
<br>
Ah! le n&eacute;ant de cet acte d'accusation! Qu'un homme ait pu &ecirc;tre condamn&eacute; sur cet acte, c'est un prodige d'iniquit&eacute;. Je d&eacute;fie les honn&ecirc;tes gens de le lire, sans que leur coeurs bondisse d'indignation et crie leur r&eacute;volte, en pensant &agrave; l'expiation d&eacute;mesur&eacute;e, l&agrave;-bas, &agrave; l'&icirc;le du Diable. Dreyfus sait plusieurs langues, crime; on n'a trouv&eacute; chez lui aucun papier compromettant, crime; il va parfois dans son pays d'origine, crime; il est laborieux, il a le souci de tout savoir, crime; il ne se trouble pas, crime; il se trouble, crime. Et les na&iuml;vet&eacute;s de r&eacute;daction, les formelles assertions dans le vide! On nous avait parl&eacute; de quatorze chefs d'accusation: nous n'en trouvons qu'une seule en fin de compte, celle du bordereau; et nous apprenons m&ecirc;me que les experts n'&eacute;taient pas d'accord, qu'un d'eux, M. Gobert, a &eacute;t&eacute; bouscul&eacute; militairement, parce qu'il se permettait de ne pas conclure dans le sens d&eacute;sir&eacute;. On parlait aussi de vingt-trois officiers qui &eacute;taient venus accabler Dreyfus de leurs t&eacute;moignages. Nous ignorons 
encore leurs interrogatoires, mais il est certain que tous ne l'avaient pas charg&eacute;; et il est &agrave; remarquer, en outre, que tous appartenaient aux bureaux de la guerre. C'est un proc&egrave;s de famille, on est l&agrave; entre soi, et il faut s'en souvenir: l'&eacute;tat-major a voulu le proc&egrave;s, l'a jug&eacute;, et il vient de le juger une seconde fois.<br>
<br>
Donc, il ne restait que le bordereau, sur lequel les experts ne s'&eacute;taient pas entendus. On raconte que, dans la chambre du conseil, les juges allaient naturellement acquitter. Et, d&egrave;s lors, comme l'on comprend l'obstination d&eacute;sesp&eacute;r&eacute;e avec laquelle, pour justifier la condamnation, on affirme aujourd'hui l'existence d'une pi&egrave;ce secr&egrave;te, accablante, la pi&egrave;ce qu'on ne peut montrer, qui l&eacute;gitime tout, devant laquelle nous devons nous incliner, le bon Dieu invisible et inconnaissable! Je la nie, cette pi&egrave;ce, je la nie de toute ma puissance! Une pi&egrave;ce ridicule, oui, peut-&ecirc;tre la pi&egrave;ce o&ugrave; il est question de petites femmes, et o&ugrave; il est parl&eacute; d'un certain D... qui devient trop exigeant: quelque mari sans doute trouvant qu'on ne lui payait pas sa femme assez cher. Mais une pi&egrave;ce int&eacute;ressant la d&eacute;fense nationale, qu'on ne saurait produire sans que la guerre f&ucirc;t d&eacute;clar&eacute;e demain, non, non! C'est un mensonge! et cela est d'autant plus odieux et cynique qu'ils mentent impun&eacute;ment sans qu'on puisse les en convaincre. Ils 
ameutent la France, ils se cachent derri&egrave;re sa l&eacute;gitime &eacute;motion, ils ferment les bouches en troublant les coeurs, en pervertissant les esprits. Je ne connais pas de plus grand crime civique.<br>
<br>
Voil&agrave; donc, monsieur le Pr&eacute;sident, les faits qui expliquent comment une erreur judiciaire a pu &ecirc;tre commise; et les preuves morales, la situation de fortune de Dreyfus, l'absence de motifs, son continuel cri d'innocence, ach&egrave;vent de le montrer comme une victime des extraordinaires imaginations du commandant du Paty de Clam, du milieu cl&eacute;rical o&ugrave; il se trouvait, de la chasse aux &laquo;sales juifs&raquo;, qui d&eacute;shonore notre &eacute;poque.<br>
<br>
Et nous arrivons &agrave; l'affaire Esterhazy. Trois ans se sont pass&eacute;s, beaucoup de consciences restent troubl&eacute;es profond&eacute;ment, s'inqui&egrave;tent, cherchent, finissent par se convaincre de l'innocence de Dreyfus.<br>
<br>
Je ne ferai pas l'historique des doutes, puis de la conviction de M. Scheurer-Kestner. Mais, pendant qu'il fouillait de son c&ocirc;t&eacute;, il se passait des faits graves &agrave; l'&eacute;tat-major m&ecirc;me. Le colonel Sandherr &eacute;tait mort, et le lieutenant-colonel Picquart lui avait succ&eacute;d&eacute; comme chef du bureau des renseignements. Et c'est &agrave; ce titre, dans l'exercice de ses fonctions, que ce dernier eut un jour entre les mains une lettre-t&eacute;l&eacute;gramme, adress&eacute;e au commandant Esterhazy, par un agent d'une puissance &eacute;trang&egrave;re. Son devoir strict &eacute;tait d'ouvrir une enqu&ecirc;te. La certitude est qu'il n'a jamais agi en dehors de la volont&eacute; de ses sup&eacute;rieurs. Il soumit donc ses soup&ccedil;ons &agrave; ses sup&eacute;rieurs hi&eacute;rarchiques, le g&eacute;n&eacute;ral Gonse, puis le g&eacute;n&eacute;ral de Boisdeffre, puis le g&eacute;n&eacute;ral Billot, qui avait succ&eacute;d&eacute; au g&eacute;n&eacute;ral Mercier comme ministre de la Guerre. Le fameux dossier Picquart, dont il a &eacute;t&eacute; tant parl&eacute;, n'a jamais &eacute;t&eacute; que le dossier Billot, j'entends le dossier fait par un subordonn&eacute; pour son ministre, le dossier qui doit exister encore au 
minist&egrave;re de la Guerre. Les recherches dur&egrave;rent de mai &agrave; septembre 1896, et ce qu'il faut affirmer bien haut, c'est que le g&eacute;n&eacute;ral Gonse &eacute;tait convaincu de la culpabilit&eacute; d'Esterhazy, c'est que le g&eacute;n&eacute;ral de Boisdeffre et le g&eacute;n&eacute;ral Billot ne mettaient pas en doute que le bordereau ne f&ucirc;t de l'&eacute;criture d'Esterhazy. L'enqu&ecirc;te du lieutenant-colonel Picquart avait abouti &agrave; cette constatation certaine. Mais l'&eacute;moi &eacute;tait grand, car la condamnation d'Esterhazy entra&icirc;nait in&eacute;vitablement la r&eacute;vision du proc&egrave;s Dreyfus; et c'&eacute;tait ce que l'&eacute;tat-major ne voulait &agrave; aucun prix.<br>
<br>
Il dut y avoir l&agrave; une minute psychologique pleine d'angoisse. Remarquez que le g&eacute;n&eacute;ral Billot n'&eacute;tait compromis dans rien, il arrivait tout frais, il pouvait faire la v&eacute;rit&eacute;. Il n'osa pas, dans la terreur sans doute de l'opinion publique, certainement aussi dans la crainte de livrer tout l'&eacute;tat- major, le g&eacute;n&eacute;ral de Boisdeffre, le g&eacute;n&eacute;ral Gonse, sans compter les sous-ordres. Puis, ce ne fut l&agrave; qu'une minute de combat entre sa conscience et ce qu'il croyait &ecirc;tre l'int&eacute;r&ecirc;t militaire. Quand cette minute fut pass&eacute;e, il &eacute;tait d&eacute;j&agrave; trop tard. Il s'&eacute;tait engag&eacute;, il &eacute;tait compromis. Et, depuis lors, sa responsabilit&eacute; n'a fait que grandir, il a pris &agrave; sa charge le crime des autres, il est aussi coupable que les autres, il est plus coupable qu'eux, car il a &eacute;t&eacute; le ma&icirc;tre de faire justice, et il n'a rien fait. Comprenez-vous cela! Voici un an que le g&eacute;n&eacute;ral Billot, que les g&eacute;n&eacute;raux de Boisdeffre et Gonse savent que Dreyfus est innocent, et ils ont gard&eacute; pour eux cette effroyable chose! Et ces gens-l&agrave; dorment, et ils 
ont des femmes et des enfants qu'ils aiment!<br>
<br>
Le lieutenant-colonel Picquart avait rempli son devoir d'honn&ecirc;te homme. Il insistait aupr&egrave;s de ses sup&eacute;rieurs, au nom de la justice. Il les suppliait m&ecirc;me, il leur disait combien leurs d&eacute;lais &eacute;taient impolitiques, devant le terrible orage qui s'amoncelait, qui devait &eacute;clater, lorsque la v&eacute;rit&eacute; serait connue. Ce fut, plus tard, le langage que M. Scheurer- Kestner tint &eacute;galement au g&eacute;n&eacute;ral Billot, l'adjurant par patriotisme de prendre en main l'affaire, de ne pas la laisser s'aggraver, au point de devenir un d&eacute;sastre public. Non! Le crime &eacute;tait commis, l'&eacute;tat-major ne pouvait plus avouer son crime. Et le lieutenant-colonel Picquart fut envoy&eacute; en mission, on l'&eacute;loigna de plus en plus loin, jusqu'en Tunisie, o&ugrave; l'on voulut m&ecirc;me un jour honorer sa bravoure, en le chargeant d'une mission qui l'aurait s&ucirc;rement fait massacrer, dans les parages o&ugrave; le marquis de Mor&egrave;s a trouv&eacute; la mort. Il n'&eacute;tait pas en disgr&acirc;ce, le g&eacute;n&eacute;ral Gonse entretenait avec lui une correspondance amicale. Seulement, il est des secrets qu'il ne 
fait pas bon d'avoir surpris.<br>
<br>
A Paris, la v&eacute;rit&eacute; marchait, irr&eacute;sistible, et l'on sait de quelle fa&ccedil;on l'orage attendu &eacute;clata. M. Mathieu Dreyfus d&eacute;non&ccedil;a le commandant Esterhazy comme le v&eacute;ritable auteur du bordereau, au moment o&ugrave; M. Scheurer-Kestner allait d&eacute;poser, entre les mains du garde des Sceaux, une demande en r&eacute;vision du proc&egrave;s. Et c'est ici que le commandant Esterhazy para&icirc;t. Des t&eacute;moignages le montrent d'abord affol&eacute;, pr&ecirc;t au suicide ou &agrave; la fuite. Puis, tout d'un coup, il paye d'audace, il &eacute;tonne Paris par la violence de son attitude. C'est que du secours lui &eacute;tait venu, il avait re&ccedil;u une lettre anonyme l'avertissant des men&eacute;es de ses ennemis, une dame myst&eacute;rieuse s'&eacute;tait m&ecirc;me d&eacute;rang&eacute;e de nuit pour lui remettre une pi&egrave;ce vol&eacute;e &agrave; l'&eacute;tat-major, qui devait le sauver. Et je ne puis m'emp&ecirc;cher de retrouver l&agrave; le lieutenant-colonel du Paty de Clam, en reconnaissant les exp&eacute;dients de son imagination fertile. Son oeuvre, la culpabilit&eacute; de Dreyfus, &eacute;tait en p&eacute;ril, et il a voulu s&ucirc;rement d&eacute;fendre son oeuvre. La r&eacute;vision du proc&egrave;s, mais 
c'&eacute;tait l'&eacute;croulement du roman- feuilleton si extravagant, si tragique, dont le d&eacute;nouement abominable a lieu &agrave; l'&icirc;le du Diable! C'est ce qu'il ne pouvait permettre. D&egrave;s lors, le duel va avoir lieu entre le lieutenant-colonel Picquart et le lieutenant-colonel du Paty de Clam, l'un le visage d&eacute;couvert, l'autre masqu&eacute;. on les retrouvera prochainement tous deux devant la justice civile. Au fond, c'est toujours l'&eacute;tat-major qui se d&eacute;fend, qui ne veut pas avouer son crime, dont l'abomination grandit d'heure en heure.<br>
<br>
On s'est demand&eacute; avec stupeur quels &eacute;taient les protecteurs du commandant Esterhazy. C'est d'abord, dans l'ombre, le lieutenant-colonel du Paty de Clam qui a tout machin&eacute;, qui a tout conduit. Sa main se trahit aux moyens saugrenus. Puis, c'est le g&eacute;n&eacute;ral de Boisdeffre, c'est le g&eacute;n&eacute;ral Gonse, c'est le g&eacute;n&eacute;ral Billot lui-m&ecirc;me, qui sont bien oblig&eacute;s de faire acquitter le commandant, puisqu'ils ne peuvent laisser reconna&icirc;tre l'innocence de Dreyfus, sans que les bureaux de la guerre croulent dans le m&eacute;pris public. Et le beau r&eacute;sultat de cette situation prodigieuse est que l'honn&ecirc;te homme, l&agrave;- dedans, le lieutenant-colonel Picquart, qui seul a fait son devoir, va &ecirc;tre la victime, celui qu'on bafouera et qu'on punira. ^O justice, quelle affreuse d&eacute;sesp&eacute;rance serre le coeur! On va jusqu'&agrave; dire que c'est lui le faussaire, qu'il a fabriqu&eacute; la carte-t&eacute;l&eacute;gramme pour perdre Esterhazy. Mais, grand Dieu! pourquoi? dans quel but? donnez un motif. Est-ce que celui-l&agrave; aussi est pay&eacute; par les juifs? Le joli de l'histoire est 
qu'il &eacute;tait justement antis&eacute;mite. Oui! nous assistons &agrave; ce spectacle inf&acirc;me, des hommes perdus de dettes et de crimes dont on proclame l'innocence, tandis qu'on frappe l'honneur m&ecirc;me, un homme &agrave; la vie sans tache! Quand une soci&eacute;t&eacute; en est l&agrave;, elle tombe en d&eacute;composition.<br>
<br>
Voil&agrave; donc, monsieur le Pr&eacute;sident, l'affaire Esterhazy: un coupable qu'il s'agissait d'innocenter. Depuis bient&ocirc;t deux mois, nous pouvons suivre heure par heure la belle besogne. J'abr&egrave;ge, car ce n'est ici, en gros, que le r&eacute;sum&eacute; de l'histoire dont les br&ucirc;lantes pages seront un jour &eacute;crites tout au long. Et nous avons donc vu le g&eacute;n&eacute;ral de Pellieux, puis le commandant Ravary, conduire une enqu&ecirc;te sc&eacute;l&eacute;rate d'o&ugrave; les coquins sortent transfigur&eacute;s et les honn&ecirc;tes gens salis. Puis, on a convoqu&eacute; le conseil de guerre.<br>
<br>
Comment a-t-on pu esp&eacute;rer qu'un conseil de guerre d&eacute;ferait ce qu'un conseil de guerre avait fait?<br>
<br>
Je ne parle m&ecirc;me pas du choix toujours possible des juges. L'id&eacute;e sup&eacute;rieure de discipline, qui est dans le sang de ces soldats, ne suffit-elle &agrave; infirmer leur pouvoir d'&eacute;quit&eacute;? Qui dit discipline dit ob&eacute;issance. Lorsque le ministre de la Guerre, le grand chef, a &eacute;tabli publiquement, aux acclamations de la repr&eacute;sentation nationale, l'autorit&eacute; de la chose jug&eacute;e, vous voulez qu'un conseil de guerre lui donne un formel d&eacute;menti? Hi&eacute;rarchiquement, cela est impossible. Le g&eacute;n&eacute;ral Billot a suggestionn&eacute; les juges par sa d&eacute;claration, et ils ont jug&eacute; comme ils doivent aller au feu, sans raisonner. L'opinion pr&eacute;con&ccedil;ue qu'ils ont apport&eacute;e sur leur si&egrave;ge, est &eacute;videmment celle-ci: &laquo;Dreyfus a &eacute;t&eacute; condamn&eacute; pour crime de trahison par un conseil de guerre, il est donc coupable; et nous, conseil de guerre, nous ne pouvons le d&eacute;clarer innocent; or nous savons que reconna&icirc;tre la culpabilit&eacute; d'Esterhazy, ce serait proclamer l'innocence de Dreyfus.&raquo; Rien ne pouvait les faire sortir de l&agrave;.<br>
<br>
Ils ont rendu une sentence inique, qui &agrave; jamais p&egrave;sera sur nos conseils de guerre, qui entachera d&eacute;sormais de suspicion tous leurs arr&ecirc;ts. Le premier conseil de guerre a pu &ecirc;tre inintelligent, le second est forc&eacute;ment criminel. Son excuse, je le r&eacute;p&egrave;te, est que le chef supr&ecirc;me avait parl&eacute;, d&eacute;clarant la chose jug&eacute;e inattaquable, sainte et sup&eacute;rieure aux hommes, de sorte que des inf&eacute;rieurs ne pouvaient dire le contraire. On nous parle de l'honneur de l'arm&eacute;e, on veut que nous l'aimions, la respections. Ah! certes, oui, l'arm&eacute;e qui se l&egrave;verait &agrave; la premi&egrave;re menace, qui d&eacute;fendrait la terre fran&ccedil;aise, elle est tout le peuple, et nous n'avons pour elle que tendresse et respect. Mais il ne s'agit pas d'elle, dont nous voulons justement la dignit&eacute;, dans notre besoin de justice. Il s'agit du sabre, le ma&icirc;tre qu'on nous donnera demain peut-&ecirc;tre. Et baiser d&eacute;votement la poign&eacute;e du sabre, le dieu, non!<br>
<br>
Je l'ai d&eacute;montr&eacute; d'autre part: l'affaire Dreyfus &eacute;tait l'affaire des bureaux de la guerre, un officier de l'&eacute;tat- major, d&eacute;nonc&eacute; par ses camarades de l'&eacute;tat-major, condamn&eacute; sous la pression des chefs de l'&eacute;tat-major. Encore une fois, il ne peut revenir innocent sans que tout l'&eacute;tat-major soit coupable. Aussi les bureaux, par tous les moyens imaginables, par des campagnes de presse, par des communications, par des influences, n'ont-ils couvert Esterhazy que pour perdre une seconde fois Dreyfus. Quel coup de balai le gouvernement r&eacute;publicain devrait donner dans cette j&eacute;suiti&egrave;re, ainsi que les appelle le g&eacute;n&eacute;ral Billot lui-m&ecirc;me ! O&ugrave; est-il, le minist&egrave;re vraiment fort et d'un patriotisme sage, qui osera tout y refondre et tout y renouveler? Que de gens je connais qui, devant une guerre possible, tremblent d'angoisse, en sachant dans quelles mains est la d&eacute;fense nationale! Et quel nid de basses intrigues, de comm&eacute;rages et de dilapidations, est devenu cet asile sacr&eacute;, o&ugrave; se d&eacute;cide le sort de la patrie! On 
s'&eacute;pouvante devant le jour terrible que vient d'y jeter l'affaire Dreyfus, ce sacrifice humain d'un malheureux, d'un &laquo;sale juif&raquo;! Ah! tout ce qui s'est agit&eacute; l&agrave; de d&eacute;mence et de sottise, des imaginations folles, des pratiques de basse police, des moeurs d'inquisition et de tyrannie, le bon plaisir de quelques galonn&eacute;s mettant leurs bottes sur la nation, lui rentrant dans la gorge son cri de v&eacute;rit&eacute; et de justice, sous le pr&eacute;texte menteur et sacril&egrave;ge de la raison d'&Eacute;tat !<br>
<br>
Et c'est un crime encore que de s'&ecirc;tre appuy&eacute; sur la presse immonde, que de s'&ecirc;tre laiss&eacute; d&eacute;fendre par toute la fripouille de Paris, de sorte que voil&agrave; la fripouille qui triomphe insolemment, dans la d&eacute;faite du droit et de la simple probit&eacute;. C'est un crime d'avoir accus&eacute; de troubler la France ceux qui la veulent g&eacute;n&eacute;reuse, &agrave; la t&ecirc;te des nations libres et justes, lorsqu'on ourdit soi-m&ecirc;me l'impudent complot d'imposer l'erreur, devant le monde entier. C'est un crime d'&eacute;garer l'opinion, d'utiliser pour une besogne de mort cette opinion qu'on a pervertie jusqu'&agrave; la faire d&eacute;lirer. C'est un crime d'empoisonner les petits et les humbles, d'exasp&eacute;rer les passions de r&eacute;action et d'intol&eacute;rance, en s'abritant derri&egrave;re l'odieux antis&eacute;mitisme, dont la grande France lib&eacute;rale des droits de l'homme mourra, si elle n'en est pas gu&eacute;rie. C'est un crime que d'exploiter le patriotisme pour des oeuvres de haine, et c'est un crime, enfin, que de faire du sabre le dieu moderne, lorsque toute la science humaine est au travail pour 
l'oeuvre prochaine de v&eacute;rit&eacute; et de justice.<br>
<br>
Cette v&eacute;rit&eacute;, cette justice, que nous avons si passionn&eacute;ment voulues, quelle d&eacute;tresse &agrave; les voir ainsi soufflet&eacute;es, plus m&eacute;connues et plus obscurcies! Je me doute de l'&eacute;croulement qui doit avoir lieu dans l'&acirc;me de M. Scheurer-Kestner, et je crois bien qu'il finira par &eacute;prouver un remords, celui de n'avoir pas agi r&eacute;volutionnairement, le jour de l'interpellation au S&eacute;nat, en l&acirc;chant tout le paquet, pour tout jeter &agrave; bas. Il a &eacute;t&eacute; le grand honn&ecirc;te homme, l'homme de sa vie loyale, il a cru que la v&eacute;rit&eacute; se suffisait &agrave; elle- m&ecirc;me, surtout lorsqu'elle lui apparaissait &eacute;clatante comme le plein jour. A quoi bon tout bouleverser, puisque bient&ocirc;t le soleil allait luire? Et c'est de cette s&eacute;r&eacute;nit&eacute; confiante dont il est si cruellement puni. De m&ecirc;me pour le lieutenant- colonel Picquart, qui, par un sentiment de haute dignit&eacute;, n'a pas voulu publier les lettres du g&eacute;n&eacute;ral Gonse. Ces scrupules l'honorent d'autant plus que, pendant qu'il restait respectueux de la discipline, ses sup&eacute;rieurs le faisaient couvrir de boue, 
instruisaient eux-m&ecirc;mes son proc&egrave;s, de la fa&ccedil;on la plus inattendue et la plus outrageante. Il y a deux victimes, deux braves gens, deux coeurs simples, qui ont laiss&eacute; faire Dieu, tandis que le diable agissait. Et l'on a m&ecirc;me vu, pour le lieutenant-colonel Picquart, cette chose ignoble: un tribunal fran&ccedil;ais, apr&egrave;s avoir laiss&eacute; le rapporteur charger publiquement un t&eacute;moin, l'accuser de toutes les fautes, a fait le huis clos, lorsque ce t&eacute;moin a &eacute;t&eacute; introduit pour s'expliquer et se d&eacute;fendre. Je dis que ceci est un crime de plus et que ce crime soul&egrave;vera la conscience universelle. D&eacute;cid&eacute;ment, les tribunaux militaires se font une singuli&egrave;re id&eacute;e de la justice.<br>
<br>
Telle est donc la simple v&eacute;rit&eacute;, monsieur le Pr&eacute;sident, et elle est effroyable, elle restera pour votre pr&eacute;sidence une souillure. Je me doute bien que vous n'avez aucun pouvoir en cette affaire, que vous &ecirc;tes le prisonnier de la Constitution et de votre entourage. Vous n'en avez pas moins un devoir d'homme, auquel vous songerez, et que vous remplirez. Ce n'est pas, d'ailleurs, que je d&eacute;sesp&egrave;re le moins du monde du triomphe. Je le r&eacute;p&egrave;te avec une certitude plus v&eacute;h&eacute;mente: la v&eacute;rit&eacute; est en marche et rien ne l'arr&ecirc;tera. C'est d'aujourd'hui seulement que l'affaire commence, puisque aujourd'hui seulement les positions sont nettes: d'une part, les coupables qui ne veulent pas que la lumi&egrave;re se fasse; de l'autre, les justiciers qui donneront leur vie pour qu'elle soit faite. Je l'ai dit ailleurs, et je le r&eacute;p&egrave;te ici: quand on enferme la v&eacute;rit&eacute; sous terre, elle s'y amasse, elle y prend une force telle d'explosion, que, le jour o&ugrave; elle &eacute;clate, elle fait tout sauter avec elle. on verra bien si l'on ne vient pas de 
pr&eacute;parer, pour plus tard, le plus retentissant des d&eacute;sastres.<br>
<br>
Mais cette lettre est longue, monsieur le Pr&eacute;sident, et il est temps de conclure.<br>
<br>
J'accuse le lieutenant-colonel du Paty de Clam d'avoir &eacute;t&eacute; l'ouvrier diabolique de l'erreur judiciaire, en inconscient, je veux le croire, et d'avoir ensuite d&eacute;fendu son oeuvre n&eacute;faste, depuis trois ans, par les machinations les plus saugrenues et les plus coupables.<br>
<br>
J'accuse le g&eacute;n&eacute;ral Mercier de s'&ecirc;tre rendu complice, tout au moins par faiblesse d'esprit, d'une des plus grandes iniquit&eacute;s du si&egrave;cle.<br>
<br>
J'accuse le g&eacute;n&eacute;ral Billot d'avoir eu entre les mains les preuves certaines de l'innocence de Dreyfus et de les avoir &eacute;touff&eacute;es, de s'&ecirc;tre rendu coupable de ce crime de l&egrave;se- humanit&eacute; et de l&egrave;se-justice, dans un but politique et pour sauver l'&eacute;tat-major compromis.<br>
<br>
J'accuse le g&eacute;n&eacute;ral de Boisdeffre et le g&eacute;n&eacute;ral Gonse de s'&ecirc;tre rendus complices du m&ecirc;me crime, l'un sans doute par passion cl&eacute;ricale, l'autre peut-&ecirc;tre par cet esprit de corps qui fait des bureaux de la guerre l'arche sainte, inattaquable.<br>
<br>
J'accuse le g&eacute;n&eacute;ral de Pellieux et le commandant Ravary d'avoir fait une enqu&ecirc;te sc&eacute;l&eacute;rate, j'entends par l&agrave; une enqu&ecirc;te de la plus monstrueuse partialit&eacute;, dont nous avons, dans le rapport du second, un imp&eacute;rissable monument de na&iuml;ve audace.<br>
<br>
J'accuse les trois experts en &eacute;critures, les sieurs Belhomme, Varinard et Couard, d'avoir fait des rapports mensongers et frauduleux, &agrave; moins qu'un examen m&eacute;dical ne les d&eacute;clare atteints d'une maladie de la vue et du jugement.<br>
<br>
J'accuse les bureaux de la guerre d'avoir men&eacute; dans la presse, particuli&egrave;rement dans _L'&Eacute;clair_ et dans _L'&Eacute;cho de Paris_, une campagne abominable, pour &eacute;garer l'opinion et couvrir leur faute.<br>
<br>
J'accuse enfin le premier conseil de guerre d'avoir viol&eacute; le droit, en condamnant un accus&eacute; sur une pi&egrave;ce rest&eacute;e secr&egrave;te, et j'accuse le second conseil de guerre d'avoir couvert cette ill&eacute;galit&eacute;, par ordre, en commettant &agrave; son tour le crime juridique d'acquitter sciemment un coupable.<br>
<br>
En portant ces accusations, je n'ignore pas que je me mets sous le coup des articles 3O et 31 de la loi sur la presse du 29 juillet 1881, qui punit les d&eacute;lits de diffamation. Et c'est volontairement que je m'expose.<br>
<br>
Quant aux gens que j'accuse, je ne les connais pas, je ne les ai jamais vus, je n'ai contre eux ni rancune ni haine. Ils ne sont pour moi que des entit&eacute;s, des esprits de malfaisance sociale. Et l'acte que j'accomplis ici n'est qu'un moyen r&eacute;volutionnaire pour h&acirc;ter l'explosion de la v&eacute;rit&eacute; et de la justice.<br>
<br>
Je n'ai qu'une passion, celle de la lumi&egrave;re, au nom de l'humanit&eacute; qui a tant souffert et q u a droit au bonheur. Ma protestation enflamm&eacute;e n'est que le cri de mon &acirc;me. Qu'on ose donc me traduire en cour d'assises et que l'enqu&ecirc;te ait lieu au grand jour !<br>
<br>
J'attends.<br>
<br>
Veuillez agr&eacute;er, monsieur le Pr&eacute;sident, l'assurance de mon profond respect.<br>
</body>
</html>