<html>
<body>
<b>Jacques Martin</b><br>
<br>
<img src="isabelleadjani.jpg"><br>
L'auteur de bandes dessin&eacute;es, p&egrave;re d'Alix, vit en Suisse depuis 1984. Jacques Martin est n&eacute; en septembre 1920, &agrave; Strasbourg. Il entame une formation d'ing&eacute;nieur, mais est d&eacute;port&eacute; en Allemagne durant la seconde guerre mondiale. Travailleur forc&eacute;, il dessine des h&eacute;lices pour le compte de l'arm&eacute;e en choisissant des aciers impossibles &agrave; trouver pour ses employeurs allemands afin que son travail ne b&eacute;n&eacute;fice pas &agrave; la Luftwaffe. Apr&egrave;s la guerre, &agrave; l'&acirc;ge de 25 ans, il se lance dans une carri&egrave;re de dessinateur.

Jacques Martin part alors en Belgique o&ugrave; il collabore avec Herg&eacute; pour le journal Tintin. A la fin de la vie d'Herg&eacute;, devenu le bras droit du patron, c'est lui qui cr&eacute;e la plupart des derniers Tintin, Herg&eacute; se bornant &agrave; superviser le travail. Mais Jacques Martin est cr&eacute;atif et il travaille &agrave; ses propres projets, cr&eacute;ant le personnage d'Alix, dont les aventures se d&eacute;roulent dans l'Antiquit&eacute;. Les albums d'Alix rencontrent un grand succ&egrave;s et le dessinateur cr&eacute;e Lefranc en 1952, copie d'Alix se situant &agrave; l'&eacute;poque contemporaine ( L'Arme absolue, Op&eacute;ration Thor ).

Jacques Martin cr&eacute;e encore le personnage de Jhen. Il est devenu l'un des grands ma&icirc;tres de la bande dessin&eacute;e classique, par sa ma&icirc;trise du dessin et ses excellentes connaissances historiques. Il poursuit avec succ&egrave;s la s&eacute;rie des Alix ( Vercing&eacute;torix et Les L&eacute;gions perdues ) et collabore avec Herg&eacute; jusqu'&agrave; la mort de celui-ci, en 1983.

En 1984, le cr&eacute;ateur d'Alix vient s'&eacute;tablir sur les hauts de Pully, &agrave; c&ocirc;t&eacute; de Lausanne, face au lac L&eacute;man. Il continue &agrave; y travailler dans un climat fiscal plus raisonnable, notamment pour les ind&eacute;pendants. L'auteur n'y est pas d&eacute;pays&eacute; avec la tenue chaque ann&eacute;e du festival international de la bande dessin&eacute;e, &agrave; Sierre dans le Valais.

Jacques Martin vit dans un grand appartement d&eacute;cor&eacute; de meubles anciens, avec une splendide vue sur le lac. Il y cr&eacute;e en 1990 un nouveau personnage, Orion le Grec, dont il laisse la finition &agrave; l'un de ses assistants, Christophe Simon, form&eacute; &agrave; ce que l'on appelle d&eacute;sormais "L'Ecole Jacques Martin".

En l'an 2000, le Mus&eacute;e de la Bande Dessin&eacute;e de Bruxelles lui consacre une r&eacute;trospective &agrave; l'occasion de son 80i&egrave;me anniversaire. G&ecirc;n&eacute; dans sa vue par une maladie des yeux, il continue &agrave; superviser le travail de nombreux assistants qui dessinent, d&eacute;corent et colorient les sc&eacute;narios du ma&icirc;tre.
</body>
</html>