<html>
<body background="../images/fondtexte2.jpg"  border="0">

<a name="haut"</a>
<font color="brown"><b>Jeanne d'Arc</b></font> (La pucelle d'Orl&eacute;ans)<br>
<a href="jeannedarcjpg.html">d'apr&egrave;s une toile de Jean Auguste Dominique Ingres</a> 
<table>
<tr>
<td>
<a href="jeannedarcjpg.html"><img src="images/jeannedarc.jpg" target="description" alt="Jeanne d'Arc d'apr&egrave;s une toile de Jean Auguste Dominique Ingres" width="117" height="135" border=0</a><br>
</td>
<td>
N&eacute;e en 1412 &agrave; <a href="../lorraine/vosges/domremy.html">Domr&eacute;my</a> (aujourd'hui Domr&eacute;my-la-Pucelle), morte le 30 mai 1431 &agrave; <a href="../hautenormandie/laseinemaritime/rouen.html">Rouen</a>.<br>
Jeanne d'Arc est la fille de paysans ais&eacute;s (Jacques Darc et Isabelle Rom&eacute;e).<br>
<br>
Elle sera b&eacute;atifi&eacute;e en 1909 et canonis&eacute;e en 1920 par le pape Beno&icirc;t 15.<br>
<br><br>
</td>
</tr>
</table>
- En mai 1428 : elle a 16 ans et se rend &agrave; Vaucouleurs o&ugrave; elle va trouver le capitaine Robert de Baudricourt (le repr&eacute;sentant du roi), qui la traite de folle et la renvoie chez elle.<br>
<br>
- Le 12 f&eacute;vrier 1429 : elle retourne voir le capitaine Robert de Baudricourt et m&ecirc;me si cette fois il l'&eacute;coute, il para&icirc;t toutefois indiff&eacute;rent, Jeanne reste alors &agrave; Vaucouleurs cherchant des appuis rencontrant plusieurs fois Baudricourt pour tenter de le convaincre, elle sucite l'inter&ecirc;t des habitants qui commence &agrave; l'aimer, &agrave; croire en elle, certains chevaliers se proposent de la conduire aupr&egrave; roi, L'accord de Baudricourt est finalement obtenu.<br>
<br>
- Le 13 f&eacute;vrier : La petite troupe part de Vaucouleurs pour arriver 11 jours plus tard &agrave; Chinon, la r&eacute;sidence du Dauphin.<br>
Celui-ci accepte de la recevoir mais se dissimule parmis ses courtisans...<br>
Jeanne ne conna&icirc;t pas le Dauphin, pourtant, lorsqu'elle entre dans la salle du ch&acirc;teau les nombreux gentilshommes alors pr&eacute;sents n'arriveront pas &agrave; l'abuser, elle ira s'agenouiller directement devant Charles en lui disant :
<br>
« Voil&agrave; le roi ! En nom Dieu gentil prince, c'est vous et non un autre ! Je te le dis de la part du Messire, tu es vrai h&eacute;ritier de France et fils de roi, et il m'a envoy&eacute; &agrave; toi pour te conduire &agrave; Reims, pour que tu re&ccedil;oives ton couronnement et ta cons&eacute;cration, si tu le veux. &raquo;<br>

<br>
Apr&egrave;s un entretien priv&eacute; d'une heure Charles pr&eacute;cise qu'elle vient de lui confier un secret que personne ne connaissait et ne pouvait conna&icirc;tre, si ce n'est Dieu.<br>
<br>
Jeanne doit alors se soumettre &agrave; un examen et a une surveillance de 3 semaines (&agrave; poitiers) le Dauphin ne voulant pas prendre le risque d'&ecirc;tre le jouet d'une illumin&eacute;e. Les ma&icirc;tres et docteurs ne trouv&egrave;rent en elle que " bien, humilit&eacute;, virginit&eacute;, d&eacute;votion, honn&ecirc;tet&eacute; et simplicit&eacute;. " <br>
Le Dauphin Charles d&eacute;cide alors de se fier &agrave; elle.<br>
<br>
- le 22 mars 1429 : Elle adresse au roi d'Angleterre et au duc de Bedford, une lettre dans laquelle elle se d&eacute;clare « envoy&eacute;e de par Dieu, le roi du ciel &raquo;, pour combattre les Anglais et les « bouter hors de France &raquo;.<br>
<br>
- avril 1429 : Jeanne alors &agrave; la t&ecirc;te des troupes royales entre dans Orl&eacute;ans.<br>
<br>
- le 8 mai 1429 : Les Anglais l&egrave;vent le si&egrave;ge.<br>
<br>
- le 11 mai 1429 : Elle rejoint le roi &agrave; Loches et le persuade de partir pour Reims.<br>
<br>
- sur la route menant &agrave; Reims, Jeanne lib&egrave;re Jargeau, Beaugency, Gien, Auxerre, Troyes, Ch&acirc;lons-en-Champagne.<br>
<br>
- Le 16 juillet, Charles rentre triomphalement dans Reims.<br>
 
- le 17 juillet 1429 : Charles est couronn&eacute; et sacr&eacute; dans la cath&eacute;drale de Reims, le Dauphin devient alors le Roi Charles VII.<br>
<bR>
Charles VII n&eacute;gocie la paix du royaume et l'entente avec Philippe de Bourgogne, mais Jeanne ne peut se r&eacute;soudre &agrave; l'inaction ...<br>
<br>
- le 8 septembre 1429 : elle est bless&eacute;e &agrave; la porte Saint-Honor&eacute; (En tentant de prendre Paris aux Anglo-Bourguignons).<br>
<br>
- le 23 mai 1430 : les habitants de Compi&egrave;gne, alors assi&eacute;g&eacute;s l'appellent &agrave; l'aide, les Bourguignons la capture et leur chef, Jean de Luxembourg-Ligny la vend aux Anglais (dix mille livres tournois, le prix d'un roi !).<br>
Les anglais s'en remettent &agrave; la justice de l'&eacute;glise tout en ayant soin de d&eacute;clarer qu'il la reprendraient si elle n'&eacute;tait pas d&eacute;clar&eacute;e h&eacute;r&eacute;tique.<br>
<br>
- Le 9 janvier 1431 : Le proc&egrave;s de Jeanne s'ouvre...<br>     
<br>
Voici les charges retenues contre elle :<br>
<br>
* Port de v&ecirc;tements d'homme, qui tombait sous le coup d'une interdiction canonique.<br>
* Tentative de suicide (en fait, une tentative d'&eacute;vasion lorsqu'elle se jeta du haut d'une tour du ch&acirc;teau de Beaulieu-en-Vermandois.)<br>
* Ses visions consid&eacute;r&eacute;es comme une imposture et un signe de sorcellerie.<br>
* Refus de soumission &agrave; l'&Eacute;glise militante, et divers griefs mineurs. <br> 
<br>
elle abjurera publiquement ses erreurs, ou elle sera abandonn&eacute;e au bras s&eacute;culier...<br>
<br>
- le 24 mai 1431 : Jeanne abjure au cimeti&egrave;re de Saint-Ouen.<br>
<br>
- le 27 mai 1431 : Jeanne se ressaisit et reprend ses habits d'homme en signe de fid&eacute;lit&eacute; envers ses voix et envers Dieu.<br>
<br>
- Le 30 mai 1431 : Apr&egrave;s un nouveau proc&egrave;s Jeanne est br&ucirc;l&eacute;e sur le b&ucirc;cher (sur la place du Vieux-March&eacute; de Rouen).Elle meurt en criant le nom de J&eacute;sus...<br>
<br><br>
- En 1455 : Charles VII lance une proc&eacute;dure en r&eacute;habilitation.<br>
<br> 
- Le 7 juillet 1456 : Jeanne est officiellement r&eacute;habilit&eacute;e.<br>
<br>
- le 18 avril 1909 : Un dernier proc&egrave;s visant cette fois &agrave; &eacute;tablir sa saintet&eacute; permet de b&eacute;atifi&eacute;e Jeanne<br>
<br>
- le 16 mai 1920 : Jeanne est canonis&eacute;e.<br>
<br> <br>

<A HREF="#haut">Haut de page</A>

</body>
</html>