<html>
<body background="../images/fondtexte2.jpg"  border="0">
<b>L&eacute;on Gambetta </b><br>
<br>
<table>
<tr>
<td>
<img src="images/leongambetta.jpg"><br>
</td>
<td>
L&eacute;on Gambetta est l'un des fondateurs de la troisi&egrave;me R&eacute;publique fran&ccedil;aise. Avocat &eacute;loquent, il se rend c&eacute;l&egrave;bre en d&eacute;fendant des opposants &agrave; Napol&eacute;on III. En 1870, apr&egrave;s la d&eacute;faite de Sedan, l'empereur des fran&ccedil;ais est captur&eacute; par les prussiens. Gambetta est alors nomm&eacute; &agrave; la h&acirc;te ministre de l'int&eacute;rieur &agrave; Paris o&ugrave; s'organise la r&eacute;sistance. Mais les Prussiens font le si&egrave;ge de la ville et Gambetta s'&eacute;chappe en mongolfi&egrave;re par-dessus les lignes ennemies. Il parcourt alors vainement la France pour mobiliser une arm&eacute;e.<br>
</td>
</tr>
</table>
<br>
En 1871, il quitte la France apr&egrave;s la reddition du gouvernement pour venir trouver la paix en Suisse. Il s'&eacute;tablit pour quelques mois &agrave; Clarens, proche de Montreux, dans la Riviera vaudoise, l&agrave; m&ecirc;me o&ugrave; s'exile Elis&eacute;e Reclus, le p&egrave;re de la g&eacute;ographie moderne. Soignant un syst&egrave;me digestif qui fonctionne mal, l'air frais du pays lui fait le plus grand bien. L'&eacute;minent r&eacute;publicain aime beaucoup se promener le long du lac, sur le chemin qui m&egrave;ne de Territet &agrave; Clarens et ensuite au ch&acirc;teau des Cr&ecirc;tes. De nombreux politiciens et amis viennent lui rendre visite dans son lieu de cure, la pension Bon-Port, o&ugrave; se trouve aujourd'hui l'h&ocirc;tel Excelsior.<br>
<br>
Il entretient une &eacute;norme correspondance avec ses amis parisiens. Il &eacute;crit dans une lettre &agrave; son p&egrave;re: L'air est doux comme &agrave; Sorente au printemps, les raisins m&ucirc;rissent et je commence d&eacute;j&agrave; &agrave; y mordre. Gambetta passe des jours heureux &agrave; Clarens, il dit m&ecirc;me ne plus utiliser de montre, utilisant les Alpes avec le soleil pour cadran. En 1904, un h&ocirc;tel est d&eacute;di&eacute; &agrave; cet &eacute;minent politicien dont l'&eacute;loquence &eacute;tait tant redout&eacute;e. On peut voir dans un angle de l'h&ocirc;tel Gambetta, &agrave; Clarens, un buste de l'homme politique fran&ccedil;ais.<br>

</body>
</html>