<html>
<body>
<b>Marie Lafor&ecirc;t</b><br>
<br>
<img src="isabelleadjani.jpg"><br>
L'actrice et chanteuse fran&ccedil;aise surnomm&eacute;e la fille aux yeux d'or habite Gen&egrave;ve depuis 1978. N&eacute;e Ma&iuml;tena Doumenach dans une famille d'immigr&eacute;s arm&eacute;niens en 1939, elle vit durant son enfance &agrave; Soulac, en Gironde. A l'&acirc;ge de 16 ans, rempla&ccedil;ant sa soeur au pied lev&eacute;, elle remporte le concours de th&eacute;&acirc;tre Naissance d'une Etoile. Sa carri&egrave;re d'actrice est lanc&eacute;e.

Le succ&egrave;s est imm&eacute;diatement au rendez-vous avec le film-culte Plein Soleil, en 1960, o&ugrave; elle c&ocirc;toie Alain Delon. Elle joue l'ann&eacute;e suivante dans un autre film &agrave; succ&egrave;s, La Fille aux yeux d'or, qui lui vaut son surnom. Marie Lafor&ecirc;t m&egrave;ne parall&egrave;lement une carri&egrave;re musicale. Elle produit l'album Ecoute dans le Vent et interpr&egrave;te plusieurs autres compositions r&eacute;pertori&eacute;es dans l'album Marie Lafor&ecirc;t volume 5.

Elle encha&icirc;ne 16 films et de nombreux albums avant de s'&eacute;tablir en Suisse en 1978, pour y &eacute;lever ses enfants: Gen&egrave;ve, c'est la plus grande rencontre amoureuse de ma vie. Elle y c&ocirc;toie notamment ses compatriotesCharles Aznavour et Alain Delon. Comme ce dernieri, elle acquiert la nationalit&eacute; suisse.

Marie Lafor&ecirc;t vit dans un luxueux appartement dans la Vieille Ville, o&ugrave; elle tient une galerie d'art jusqu'en 1981. En 1994, Elle sort un nouvel album, Reconnaissances, d&eacute;di&eacute; aux habitants de Gen&egrave;ve, dans lequel elle d&eacute;peint la ville &agrave; travers les saisons. Divorc&eacute;e, la chanteuse habite non loin de son fils qui lui aussi r&eacute;side &agrave; Gen&egrave;ve.

Elle s'adonne &eacute;galement &agrave; sa premi&egrave;re grande passion, l'&eacute;criture, et on peut fr&eacute;quemment la rencontrer &agrave; la Biblioth&egrave;que de l' Universit&eacute; de Gen&egrave;ve o&ugrave; elle m&egrave;ne ses recherches. La chanteuse se prom&egrave;ne quotidiennement dans le Parc des Bastions, au centre-ville, o&ugrave; elle collecte des feuilles d'arbres pour confectionner des cr&egrave;mes de beaut&eacute;.
</body>
</html>