<html>
<body background="../images/fondtexte2.jpg"  border="0">
<b>Napol&eacute;on III</b><br>
<br>
<table>
<tr>
<td>
<img src="images/napoleon3.jpg"><br>
</td>
<td>
Le pr&eacute;sident de la Deuxi&egrave;me R&eacute;publique puis Empereur des Fran&ccedil;ais passa sa jeunesse en Suisse. Napol&eacute;on III est n&eacute; en 1808, &agrave; Paris. Fils de Louis Bonaparte (le fr&egrave;re de Napol&eacute;on Bonaparte) et d'Hortense Beauharnais, il se r&eacute;fugie en Suisse avec sa m&egrave;re &agrave; la chute de l'Empire fran&ccedil;ais en 1815.<br>
<br>
Napol&eacute;on III s'intalle d&egrave;s 1923 au Ch&acirc;teau d'Arenenberg, proche du Lac de Constance. Il accomplit sa formation &agrave; l'&eacute;cole militaire de Thoune, dans l'Oberland bernois, sous la direction du g&eacute;n&eacute;ral Dufour. Il y r&eacute;dige en 1833 ses Consid&eacute;rations politiques et militaires sur la Suisse.<br>
</td>
</tr>
</table>
<br>
En 1836, Napol&eacute;on III fomente un coup d'Etat depuis Strasbourg, en vain. Il s'exile &agrave; nouveau et tente de prendre le pouvoir &agrave; son retour en 1840. Emprisonn&eacute;, il s'&eacute;chappe en 1846 puis revient &agrave; Paris apr&egrave;s la r&eacute;volution de 1848, o&ugrave; il est &eacute;lu &agrave; l'Assembl&eacute;e constituante. Il est alors &eacute;lu pr&eacute;sident lors du scrutin de la m&ecirc;me ann&eacute;e.<br>
<br>
En 1852, Napol&eacute;on III dissout l'Assembl&eacute;e et se proclame Empereur, approuv&eacute; devant le peuple par un pl&eacute;biscite. Il encourage alors le d&eacute;veloppement &eacute;conomique et la modernisation de Paris, et annexe la Savoie en 1860. En 1864, il revient une derni&egrave;re fois en Suisse, dans sa demeure favorite, le Ch&acirc;teau d'Arenenberg.<br>
<br>
L'Empereur d&eacute;clare la guerre &agrave; la Prusse en 1870. Apr&egrave;s la d&eacute;faite de Sedan, le 2 septembre 1870, Napol&eacute;on III est fait prisonnier &agrave; Wilhelmsh&ouml;he, o&ugrave; il apprend son d&eacute;tr&ocirc;nement par l'Assembl&eacute;e nationale. Il s'exile peu apr&egrave;s en Angleterre, o&ugrave; il s'&eacute;teint en 1783. On peut visiter aujourd'hui le mus&eacute;e Napol&eacute;on, situ&eacute; dans le Ch&acirc;teau d'Arenenberg.<br>

</body>
</html>