<html>
<body background="../images/fondtexte2.jpg"  border="0">
<font color="brown"><b>Paul Verlaine</b></font> (1844-1896)<br>
<br>
<table>
<tr>
<td>
<img src="images/paulverlaine.jpg"><br>
</td>
<td>
<br>
Paul Verlaine tient une place &agrave; part dans la po&eacute;sie du XIXe si&egrave;cle, par la sinc&eacute;rit&eacute; de son lyrisme et le caract&egrave;re tr&egrave;s personnel de son oeuvre. On a dit que le vers de Verlaine chantait plus et mieux qu'aucun autre et que c'est &laquo; &agrave; partir de Baudelaire et de Verlaine (...) que s'op&egrave;re d&eacute;finitivement la liaison entre po&eacute;sie et musique &raquo; (C. Cu&eacute;not).<br>
<br><br>
 Une enfance sans probl&egrave;me :<br>
<br>
 Une enfance sans probl&egrave;me Paul Verlaine na&icirc;t en 1844 &agrave; <a href="../lorraine/moselle/metz.html"target="description">Metz</a> o&ugrave; il passe son enfance. Il fait ses &eacute;tudes &agrave; Paris et fr&eacute;quente les salons et les caf&eacute;s litt&eacute;raires de la capitale. Il fait la connaissance de po&egrave;tes c&eacute;l&egrave;bres comme Hugo, Banville, Gautier, Heredia et Baudelaire. Ces rencontres l'incitent &agrave; composer des vers.<br>
</td>
</tr>
</table>
<br><br>
 Un sensible violent :<br>
<br>
 D'un caract&egrave;re d&eacute;j&agrave; timide et apeur&eacute;, Verlaine est d&eacute;stabilis&eacute; par des deuils familiaux : son p&egrave;re meurt en 1865, sa cousine &Eacute;lisa &agrave; qui il &eacute;tait tr&egrave;s attach&eacute; deux ans plus tard. Il se tourne alors vers la boisson. Sous son emprise, Verlaine se r&eacute;v&egrave;le violent, n'h&eacute;sitant pas &agrave; battre sa m&egrave;re. Dans l'espoir de s'assagir, il se marie avec Mathilde Maut&eacute; et se d&eacute;tourne, temporairement, de l'alcool.<br>
<br><br>
 La rencontre du &laquo; mauvais ange &raquo; :<br>
<br>
 C'est alors que Verlaine croise le chemin d'un de ses admirateurs dont il tombe litt&eacute;ralement amoureux : Arthur Rimbaud. Il abandonne sa femme pour suivre Rimbaud en Angleterre et en Belgique. Mais les relations entre les deux hommes sont orageuses : en 1873, Verlaine blesse Rimbaud avec un revolver. Il est condamn&eacute; &agrave; deux ans de prison.<br>
<br><br>
 Un rachat compromis :<br>
<br>
 Il y compose des po&egrave;mes emplis de mysticisme et de nostalgie. &Agrave; sa sortie de prison, il prend de bonnes r&eacute;solutions. Il exerce le m&eacute;tier d'enseignant en Angleterre d'abord (d'o&ugrave; il &eacute;crit pour la derni&egrave;re fois &agrave; Rimbaud en 1875), puis en France. Mais Verlaine se remet &agrave; boire et se prend d'affection pour un de ses &eacute;l&egrave;ves. Il perd son poste de professeur et s'essaie &agrave; l'agriculture dans le Nord.<br>
<br><br>
 Le prince mis&eacute;rable :<br>
<br>
 Cette tentative se solde par un &eacute;chec financier d&eacute;sastreux. Sa mis&egrave;re mat&eacute;rielle et physique devient de plus en plus profonde. Elle co&iuml;ncide paradoxalement avec le d&eacute;but de sa gloire litt&eacute;raire. En 1894, il est couronn&eacute; &laquo; Prince des po&egrave;tes &raquo; et se voit dot&eacute; d'une pension. Cela n'emp&ecirc;che pas Verlaine de sombrer dans la mis&egrave;re la plus totale. Il conna&icirc;t une nouvelle fois la prison pour violences contre sa m&egrave;re et m&egrave;ne une vie de clochard. On le retrouve mort le 8 janvier 1896 dans la chambre d'une prostitu&eacute;e.<br>
<br><br>


 F&ecirc;tes Galantes :<br>
<br>
 Ces po&egrave;mes ont pour point de d&eacute;part des tableaux des peintres fran&ccedil;ais Watteau et Fragonard : ils sont peupl&eacute;s de berg&egrave;res, de marquis ci autres cr&eacute;atures de fantaisie &eacute;voluant dans un milieu frivole et campagnard.<br>
<br><br>
 La Bonne Chanson :<br>
<br>
 Verlaine devient tr&egrave;s personnel dans ces po&egrave;mes o&ugrave; il &eacute;crit ses espoirs mais aussi ses inqui&eacute;tudes face au mariage dans lequel il va s'engager avec Mathilde.<br>
<br><br>
 Quelques oeuvres :<br>
<br>
 1866 Po&egrave;mes Saturniens<br>
1869 F&ecirc;tes Galantes<br>
1870 La Bonne Chanson<br>
1874 Romances sans Paroles<br>
1881 Sagesse<br>
1884 Jadis et Nagu&egrave;re<br>
1888 Amour<br>
1889 Parall&egrave;lement<br>
1891 Bonheur et Chansons pour elle<br>
</body>
</html>