<html>
<body background="../images/fondtexte2.jpg"  border="0">


<font color="brown"><b>Philippe IV le Bel</b></font><br>
<table>
<tr>
<td>
<img src="images/philippe4lebel.jpg"><br>
</td>
<td>
<br>
N&eacute; en 1268 &agrave; Fontainebleau, mort le 29 novembre 1314 des suites d'une blessure &agrave; la chasse.<br> 
Fils du roi Philippe III le Hardi.<br>
<br>
Il &eacute;pousa Jeanne de Navarre (&acirc;g&eacute;e de 11 ans), fille d'Henri II de Champagne et roi de Navarre apportant ces 2 r&eacute;gions au royaume.<br>
6 enfants na&icirc;tront de leur union mais 4 survivront :<br>
- Louis (Louis le Hutin) n&eacute; en 1289<br>
- Philippe (Philippe V le long) n&eacute; en 1293 <br> 
- Charles (Charles IV le Bel) n&eacute; en 1294<br>
- Isabelle qui deviendra reine d'Angleterre en &eacute;pousant Edouard II.<br>
<br> 
</td>
</tr>
</table>
<b>- 1285 :</b> &eacute;lu roi, il a alors 17 ans !<br>
<br>
<b>- 1289 :</b> Il ach&egrave;te le Quercy aux anglais (contre une rente de 3 000 livres)<br>
<br>
<b>- 1296 :</b> Philippe le Bel impose une taxe au clerg&eacute; !<br>
<br>
<b>- 1301 :</b> Le Pape Boniface VIII invite tous les &eacute;v&ecirc;ques &agrave; "pr&eacute;parer la r&eacute;formation du royaume et la punition du roi de France".<br>
<br>
<b>- 1302 :</b> Philippe le Bel alors menac&eacute; d'excommunication r&eacute;unira l'assembl&eacute;e des Trois Etats afin de r&eacute;clamer la d&eacute;position du Pape par un concile.<br>
Les &eacute;v&ecirc;ques pr&eacute;f&egrave;reront soutenir le roi (pour ne pas d&eacute;pendre du Pape plus que du roi...).<br>
<br>
<b>- 7 septembre 1303 :</B> Guillaume de Nogaret aidé par des toscans se rend dans la petite ville d'Anagni pour arr&ecirc;ter le Pape.<br>
Menac&eacute; et injuri&eacute; par Guillaume de Nogaret, Boniface VIII (alors &acirc;g&eacute; de 60 ans) se serait alors d&eacute;fendu en criant : "Voil&agrave; mon cou, voil&agrave; ma t&ecirc;te ; je mourrai, mais je mourrai Pape" en traitant Guillaume de Nogaret de "fils de Cathare".<br>
Le courage du vieillard impressionne, des cavaliers romains et la population prennent alors sa d&eacute;fense, Nogaret est oblig&eacute; de quitter la ville.<br>
<br>
<b>- Octobre 1303 :</b> Mort du Pape Boniface VIII.<br>  
<br>
<b>- le 11 juillet 1302 :</b> Bataille des &eacute;perons d'or, Les chevaliers fran&ccedil;ais, command&eacute;s par Robert d'Artois, sont honteusement battus pr&egrave;s de Courtrai par les fantassins des milices communales flamandes.<br>
<br>
<b>- 1304 :</b> victoire de Mons en P&eacute;v&egrave;le, Philippe le Bel prend alors le contr&ocirc;le des châtellenies de Lille, Douai et B&eacute;thune.<br>
<br>
<b>- 13 octobre 1307 :</b> Le roi fait arr&ecirc;ter tous les Templiers et confisque leurs biens...<br>
<br>
<b>- 1312 :</b> Il fait  dissoudre l'ordre des Templiers par le Pape.<br> 
<br>
<b>- 29 novembre 1314 :</b> Philippe IV le Bel mort des suites d'une blessure &agrave; la chasse.<br>

</body>
</html>