<html>
<body background="../images/fondtexte2.jpg"  border="0">
<font color="brown"><b>Victor Hugo</b></font> (1802-1885)<br>
<br>
<table>
<tr>
<td>
<img src="images/victorhugo.jpg"><br>
</td>
<td>
<br>
Certains critiques ont propos&eacute; d'appeler le XIXe si&egrave;cle &laquo; le si&egrave;cle de Victor Hugo &raquo;. Il l'occupe en effet non seulement par sa long&eacute;vit&eacute;, par son autorit&eacute; comme chef de file des romantiques, mais aussi par l'ampleur de son oeuvre. Artiste complet, peintre &eacute;galement, il a &eacute;crit pour tous les genres : po&eacute;sie, th&eacute;&acirc;tre, roman. C'est aussi un po&egrave;te engag&eacute;, un homme politique lib&eacute;ral qui s'est mis au service des grandes id&eacute;es humanitaires.<br>
<br><br>
</td>
</tr>
</table>
 Les d&eacute;buts litt&eacute;raires :<br>
<br>
 Fils d'un commandant qui deviendra g&eacute;n&eacute;ral, Victor Hugo na&icirc;t &agrave; <a href="../franchecomte/doubs/besancon.html"target="description">Besan&ccedil;on</a> en 1802 (&laquo;Ce si&egrave;cle avait deux ans&raquo;, &eacute;crira-t-il plus tard). Sa jeunesse est entrecoup&eacute;e de nombreux voyages &agrave; travers l'Europe, ainsi que le veut la carri&egrave;re d'un militaire de m&eacute;tier. Les parents de Victor ne s'entendent pas tr&egrave;s bien et finissent pas se s&eacute;parer. Ile envoient leur fils en pension o&ugrave; il compose ses premiers po&egrave;mes. Son talents litt&eacute;raire est vite reconnu car l'Acad&eacute;mie fran&ccedil;aise lui d&eacute;cerne une r&eacute;compense. Il pourra bient&ocirc;t se consacrer &agrave; la litt&eacute;rature malgr&eacute; les voeux de son p&egrave;re qui aimerait le voir fr&eacute;quenter l'&eacute;cole polytechnique. Il veut &laquo; &ecirc;tre Chateaubriand ou rien &raquo;. Au d&eacute;but de sa carri&egrave;re, Hugo est catholique et monarchiste. en 1822, &acirc;g&eacute; de 20 ans, il &eacute;pouse Ad&egrave;le Foucher qui lui donnera 4 enfants dont L&eacute;opoldine et Ad&egrave;le (Ad&egrave;le H) qui eurent un destin tragique. La m&ecirc;me ann&eacute;e, il publie son premier recueil de po&egrave;me, les Odes, et commence &agrave; fr&eacute;quenter le salon de Nodier o&ugrave; il rencontre Vigny et Lamartine.<br>
<br><br>
 Le romantisme :<br>
<br>
 Victor Hugo prend nettement position en faveur du romantisme et contre le classicisme. Dans la pr&eacute;face de Cromwell (1827). Il devient le chef de file de l'&eacute;cole romantique et triomphe avec son drame Hernani. Lors de la premi&egrave;re repr&eacute;sentation devant le public de la Com&eacute;die-Fran&ccedil;aise, partisan du classicisme, les jeunes d&eacute;fenseurs du romantisme forcent le succ&egrave;s par leurs applaudissements. Ils livrent ainsi chaque soir ce que l'on a appel&eacute; la bataille d'Hernani..<br>
<br><br>
 Succ&egrave;s litt&eacute;raires et &eacute;checs personnels :<br>
<br>
 Victor Hugo conna&icirc;t alors une intense activit&eacute; litt&eacute;raire dans tous les genres. En 1841, il entre &agrave; l'Acad&eacute;mie fran&ccedil;aise. Cette p&eacute;riode f&eacute;conde est pourtant assombrie par des chagrins personnels. Son m&eacute;nage est bris&eacute; par la trahison de son ami Sainte-Beuve. Quelques ann&eacute;es plus tard, il perd sa fille a&icirc;n&eacute;e (1843), L&eacute;opoldine, qui se noie accidentellement. La douleur du p&egrave;re est muette. Il s'&eacute;coulera 16 ans entre sa derni&egrave;re publication : Les Rayons et les Ombre (1840) et le recueil consacr&eacute; &agrave; la m&eacute;moire de L&eacute;opoldine intitul&eacute; : Les Contemplations (1856). En 1845, il devient d&eacute;put&eacute; au parlement, &agrave; Paris.<br>
<br><br>
 L'homme et l'exil :<br>
<br>
 Victor Hugo est un lib&eacute;ral qui au d&eacute;but se m&eacute;fie des id&eacute;es r&eacute;publicaines et socialistes. Elu d&eacute;put&eacute;, il commence par soutenir la candidature &agrave; la pr&eacute;sidence de la r&eacute;publique du prince Louis Napol&eacute;on. Mais il ne tarde pas &agrave; changer de camp et &agrave; devenir un opposant de celui qu'il consid&egrave;re comme un tyran. Il fuit alors en Belgique, puis &agrave; Jersey et Guernesey, o&ugrave; il s'installe. Pendant quinze ans, Hugo reste en exil, &eacute;crivant des satires contre celui qu'il appelle Napol&eacute;on-le-Petit. C'est aussi l'&eacute;poque o&ugrave; il produit ses plus grandes oeuvres : Ch&acirc;timents, Les contemplations, La L&eacute;gende des si&egrave;cles et Les Mis&eacute;rables.<br>
<br><br>
 Le retour et la gloire :<br>
<br>
 Victor Hugo est triomphalement accueilli lorsqu'il rentre en France en 1870, &agrave; la chute de l'empire. Il tente de participer activement &agrave; la vie publique mais, d&eacute;&ccedil;u par le nouveau gouvernement, il se retire de nouveau &agrave; Guernesey. &Agrave; sa mort en 1885, la R&eacute;publique lui fait des fun&eacute;railles nationales et il est enterr&eacute; au Panth&eacute;on.<br>
<br><br>
 Ses amour :<br>
<br>
 - Se marie avec Ad&egrave;le Foucher : qui lui donne 4 enfants.<br>
- Liaison avec Juliette Drouet : (com&eacute;dienne) lui restera fid&egrave;le tout sa vie.<br>
<br><br>
 Le spiritisme :<br>
<br>
 - Il croit aux esprits, il organise des s&eacute;ances.<br>
- Il poss&egrave;de une chaise ou personne ne peut s'asseoir, car elle d&eacute;sign&eacute;e a ses anc&ecirc;tres.<br>
- Dans sa chambre, se trouvent une table et des chaises qui repr&eacute;sentent le tribunal.<br>
- Il a un tableau: moiti&eacute; du visage repr&eacute;sente la mort.<br>
<br><br>
 Quelques oeuvres :<br>
<br>
 1827 Cromwell<br>
1830 Hernani<br>
1838 Ruy Blas<br>
1840 Les Rayons et les Ombres<br>
1849 Les Burgraves<br>
1853 Les Ch&acirc;timents<br>
1856 Les Contemplations<br>
1862 Les Mis&eacute;rables<br>

<pre>
------------------------------
(Recueil : Odes et ballades)
  

 A une jeune fille

Vous qui ne savez pas combien l'enfance est belle,
Enfant ! n'enviez point notre &acirc;ge de douleurs,
O&ugrave; le coeur tour &agrave; tour est esclave et rebelle,
O&ugrave; le rire est souvent plus triste que vos pleurs.

Votre &acirc;ge insouciant est si doux qu'on l'oublie !
Il passe, comme un souffle au vaste champ des airs,
Comme une voix joyeuse en fuyant affaiblie,
Comme un alcyon sur les mers.

Oh ! ne vous h&acirc;tez point de m&ucirc;rir vos pens&eacute;es !
Jouissez du matin, jouissez du printemps ;
Vos heures sont des fleurs l'une &agrave; l'autre enlac&eacute;es ;
Ne les effeuillez pas plus vite que le temps.

Laissez venir les ans ! Le destin vous d&eacute;voue,
Comme nous, aux regrets, &agrave; la fausse amiti&eacute;,
A ces maux sans espoir que l'orgueil d&eacute;savoue,
A ces plaisirs qui font piti&eacute;.

Riez pourtant ! du sort ignorez la puissance
Riez ! n'attristez pas votre front gracieux,
Votre oeil d'azur, miroir de paix et d'innocence,
Qui r&eacute;v&egrave;le votre &acirc;me et r&eacute;fl&eacute;chit les cieux !
</pre>
</body>
</html>