@DATABASE opium.newmail.ru:666/15s.htm
@WORDWRAP

@NODE MAIN
@TITLE " Ave Satanas..."
 
   @{" " link "14_1s.guide/MAIN"}@{"../pau.gif" link "../pau.gif/MAIN"}
Назад    Черная Библия "Книга Люцифера
 (Воздух)"    @{" " link "16s.guide/MAIN"}@{"../pau0.gif" link "../pau0.gif/MAIN"}
Дальше 

Религиозные праздники 

&nbsp;Величайший из всех праздников в Сатанинской религии - свой собственный день рождения. Это является полной противоположностью святым из святых дней других религий, обожествляющих какого-либо антропоморфического бога, созданного по образу и подобию человеческому, что лишний раз доказывает то, что эго еще не окончательно похоронено. 

&nbsp;Сатанист полагает: "Почему бы не быть честным с самим собой, и, если уж бог создается по моему образу и подобию, почему бы этим богом не считать себя?" Каждый человек является богом, если он считает себя таковым. Так что Сатанист празднует свой день рождения как самый важный праздник в году. В конце концов, разве сам факт вашего рождения не доставляет вам более радости, чем день рождения того, кого вы в своей жизни даже и не повстречали? Или, не беря в расчет религиозные мотивы, почему уделять больше чести дню рождения Президента или исторической дате, чем дню, когда вы появились на свет? 

&nbsp;Несмотря на тот факт, что некоторых из нас могли и не хотеть, или, по крайней мере, не планировали, мы рады, даже если более не рад никто, тому, что мы здесь! Надобно похлопать себя по спине, купить себе все мыслимые подарки, обращаться с собой как с королем (или богом), коими мы и являемся; в общем, праздновать свой день рождения с максимально возможной помпой и церемонностью. 

&nbsp;После собственного дня рождения двумя главными Сатанинскими праздниками являются Вальпургиева ночь (ночь на 1-е мая) и Халловин (канун Дня Всех Святых, 31 октября). 

&nbsp;Св. Вальпургия, либо Вальпурга, либо Вальбурга - в зависимости от места и времени, в котором она упоминается, родилась в английском графстве Суссекс на рубеже VII и VIII веков и получила образование в Уинборне, графство Дороет, где после пострижения в монахини прожила 27 лет. Затем она, по настоянию своего дядюшки. Св. Бонифация и брата, Св, Вилибальда отправилась с другими монахинями основывать религиозные заведения в Германии. Первое из них было создано в Бишофштайне, что в Майнцской епархии, а двумя годами позже Св. Вальпургия становится аббатисой в женском бенедиктинском монастыре Айштадтского аббатства ее брата Св. Вилибальда в Баварии, где другой ее брат, Винебальд также возглавил монастырь. После его смерти в 760 году она взяла на себя его обязанности и руководила обоими аббатствами вплоть до своей смерти 25 февраля 779 года. Ее мощи были перевезены в Айштадт, где были возложены в пустоту одной из скал, откуда потом стало выделяться битумное масло, известное как Вальпургиево и имеющее чудодейственные свойства против болезней. Пещера стала местом паломничества н там была построена большая церковь. Св. Вальпургия почиталась в разны одни, но, в основном, 1-го мая, которое стало с тех пор христианским праздником вместо праздновавшегося ранее в тот же день языческого. Удивительно, что весь этот вздор был сочтен необходимым только потому, что приходилось иметь дело с продолжающим отмечаться самым важным языческим празднеством года - великой кульминацией весеннего равноденствия! 

&nbsp;Канун мая был олицетворен как ночь, в которую все демоны, привидения, злые духи и прочая нечисть появляется на свет н закатывает дикие празднества, символизируй наступление весеннего равноденствия. 

&nbsp;Халловин, канун Дня Всех Святых, выпадает на ночь с 31 октября на 1 ноября. Изначально, День Всех Святых был одним из больших огненных праздников Британии времен друидов. В Шотландии он ассоциировался со временем, когда души мертвых, демоны и колдуны были необычайно активны и благосклонны. Парадоксально, но этот день был для молодых людей датой совершения магических ритуалов для определения будущих партнеров по браку. Деревенская молодежь сопровождала все это весельем и чувственными утехами, а более старые тщательно оберегали свои дома от злых духов, ведьм и демонов, обладавших этой ночью необычайной силой. 

&nbsp;Солнцестояния и равноденствия также праздновались в качестве первых дней времен года. Разница между солнцестоянием и равноденствием является семантическим определением взаимоотношений Солнца, Луны и неподвижных звезд. Солнцестояния выпадают на зиму и лето, равноденствия относятся к осени и весне. Летнее солнцестояние - в июне, зимнее - в декабре. Осеннее равноденствие - в сентябре, весеннее - в марте. И солнцестояния и равноденствия меняют свою дату на день или два от года к году, что зависит от лунного цикла в данный момент, но, как правило, попадают на 21-е или 22-е число соответствующего месяца. От пяти до шести недель после этих дат празднуются легендарные Сатанинские праздники. 
 ---

 ---

 ---

 ---

 ---

@endnode
