<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="Author" CONTENT="MGF - Design">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.03 [de] (WinNT; I) [Netscape]">
   <META NAME="Description" CONTENT="Serienguide zu Seaquest DSV">
   <META NAME="KeyWords" CONTENT="Seaquest,Seaquest DSV,Seaquest 2032">
   <TITLE>SeaQuest DSV - Die Staffel &Uuml;bersicht</TITLE>
</HEAD>
<BODY TEXT="#FFFFFF" BGCOLOR="#000080" LINK="#FFFF00" VLINK="#8080FF" ALINK="#FF00FF" BACKGROUND="wasser.gif">
<B><U><FONT SIZE=+2><A HREF="seaquestmain.html">Hintergr&uuml;nde</A></FONT></U></B>

<P><FONT SIZE=+1>Das einundzwanzigste Jahrhundert. Der Mensch hat die letzte
unerforschte Region unserer Erde kolonisiert - den Ozean.</FONT>
<BR><FONT SIZE=+1>Als Besatzung der SeaQuest sind wir f&uuml;r den Schutz
der Meere verantwortlich. Denn unter der Wasseroberfl&auml;che liegt die
Zukunft ...</FONT><FONT SIZE=+1></FONT>

<P><FONT SIZE=+1>Mit SEAQUEST DSV, einer ehrgeizigen und &uuml;beraus kostspieligen
Koproduktion von Universal Television und seiner eigenen Produktionsgesellschaft
Amblin Entertainment, versuchte Hollywoods Wunderknabe Steven Spielberg
1993, in die Gefilde erfolgreicher Fernsehserien vorzusto&szlig;en. Von
Beginn an als Versuch deklariert, dem &uuml;berm&auml;chtigen STAR TREK
aus dem Hause Paramount Paroli zu bieten, sollte SEAQUEST ein eigenes,
atemberaubendes Science-Fiction-Universum kreieren und von der Erforschung
der geheimnisvollen Welt unter Wasser handeln.</FONT><FONT SIZE=+1></FONT>

<P><U><FONT SIZE=+1>KALKULIERBARER ERFOLG ?</FONT></U><FONT SIZE=+1></FONT>

<P><FONT SIZE=+1>So weit so gut - nur das Spielbergs &Uuml;berlegungen,
anders als etwa bei E.T. und JURASSIC PARK, diesmal ins Leere zielten.
Denn die neue Serie um das Super-U-Boot SEAQUEST wurde zwar mit allem ausgestattet,
was eine perfekte TV-Show erfordert - es gab gute Schauspieler, tolle Spezialeffekte
und atemberaubende Sets-, aber letztlich war der Stapellauf der SEAQUEST,
der am 12.September 1993 unter gro&szlig;em Werbeaufwand im amerikanischen
Fernsehen erfolgte, nur der Startschu&szlig; zu einer &auml;u&szlig;erst
schlingernden Tiefseefahrt, die im Dezember 1995 abrupt endete.</FONT>
<BR><FONT SIZE=+1>Dabei hatte drei Jahre zuvor noch alles so gut ausgesehen.
Spielbergs klangvoller Name hatte schon fr&uuml;hzeitig daf&uuml;r gesorgt,
da&szlig; die Medien &uuml;beraus gro&szlig;es Interresse an der neuen
Science-Fiction-Serie angemeldet hatten. DIe Nachricht, da&szlig; Roy Scheider,
allen bekannt durch seine Rolle als beherzter Sheriff Brody in Spielbergs
DER WEISSE HAI, die Hauptrolle &uuml;bernehmen w&uuml;rde, schlug wie eine
Bombe ein, und staunend nahm man zur Kenntnis, da&szlig; s&auml;mtliche
FX-Sequencen der neuen Serie im Computer gemacht w&uuml;rden, mit freundlicher
Unterst&uuml;tzung der Firma Commodore. Mehr als seinen guten Namen lieh
Spielberg der Serie, bei der er als Ausf&uuml;hrender Produzent fungierte,
jedoch nicht - er war zu dieser Zeit bereits mit den Arbeiten an JURASSIC
PARK besch&auml;ftigt und seine Mitwirkung beschr&auml;nkte sich darauf,
gelegentlich am Set vorbeizusehen und Rockney S. O&acute;Bannon, den Autor
der Serie, mit spritzigen Ideen zu versorgen, die dieser dann flei&szlig;ig
ins Skript einzuarbeiten versuchte.</FONT><FONT SIZE=+1></FONT>

<P><U><FONT SIZE=+1>STAR TREK UNTER WASSER</FONT></U><FONT SIZE=+1></FONT>

<P><FONT SIZE=+1>Da&szlig; SEAQUEST darauf ausgelegt war, eine Art STAR
TREK unter Wasser zu werden, steht au&szlig;er Frage und wurde von den
Verantwortlichen auch nie ernstlich bestritten - wenngleich man sich lieber
auf Vorbilder wie James Camerons ABYSS und Klassiker wie Jules Vernes 20.000
MEILEN UNTER DEM MEER berief. Tatsache ist aber, da&szlig; STAR TREKs unendliche
Weitem lediglich durch unendliche Tiefen vertauscht wurden - am Auftrag,
k&uuml;hn dorthin vorzusto&szlig;en, wo noch keiner zuvor gewesen ist,
&auml;ndert sich auch in Spielbergs Unterwassersaga nichts.</FONT>
<BR><FONT SIZE=+1>Auch die Mannschaft, die auf Deck der SEAQUEST versammelt
wurde, weist mehr als nur eine Parallele zu Gene Roddenberrys Sch&ouml;pfung
auf - neben dem Captain (Roy Scheider), einer v&auml;terlichen Mischung
aus Wissenschaftler und kaltem Krieger, gibt es die nette Schiffs&auml;rztin
und einen jugendlichen Sidekick (Lucas Wolenczak alias Jonathan Brandis),
dessen intellektuelle Eigenschaften deutlich an Wesley Crusher erinnern.
Dem Captain zur Seite steht sein erster Offizier Jonathan Ford und STacy
Haiduk als Schiffsingeneurin Lt.Hitchcock. Das exotischste Mitglied der
SEAQUEST-Besatzung (f&uuml;r das sich kein Pendant auf der Enterprise ausmachen
l&auml;&szlig;t) ist Darwin, ein &uuml;beraus intelligenter und aufgrund
moderner Technik zum Sprechen bef&auml;higter Delphin, der gleichzeitig
als Schiffsmaskottchen dient.</FONT><FONT SIZE=+1></FONT>

<P><U><FONT SIZE=+1>EIN STOLZES SCHIFF</FONT></U><FONT SIZE=+1></FONT>

<P><FONT SIZE=+1>Der heimliche Star der Serie hingegen ist - auch hier
denken wir an STAR TREK - das Schiff selbst, das der Besatzung Zuflucht
und zweite Heimat ist - Top Designer James Lima (TOTAL RECALL,STRANGE DAYS)
setzte sich ans Zeichenbrett und entwarf das definitive U-Boot der Zukunft.
Beim Design der SEAQUEST orientierte er sich an organischen Formen - das
U-Boot erscheint wie ein riesiger Tintenfisch, der majest&auml;tisch durch
die Tiefen des Ozeans gleitet. Die Abmessungen des Unterwasser-Liners dachte
Lima sich in wahrhaft phantastischen Dimensionen: Fast 350 Meter lang ist
seine SEAQUEST, die von einem nuklearen Verschmelzungssystem angetrieben
wird und in abgetauchtem Zustand satte 32.000 Tonnen Wasser verdr&auml;ngt
...</FONT>
<BR><FONT SIZE=+1>Auch das Interieur des Schiffes ist vom Feinsten. Produktionsdesigner
Richard Lewis zog alle Register seines K&ouml;nnens, um m&ouml;glichst
realistische Sets zu entwerfen, unterst&uuml;tzt von Ozeanologen und Titanic-Entdecker
Robert Ballard, der von Spielberg als wissenschaftlicher Berater angeheuert
wurde. W&auml;hrend der ersten Staffel tauchte Ballard auch im Nachspann
auf, um kurze Statements zum Stand heutiger Meeresforschung abzugeben und
(bisweilen an den Haaren herbeigezogene) Parallelen zwischen der SEAQUEST-Handlung
und der Wirklichkeit zu ziehen.</FONT><FONT SIZE=+1></FONT>

<P><U><FONT SIZE=+1>STARTPROBLEME</FONT></U><FONT SIZE=+1></FONT>

<P><FONT SIZE=+1>Doch wenn auch mit dem umfeld des neuen SF-Knallers alles
zu stimmen schien, hatte SEAQUEST DSV von Beginn an Probleme, sich auf
dem Bildschirm zu behaupten. Zu gro&szlig; war wohl die Bandbreite, in
der die Skripts zwischen hochwertiger Science Fiction und kindlich hausbackener
Action variierten, zu weit auch die Streuung des Zielpublikums - SEAQUEST
konnte sich sichtlich nicht f&uuml;r ein Zuschauerpotential entscheiden.
Ob es daran lag, da&szlig; der Name Spielberg einfach zu hohe Erwartungen
geweckt oder zu viele K&ouml;che (sprich: Produzenten) den Brei verdorben
hatten, sei dahingestellt: Trotz ihrer ungew&ouml;hnlich hohen Qualit&auml;t
fiel die Serie beim breiten Publikum durch. Mitverantworlich f&uuml;r das
schlechte Abschneiden der ersten Staffel war zweifellos auch, da&szlig;
SEAQUEST zeitgleich mit SUPERMAN - DIE ABENTEUER VON LOIS UND CLARK gesendet
wurde und Capt. Bridger und seine Crew sich gegen einen uramerikanischen
Mythos zu behaupten hatten - zu einer anderen Sendezeit h&auml;tten sich
vielleicht mehr Zuschauer</FONT>
<BR><FONT SIZE=+1>f&uuml;r feuchtfr&ouml;hliche Unterwasser-SF begeistern
lassen. So hielten die meisten dem st&auml;hlernen Kryptonier die Treue.</FONT><FONT SIZE=+1></FONT>

<P><U><FONT SIZE=+1>EIN NEUES SPIEL ...</FONT></U><FONT SIZE=+1></FONT>

<P><FONT SIZE=+1>Vielleicht w&auml;re SEAQUEST DSV nach seinem schlechten
Abschneiden gar keine zweite Staffel beschieden gewesen, h&auml;tte nicht
eine Reihe von Faktoren daf&uuml;r gesorgt, da&szlig; die Produktion am
Leben gehalten wurde:</FONT>
<BR><FONT SIZE=+1>Zum einen war nat&uuml;rlich Steven Spielbergs klangvoller
Name mit dem Projekt verkn&uuml;pft, und die Serie war zu einem Prestigeobjekt
f&uuml;r den sonst erfolsverw&ouml;hnten Produzenten geworden. Zum anderen
hatte man Millionen Dollar in teure Sets und Spezialeffekte gesteckt, die
sich schlie&szlig;lich auch auszahlen sollten - die Herstellung einer zweiten
Staffel war also schon daher ein Mu&szlig;.</FONT>
<BR><FONT SIZE=+1>Ein dritter Grund mag sein, da&szlig; Spielberg, in Erinnerung
an die clevere Vorgehensweise seines Kumpel George Lucas, bereit vor dem
Start von SEAQUEST diverse Deals mit der Merchandisingindustrie abgeschlossen
hatte: Spielzeug, Modelle, B&uuml;cher etc. gelangten p&uuml;nktlich zum
Start der Serie in die L&auml;den und verkauften sich - dem m&auml;&szlig;igen
Erfolg der TV-Folgen entsprechend - nur z&auml;h. Auch von dieser Seite
lagen also massive Interessen vor, da&szlig; SEAQUEST fortgesetzt wurde.
Dennoch wollte man nicht so weitermachen, wie man aufgeh&ouml;rt hatte.
SPielberg gab Auftrag, die Serie grundlegend zu &uuml;berarbeiten. Ein
neues Erfolgskonzept mu&szlig;te her - und das glaubte man schlie&szlig;lich
auch gefunden zu haben. David J. Burke, Ausf&uuml;hrender Produzent der
ersten Staffel, stieg zum Koproduzenten auf und sollte der Serie mit neuem
Elan zu sp&auml;tem Erfolg verhelfen.</FONT>
<BR><FONT SIZE=+1>Burke f&uuml;hrte auch tats&auml;chlich eine Reihe von
&Auml;nderungen ein und verpa&szlig;te der Serie eine Frischzellenkur,
die sich nicht nur auf die Geschichten auswirkte, die fortan wesentlich
mehr in Richtung Science Fiction zielten, sondern auch das Durchschnittsalter
der Crew verj&uuml;ngten.</FONT>
<BR><FONT SIZE=+1>So wurde die SEAQUEST, die in der letzten Folge der ersten
Staffel zerst&ouml;rt worden war, durch ein neues Schiff gleichen Namens
ersetzt, dessen Design do plausibel ver&auml;ndert und auf die Erfordernisse
einer TV-Serie besser zugeschnitten werden konnte. SO sitzt die Br&uuml;ckenbesatzung
der neuen SEAQUEST nicht mehr &uuml;ber ihre Instrumente gebeugt mit dem
R&uuml;cken zueinander, sondern blickt zur Mitte des Raumes wo sich der
Captain befindet. Der Drehort der Serie wurde - nicht gerade zur Freude
der Schauspieler - von Los Angeles nach Orlando in Florida verlegt, wo
Universal neben einem Film-Vergn&uuml;gungspark auch Produktionsst&auml;tten
unterh&auml;lt. Nicht nur, da&szlig; die Regenw&auml;lder und Str&auml;nde
des Sunshine State sich hervorragend f&uuml;r Au&szlig;endrehs eigneten
- die riesigen Aquarien des nahegelegenen Seaworld-Amusementparks, mit
dem Burke ein Abkommen schlo&szlig;, konnte auch noch als preiswerter Drehort
f&uuml;r packende Unterwasseraction genutzt werden.</FONT><FONT SIZE=+1></FONT>

<P><U><FONT SIZE=+1>TRAU KEINEM &Uuml;BER 35</FONT></U><FONT SIZE=+1></FONT>

<P><FONT SIZE=+1>Zum neuen Konzept geh&ouml;rte auch, da&szlig; einige
Schauspieler der ersten Staffel ihren Seesack schultern und das Schiff
verlassen mu&szlig;ten - allen voran Royce D. Applegate und John D&acute;Aquino,
die Burke f&uuml;r zu alt hielt, um in einer auf sexy und jugendlich getrimmten
Serie auftreten zu k&ouml;nnen. Im Gegenzug mu&szlig;te Burke zwei herbe
R&uuml;ckschl&auml;ge hinnehmen, als die beiden leading Ladies der Serie
das handtuch warfen: Stephanie Beacham stieg aus, weil sie sich schauspielerisch
unterfordert f&uuml;hlte, und auch Stacy Haiduk zog es vor, nicht weiter
auf der SEAQUEST Dienst zu tun - Ger&uuml;chten zufolge hatte sie keine
Lust mehr, mit nassem T-Shirt durchs Set zu turnen und der Serie ein paar
voyeuristische Highlihts zu bescheren ...</FONT>
<BR><FONT SIZE=+1>Burke machte aus der Not eine Tugend und f&uuml;hrte
eine Reihe neuer Charaktere ein: Als &Auml;rztin und Counselor(STAR TREK
l&auml;&szlig;t gr&uuml;&szlig;en) in Personalunion heuerte Rosalind Allen
an, die die telepathisch begabte Wendy Smith spielt; Peter DeLuise, Sohn
des Komikers Dom DeLuise, wurde als genetisch erzeugter Kunstmensch Dagwood
verpflichtet, der sich gro&szlig;e M&uuml;he gibt, ein echter Mensch zu
werden(Parallelen zu Data ???), Edward Kerr schlie&szlig;lich kam als schneidiger
Offizier an Bord, dem die Autoren den Namen "Brody" gaben - ein Nachfahre
des legend&auml;ren Sheriff Brody, der anno 1975 den gef&auml;hrlichen
wei&szlig;en Hai erlegte ? Mit Kathy Evison als beherzter F&auml;hnrich
Henderson und Michael DeLuise als Lt. Piccolo, der &uuml;ber implantierte
Kiemen verf&uuml;gt und wie ein Fisch unter Wasser atmen kann, wurde die
Besatzung endg&uuml;ltig verj&uuml;ngt.</FONT>
<BR><FONT SIZE=+1>Damit glaubte man nun auch endlich, ein Zielpublikum
f&uuml;r SEAQUEST DSV gefunden zu haben: Die junge Zuschauerschaft sollte
es sein, der die Abenteuer des Super-U-Boots ans Herz wachsen sollten.</FONT><FONT SIZE=+1></FONT>

<P><U><FONT SIZE=+1>EIN NEUES PUBLIKUM ?</FONT></U><FONT SIZE=+1></FONT>

<P><FONT SIZE=+1>Bunt und poppig kam die zweite Staffel also daher, in
der das SF-Element wirklich den gr&ouml;&szlig;ten Anteil erhielt. Aus
der Begegnung mit einem Alien in der ersten Staffel wurden nun ganze Episoden
gestrickt, die schlie&szlig;lich darin gipfelten, da&szlig; die ganze SEAQUEST
auf einen fremden Planeten versetzt wurde, wo sie in eine au&szlig;erirdische
Auseinandersetzung eingriff. Das neue Konzept erwies sich jedoch als wenig
wirkungsvoll: Anstatt neue Anh&auml;nger hinzuzugewinnen, half es lediglich,
die Fans der ersten Stunde zu vergraulen.</FONT>
<BR><FONT SIZE=+1>Roy Scheider, der die Rolle des Bridger von Beginn an
etwas widerwillig und eigenen Aussagen nur Steven Spielberg zuliebe gepielt
hatte, begann sich denn auch lauthals in den Medien zu beschweren, da&szlig;
die SEAQUEST zu einem schwimmenden Kindergarten verkommen sei und bat entnervt
um seine Entlassung, die ihm zu Beginn der dritten Staffel auch gew&auml;hrt
wurde.</FONT><FONT SIZE=+1></FONT>

<P><U><FONT SIZE=+1>... UND ZUM DRITTEN</FONT></U><FONT SIZE=+1></FONT>

<P><FONT SIZE=+1>Mit Beginn der dritten Staffel wurde das Konzept der Serie
noch einmal &uuml;berarbeitet. Man entschlo&szlig; sich, einen noch actionbetonteren
Kurs zu fahren und mit ernsteren Themen auch das erwachsene Publikum wieder
zum einschalten zu bewegen.</FONT>
<BR><FONT SIZE=+1>Da roy Scheider wie erw&auml;hnt nicht mehr zur Verf&uuml;gung
stand, er beschr&auml;nkte sich darauf, gelegentlich als Gaststar vorbeizuschauen,
wurde ein neuer Befehlshaber f&uuml;r das U-Boot ben&ouml;tigt, den man
schlie&szlig;lich in Michael Ironside gefunden zu haben glaubte. Ironside,
bekannt vor allem als B&ouml;sewicht aus TOTAL RECALL und HIGHLANDER II,
brachte sowohl das verlangte Charisma als auch den n&ouml;tigen Enthusiasmus
mit an Bord, der n&ouml;tig sein w&uuml;rde, die SEAQUEST wieder in ruhigere
Gew&auml;sser zu steuern.</FONT><FONT SIZE=+1></FONT>

<P><U><FONT SIZE=+1>EIN NEUER CHEF</FONT></U><FONT SIZE=+1></FONT>

<P><FONT SIZE=+1>Mit dem F&uuml;hrungswechsel auf der Br&uuml;cke des U-Bootes
ging auch eine Ver&auml;nderung in der Chefetage der SEAQUEST-Produktion
vonstatten: Patrick Haburgh l&ouml;ste David burke als verantwortlichen
Produzenten ab und sollte die Serie (nun aber endg&uuml;ltig) zum Erfolg
f&uuml;hren.</FONT>
<BR><FONT SIZE=+1>Mehr Action sollte es von nun an geben, mehr Abenteuer
und plausible, technische Science Fiction, wie sie in der ersten Staffel
erz&auml;hlt worden war. Vergessen waren all die Aliens, die sich w&auml;hrend
der zweiten Staffel an Bord der SEAQUEST get&uuml;mmelt hatten, vergessen
auch die dunklen Geister und D&auml;monen, die Bridger und seine Crew heimgesucht
hatten. "J&auml;ger des verlorenen Schatzes" sollte die neue Richtung sein,
legte Produzent Hasburgh fest, in die das leck geschlagene Schiff nun steuern
sollte, hoffentlich in ruhigere Gew&auml;sser.</FONT><FONT SIZE=+1></FONT>

<P><U><FONT SIZE=+1>UNTERWASSER JAGD</FONT></U><FONT SIZE=+1></FONT>

<P><FONT SIZE=+1>Prompt fand die im All verschollene Crew im Pilotfilm
der dritten Staffel auf die Erde zur&uuml;ck, und erlebte fortan nur noch
dort ihre Abenteuer. Den Kunstgriff, die neuen Erlebnisse der SeaQuest-Crew
zehn Jahre nach den Ereignissen der zweiten Staffel spielen zu lassen,
wandten Hasburgh und seine Autoren an, um die Serie noch einmal t&uuml;chtig
umkrempeln zu k&ouml;nnen, ohne dabei zu sehr auf Kosten der Kontinuit&auml;t
zu arbeiten.</FONT>
<BR><FONT SIZE=+1>In den folgenden Episoden jagten Captain Hudson und seine
Leute versunkenen Sch&auml;tzen und Ruinen nach, erlebten Zeitreisen und
behaupteten sich gegen faschistoide B&ouml;sewichte und skrupellose Wirtschaftsmagnate.
Doch die Einschaltquoten wollten noch immer nicht steigen. Zwar wurde SEAQUEST
2032, wie die Serie nun offiziell hie&szlig;, nun auch von Kritikerseite
ein gewisses Unterhaltungspotential zugestanden, doch war es f&uuml;r die
Serie im Grunde zu sp&auml;t, sich ein eigenes Publikum zu schaffen. Die
Show rangierte weiterhin auf den hinteren Pl&auml;tzen und schaffte es
nicht, sich als feste Gr&ouml;&szlig;e im TV-Programm zu etablieren.</FONT>
<BR><FONT SIZE=+1>Da sahen die Geldgeber bei NBC Networks denn nicht mehr
l&auml;nger zu und strichen die Abenteuer des Unterseebootes im Dezember
1995 aus ihrem Programm - mitten in der dritten Staffel. Der Grund daf&uuml;r
ist sicher nicht im fehlenden Engagement Hasburghs und seiner Darstellerriege
zu suchen, die - allen oran Michael Ironside als Captain Hudson - mit iel
Enthusiasmus zu Werke gegangen waren. Zu viele Fehler waren in vorangegangenen
Staffeln gemacht worden, als da&szlig; sie mit wenigen gelungenen Episoden
hatten ausgeb&uuml;gelt werden k&ouml;nnen. Da&szlig; es mit Steven Spielbergs
U-Boot-Saga, die zwar zu keiner Zeit wirklich STAR TREK &auml;hnliches
Potential entwickelte, aber doch immerhin recht gut gemachte Unterhaltung
bot, ein so unr&uuml;hmliches Ende nahm, ist sicher Schade - doch mu&szlig;
eingestanden werden, da&szlig; SEAQUEST die vollmundigen Versprechungen,
die vor dem Start der Serie gemacht worden waren, zu keinem Zeitpunkt wirklich
eingel&ouml;st wurden.</FONT>
<BR><FONT SIZE=+1>SEAQUEST vers&auml;umte es, sich ein treues Stammpublikum
zu schaffen und havarierte planlos zwischen den Sendezeiten - der Todessto&szlig;
f&uuml;r jedes noch so erfolgversprechende TV-Konzept. Auch gerieten die
Skripts, mit denen die Story Editoren die Serie bedachten, bisweilen abstrus
und phantastisch und lie&szlig;en psychologische Tiefe und Plausibilit&auml;t
in der Charakterzeichnung missen - da half auch der gute Name Spielbergs
nicht, das Schiff vor dem Untergang zu retten.</FONT><FONT SIZE=+1></FONT>

<P><U><FONT SIZE=+1>EIN ENTGLEISTER ZUG</FONT></U><FONT SIZE=+1></FONT>

<P><FONT SIZE=+1>Ein Verlustgesch&auml;ft d&uuml;rfte SEAQUEST DSV jedoch
trotzdem nicht sein. die insgesamt knapp 60 Folgen lassen sich (nicht zuletzt
wegen Spielbergs Teilnahme) an Fernsehgesellschaften in aller Welt verschachern
und werden wohl immer wieder auf irgendeinem Programm zu sehen sein - in
Deutschland fand die Serie um das futuristische Super-U-Boot beim Privatsender
RTL seinen Heimathafen, obwohl es die Leute bei RTL nicht schaffen die
Teile der Serie in der richtigen Reihenfolge auszustrahlen.</FONT>
<BR><FONT SIZE=+1>Wir die Zuschauer, k&ouml;nnen uns lediglich fragen,
was h&auml;tte aus dieser ambitionierten Serie werden k&ouml;nnen, h&auml;tte
sie beizeiten ihren Rhythmus und ihr Ziel gefunden. Autor Rochney S. O&acute;Bannon,
verantwortlich f&uuml;r das Grundkonzept der Serie, hatte es jedenfalls
die ganze Zeit kommen sehen: "Die Produzenten wollten die Produktion unbedingt
am Laufen halten, anstatt einen Monat f&uuml;r Feinabstimmung aufzuwenden
und den Autoren Zeit zu geben, andere Drehb&uuml;cher zu entwickeln. Zu
diesem zeitpunkt sprang der Zug aus dem Gleis - und war fortan nicht mehr
zu bremsen."</FONT>

<P>
<HR WIDTH="100%">
<BR><A HREF="seaquestquellen.html"><IMG SRC="left.gif" ALT="Quellen" BORDER=0 HEIGHT=30 WIDTH=30></A><A HREF="#top"><IMG SRC="top.gif" ALT="Seitenanfang" BORDER=0 HEIGHT=30 WIDTH=30></A><A HREF="seaquestmain.html"><IMG SRC="right.gif" ALT="Hauptseite" BORDER=0 HEIGHT=30 WIDTH=30></A>
</BODY>
</HTML>
