<HTML>
<body background="../images/fondtexte2.jpg" text="black" vlink="black" border="0">
<b>1740 :</b> 1er  Championnat du Monde de jeu de paume, le Fran&ccedil;ais Clerg&eacute;  devient le premier champion du Monde, tous sports confondus.<br>
<br>
<b>1804 :</b> Construction du premier bassin &agrave; fond de bois permettant la cr&eacute;ation d'une Ecole Imp&eacute;riale de Natation &agrave; Paris.<br>
<br>
<b>1818 :</B> Ouverture (le 1er f&eacute;vrier) du premier club public de gymnastique (Gymnase de l'Institution Durdan) &agrave; Paris<bR> 
<br>
<b>1823 :</b> Le Journal des Haras emploie pour la premi&egrave;re fois en France le mot anglais <i>Sport</i>. Cet ancien verbe anglais (sporting) vient du vieux fran&ccedil;ais (desport) comme pr&egrave;s de 30% de la langue anglaise.<br> 
<br>
<b>1837 :</b> Premi&egrave;re r&eacute;gate d'aviron en France (Dieppe).<br>
<br>
<b>1830 :</b> Invention de la Boxe Fran&ccedil;aise par Charles Lecour.<br>
<br>
<b>1835 :</b> Premi&egrave;re &eacute;dition (le 24 juin) de la course hippique fran&ccedil;aise du Prix du Jockey Club (&agrave;  Chantilly).<br>
<bR>
<b>1848 :</b> Premi&egrave;re tentative d'unification des diff&eacute;rentes r&egrave;gles du football, premi&egrave;res r&egrave;gles &eacute;crites connues.<br>
<br>
<b>1843 :</b> Premi&egrave;re &eacute;dition de la course hippique fran&ccedil;aise du Prix de Diane (&agrave;  Chantilly).<br>
<bR>
<b>1856 :</b> Premier parcours de golf en France et sur le continent europ&eacute;en (Pau). Ce parcours est avant tout destin&eacute; aux officiers anglais en retraite.<br>
<br>
<b>1857 :</b> Invention de la chistera, gant d'osier, qui fonde de fait la pelote basque (jusque-l&agrave;  simple version locale du jeu de paume).<bR>
<br>
<b>1857 :</B> Inauguration (le 27 avril) de l'hippodrome de Lonchamps &agrave; Paris.<br>
<br>
<b>1859 :</b> Premi&egrave;re course d'aviron mettant aux prises des clubs Fran&ccedil;ais et Anglais.<br>
<br>
<b>1861 :</B> Invention par les fr&egrave;res Michaux de la p&eacute;dale. Les carrossiers bas&eacute;s &agrave; Paris adaptent leurs p&eacute;dales sur la roue avant d'une draisienne. Le v&eacute;lo est n&eacute; et contrairement &agrave; la draisienne, son succ&egrave;s est ph&eacute;nom&eacute;nal.<br>
<br>
<b>1866 :</b> Premier concours de saut d'obstacles &agrave; Paris.<br>
<br> 
<b>1870 :</b> Innovation dans l'athl&eacute;tisme, les d&eacute;parts jusqu'alors effectu&eacute;s debout font place au d&eacute;parts accroupis...<br>
<br>
<b>1870 :</b> Premi&egrave;re &eacute;dition du championnat du monde professionnel de billard..<br>
<br>
<b>1871 :</b> Cr&eacute;ation du poste sp&eacute;cifique de gardien de but (il peut faire usage de ses mains sur l'ensemble du terrain).<br>
<br> 
<b>1872 :</b> premier match international officiel de football de l'histoire. Cette rencontre eu lieu le 30 novembre &agrave; Glasgow (3 000 spectateurs) et opposait l'&eacute;cosse et l'Angleterre qui se s&eacute;par&egrave;rent sur un match nul (0-0).<br>
<br>
<b>1873 :</b> Premi&egrave;re voiture (&agrave;  vapeur) commercialis&eacute;e, la Boll&eacute;e &eacute;tait fabriqu&eacute;e au Mans.<br>
<br>
<b>1874 :</B> le 10 f&eacute;vrier, la FA donne autorit&eacute; aux arbitres pour exclure un joueur inconvenant. Jusque-l&agrave; , l'expulsion &eacute;tait d&eacute;cid&eacute;e par les deux capitaines.<br>
<br>
<b>1874 :</b> en football, le changement de c&ocirc;t&eacute; apr&egrave;s chaque but est abandonn&eacute; au profit d'un seul changement de c&ocirc;t&eacute; par match, &agrave; la mi-temps.<br>
<br>
<b>1875 :</b> Invention du gant de baseball par Charles Waitt.<br>
<br> 
<b>1875 :</b> Le 24 ao&ucirc;t, le capitaine Matthew Webb r&eacute;ussit l'exploit de r&eacute;aliser la premi&egrave;re travers&eacute;e de la Manche &agrave; la nage (en 21 heures et 45 minutes).<br>
<br>
<b>1875 :</b> Le 17 avril, &agrave; Calcutta (Inde), l'Anglais Sir Neville Chamberlain invente le snooker (variante du billard) .<bR>
<br>
<b>1877 :</B> Fondation (par des Britanniques r&eacute;sidants &agrave; Paris) du premier club fran&ccedil;ais de rugby (The English Taylors).<br>
<br>
</body>
</HTML>
