<html>
<head>
<title>Concepts de base</title>
</head>
<body>
<h2>Concepts de base</h2>

<a name="4-1"><h4>Qu'est-ce une unit&eacute; (device) ?</h4>
<p>
Une unit&eacute; peut &ecirc;tre une unit&eacute; physique comme un disque dur ou une imprimante,
ou une unit&eacute; logique - qui existe uniquement par le logiciel - comme le
&quot;Ram Disk&quot; L'Amiga ne fait aucune distinction entre une unit&eacute; physique ou
logique, il ne fait pas de distinction entre les unit&eacute;s disques et les autres
unit&eacute;s, la seule particularit&eacute; est que les unit&eacute;s disques ont un syst&egrave;me de
fichiers install&eacute; dessus.
<br><br>
Les unit&eacute;s sont appel&eacute;es par un nom suivi d'un &quot;:&quot;, comme par exemple:<br>
<tt>df0: </tt>le premier lecteur de disquettes<br>
<tt>df1: </tt>le deuxi&egrave;me lecteur de disquettes<br>
<tt>hd0: </tt>le premier disque dur du syst&egrave;me - parfois aussi dh0: -<br>
<tt>par: </tt>le port parall&egrave;le<br>
<tt>ram: </tt>le &quot;Ram Disk&quot;, un pseudo-lecteur de disquettes qui utilise la m&eacute;moire RAM<br>
<tt>con: </tt>une fen&ecirc;tre console comme par exemple le shell<br>
<tt>sys: </tt>un lecteur logique qui indique le disque à partir duquel vous avez d&eacute;marr&eacute;<br>
</p>

<a name="4-2"><h4>Qu'est-ce un volume (volume) ?</h4>
<p>
Un volume est un disque ou une partie d'un disque que le syst&egrave;me consid&egrave;re
comme un disque. La diff&eacute;rence entre le volume et l'unit&eacute; est que l'unit&eacute; fait
r&eacute;f&eacute;rence au lecteur, et le volume fait r&eacute;f&eacute;rence au disque qui se trouve à
l'int&eacute;rieur. Pour les disques dur il n'y a pas de diff&eacute;rence, vu que le disque
ne peut pas &ecirc;tre retir&eacute; de son lecteur, pour les disquettes par contre, un
volume peut se trouver dans n'importe quel lecteur de disquettes. Les noms de
volumes, tout comme les noms d'unit&eacute;s finissent par un &quot;:&quot;.
<br><br>
un volume se reconnait pas son nom, vous pouvez lui donner le nom que vous
voulez, pour &eacute;viter des complications - avec le shell -, &eacute;vitez de mettre des
espaces dans le nom. Si vous r&eacute;f&eacute;rencez un disque par son nom, l'Amiga va voir
dans toutes les unit&eacute;s si il s'y trouve.
<br><br>
Par exemple si j'ai une disquette nomm&eacute;e Truc: dans le premier lecteur de
disquettes, je peut y acc&eacute;der en utilisant le nom de volume Truc: ou le nom
d'unit&eacute; df0:. Cependant si j'utilise le nom de volume, l'amiga va la retrouver,
m&ecirc;me si je l'ai plac&eacute;e dans un autre lecteur de disquettes entre temps. Si par
contre j'utilise le nom d'unit&eacute;, il va utiliser la disquette qui se trouve en
ce moment dans le lecteur.
<br><br>
Si je demande la disquette Truc: et qu'il ne se trouve pas dans un lecteur,
l'Amiga va me demander de la mettre dans un des lecteurs, et attendre jusqu'à
ce que je l'aie mise, de cette mani&egrave;re je suis sûr d'utiliser la bonne
disquette.
</p>

<a name="4-3"><h4>Qu'est-ce une partition (partition) ?</h4>
<p>
une partition est une partie d'un disque, qui est consid&eacute;r&eacute;e par l'Amiga comme
un disque s&eacute;par&eacute;. Si j'ai un gros disque dur, je peut le s&eacute;parer en plusieurs
partitions, et, m&ecirc;me si elles se trouvent physiquement sur le m&ecirc;me disque,
l'Amiga va les traiter comme si elles &eacute;taient s&eacute;par&eacute;es, cela pourrais &ecirc;tre
hd0:, hd1:, elles seront &eacute;galement consid&eacute;r&eacute;es comme des volumes diff&eacute;rents.
</p>

<a name="4-4"><h4>Qu'est-ce une assignation (assign) ?</h4>
<p>
une assignation est un objet cr&eacute;e par l'utilisateur (ou par le logiciel), qui
est trait&eacute; par l'Amiga comme un volume, et comme les unit&eacute;s et les volumes,
les noms d'assignations se terminent par un &quot;:&quot;.
<br><br>
Si par exemple j'ai un r&eacute;pertoire appel&eacute; &quot;Work:textes/documents/lettres&quot; je
peut lui donner un nom d'assignation qui lui est propre, par exemple
&quot;lettres:&quot;, ainsi, à la place d'utiliser le nom complet, j'utilise simplement
&quot;lettres:&quot; pour acc&eacute;der au r&eacute;pertoire
<br><br>
l'Amiga cr&eacute;e quelques assignations au d&eacute;marrage, comme par exemple:
<br><table width=100%>
<tr><td>C:</td><td>SYS:C</td><td>ou se trouvent les commandes shell</td></tr>
<tr><td>LIBS:</td><td>SYS:LIBS</td><td>ou se trouvent les biblioth&egrave;ques d'extensions. (.library)</td></tr>
<tr><td>S:</td><td>SYS:S</td><td>ou se trouvent les fichiers scripts shell</td></tr>
</table><br>
Ainsi que beaucoup d'autres. Beaucoup de programmes utilisent leur propres
assignations, de mani&egrave;re à trouver facilement leur fichiers.
<br><br>
Vous pouvez cr&eacute;er votre propre assignation en tappant la commande suivante:
<br><br>
<tt>Assign &lt;nom:&gt;  &lt;r&eacute;pertoire destination&gt;</tt>
</p>

<a name="4-5"><h4>Que sont tous ces fichiers qui finissent par &quot;.info&quot; ?</h4>
<p>
Les fichiers .info sont les fichiers des ic&ocirc;nes que vous voyez en ouvrant un
tiroir, chaque fichier qui a un ic&ocirc;ne sur le Workbench a un fichier .info qui
lui correspond, avec le m&ecirc;me nom que l'ic&ocirc;ne, suivi de  &quot;.info&quot;, le fichier
.info contient l'image de l'ic&ocirc;ne, sa position, ainsi que d'autres informations
suivant le type de l'ic&ocirc;ne.
<br><br>
Il y a cinq types d'ic&ocirc;nes diff&eacute;rents: disque, tiroir, outil, projet et
poubelle. la poubelle est un type sp&eacute;cial utilis&eacute; par l'ic&ocirc;ne &quot;Traschan&quot;.
<br><br>
les ic&ocirc;nes de type disque sont utilis&eacute;s pour les volumes, si vous
double-cliquez sur un de ces ic&ocirc;nes, une fen&ecirc;tre s'ouvre et affiche les ic&ocirc;nes
pr&eacute;sents dans le r&eacute;pertoire racine du volume.
<br><br>
les ic&ocirc;nes de type tiroir repr&eacute;sentent les r&eacute;pertoires d'un disque, si vous
double-cliquez dessus, une fen&ecirc;tre s'ouvre et affiche les ic&ocirc;nes pr&eacute;sents dans
ce r&eacute;pertoire.
<br><br>
les ic&ocirc;nes de type outil repr&eacute;sentent les programmes ex&eacute;cutables, si vous
double-cliquez dessus le programme associ&eacute; d&eacute;marre. Ces ic&ocirc;nes peuvent contenir
des informations vari&eacute;es qui sont pass&eacute;es au programme, appel&eacute;es
&quot;types d'outils&quot;, pour plus d'informations concernant les types d'outils lisez
la section &quot;Workbench&quot;.
<br><br>
les ic&ocirc;nes de type projet sont utilis&eacute;s par des fichiers de donn&eacute;es enregistr&eacute;es
par les programmes, par exemple si vous cr&eacute;ez un document à partir d'un
traitement de textes, et que vous l'enregistrez sur le disque dur, il pourra
avoir un ic&ocirc;ne projet associ&eacute;. L'ic&ocirc;ne projet contiendra le nom du programme
utilis&eacute; pour le cr&eacute;er, comme &quot;outil par d&eacute;faut&quot; Si il le contient, le fait de
double-cliquer sur l'ic&ocirc;ne va d&eacute;marrer ce programme, qui va alors automatiquement
charger le fichier associ&eacute;.
<br><br>
Par exemple si votre document a &eacute;t&eacute; cr&eacute;&eacute; par un traitement de textes, le fait de
double-cliquer sur l'ic&ocirc;ne de votre document va d&eacute;marrer le traitement de
textes, et celui-ci va charger votre document.
Pour plus d'informations sur les outils par d&eacute;faut, lisez la section &quot;Workbench&quot;.
</p>

<a name="4-6"><h4>Que sont tous ces fichiers qui finissent par &quot;.library&quot; ?</h4>
<p>
Les fichiers avec l'extension .library sont des fichiers de librairies
d'extensions, ils doivent se trouver dans le r&eacute;pertoire libs: ces fichiers
contiennent des fonctions qui sont utilisables par plusieurs programmes en
m&ecirc;me temps, ils sont charg&eacute;s en m&eacute;moire si n&eacute;cessaire.
<br><br>
L'avantage des librairies est que les programmeurs n'ont pas besoin de
re-inventer la roue en &eacute;crivant des programmes, beaucoup de fonction
standard se trouvent dans les biblioth&egrave;ques, la seule chose qu'il doivent
faire est de les utiliser.
<br><br>
Le syst&egrave;me est &eacute;quip&eacute; de diverses librairies permettant au programmeur
d'utiliser les fonction du syst&egrave;me dans ces programmes, voici quelques
unes des libraires que vous trouverez dans libs:
<br>
<table width=100%>
<tr><td>amigaguide.library</td><td>utilis&eacute; par le syst&egrave;me d'aide AmigaGuide</td></tr>
<tr><td>locale.library</td><td>fonctions pour cr&eacute;er des programmes multilingues</td></tr>
<tr><td>asl.library</td><td>requ&ecirc;tes syst&egrave;mes standard (fichiers, polices, etc.)</td></tr>
<tr><td>datatypes.library</td><td>utilis&eacute; par le syst&egrave;me des datatypes</td></tr>
<tr><td>mathieeedoubbas.library</td><td>fonction math&eacute;matiques</td></tr>
</table><br>
Ainsi que d'autres encore, il y a &eacute;galement des libraires venant de programmes
externes. L'utilisateur n'a pas à ce pr&eacute;occuper du contenu de ces librairies,
la seule chose qu'il doit s'assurer est qu'elles soient install&eacute;es. Les logiciels
qui utilisent des librairies externes viennent &eacute;quip&eacute;s de ces librairies,
ou donnent des indications sur où et comment les trouver.
</p>
</body>
</html>
