<html>
<head>
<title>Configuration</title>
</head>
<body>
<h2>Configuration</h2>

<a name="7-1"><h4>Comment est-ce que je peut arr&ecirc;ter les clics du lecteur de disquette ?</h4>
<p>
Il y a plusieurs solutions pour supprimer ces ennuyeux clics, voici une liste
de ce que j'ai trouv&eacute; sur Aminet:
<br><br><pre>
Shutup-1.2.lha       disk/misc    9K NoClick plus drive renaming
DOSPrefs30.lha       util/boot   30K+.,.. dirs, noclick, enable * wildcard
NoClick_1.6.lha      util/boot   28K+NoClick utility. V1.6
NoClick10.lha        util/cdity  10K+Disables drive clicking (incl. source)
wildclick.lha        util/cli     2K+The smallest wildstar and noclick progra
SetNoClick.lha       util/misc    6K+Enable built-in noclick feature in track
</pre></p>

<a name="7-2"><h4>Comment &eacute;viter que les mauvais scripts d'installation ne remplacent le contenu de LIBS: par des versions plus anciennes ?</h4>
<p>
Cette technique viens de Mathew Hendry, il ne se souvient plus où il l'a trouv&eacute;
<br><br>
cr&eacute;ez un r&eacute;pertoire nomm&eacute; NewLibs, comme ceci:
<br><br>
<tt>makedir sys:NewLibs</tt>
<br><br>
Utilisez un &eacute;diteur comme par exemple C:ed pour modifier le fichier
s:startup-sequence, et recherchez la ligne suivante:
<br><br>
<tt>Assign &gt;NIL: LIBS: SYS:Classes ADD</tt>
<br><br>
remplacez la par cette ligne:
<br><br>
<tt>Assign &gt;NIL: SYS:NewLibs SYS:Libs SYS:Classes</tt>
<br><br>
enregistrez le texte et red&eacute;marrez l'ordinateur, apr&egrave;s ceci, n'importe quel
programme qui installe des libraires dans LIBS:, va les mettre dans le
r&eacute;pertoire NewLibs, au lieu du r&eacute;pertoire libs, de cette mani&egrave;re les fichiers
libairies pr&eacute;sents ne vont pas &ecirc;tre remplac&eacute;s. la version nouvellement
install&eacute;e va &ecirc;tre trouv&eacute;e d'abord. Une fois que vous avez d&eacute;termin&eacute; quelle
est la nouvelle version vous pouvez d&eacute;placer la librairie dans le r&eacute;pertoire
libs en utilisant le Workbench, ou les commandes suivantes:
<br><br>
<tt>copy SYS:NewLibs/&lt;librairie&gt; SYS:Libs<br>
delete SYS:NewLibs/&lt;librairie&gt;</tt><br>
</p>

<a name="7-3"><h4>Comment conna&icirc;tre la version d'une librairie ?</h4>
<p>
utilisez la commande suivante:
<br><br>
<tt>version &lt;librairie&gt;</tt>
<br><br>
ceci vous donnera le num&eacute;ro de version de la librairie, si vous en avez
plusieurs avec le m&ecirc;me nom, comme par exemple pour la question pr&eacute;c&eacute;dente,vous
obtiendrez le num&eacute;ro de version de la librairie trouv&eacute;e en premier.
<br><br>
dans ce cas pour obtenir le num&eacute;ro de version d'un fichier particulier,
utilisez le nom de fichier avec le chemin complet:
<br><br>
<tt>version SYS:Libs/&lt;librairie&gt;</tt>
<br><br>
ceci vous donnera le num&eacute;ro de version de la librairie qui se trouve dans le
r&eacute;pertoire principal sys:libs.
</p>
</body>
</html>
