<html>
<head>
<title>L'Internet</title>
</head>
<body>
<h2>L'Internet</h2>

<a name="10-1"><h4>Quel types de modem fonctionnent avec l'Amiga ?</h4>
<p>
N'importe quel type de modem standard fonctionne. La seule chose à savoir est
que la plupart des PC ont un port s&eacute;rie à 9 broches tandis que l'Amiga a un port
à 25 broches. Donc vous aurez besoin d'un c&acirc;ble avec une prise 25 broches. Vu
que la plupart des modems modernes ont une prise 25 broches, il vous faudra un
c&acirc;ble 25-à-25 broches
</p>

<a name="10-2"><h4>A quelle vitesse peut fonctionner le port s&eacute;rie ?</h4>
<p>
Le port s&eacute;riel de l'Amiga est depass&eacute;, il est pas aussi rapide que le port d'un
PC, plus grand probl&egrave;me est sa m&eacute;moire tampon de 1 octet.
<br><br>
Quoique vous devez arriver à faire fonctionner le port à 38400 bits par seconde
sans probl&egrave;mes (si vous avez un processeur 68000 c'est peut-&ecirc;tre trop rapide)
si vous avez par de carte graphique essayez de diminuer le nombre de couleurs,
vu que le processeur peut &ecirc;tre ralenti par l'affichage.
</p>

<a name="10-3"><h4>Mais Serial Preferences ne me permet pas une vitesse pareille !</h4>
<p>
Oubliez Serial Preferences. Je ne l'ai jamais utilis&eacute;. Changez la vitesse du
port s&eacute;rie en utilisant votre programme de communications, il va utiliser ses
propres r&eacute;glages à la place de ceux de Serial Preferences.
</p>

<a name="10-4"><h4>Qu'est LHA ? que faire avec tout ces fichiers &quot;.lha&quot; ?</h4>
<p>
LHA est un programme d'archivage et de compactage. Il prend un ensemble de
fichiers, les compresse, et les stoque dans un seul fichier. les archives LHA
ont l'extension .lha
<br><br>
Pour les d&eacute;compresser vous aurez besoin du programme LHA, il est disponible sur
Aminet, il est disponible dans util/arc/lha_e138.run. C'est une archive
auto-extractible, executez le programme et il va se d&eacute;compresser lui-m&ecirc;me.
ensuite copiez le programme LHA dans C:
<br><br>
pour d&eacute;compacter une archive lha utilisez la commande shell suivante:
<br><br>
<tt>lha x &lt;archive&gt;</tt>
</p>

<a name="10-5"><h4>Qu'est Aminet ?</h4>
<p>
Aminet est le point central ou trouver des programmes de domaine public, et
demos. Pratiquement n'importe quel programme non-commercial peut &ecirc;tre trouv&eacute;
sur Aminet, ainsi que des versions de d&eacute;monstration de programmes commerciaux.
<br><br>
le serveur principal est ftp.wustl.edu, ensuite les archives sont copi&eacute;es sur
d'autres serveur à travers le monde. De cette mani&egrave;re vous pouvez utiliser
celui qui se trouve le plus pr&egrave;s de vous. Tous les serveurs sont organis&eacute; de la
m&ecirc;me mani&egrave;re, ainsi n'importe quel fichier sur Aminet peut &ecirc;tre r&eacute;f&eacute;renc&eacute; par
le r&eacute;pertoire où il se trouve.
<br><br>
Les archives Aminet existent aussi sur CD-ROM et sont disponibles chez presque
tout les revendeurs Amiga.
</p>

<a name="10-6"><H4>Où ce trouvent les sites miroirs Aminet ?</h4>
<p>
Voici la liste des principaux sites:
<table width=100%>
<tr><td nowrap>Pays</td><td nowrap>serveur</td><td nowrap>acc&egrave;s WWW ?</td></tr>
<tr><td nowrap>USA (MO)</td><td nowrap>ftp.wustl.edu</td><td nowrap>oui</td></tr>
<tr><td nowrap>USA (WI)</td><td nowrap>ftp.netnet.net</td><td nowrap>oui</td></tr>
<tr><td nowrap>UK</td><td nowrap>src.doc.ic.ac.uk</td><td nowrap>non</td></tr>
<tr><td nowrap>Germany</td><td nowrap>ftp.germany.aminet.org</td><td nowrap>oui</td></tr>
<tr><td nowrap>Italy</td><td nowrap>ftp.unina.it</td><td nowrap>oui</td></tr>
<tr><td nowrap>Austria</td><td nowrap>vienna.aminet.or.at</td><td nowrap>oui</td></tr>
</table></p>

<a name="10-7"><h4>Comment est organis&eacute; Aminet ?</h4>
<p>
Les r&eacute;pertoires de Aminet:
<br><table width=100%>
<tr><td><tt>biz/</tt></td><td>programmes commerciaux</td></tr>
<tr><td><tt>comm/</tt></td><td>programmes de communication</td></tr>
<tr><td><tt>demo/</tt></td><td>demos graphiques et sonores</td></tr>
<tr><td><tt>dev/</tt></td><td>programmes pour d&eacute;veloppeurs</td></tr>
<tr><td><tt>disk/</tt></td><td>outils pour disques/disquettes</td></tr>
<tr><td><tt>docs/</tt></td><td>documents texte</td></tr>
<tr><td><tt>game/</tt></td><td>jeux</td></tr>
<tr><td><tt>gfx/</tt></td><td>programmes pour le graphisme</td></tr>
<tr><td><tt>hard/</tt></td><td>relatif au mat&eacute;riel</td></tr>
<tr><td><tt>misc/</tt></td><td>divers</td></tr>
<tr><td><tt>mods/</tt></td><td>modules de musique</td></tr>
<tr><td><tt>mus/</tt></td><td>programmes de musique</td></tr>
<tr><td><tt>pix/</tt></td><td>images, ic&ocirc;nes</td></tr>
<tr><td><tt>text/</tt></td><td>programmes pour les textes</td></tr>
<tr><td><tt>util/</tt></td><td>utilitaires</td></tr>
</table></p>

<a name="10-8"><h4>Est-ce que je peut utiliser Netscape Navigator sur mon Amiga ?</h4>
<p>
ce programme n'existe pas en version Amiga, cependant vous pouvez faire
fonctionner la version Macintosh, en utilisant un &eacute;mulateur Macintosh comme par
exemple Shapeshifter. lisez le chapitre suivant pour plus d'indications au
à propos de Shapeshifter.
</p>
</body>
</html>
