<html>
<head>
<title>Logiciels suppl&eacute;mentaires</title>
</head>
<body>
<h2>Logiciels suppl&eacute;mentaires</h2>

<a name="9-1"><h4>Qu'est MUI ?</h4>
<p>
MUI est l'acronyme de Magic User Interface (interface utilisateur magique).  MUI
est un syst&egrave;me pour cr&eacute;er et maintenir des interfaces graphiques utilisateur. Il
permet au programmeur de cr&eacute;er des interfaces graphiques puissantes tr&egrave;s
rapidement, et sans difficult&eacute;. Il permet à l'utilisateur de personaliser chaque
interface selon ces pr&eacute;f&eacute;rences.
<br>
Les programmes qui utilisent MUI demandent que la partie &quot;user&quot; de MUI soit
install&eacute;e sur l'ordinateur, l'archive est &eacute;quip&eacute;e d'un script installer,
et peut &ecirc;tre trouv&eacute;e sur Aminet, dans dev/gui/mui36usr.lha
<br>
MUI est un contribuciel (shareware), la version enregistr&eacute;e vous permet de
configurer n'importe que programme MUI exactement comme vous le voulez, la
version non-enregistr&eacute;e a quelques limitations, mais est enti&egrave;rement utilisable
Vous pouvez utiliser la version non-enregistr&eacute;e tant que vous voulez, vous
devez payer pour avoir droit aux options suppl&eacute;mentaires.
</p>

<a name="9-2"><h4>Pourquoi tout le monde parle de MUI ?</h4>
<p>
R&eacute;ponse courte: parce qu'ils ont rien d'autre à faire
<br><br>
MUI a des bons et des mauvais points, et les gens des deux camps aiment bien en
parler: les pro-MUI aimeraient que tout le monde utilise MUI, et les anti-MUI
aimeraient ne jamais l'avoir connu. Aucun camp ne va gagner, et les arguments
n'ont jamais &eacute;t&eacute; constructifs et ne le seront jamais.
<br><br>
Voila quelques arguments de chaque camp, comme ça vous pourrez ignorer les
guerres d'injures qui s&eacute;vissent sur les newsgroups:
<br><br>
Pro-MUI:<br>
- MUI est beau<br>
- MUI standardise l'interface d'un programme à l'autre<br>
- MUI offre des possibilit&eacute;s inconnues dans les interfaces GadTools est BOOPSI.<br>
- Le code MUI est commun entre les programmes MUI qui fonctionnent en m&ecirc;me
  temps, ce qui fait gagner de la m&eacute;moire<br>
- MUI permet un developpement facile et rapide des interfaces graphiques, et
  permet au programmeur de ce concentrer sur les parties importantes du
  programme.<br>
<br><br>
Anti-MUI:<br>
- MUI gaspille de l'espace disque<br>
- MUI est lourd et utilise beaucoup trop de m&eacute;moire<br>
- MUI est tres lent, surtout sur une machine non acc&eacute;l&eacute;r&eacute;e<br>
- MUI ne donne pas toujours une r&eacute;ponse immediate<br>
- Pour utiliser des programmes MUI vous devez installer le logiciel &quot;user&quot;<br>
<br>
Voila, comme ca vous savez et vous aurez plus besoin de participer au guerres
d'injures au sujet de MUI.
</p>
<a name="9-3"><h4>Qu'est Directory Opus ?</h4>
<p>
Directory Opus est un programme qui sert à la manipulation des fichiers, ainsi
que beaucoup d'autres choses. Il peut &ecirc;tre utilis&eacute; pour des simples copies ou
d&eacute;placements de fichiers, pour d&eacute;marrer des programmes, etc. La version 5.0 peut
&ecirc;tre install&eacute;e en remplacement du Workbench.
<br><br>
Opus est tr&egrave;s configurable, si vous avez du temps à passer pour le configurer,
vous pourrez arriver à le faire faire exactement ce que vous voulez. Vous pouvez
cr&eacute;er des barres de boutons, attacher des actions à ces boutons, incluant des
actions internes, des programmes externes, des scripts ARexx, etc.
<br><br>
C'est un programme commercial de Johnathon Potter, il coute environ 80$, tout
le monde devrait le poss&eacute;der.
</p>

<a name="9-4"><h4>Qu'est Executive ?</h4>
<p>
Executive est un gestionnaire de t&acirc;ches, il dirige le multit&acirc;che de l'Amiga
d'une mani&egrave;re bien meilleure que ce que fait le syst&egrave;me, en donnant plus de
temps d'ex&eacute;cution aux programmes interactifs et moins aux programmes qui
s'ex&eacute;cutent en arri&egrave;re plan, de cette mani&egrave;re si vous ex&eacute;cutez beaucoup de
programmes en arri&egrave;re plan vous pouvez continuer à utiliser l'ordinateur sans
que la vitesse ne soit p&eacute;nalis&eacute;e.
<br><br>
Executive n'est pas un bricolage, sa programmation est conforme au syst&egrave;me.
c'est un contribuciel (shareware), vous pouvez trouver une version d&eacute;mo sur
Aminet dans util/misc/Executive.lha
</p>

<a name="9-5"><h4>Qu'est ixemul.library ?</h4>
<p>
ixemul.library est une librairie qui simule une partie des fonction du syst&egrave;me
Unix, de cette mani&egrave;re beaucoup de programmes Unix peuvent &ecirc;tre facilement
adapt&eacute;s sur l'Amiga. les programmes adapt&eacute;s à partir de cette librairie
n&eacute;cessitent que la librairie soit install&eacute;e dans le r&eacute;pertoire LIBS: pour
fonctionner.
<br><br>
ixemul est souvent accompagn&eacute;e d'autres librairies comme ixnet.library qui
s'occupe du r&eacute;seau, avec AmiTCP, Inet225, Miami, etc.
</p>
<a name="9-6"><h4>Qu'est ADE ?</h4>
<p>
ADE est l'acronyme de Amiga Developper Environment (environnement de
d&eacute;veloppement pour Amiga), Il s'agit d'une collection de programmes, une bonne
partie sont des adaptations des outils GNU de Unix. Bien que ADE soit surtout
pr&eacute;vu pour les programmeurs, il contient beaucoup de programmes utiles,
sp&eacute;cialement avec le shell. Si vous connaissez Unix, vous retrouverez beaucoup
de programmes familiers dans ADE
<br><br>
le serveur ftp principal de ADE est: ftp.ninemoons.com, le r&eacute;pertoire pub/ade
</p>

<a name="9-7"><h4>Qu'est CyberGraphX (CyberGfx) ?</h4>
<tt>(en pr&eacute;paration)</tt>
</body>
</html>

