<html>
<head>
<title>Mat&eacute;riel suppl&eacute;mentaire</title>
</head>
</body>
<h2>Mat&eacute;riel suppl&eacute;mentaire</h2>

<a name="8-1"><h4>Est-ce que je peut utiliser un lecteur Iomega Zip sur mon Amiga ?</h4>
<p>
Oui, vous pouvez utiliser la version SCSI du lecteur Zip, si vous avez un
contr&ocirc;leur SCSI, et il fonctionnera exactement comme une autre unit&eacute; SCSI. Vous
pouvez obtenir un paquet de logiciel appel&eacute; Zip Tools de HiSoft, qui vous
simplifiera la configuration, mais il n'est pas obligatoire. Il vous suffit de
partitionner et formater le Zip avec HDToolbox ou un autre programme et il
fonctionnera.
<br><br>
Vous NE POUVEZ PAS utiliser la version paral&egrave;lle du lecteur Zip sur Amiga. Ce
n'est pas a cause du manque de logiciel pilote, le port paral&egrave;lle de l'Amiga
est physiquement different de celui du PC et il n'est pas possible d'utiliser
le Zip paral&egrave;lle.
</p>

<a name="8-2"><h4>Quelle est la mani&egrave;re la moins ch&egrave;re d'acc&eacute;l&eacute;rer un Amiga non &eacute;tendu ?</h4>
<p>
Si vous n'avez pas de fast RAM, ce qui est le cas pour un Amiga 500, 600, 1200
ou 2000 non &eacute;tendu, en ajouter est la m&eacute;thode la plus simple pour am&eacute;liorer
votre machine. Ajouter 4 MB de fast RAM sur un A1200 qui a 2MB de chip RAM va
doubler sa vitesse.
</p>

<a name="8-3"><h4>Quels types de disques durs fonctionnent avec le contr&ocirc;leur interne du A1200 ?</h4>
<p>
Le A1200 a un contr&ocirc;leur IDE interne, avec un connecter 44 p&ocirc;les, pr&eacute;vu
pour un disque IDE de 2.5 pouces.
</p>

<a name="8-4"><h4>Ma carte acc&eacute;l&eacute;ratrice utilise des m&eacute;moires SIMM 72 broches, quel type ? parit&eacute; ? EDO ?</h4>
<p>
Si vous avez une carte qui supporte les m&eacute;moires au standard SIMM 72 broches,
vous pouvez monter n'importe quel type de m&eacute;moire standard. Contr&ocirc;lez dans
la documentation la vitesse minimum requise, dans la plupart des cas 70 ns.
<br><br>
la parit&eacute; ne fais pas de diff&eacute;rence, l'Amiga ne l'utilise pas, vous pouvez
utiliser de la m&eacute;moire avec ou sans parit&eacute;.
<br><br>
EDO ne fais pas de diff&eacute;rence, l'Amiga ne l'utilise pas, vous pouvez monter
de la m&eacute;moire EDO ou standard, vous ne verrez aucun gain avec la EDO.
</p>
</body>
</html>
