<html>
<head>
<title>Le mat&eacute;riel</title>
</head>
<body>
<h2>Le mat&eacute;riel</h2>

<a name="2-1"><h4>Quels sont les diff&eacute;rents mod&egrave;les Amiga ?</h4>
<p>
A1000 - le premier Amiga, il est maintenant d&eacute;pass&eacute;
<br><br>
A500 - un mod&egrave;le monopi&egrave;ce (clavier attach&eacute;), avec pav&eacute; num&eacute;rique et
prise d'extension du cot&eacute; gauche, ainsi qu'une trappe d'extension
en dessous pour les extensions m&eacute;moire, ils est &eacute;tonnamment extensible.
<br><br>
A500+ - une version etendue du A500, avec 1 m&eacute;gaoctet de m&eacute;moire, extensible
à 2 m&eacute;gaoctets, et les puces (chipset) ECS
<br><br>
A600 - un autre mod&egrave;le monopi&egrave;ce, sans pav&eacute; num&eacute;rique, mais avec prise PCMCIA
(format cartes de cr&eacute;dit), le probl&egrave;me de ce mod&egrave;le est que les puces sont
mont&eacute;es en surface, il est donc difficile de faire des r&eacute;parations ou des
am&eacute;liorations.
<br><br>
A1200 - le mod&egrave;le bas de gamme actuel, monopi&egrave;ce, avec pav&eacute; num&eacute;rique, plus
petit que le A500, il a une trappe pour les extensions m&eacute;moire et processeur
et une prise pour les cartes PCMCIA, il est &eacute;quip&eacute; des puces (chipset) AGA.
<br><br>
A2000 - un mod&egrave;le à &quot;grand bo&icirc;tier&quot;, avec clavier s&eacute;par&eacute;, &eacute;quip&eacute; du bus
d'extensions Zorro II et ISA, ainsi que de prises pour extensions vid&eacute;o
et processeur.
<br><br>
A1500 - une version europ&eacute;enne du A2000, j'en ai jamais vus.
<br><br>
A2500 - une version du A2000, je crois qu'elle est am&eacute;ricaine uniquement,
c'est à la base un A2000 modifi&eacute;
<br><br>
A3000 - un autre mod&egrave;le à grand bo&icirc;tier, plus petit que le A2000, &eacute;quip&eacute;
du bus d'extensions Zorro III et ISA, ainsi que de prises pour extensions
vid&eacute;o et processeur il est aussi &eacute;quip&eacute; d'un contr&ocirc;leur SCSI et d'un
connecteur pour &eacute;cran VGA. (15 p&ocirc;les)
<br><br>
A3000T - une version du A3000 en bo&icirc;tier tour, peu r&eacute;pandu.
<br><br>
A4000 - un mod&egrave;le à grand bo&icirc;tier, avec bus d'extensions Zorro III, ISA
et vid&eacute;o, le processeur est mont&eacute; sur une carte s&eacute;par&eacute;e, qui peut facilement
&ecirc;tre remplac&eacute;e par un mod&egrave;le plus rapide.
<br><br>
A4000T - une version du A4000 en bo&icirc;tier tour, le mod&egrave;le de haut de gamme
actuel.
</p>

<a name="2-2"><h4>Quelle est la diff&eacute;rence entre m&eacute;moire Chip et m&eacute;moire Fast ?</h4>
<p>
La m&eacute;moire Chip peut &ecirc;tre utilis&eacute;e directement par les puces Amiga (Chipset)
sans passer par le processeur, c'est dans cette m&eacute;moire que sont plac&eacute;s les
sons et les images lors de leur utilisation par les puces graphiques et
sonores. Vous pensez peut-&ecirc;tre que c'est comme la m&eacute;moire d'affichage des PC,
ce n'est pas tout à fait vrai, car elle peut aussi &ecirc;tre utilis&eacute;e pour les
programmes et les donn&eacute;es, de la m&ecirc;me mani&egrave;re que les autres types de m&eacute;moire.
<br><br>
La m&eacute;moire Chip est limit&eacute;e a 2 Mo, il est difficile d'en ajouter, la quantit&eacute;
maximale de m&eacute;moire Chip d&eacute;pend de la puce &quot;Agnus&quot;, si vous avez la &quot;Fatter
Agnus&quot; vous pouvez avoir au maximum 1 Mo, la &quot;Obese Agnus&quot; est limit&eacute;e a 2 Mo,
vous ne pouvez pas simplement remplacer une puce contre l'autre, vous devez
installer une carte comme par exemple la DKB MegaChip. Les Amiga AGA
(A1200 et A4000) sont &eacute;quip&eacute;s de la puce 2 Mo et de 2 Mo de m&eacute;moire Chip
en standard.
<br><br>
La m&eacute;moire Chip est plus lente que la m&eacute;moire Fast (Fast=rapide), les Amiga
&eacute;quip&eacute;s de m&eacute;moire Chip uniquement fonctionnent donc plus lentement que les
mod&egrave;les &eacute;tendus, si de la m&eacute;moire Fast est install&eacute;e, les programmes vont
l'utiliser en premier, et vont utiliser la m&eacute;moire Chip si il n'y a plus de
m&eacute;moire Fast disponible.
<br><br>
La m&eacute;moire Fast est accessible uniquement par le processeur, elle ne peut donc
pas &ecirc;tre utilis&eacute;e pour les sons et les images, comme le nom l'indique
(Fast=rapide) la m&eacute;moire Fast est plus rapide que la m&eacute;moire Chip, elle est
donc pr&eacute;f&eacute;r&eacute;e pour le stockage des programmes et des donn&eacute;es.
</p>

<a name="2-3"><h4>Quelle quantit&eacute; de m&eacute;moire ce trouve dans mon Amiga ?</h4>
<p>
Ouvrez un shell et tappez la commande &quot;Avail&quot;, elle vous indiquera la quantit&eacute;
de m&eacute;moire libre, la quantit&eacute; utilis&eacute;e, et la quantit&eacute; totale install&eacute;e dans
votre ordinateur, ainsi que la taille du plus grand bloc libre, pour la m&eacute;moire
Chip, Fast et le total.
<br><br><pre>

Type  Available    In-Use   Maximum   Largest
chip     245664    274528    520192    232568
fast   13568136   3209080  16777216  12295880
total  13813800   3483608  17297408  12295880

</pre>
Les chiffres indiqu&eacute;s sont en octets, dans la colonne maximum on peut voir qu'il
y a 512 ko de m&eacute;moire Chip et 16.5 Mo de m&eacute;moire Fast, pour un total de 17 Mo
</p>

<a name="2-4"><h4>Est-ce que je peut utiliser un &eacute;cran VGA pour mon Amiga ?</h4>
<p>
Les &eacute;crans VGA bon march&eacute; fonctionnent uniquement à la fr&eacute;quence d'affichage
VGA, l'Amiga fonctionne à la base à la fr&eacute;quence des t&eacute;l&eacute;visions, beaucoup plus
basse, les moniteurs VGA n'arrivent pas à afficher à cette fr&eacute;quence.
<br><br>
Si votre Amiga est &eacute;quip&eacute; des puces ECS ou AGA, il peut g&eacute;n&eacute;rer un affichage à
la fr&eacute;quence des &eacute;crans VGA, vous devez pour ceci utiliser le pilote VGA-Only
fourni avec le syst&egrave;me. Le probl&egrave;me de cette m&eacute;thode est que vous &ecirc;tes limit&eacute;s
à utiliser uniquement ce mode d'affichage, tous ce qui est affich&eacute; à la
fr&eacute;quence des t&eacute;l&eacute;visions n'appara&icirc;tra pas, ce qui fait que vous ne pourrez
pas utiliser certains programmes comme par exemple beaucoup des jeux, ainsi
que les alertes et le menu de d&eacute;marrage.
<br><br>
Si vous avez un A3000 ignorez le dernier paragraphe, le A3000 est &eacute;quip&eacute; d'un
connecteur pour &eacute;cran VGA et permet l'utilisation d'un &eacute;cran VGA dans n'importe
quel mode d'affichage, de la m&ecirc;me mani&egrave;re qu'un ScanDoubler.
<br><br>
La solution finale, et la meilleure, consiste à acheter une carte graphique
24 bits, et un moniteur multi-fr&eacute;quences, ce type d'&eacute;cran n'est pas limit&eacute; à
une ou deux vitesses d'affichage, il est capable d'afficher à n'importe quelle
fr&eacute;quence comprise dans un certain intervalle. Combinez ce type de moniteur
avec une carte graphique telle que la Cybervision ou la Picasso et vous aurez
une puissante station graphique.
<br><br>
Si vous faites comme ceci, vous aurez besoin d'un &eacute;cran capable d'afficher à
une fr&eacute;quence minimale de 15kHz (fr&eacute;quence t&eacute;l&eacute;vision), tr&egrave;s peu d'&eacute;crans sont
capables de le faire. Testez donc vous m&ecirc;me l'&eacute;cran avant de l'acheter, d'autant
plus que si vous l'achetez dans un magasin PC, ils ne sauront certainement pas
de quoi vous parlez. La meilleure solution est de vous faire conseiller par
votre revendeur Amiga.
</p>

<a name="2-5"><h4>Que sont PAL et NTSC, desquels on parle tant ?</h4>
<p>
Le signal vid&eacute;o des t&eacute;l&eacute;visions est diff&eacute;rent en Europe et au Etats Unis,
le syst&egrave;me NTSC est utilis&eacute; au Etats Unis, alors que les pays d'Europe et la
plupart des autres pays utilisent le syst&egrave;me PAL. Vu que les Amiga fonctionnent
avec des modes d'affichage bas&eacute;s sur la vid&eacute;o, ils sont construits pour un des
deux syst&egrave;mes, suivant le pays.
<br><br>
La diff&eacute;rence principale entre les deux modes d'affichage est la r&eacute;solution et
la fr&eacute;quence d'affichage. Les affichages NTSC ont 200 lignes en verticale, 400
avec entrelacement, et affichent 30 images (60 trames) par seconde. Les
affichages PAL utilisent 256 lignes, 512 en entrelac&eacute;, avec une fr&eacute;quence de
25 images (50 trames) par seconde.
<br><br>
Si vous avez les puces (chipset) ECS vous pouvez passer d'un mode d'affichage
à l'autre en utilisant le programme ScreenMode, dans le tiroir Preferences.
Vous pouvez aussi changer le mode d'affichage par d&eacute;faut dans le menu de
d&eacute;marrage (Early Startup Menu), que vous activez en pressant les deux boutons
de la souris pendant le d&eacute;marrage.
<br><br>
Certains programmes, principalement des jeux, ne sont pas corrects avec le
syst&egrave;me et ne supportent qu'un seul des modes, beaucoup de jeux disponibles sur
Aminet, par exemple,ne supportent que le mode PAL. Si vous avez une machine
NTSC vous pourrez utiliser la plupart de ces jeux a condition que vous ayez les
puces ECS ou AGA, et au minimum 1 Mo de m&eacute;moire Chip.
</p>

<a name="2-6"><h4>Est-ce que je peut avoir un affichage 16 Mio de couleurs haute r&eacute;solution sur Amiga ?</h4>
<p>
Oui. Il existe beaucoup de cartes d'extension graphique (cartes graphiques) pour
l'Amiga, elles vous permettent d'utiliser le Workbench ainsi que beaucoup de
programmes sur un affichage haute r&eacute;solution, avec beaucoup de couleurs.
<br><br>
Si vous achetez une carte graphique 24 bits, assurez-vous qu'elle soit
livr&eacute;e avec le logiciel CyberGraphX (Cybergraphics), ou que vous pouvez
obtenir ce logiciel s&eacute;p&eacute;rement. CyberGraphX est le standard pour
les cartes graphiques. Vous aurez aussi besoin du Workbench 3.0 ou plus pour
pouvoir pleinement profiter des avantages de la carte.
<br><br>
Croyez-moi, il y a rien de plus beau qu'un Workbench sur un &eacute;cran en
1024x768 points en 256 couleurs ! Vous pourrez aussi surfer sur le World Wide
Web, et utiliser la plupart de vos programmes en 256 couleurs.
<br><br>
Notez que certains programmes, comme par exemple la plupart des jeux utilisent
les circuits graphiques en direct, et ne profiteront donc pas de la haute
r&eacute;solution, et la haute vitesse de la carte graphique.
</p>
</body>
</html>
