<html>
<head>
<title>Travailler avec d'autres plateformes</title>
</head>
<body>
<h2>Travailler avec d'autres plateformes</h2>

<a name="11-1"><h4>Est-ce que je peut lire des disquettes Amiga sur un PC ?</h4>
<p>
Avec un PC vous ne pouvez par lire les disquettes Amiga, leur format est
physiquement different, et en plus il n'y a pas de logiciel.
</p>

<a name="11-2"><h4>Alors est-ce que je peut lire des disquettes PC sur un Amiga ?</h4>
<p>
Oui, c'est possible.<br>
Si vous avez la version 2.1 ou plus du syst&egrave;me, vous pourrez utiliser le
programme CrossDos, qui vous permet de lire, &eacute;crire et formater. Si vous avez
un lecteur de disquettes double densit&eacute; vous pourrez uniquement travailler avec
les disquettes de 720 ko, si par contre vous avez un lecteur haute-densit&eacute; vous
pourrez utiliser les disquettes 1.4 Mo standard des PC.
<br><br>
Pour pouvoir utiliser CrossDos vous devez d'abord activer l'unit&eacute;. Pour ceci
regardez dans le r&eacute;pertoire DOSDrivers du r&eacute;pertoire Storage, il se trouve
un ic&ocirc;ne appel&eacute; &quot;PC0&quot;, double-cliquez dessus, il va cr&eacute;er un lecteur appel&eacute;
PC0:, si vous ins&eacute;rez une disquette MS-DOS dans le premier lecteur de
disquettes, il appara&icirc;tra en temps que PC0:, vous pourrez l'utiliser comme
n'importe quelle autre disquette.<br>
Cependant vous serez limit&eacute; à des noms de fichier de 8 caract&egrave;res plus
3 d'extension (8.3), comme pour MS-DOS.
<br><br>
Si vous voulez que l'unit&eacute; PC0: soit activ&eacute;e à chaque fois que vous d&eacute;marrez
l'ordinateur, vous devrez d&eacute;placer l'ic&ocirc;ne PC0 dans le r&eacute;pertoire DOSDrivers
qui se trouve dans le r&eacute;pertoire Devs.
</p>

<a name="11-3"><h4>Est-ce que l'Amiga peut lire des disquettes Macinthosh ?</h4>
<p>
Oui, mais c'est un peu plus compliqu&eacute; que pour les disquettes PC. Il existe des
logiciels commerciaux, comme par exemple CrossMac qui vous permettent de lire
les disquettes Macintosh. Cependant le vieux format double-densit&eacute; est
propri&eacute;taire, et n'est pas lisible en utilisant en utilisant un lecteur de
disquettes standard, pour ceci vous aurez besoin d'un lecteur disquettes
Macintosh.
<br><br>
Les disquettes haute densit&eacute; Macintosh peuvent &ecirc;tre lues avec un lecteur de
disquettes haute densit&eacute; pour Amiga en utilisant CrossMac ou un autre logiciel.
</p>

<a name="11-4"><h4>Est-ce que je peut transf&eacute;rer des fichiers de l'Amiga au Mac, et vice-versa
 sans utiliser de logiciel sp&eacute;cial comme CrossMac ?</h4>

<p>
Oui, c'est la m&eacute;thode la plus simple, vu que le Macintosh peut lire des
disquettes MS-DOS et l'Amiga aussi, il vous suffit d'utiliser CrossDos.
<br><br>
Du c&ocirc;t&eacute; Amiga faites le comme indiqu&eacute; quelques lignes plus haut, du c&ocirc;t&eacute;
Macintosh si vous avez le syst&egrave;me 7.5 ou plus les disquettes sont reconnues
automatiquement, sinon vous devrez utiliser l'outil Apple File Exchange pour
transf&eacute;rer les fichiers.
</p>
<a name="11-5"><h4>
Quand je transf&egrave;re une image de l'Amiga au Mac/PC elle appara&icirc;t ecras&eacute;e, et
quand je la transf&egrave;re du Mac/PC à l'Amiga elle appara&icirc;t allong&eacute;e, qu'est-ce
que je dois faire ?</h4>
<p>
la raison est que le Mac et le PC travaillent avec des pixels carr&eacute;s, alors que
l'amiga travaille avec des pixels rectangulaires. Et les images n'ont pas le
m&ecirc;me rapport hauteur/largeur.
<br><br>
Utilisez un programme de traitement d'images pour corriger la hauteur de
l'image, de mani&egrave;re à obtenir le bon aspect.
</p>
<a name="11-6"><h4>Quand je transf&egrave;re un fichier texte de l'Amiga vers le PC il est compl&eacute;tement
 d&eacute;form&eacute;, il manque les sauts de ligne. Que faire ?</h4>
<p>
l'Amiga utilise un seul caract&egrave;re pour le saut de ligne (LF), alors que DOS en
utilisent deux (CR+LF). Le programme CrossDos peut corriger ce probl&egrave;me pour
vous. Pour ceci, avant de copier le fichier texte sur la disquette PC activez
l'option &quot;Conversion du texte&quot; de CrossDos. Pour ca ouvrez le r&eacute;pertoire
Commodities dans le r&eacute;pertoire Tools et double-cliquez sur sur l'ic&ocirc;ne CrossDos,
une fen&ecirc;tre doit appara&icirc;tre. Selectionnez PCO, puis activez les deux options
&quot;Filtrage du texte&quot; et &quot;Conversion du texte&quot;, apr&egrave;s ceci vous pouvez copier
votre fichier sur la disquette,et les sauts de ligne seront corrig&eacute;s.
</p>
<a name="11-7"><h4>Qu'est Shapeshifter ?</h4>
<p>
Shapeshifter est un &eacute;mulateur Macintosh logiciel, c'est un contribuciel
(shareware), la version d&eacute;monstration se trouve sur Aminet, il vous permet
de faire fonctionner des programmes pour Macintosh sur votre Amiga.
<br><br>
Pour faire fonctionner Shapeshifter vous avez besoin de: un processeur 68020 ou
plus rapide, au minimum 4 Mo de m&eacute;moire (8 est conseill&eacute;), la version 2.1 ou
plus r&eacute;cente du syst&egrave;me Amiga, la copie sur fichier d'une ROM Macintosh, si vous
avez un 68020 ou 68030 vous pouvez utilisez une ROM de 512 Ko, si vous avec un
68040 ou 68060 vous aurez besoin d'une ROM de 1 Mo, vous aurez aussi besoin des
logiciels syst&egrave;me du Macintosh.
<br><br>
Pour lire les disquettes Macintosh, qui sont presque toutes en haute densit&eacute;,
vous aurez besoin d'un lecteur haute densit&eacute;. L'affichage est relativement
lent sans carte graphique.
<br><br>
Ce qui fait finalement beaucoup de mat&eacute;riel n&eacute;cessaire, mais pensez bien que
vous aurez alors un v&eacute;ritable Macintosh dans votre Amiga.
</p>

<a name="11-8"><h4>Comment faire pour se procurer une ROM Mac ?</h4>
<p>
Shapeshifter est &eacute;quip&eacute; d'un programme pour faire une copie d'une ROM Mac, pour
l'&eacute;mulateur, il vous suffit de l'utiliser sur le Mac d'un de vos amis, ou à
l'&eacute;cole, mis à part que c'est ill&eacute;gal.
L'ideal serait de commander une ROM chez Apple, mais apr&egrave;s vous aurez besoin
d'un Mac complet pour faire la copie. Donc je pense que d'acheter la ROM par
obligation et ensuite faire une copie sur la machine d'un amis devrais &ecirc;tre
l&eacute;gal, mais je prend pas de responsabilit&eacute;s si Apple vient frapper à votre
porte ;-)
</p><br><p>
</BODY>
</HTML>

