<html>
<head>
<title>Utiliser le Shell</title>
</head>
<body>
<h2>Utiliser le Shell</h2>
<a name="6-1"><h4>Comment ouvrir une fen&ecirc;tre shell</h4>
<p>
C'est relativement simple. Ouvrez le r&eacute;pertoire <tt>System</tt> de votre
partition Workbench, et double-cliquez sur l'ic&ocirc;ne <tt>Shell</tt>.
</p>
<a name="6-2"><h4>Quelles sont les commandes Shell les plus importantes ?</h4>
<p>
Voila quelques unes des commandes Shell les plus importantes:<br>
<br>
<tt>dir</tt><br>
affiche la liste des fichiers du r&eacute;pertoire courant<br>
<br>
<tt>cd &lt; r&eacute;pertoire ou volume &gt;</tt><br>
Vous permet de changer le r&eacute;pertoire courant, n'oubliez pas que les noms
de volume doivent &ecirc;tre suivis de deux points (:), cette commande n'est pas
n&eacute;cessaire si vous utilisez Workbench 2.1 ou plus, il vous suffit de
saisir le nom du r&eacute;pertoire ou du volume.<br>
<br>
<tt>copy &lt; source &gt; &lt; destination &gt;</tt><br>
cette commande permet de copier fichiers ou des r&eacute;pertoires d'une place
vers une autre.<br> <br>

<tt>delete &lt; fichier ou r&eacute;pertoire &gt;</tt> <br>
cette commande vous permet d'effacer le fichier ou le r&eacute;pertoire
sp&eacute;cifi&eacute;. Pour supprimer un r&eacute;pertoire ainsi que les
fichiers qu'il contient utilisez la commande suivante:<br>
<tt>delete &lt; fichier ou r&eacute;pertoire &gt; all</tt><br>
dans le cas contraire la commande refusera d'effacer un r&eacute;pertoire qui
contient encore des fichiers.<br>
<br>
<tt>makedir &lt; nom &gt;</tt><br>
vous permet de cr&eacute;er un r&eacute;pertoire avec le nom specifi&eacute;<br>
<br>
Vous pouvez aussi utiliser la plupart des programmes graphiques &agrave; partir
d'un Shell, par exemple pour utiliser <tt>Memacs</tt>, dans le r&eacute;pertoire
<tt>Tools</tt> de la partition Workbench, saisissez:<br>
<tt>cd sys:tools<br>
memacs</tt><br>
<br>
Pour fermer une fen&ecirc;tre Shell, utilisez la commande suivante:<br>
<tt>endshell</tt><br>
<br>
Pour ouvrir une deuxi&egrave;me fen&ecirc;tre Shell, utilisez la commande
suivante:<br>
<tt>newshell</tt><br>
</p>
</body>
</html>
