<html>
<head>
<title>Le syst&egrave;me d'exploitation (syst&egrave;me)</title>
</head>
<body>
<h2>Le syst&egrave;me d'exploitation (syst&egrave;me)</h2>

<a name="3-1"><h4>Quelle est la derni&egrave;re version du syst&egrave;me Amiga ?</h4>
<p>
la derni&egrave;re est la version 3.1, aussi connu comme &quot;version 40&quot;.
</p>

<a name="3-2"><h4>Quelle version du syst&egrave;me ce trouve dans mon ordinateur ?</h4>
<p>
Il y a plusieurs mani&egrave;res de retrouver quelle version vous utilisez.
<br><br>
Choisissez le menu &quot;Version&quot; du Workbench, une requ&ecirc;te apparaitra, et vous
indiquera la version de la ROM et du Workbench. Ou alors ouvrez un shell et
tappez la commande &quot;version&quot;, vous verrez appara&icirc;tre les num&eacute;ros de version.
Les num&eacute;ros de version sont g&eacute;n&eacute;ralement indiqu&eacute;s sur l'&eacute;cran au d&eacute;marrage de
l'ordinateur. Les versions sont souvent sous la forme de num&eacute;ros comme 37, 38,...
A transcrire de la mani&egrave;re suivante:
<br><br><pre>
40 = 3.1
39 = 3.0
38 = 2.1
37 = 2.04
36 = 2.0
35 = 1.4
34 = 1.3
33 = 1.2
</pre>
par exemple, si je tappe &quot;version&quot; dans un shell, et que j'obtiens:
<pre>&gt; Kickstart 40.63, Workbench 40.42</pre>
Cela signifie que j'utilise la version 3.1
</p>

<a name="3-3"><h4>Est-ce que je dois passer à la version 3.1 ?</h4>
<p>
r&eacute;ponse courte: faites-le tout de suite.
<br><br>
Si vous utilisez la version 1.3, ou plus ancien, le fait de passer à la 3.1
vous fera comme si vous aviez un nouvel ordinateur. Il a un meilleur aspect,
il fonctionne mieux, et il a plus de possibilit&eacute;s. La plupart des nouveaux
programmes ne fonctionnent pas avec la version 1.3. , mais tous fonctionnent
avec la 3.1, il est difficile d'aller sur Internet avec la version 1.3
par exemple.
<br><br>
Si vous avez la version 2.0 ou 2.04 la r&eacute;ponse est &eacute;galement oui. l'aspect
n'est pas tr&egrave;s diff&eacute;rent, mais des nouvelles fonctions le rendent tr&egrave;s
int&eacute;ressant, comme par exemple le support de multiples langues autres que
l'anglais gr&acirc;ce à la Locale.
<br><br>
Une autre possibilit&eacute; est d'utiliser un kit pour la version 2.1. Toutefois, vu
le prix relativement &eacute;lev&eacute; de ce kit, vous avez int&eacute;r&ecirc;t à &eacute;conomiser quelques
francs pour passer directement a la version 3.1, d'autant plus que la version
2.1 ne sera certainement plus support&eacute;e une fois que de nouvelles versions
seront sorties.
<br><br>
le passage de la version 2.1 à la 3.1 ressemble plutot à une mise à jour, mais
je la conseille tout de m&ecirc;me dans tous les cas.
<br><br>
Passer de la version 3.0 à la 3.1 est moins important (vous ne pouvez pas passer
à la version 3.0, elle est mont&eacute;e en standard dans les A1200 et A4000) S'il est
int&eacute;ressant pour vous de payer le prix ou si vous pensez developper des
programmes, je vous recommande la mise à jour. Si vous &ecirc;tes une de ces personnes
qui adorent avoir le dernier cri, faites-le. Sinon, si vous avez le choix entre
un kit 3.1 ou un peu plus de m&eacute;moire, il est plus int&eacute;ressant de rajouter de la
m&eacute;moire.
<br><br>
Cependant vous pouvez utiliser le kit logiciel 3.1 avec les ROM 3.0, vous
perdrez quelques rares possibilit&eacute;s, et il revient un peu moins cher d'acheter
uniquement les disquettes.
</p>

<a name="3-4"><h4>Qu'implique le passage à une nouvelle version ?</h4>
<p>
Le syst&egrave;me d'exploitation (syst&egrave;me) de l'Amiga comporte une s&eacute;rie de programmes
distribu&eacute;s sur disquette, et des puces de m&eacute;moire morte (ROM) que vous devez
installer à l'int&eacute;rieur de l'ordinateur. la ROM est connue sous le nom de
&quot;Kickstart&quot;, elle contient la partie principale du syst&egrave;me qui doit &ecirc;tre
disponible à tout moment.
<br><br>
Pour passer à une nouvelle version vous devez remplacer la ou les ROM qui se
trouvent dans l'ordinateur, sauf si vous passez de la version 2.04 à la
version 2.1, vu qu'elle utilise les ROM 2.04.
<br><br>
Vous pouvez aussi passer à la version 3.1 en utilisant les ROM 3.0, vous
perdrez quelques rares fonctionalit&eacute;s.
</p>

<a name="3-5"><h4>Quelles version du syst&egrave;me peuvent fonctionner sur mon ordinateur ?</h4>
<p>
Vous pouvez changer de version sur n'importe quel Amiga, à part le A600 sur
lequel les ROM sont soud&eacute;es en surface et il n'existe pas de ROM de
remplacement soud&eacute;e, et le A1000 qui est d&eacute;pass&eacute;.
<br><br>
Le kit 3.1 existe en une version pour A500/A2000, pour A1200, et pour
A3000/A4000, Lorsque vous commandez le kit vous devez pr&eacute;ciser quel mod&egrave;le
Amiga vous utilisez.
<br><br>
La version 3.1 est une version corrig&eacute;e de la 3.0 - qui se trouve dans les
A1200 et A4000 - il n'existe pas de ROM 3.0 pour les autres machines.
</p>
</body>
</html>

