@DATABASE opium.newmail.ru:666/21s.htm
@WORDWRAP

@NODE MAIN
@TITLE " Ave Satanas..."
 
   @{" " link "20_1s.guide/MAIN"}@{"../pau.gif" link "../pau.gif/MAIN"}
Назад    Черная Библия "Книга Белиала
 (Земля)"    @{" " link "22s.guide/MAIN"}@{"../pau0.gif" link "../pau0.gif/MAIN"}
Дальше 

Сатанинский Ритуал @{" " link "me="1"/MAIN"}Что необходимо принять во внимание перед выполнением Ритуала 

1. Лицо, выполняющее ритуал, стоит лицом к алтарю и символу Бафомета в течении всего ритуала, исключая специально оговоренные конкретные случаи. 

2. По возможности, алтарь должен находиться у западной стены. 

3. Если ритуал выполняется одним лицом, роль священника не требуется. Если в ритуале принимают участие более одного человека, один из них должен выполнять роль священника. В приватном ритуале единственный участник должен следовать инструкциям для священника. 

4. После произнесения священником слов "Шемхамфораш!" или "Да здравствует Сатана!" другие участники должны повторить эти слова за ним. После их ответа звучит гонг. 

5. Разговоры (кроме тех, что ведутся к контексте церемонии) и курение запрещены после удара колокола в начале и до его удара в конце. 

6. Книга Белиала содержит принципы сатанинской магии и ее ритуалов. ПЕРЕД ТЕМ как начать совершать ритуалы из Книги Левиафана строго необходимо прочесть И ПОНЯТЬ ПОЛНОСТЬЮ Книгу Белиала. До этого же, никакого намека на успех не должно ожидаться от ни-жеприведенных тринадцати шагов. 

@{" " link "me="2"/MAIN"}Тринадцать Шагов 
(См. "Предметы, используемые в сатанинском ритуале" для более детальных инструкций)
 

1. Оденьтесь для ритуала. 

2. Приготовьте предметы для ритуала; зажгите свечи и блокируйте все внешние источники света; поместите пергаменты слева и справа от алтаря, как указано ниже. 

3. Если в качестве алтаря используется женщина, она занимает свое положение. 

4. Очищение воздуха происходит при звуке колокола. 

5. "Заклинание к Сатане" и следующие за ним "Адские Имена" (см. Книгу Левиафана) прочитываются священником вслух. Участники повторяют каждое Адское Имя за священником. 

6. Испейте из кубка. 

7. Поворачиваясь против часовой стрелки, священник указывает мечом на главные стороны света и вызывает соответствующих Принцев Ада: Сатану - с Юга, Люцифера - с Востока, Белиала - с Севера и Левиафана - с Запада. 

8. Благословите фаллос (если он используется в ритуале). 

9. Священник читает вслух соответствующее заклинание для исполняемой церемонии: Вожделения, Сострадания или Уничтожения (см. Книгу Левиафана). 

10. В случае персонализированного ритуала этот шаг необычайно важен. Одиночество располагает к выражению самых скрытых желаний, и никакой попытки "сдержаться" не должно быть предпринято при исполнении, проговаривании или воображении образов, относящихся к вашим желаниям. Именно в этом шаге ваш "чертеж" магического действия рисуется, упаковывается и посылается получателю. 

(@{"b"}А@{"ub"}) 

Для склонения кого-либо на предмет вожделения или создания сексуально благоприятной ситуации. Покиньте пространство вокруг алтаря и переместитесь в место, находящееся либо в этой комнате, либо за ее пределами, наиболее соответствующее для исполнения нужного ритуала. Затем, вызовите любые, подвластные вашему воображению образы, которые как можно более соответствовали бы пути к желаемой вами ситуации. Не забывайте о том, что у вас есть пять органов чувств и не нужно ограHичивать себя использованием лишь одного из них. Вот, что может быть задействовано (как по отдельности, так и в любой комбинации): 

< 

< 

< 

< 

nbspnbspnbspnbspд) любые звуки или сторонние шумы, способные создать и поддержать сильный образ. 

Сильное сексуально чувство должно сопровождать этот шаг в ритуале, а после того, как вызван достаточно яркий образ, выход сильных эмоций, таких как оргазм, должен завершить этот этап. Климакс может быть достигнут путем любых необходимых мастурбационных или автоэротических действий. После достижения оргазма вернитесь к алтарю и приступайте к одиннадцатому шагу. 

(@{"b"}Б@{"ub"}) 

Обеспечение помощи и успеха человеку, к которому вы испытываете симпатию или сочувствие (включая самого себя) 

Находитесь вблизи алтаря и, вызвав в уме яркий образ того, кому вы хотите помочь (или усилив чувство сострадания к самому себе), выскажите пожелание своими собственными словами. Если ваши эмоции достаточно искренни, они должны сопровождаться пролитием слез, которые не должны никоим образом сдерживаться. После того, как выказано это сострадание, приступайте к одиннадцатомму шагу. 

(@{"b"}В@{"ub"}) 

Вызывание уничтожения врага 

Оставайтесь вблизи алтаря, если только образы не вызываемы более легко в другом месте, таком, как, например, непосредственная близость к жертве. Создав образ жертвы, приступайте к уничтожению ее изображения любым способом по вашему выбору. Это может быть достигнуто следующими путями: 

кукла может быть изготовлена из ткани, дерева, растительных материалов и т.д.; 

< 

< 

< 

nbspnbspnbspnbspд) уничтожением, увечием или вызыванием боли через доверенное лицо, использующее любые другие желаемые способы. 

Сильные, намеренные ярость и презрение должны сопровождать этот шаг в церемонии и не должно предприниматься никаких попыток остановить этот шаг до той поры, пока расход энергии со стороны мага не проявится в виде состояния относительной усталости. При появлении этой усталости приступайте к одиннадцатому шагу. 

11.а) Если просьбы изложены в письменном виде, они должны быть прочитаны вслух священником и затем сожжены в пламени свечи. "Шемхамфораш!" и "Да здравствует Сатана!" произносятся после каждой просьбы. 

11.б) Если просьбы излагаются устно, участники (по одному) излагают их священнику. Он затем повторяет их просьбы своими словами (которые эмоционально стимулируют его в большей степени). "Шемхамфораш!" и "Да здравствует Сатана!" произносятся после каждой просьбы. 

12. Подходящий Енохианский Ключ затем прочитывается священником как доказательство верности участников Силам Тьмы. 

13. Удар колокола возвещает об осквернении (т.е. об окончании периода очищения, возвещанного ударом колокола в начале - прим. перев.) и слова "ИТАК, СВЕРШЕНО" произносятся священником. 

ОКОНЧАНИЕ РИТУАЛА. 


@{" " link "me="3"/MAIN"}Предметы, используемые в Сатанинском Ритуале 

@{"b"}Одежда@{"ub"} 

Участники мужского пола облачены в черные рясы. Рясы могут быть как с капюшонами, так и с колпаками; дабы, если в том появится нужда, скрыть лицо. Цель сокрытия лица - предоставить участнику свободу выразить свои чувства на лице безо всякого стеснения. Это также снижает отвлекаемость одного участника другим. Участники женского пола одеты сексуально вызывающе, для пожилых женщин более подобают черные одеяния. Амулеты со знаком Бафомета или традиционной пентаграммой Сатаны должны быть у каждого участника. 

Рясы надеваются мужчинами перед входом в ритуальную комнату и не снимаются в течение всего ритуала. Мужчины могут заменить рясы полностью черной одеждой. 

Для одежд, носимых в ритуальной комнате, черный цвет выбран поскольку он символизирует Силы Тьмы. Сексуально вызывающие одежды надеваются женщинами для того, чтобы возбудить эмоции участников мужского пола и, таким образом, усилить выделение адреналина и биоэлектрической энергии, обеспечивающей более успешный результат. 


@{"b"}Алтарь@{"ub"} 

Самые ранние алтари в истории человечества были из живой плоти и крови, а естественные инстинкты и склонности служили основанием, на котором основывались его религии. Позднейшие религии, сделав естественные наклонности человека грешными, извратили и его живые алтари, превратив их в каменные плиты и куски металла. 

Сатанизм - религия более плоти, нежели духа, посему, алтарь из плоти используется в сатанинских церемониях. Назначение алтаря - служить центральной точкой, на которой концентрируется все внимание на протяжении церемонии. В качестве алтаря в сатанинских церемониях используется обнаженная женщина, поскольку она является естественным пассивным рецептором и представляет мать-землю. 

В некоторых ритуалах обнажение женщины, служащей алтарем, может не представлять практического смысла и тогда она может быть одета или частично прикрыта. Если женщина выполняет ритуал в одиночку, она не нуждается в другой женщине на роль алтаря. Если в качестве алтаря не используется женщина, возвышение, на котором она лежит в остальных случаях, может быть использовано для размещения других предметов, используемых в ритуале. При больших групповых ритуалах для женщины может быть сооружен трапециевидный алтарь 3-4 фута высотой и 5.5-6 футов длиной. Если это не представляется возможным по практическим соображениям, или при частных ритуалах, в качестве алтаря может быть использована любая приподнятая поверхность. Если женщина используется в качестве алтаря, другие предметы могут быть также возложены рядом с ней, чтобы находиться под рукой у священника. 


@{"b"}Символ Бафомета@{"ub"} @{"baf.gif" link "baf.gif/MAIN"}

Символ Бафомета использовался Орденом Тамплиеров для представления Сатаны. На протяжении веков этот символ назывался множеством разных имен. Среди них: Козел Мендеса, Козел Тысячи Юнос-тей, Черный Козел, Козел Иуды и, наверное, самое подходящее - Козел Отпущения. 

Бафомет представляет собой Силы Тьмы, соединенные с репродуктивной плодовитостью козла. В своей "чистой" форме символ представляет собой пентаграмму, во все пять лучей которой вписана фигура человека - три конечности вверх, два - вниз, символизируя духовную природу человека. В Сатанизме пентаграмма также используется, но, поскольку Сатанизм представляет плотские инстинкты человека, пентаграмма здесь перевернута, дабы вместить в себя голову козла - его рога, представляющие собой двойственную природу человека, бросают вызов небу; другие три оконечности перевернуты, что являет собой отрицание Троицы. Ивритские письмена, расположенные за внешним кругом символа, который, кстати, берет свое начало в магическом учении Каббалы, составляют слово "Левиафан" - имя змея из водной бездны, ассоциируемого с Сатаной. Символы расположены напротив пяти лучей перевернутой звезды. 

Символ Бафомета помещается на стене перед алтарем. 


@{"b"}Свечи@{"ub"} 

Свечи, используемые в сатанинском ритуале, представляют собой свет Люцифера - носителя света, просвещения, живого огня, горящей страсти и языки пламени Бездны. 

Только черные и белые свечи могут быть использованы в сатанинском ритуале. Ни в коем случае нельзя использовать более одной белой свечи; черных же может быть столько, сколько необходимо для освещения ритуальной комнаты. По крайней мере одна черная свеча располагается слева от алтаря, символизируя собой Силы Тьмы и Левосторонний путь. Остальные черные свечи располагаются там, где необходимо для освещения. Единственная белая свеча располагается справа от алтаря, являя лицемерие "магов" белого света и последователей правостороннего пути. Никаких других источников света не используется. 

Черные свечи используются для придания силы и успеха участникам ритуала, в их пламени, кроме того, предаются огню пергаменты, на которых изложены милости, испрашиваемые участниками ритуала. Белая свеча используется для уничтожения врагов. Пергаменты, на которых написаны проклятия, сжигаются в пламени белой свечи. 


@{"b"}Колокол@{"ub"} 

Удар колокола возвещает начало и конец ритуала. Священник звонит в колокол девять раз, поворачиваясь против часовой стрелки, и направляет звук его ударов в четыре главных стороны света. Это делается один раз вначале ритуала для того, чтобы очистить воздух от внешних звуков и один раз - в конце ритуала, чтобы усилить его действие и послужить осквернителем, возвещающим о финале действа. 

Тональность используемого колокола предпочтительно должна быть громкой и пронзительной, нежели мягкой и звонкой. 


@{"b"}Кубок@{"ub"} 

В сатанинском ритуале кубок, или сосуд, являет собой Кубок Экстаза. В идеале кубок должен быть изготовлен из серебра, но если это не представляется возможным, кубок, изготовленный из другого металла, стекла или глины также может быть применен; 

ЕДИНСТВЕННО, ОН НЕ ДОЛЖЕН БЫТЬ ЗОЛОТЫМ. Золото всегда ассоцииро-валось с белосветными религиями и Царствием Небесным. 

Из кубка первым пьет священник, затем его помощник. В частных ритуалах, человек, исполняющий церемонию, осушает кубок в одиночку. 


@{"b"}ЭЛИКСИР@{"ub"} 

Возбуждающая жидкость, или Эликсир Жизни использовался язычниками, но, затем был заменен сакраментальным вином в Христианской вере. Первоначально, напиток, применявшийся в языческих ритуалах, выпивался для того, чтобы расслабиться и усилить эмоции тех, кто участвовал в церемонии. Сатанизм не приносит в жертву своего бога, как это делают другие религии. Сатанист не практикует таких форм символического каннибализма и возвращает вино, используемое христианами, к его подлинному назначению - возбуждению чувств, необходимого для сатанинского ритуала. Вовсе необязательным является использование вина - подойдет любой наиболее возбуждающий и наиболее приятный на вкус напиток. 

Эликсир Жизни должен быть выпит из Кубка Экстаза, как указано выше, непосредственно после Заклинания к Сатане. 


@{"b"}Меч@{"ub"} 

Меч Власти символизирует агрессивную силу и служит продолжением и усилением руки; священник использует его для указания и направления. Аналогией мечу служит указка или волшебная палочка, используемая в ритуалах других магий. 

Меч находится в руках у священника и используется для указания на символ Бафомета во время Заклинания к Сатане. Он также используется, как было указано в "Шагах ритуала", при вызове четырех принцев Ада. Священник пронзает острием клинка пергамент, содержащий сообщение или просьбу, и подносит их затем к пламени свечи. Выслушивая просьбы других участников и повторяя их, священник возлагает меч на их головы (в традиционной манере "посвящения в рыцарство"). 

При проведении частных ритуалов меч, если он не может быть добыт, подлежит замене на длинный нож, трость или похожий предмет. 


@{"b"}Фаллос@{"ub"} 

Фаллос в язычестве - символ плодовитости, половой зрелости, мужественности и агрессии. Это еще один пример богохульного превращения в угоду комплексу вины, коим пронизаны все христианские церемонии. Фаллос - это неолицемеренная версия аспергилия, или "оросителя святою водой", используемого в католицизме - интересное перевоплощение обычного пениса! 

Фаллос держится в обоих руках одним из помощников священника и встряхивается дважды против каждой главной стороны света для благословления дома. 

Может быть использован любой фаллический символ. Материалом для его изготовления может послужить гипс, дерево, глина, воск и т.д. Фаллос необходим лишь в групповых ритуалах. 


@{"b"}Гонг@{"ub"} 

Гонг используется для вызова Сил Тьмы. В него ударяют всякий раз, когда участники ритуала повторяют за священником "Да здравствует Сатана!" Гонг необходим только в групповых ритуалах. По тональности более всего подойдет концертный гонг, но если он не может быть добыт, любой гонг с глубоким, богатым тембром может быть использован. 


@{"b"}Пергамент@{"ub"} 

Пергамент используется по той причине, что его органические свойства совпадают с элементами природы. В соответствии с сатанинскими взглядами на жертвоприношение, используемый пергамент может быть изготовлен из шкуры овцы, но только той, что была умерщвлена в целях необходимости добытия пищи. Животное НИКОГДА не умерщвляется лишь для того, чтобы целиком или по частым быть использованным в сатанинском ритуале. Если пергамент промышленного изготовления не может быть получен, в качестве его замены подойдет и обыкновенная бумага. 

Пергамент являет собой носитель, посредством которого написанное сообщение или просьба предается огню и пересылается таким образом в эфир. Просьба пишется на пергаменте или бумаге, зачитывается вслух и затем сжигается в пламени черной или белой свечи, в зависимости от сути каждой просьбы. Перед началом ритуала написанные проклятия располагаются справа от священника, а привороты и благословения - слева. 
 ---

 ---

 ---

 ---

 ---

@endnode
