<HTML>

<HEAD>
<TITLE>FREE EAST TIMOR - Online Campaign - O que é isto ?</TITLE>
</HEAD>

<BODY>
<BODY BGCOLOR="#ffffff" TEXT="#000000">
</BODY>

<A HREF="main_p.htm"><IMG SRC="triangle.gif" ALT="Triangle" BORDER="0" ALIGN="RIGHT"></A>

<P>

<CENTER>

<IMG SRC="barra.gif" ALT="Barra"><BR>
<IMG SRC="m_what.gif" ALT="O que é isto ?" BORDER=0><BR>O que é isto ?<BR>
<IMG SRC="barra.gif" ALT="Barra">
<P>

</CENTER>

<TABLE>

<TR>

<TD>
No dia 7 de Dezembro de 1975, Timor Leste foi invadido pelo ex&eacute;rcito indon&eacute;sio.
As Na&ccedil;ões Unidas não reconheceram a anexa&ccedil;ão, exigindo desde então uma solu&ccedil;ão verdadeiramente justa rumo &agrave; auto-determina&ccedil;ão do povo maubere.
</TD>

<TD>
<IMG SRC="what_soldiers.jpg" ALT="Soldados indonésios" BORDER=0>
</TD>

</TR>

<TR>

<TD>
Durante estes &uacute;ltimos 21 anos, o poderoso ex&eacute;rcito indon&eacute;sio tem mantido uma pol&iacute;tica
de terror e completo genoc&iacute;dio do povo timorense. Massivas viola&ccedil;ões dos direitos humanos causaram
j&aacute; a morte de mais de 250 000 pessoas, que &eacute; cerca de um ter&ccedil;o da popula&ccedil;ão.
</TD>

<TD>
<IMG SRC="what_torture.jpg" ALT="Jovens timorenses sendo torturados" BORDER=0>
</TD>

</TR>

<TR>

<TD>
Em 12 de Novembro de 1991, no funeral de um jovem timorense morto pelo ex&eacute;rcito indon&eacute;sio,
no cemit&eacute;rio de Santa Cruz, cerca de 250 pessoas foram mortas pelos tiros de M16.
Mas desta vez um jornalista ingl&ecirc;s tinha filmado o triste acontecimento, enviando o v&iacute;deo
para todas as cadeias de televisão do mundo.
</TD>

<TD>
<IMG SRC="what_santa.jpg" ALT="Uma imagem do massacre de Santa Cruz em 1991" BORDER=0>
</TD>

</TR>

<TR>

<TD>
Estes minutos de TV foram fundamentais para chamar a aten&ccedil;ão do p&uacute;blico para as atrocidades
cometidas neste territ&oacute;rio.
Com este acontecimento, o ex&eacute;rcito indon&eacute;sio fortaleceu ainda mais as persegui&ccedil;ões e prisões,
e no dia 20 de Novembro Xanana Gusmão, o l&iacute;der da resist&ecirc;ncia timorense, foi preso em Dili.xHÈ
</TD>

<TD>
<IMG SRC="what_xanana.jpg" ALT="O carismático líder da resistência timorense" BORDER=0>
</TD>

</TR>

</TABLE>

<TABLE>

<TR>

<TD>
<IMG SRC="what_horta.jpg" ALT="Jos&eacute; Ramos Horta" BORDER=0>
</TD>

<TD>
No dia 11 de Outubro de 1996, o Pr&eacute;mio Nobel da Paz foi entregue ao representante de Xanana Gusmão
no exterior, Jos&eacute; Ramos Horta, e ao bispo de Timor Leste, Ximenes Belo.
</TD>

<TD>
<IMG SRC="what_belo.jpg" ALT="O bispo Ximenes Belo" BORDER=0>
</TD>

</TR>

</TABLE>

<P>
<CENTER>
<B>A luta timorense &eacute; equiparada pelo comit&eacute; Nobel a outras causas como a do Tibete,
Guatemala e Birm&acirc;nia.
</B>
<P>
<H4>
<I>
Apesar destes sinais positivos, a luta pela liberdade em Timor Leste ainda não acabou.
&Eacute; necess&aacute;rio que no mundo inteiro, aqueles que defendam a paz e os direitos humanos,
 se mobilizem de forma a que os seus pa&iacute;ses pressionem
a Indon&eacute;sia para libertar Timor Leste.
</I>
</H4>
<P>
<IMG SRC="freetimor.gif" ALT="FREE EAST TIMOR - Online Campaign - logo image" BORDER=0>
<H5>
<P>
Ao usar esta imagem est&aacute; a apoiar a luta de um povo
pela Paz, Direitos Humanos e Auto-Determina&ccedil;ão.
</H5>
<P>
Divulgue esta imagem o mais que puder com um link para esta p&aacute;gina:
<BR>
<IMG SRC="url.gif" ALT="http://www.handrade.pt/timor/free/" BORDER=0>

</HTML>
