<html>
<body bgcolor="#9EB3C4" text="#000000">
<title>Paladium ou l'avenir vu par Bill Gates (Microsoft)</title>
<a name="a"</a>

<center><b><font color="brown"><font size=5>LE PROJET PALADIUM</font></font></b></center><br>
<br>
<p>Document source original en anglais : <a
 href="http://newsforge.com/newsforge/02/10/21/1449250.shtml?tid=19">http://newsforge.com/newsforge/02/10/21/1449250.shtml?tid=19</a><br>
</p>
<h2>Pouvez vous faire confiance &agrave; votre ordinateur ?<br>
</h2>
<p>Par <a href="http://www.stallman.org/">Richard Stallman</a> (octobre
2002) :<br>
</p>
<p>De qui votre ordinateur devrait-il recevoir ses ordres ? La plupart
des gens pensent que leur ordinateur devrait leur ob&eacute;ir, et non
ob&eacute;ir &agrave; quelqu'un d'autre. Avec un projet qu'elles
appellent "trusted computing" ("l'informatique de confiance"), de
grandes soci&eacute;t&eacute;s de m&eacute;dias (incluant des
soci&eacute;t&eacute;s de cin&eacute;ma et des maisons de disques), en
collaboration avec des soci&eacute;t&eacute;s informatiques comme
Microsoft et Intel, pr&eacute;voient de faire en sorte que votre
ordinateur leur ob&eacute;isse au lieu de vous ob&eacute;ir. Dans le
pass&eacute;, des programmes propri&eacute;taires ont d&eacute;j&agrave;
inclus des dispositifs malveillants, mais ce projet rendrait ceci
universel.<br>
<br>
"Logiciel propri&eacute;taire" signifie, fondamentalement, que vous ne
contr&ocirc;lez pas ce qu'il fait; vous ne pouvez pas &eacute;tudier le
code source, ou le modifier. Il n'est pas surprenant que des hommes
d'affaires intelligents trouvent des fa&ccedil;ons d'utiliser ce
contr&ocirc;le pour vous d&eacute;savantager. Microsoft l'a fait
plusieurs fois : une des versions de Windows a &eacute;t&eacute;
con&ccedil;ue de fa&ccedil;on &agrave; informer Microsoft sur tous les
logiciels de votre disque dur; un correctif "de s&eacute;curit&eacute;"
r&eacute;cent dans Windows-Media-Player exige que les utilisateurs
acceptent de nouvelles <a
 href="http://www.unixtech.be/modules.php?op=modload&amp;name=News&amp;file=article&amp;sid=2361">restrictions</a>.
Mais Microsoft n'est pas seul : le logiciel de partage de musique KaZaa
est con&ccedil;u pour qu'un partenaire commercial de KaZaa puisse louer
&agrave; ses clients <a
 href="http://www.lexpansion.com/art/0.0.60421.0.html">l'utilisation</a>
de votre propre ordinateur. Ces <a
 href="http://www.freelists.org/archives/helpc/03-2002/msg00025.html">fonctions
malveillantes</a> sont souvent secr&egrave;tes, mais m&ecirc;me une fois
que vous en avez connaissance, il est difficile de les enlever, puisque
vous n'avez pas le code source.<br>
<br>
Dans le pass&eacute;, il s'agissait d'incidents isol&eacute;s.
L'"informatique de confiance" g&eacute;n&eacute;ralisera cela. Un nom
plus appropri&eacute; serait "informatique d&eacute;loyale (treacherous
computing)", parce que le projet est con&ccedil;u pour s'assurer que
votre ordinateur vous d&eacute;sob&eacute;ira syst&eacute;matiquement.
En fait, il est con&ccedil;u pour emp&ecirc;cher votre ordinateur de
fonctionner comme un ordinateur &agrave; vocation universelle. Chaque
op&eacute;ration devra &ecirc;tre autoris&eacute;e explicitement.<br>
<br>
L'id&eacute;e technique &agrave; la base de l'"informatique
d&eacute;loyale" (treacherous computing) consiste en ce que l'ordinateur
inclut un proc&eacute;d&eacute; de chiffrement et de signature, dont les
clefs ne vous sont pas connues. (La version de Microsoft est
appel&eacute;e "palladium"). Des logiciels propri&eacute;taires
utiliseront ce dispositif pour contr&ocirc;ler quels autres programmes
vous pouvez utiliser, quels documents ou quelles donn&eacute;es vous
pouvez lire, et avec quels programmes vous avez le droit de les lire.
Ces programmes t&eacute;l&eacute;chargeront de nouvelles r&egrave;gles
d'autorisation par Internet et vous imposeront automatiquement ces
r&egrave;gles. Si vous ne permettez pas &agrave; votre ordinateur
d'obtenir les nouvelles r&egrave;gles, certaines fonctionnalit&eacute;s
cesseront automatiquement de fonctionner. <br>
<br>
&Eacute;videmment, Hollywood et les maisons de disques pr&eacute;voient
d'utiliser l'"informatique d&eacute;loyale" pour la "gestion des droits
num&eacute;riques" (Digital Right Management), afin que les
vid&eacute;os et la musique t&eacute;l&eacute;charg&eacute;es puissent
&ecirc;tre jou&eacute;s seulement sur un ordinateur pr&eacute;cis. Le
partage sera compl&egrave;tement impossible, au moins avec les fichiers
autoris&eacute;s que vous obtiendrez de ces soci&eacute;t&eacute;s.
Vous, (le public), devriez avoir la libert&eacute; et la capacit&eacute;
de partager ces choses. (Je m'attends &agrave; ce que quelqu'un trouve
une fa&ccedil;on de produire des versions non crypt&eacute;es pour les
t&eacute;l&eacute;charger, si bien que le DRM ne sera pas un
succ&egrave;s total. Mais &ccedil;a ne justifie en rien ce principe de
restriction.)<br>
<br>
L'impossibilit&eacute; du partage est d&eacute;j&agrave; mauvaise, mais
il y a pire. Il y a des projets d'utiliser la m&ecirc;me m&eacute;thode
pour le courrier et les documents &eacute;lectroniques. Ainsi, certains
mails dispara&icirc;traient au bout de deux semaines, ou certains
documents ne pourraient &ecirc;tre lus que sur les ordinateurs d'une
soci&eacute;t&eacute;.<br>
<br>
Imaginez que vous receviez un mail de votre patron vous for&ccedil;ant
&agrave; faire quelque chose de risqu&eacute;; un mois plus tard, si des
ennuis surviennent, vous ne pouvez plus utiliser le mail pour prouver
que la d&eacute;cision n'&eacute;tait pas la v&ocirc;tre.  Vous ne
pouvez pas &ecirc;tre prot&eacute;g&eacute; par un document &eacute;crit
avec une encre qui dispara&icirc;t. Imaginez si vous recevez un mail de
votre patron exposant une politique ill&eacute;gale ou amorale.
Aujourd'hui vous pouvez l'envoyer &agrave; un journaliste et exposer
l'activit&eacute;. Avec l'"informatique d&eacute;loyale", le journaliste
ne sera pas capable de lire le document; son ordinateur refusera de lui
ob&eacute;ir. L'"informatique d&eacute;loyale" devient un paradis pour
la corruption.<br>
<br>
Les logiciels de traitement de texte comme Microsoft Word pourraient
utiliser l'"informatique d&eacute;loyale" pour enregistrer vos documents
et s'assurer qu'aucun autre logiciel de traitement de texte concurrent
ne peut les lire.  Aujourd'hui nous sommes oblig&eacute;s de faire des
exp&eacute;rimentations laborieuses pour d&eacute;couvrir les secrets du
format de fichier Word ".doc" pour fabriquer des logiciels libres de
traitement de texte qui supportent ce format. Si Word enregistre les
documents en utilisant l'"informatique d&eacute;loyale", la
communaut&eacute; du logiciel libre n'aura aucun moyen de
d&eacute;velopper un logiciel pour les lire - et m&ecirc;me si nous
pouvions, cela serait interdit par la loi DMCA (Digital Millenium
Copyright Act).<br>
<br>
Les programmes utilisant l'"informatique d&eacute;loyale"
r&eacute;cup&eacute;reront r&eacute;guli&egrave;rement de nouvelles
r&egrave;gles d'autorisation par Internet et appliqueront ces
r&egrave;gles automatiquement &agrave; votre travail. Si Microsoft, ou
le gouvernement am&eacute;ricain, n'aiment pas ce que vous avez
&eacute;crit dans un document, ils pourraient cr&eacute;er de nouvelles
r&egrave;gles imposant &agrave; tous les ordinateurs de refuser de lire
ce document. Chaque ordinateur ob&eacute;irait &agrave; ces
r&egrave;gles sans votre contr&ocirc;le. Vos &eacute;crits seraient
soumis &agrave; de l'effacement r&eacute;troactif fa&ccedil;on "1984, de
G. Orwell". Vous pourriez m&ecirc;me &ecirc;tre dans l'incapacit&eacute;
d'ouvrir vos propres documents.<br>
<br>
Vous pensez peut-&ecirc;tre que vous d&eacute;couvrirez ce que cache un
logiciel utilisant l'"informatique d&eacute;loyale", et que vous
d&eacute;ciderez de l'accepter ou non. Il faudrait &ecirc;tre myope et
idiot pour accepter, mais le probl&egrave;me est que votre
d&eacute;cision aura une port&eacute;e bien faible. Une fois que vous
devenez d&eacute;pendant de l'utilisation du programme, vous &ecirc;tes
pris et ils le savent; &agrave; ce moment ils peuvent changer les
r&egrave;gles du jeu. Quelques logiciels t&eacute;l&eacute;chargeront
automatiquement les mises &agrave; jour qui feront quelque chose de
diff&eacute;rent - et ils ne vous donneront pas le choix de mettre
&agrave; jour ou non.<br>
<br>
Aujourd'hui vous pouvez &eacute;viter de voir vos libert&eacute;s
contraintes par un logiciel propri&eacute;taire, en ne l'utilisant pas.
Si vous utilisez GNU/Linux ou tout autre syst&egrave;me libre et si vous
&eacute;vitez d'y installer des logiciels propri&eacute;taires, alors
vous pouvez d&eacute;cider ce que fait votre ordinateur. Si un logiciel
libre a une fonction malveillante, d'autres d&eacute;veloppeurs de la
communaut&eacute; l'enl&egrave;veront et vous pourrez utiliser la
version corrig&eacute;e. Vous pouvez aussi utiliser des applications
libres et des outils libres sur des syst&egrave;mes qui ne le sont pas;
cela ne vous octroie pas une libert&eacute; totale, mais beaucoup
d'utilisateurs le font.<br>
<br>
L'"informatique d&eacute;loyale" met en danger l'existence de
l'informatique libre, parce que vous ne serez plus autoris&eacute;
&agrave; l'utiliser. Certaines versions de l'"informatique
d&eacute;loyale" exigeraient que le syst&egrave;me d'exploitation soit
sp&eacute;cifiquement autoris&eacute; par une compagnie
particuli&egrave;re. Des syst&egrave;mes d'exploitation libres ne
pourraient pas &ecirc;tre install&eacute;s.  D'autres versions de
l'"informatique d&eacute;loyale" exigeraient que chaque programme soit
sp&eacute;cifiquement autoris&eacute; par l'&eacute;diteur du
syst&egrave;me d'exploitation. Vous ne pourriez pas utiliser
d'applications libres sur un tel syst&egrave;me.  Si vous y parveniez et
que vous diffusiez la fa&ccedil;on de faire, ce serait
consid&eacute;r&eacute; comme un d&eacute;lit.<br>
<br>
Il y a d&eacute;j&agrave; des propositions de loi am&eacute;ricaines
qui veulent exiger que tous les ordinateurs fonctionnent avec ce
principe et interdire aux anciens ordinateurs de se connecter &agrave;
l'internet. Le CBDTPA (nous l'appelons le Consume But Don't Try
Programming Act, c'est-&agrave;-dire "consommez, mais n'essayez pas de
programmer") est l'une d'entre elles. M&ecirc;me si elles ne vous
for&ccedil;aient pas l&eacute;galement &agrave; vous convertir &agrave;
l'"informatique d&eacute;loyale", la pression sur vous pour l'accepter
serait &eacute;norme. Aujourd'hui les gens utilisent souvent le format
de Word pour communiquer, bien que cela cause plusieurs sortes de
probl&egrave;mes (voir <a
 href="http://www.fsf.org/philosophy/no-word-attachments.fr.html">http:
// www.gnu.org/philosophy/no-word-attachments.fr.html</a> (<a
 href="http://ccomb.free.fr/no-word-attachments_fr.html">ou bien ici</a>).
Si les seules machines &agrave; pouvoir lire le format de Word sont des
machines utilisant l'"informatique d&eacute;loyale", beaucoup de
personnes s'y plieront, s'ils voient la situation seulement en termes
d'action individuelle (c'est &agrave; prendre ou &agrave; laisser). Pour
nous opposer &agrave; l'"informatique d&eacute;loyale", nous devons agir
et r&eacute;agir de fa&ccedil;on collective.<br>
<br>
Pour plus  d'information sur l'"informatique d&eacute;loyale", voir <a
 href="http://www.lebars.org/sec/tcpa-faq.fr.html">http://www.lebars.org/sec/tcpa-faq.fr.html</a>.<br>
Pour bloquer l'"informatique d&eacute;loyale", il faut qu'un grand
nombre de citoyens s'organisent. Nous avons besoin de votre aide! L'<a
 href="http://www.eff.org">Electronic Frontier Foundation</a> et la <a
 href="http://www.publicknowledge.org">Public Knowledge</a>font
campagne contre elle, ainsi que le <a
 href="http://www.digitalspeech.org">Digital Speech Project</a>
lanc&eacute; par la <a href="http://www.fsf.org/home.fr.html">Free
Software Foundation</a>. S'il-vous-pla&icirc;t, visitez leurs sites Web
pour pouvoir vous inscrire et les aider dans leur travail.<br>
<br>
Vous pouvez aussi aider en &eacute;crivant aux bureaux d'affaires
publics d'Intel, IBM, l'HP/COMPAQ, ou quiconque &agrave; qui vous avez
achet&eacute; un ordinateur, expliquant que vous ne voulez pas subir des
pressions pour acheter des syst&egrave;mes informatique "de confiance"
(trusted) et que vous ne voulez pas qu'ils en produisent. Cela peut
aider le grand public &agrave; accro&icirc;tre sa pression. Si vous
faites ceci vous-m&ecirc;me, envoyez s'il vous pla&icirc;t les copies de
vos lettres aux organisations ci-dessus.<br>
<br>
<br>
PS : <br>
<br>
1. Le Projet GNU distribue le logiciel GPG (<a
 href="http://www.gnupg.org/fr/gnupg.html">GNU Privacy Guard</a>), un
programme qui utilise l'encryption &agrave; clef publique et la
signature num&eacute;rique, que vous pouvez utiliser pour envoyer des
mails s&ucirc;rs et priv&eacute;s. Il est utile d'explorer comment GPG
diff&egrave;re de l'"informatique d&eacute;loyale" et de voir ce qui
fait que l'un est utile et l'autre si dangereux. Quand quelqu'un utilise
GPG pour vous envoyer un document crypt&eacute; et que vous utilisez GPG
pour le d&eacute;coder, le r&eacute;sultat est un document non
crypt&eacute; que vous pouvez lire, exp&eacute;dier, copier et
m&ecirc;me re-crypter pour l'envoyer de fa&ccedil;on s&ucirc;re &agrave;
quelqu'un d'autre. Un logiciel d'informatique d&eacute;loyale vous
laisserait lire les mots sur l'&eacute;cran, mais <a
 href="http://www.adobe.fr/epaper/features/drm/howdrmworks.html">ne
vous laisserait pas</a> produire un document non crypt&eacute; que vous
pourriez utiliser d'une autre fa&ccedil;on. GPG, un logiciel libre, met
la s&eacute;curit&eacute; &agrave; disposition des utilisateurs; ils
l'utilisent. L'"informatique d&eacute;loyale" est con&ccedil;ue pour
imposer des restrictions aux utilisateurs; ici, c'est elle qui les
utilise.<br>
<br>
2. Microsoft pr&eacute;sente le Palladium comme une mesure de
s&eacute;curit&eacute; et pr&eacute;tend qu'il nous prot&eacute;gera
contre les virus, mais cette revendication est &eacute;videmment fausse.
Une pr&eacute;sentation par le d&eacute;partement de recherche de
Microsoft en octobre 2002 a d&eacute;clar&eacute; qu'une des
sp&eacute;cifications de Palladium est que les syst&egrave;mes
d'exploitation logiciels existants continueront de fonctionner; donc
fatalement, les virus aussi continueront &agrave; faire toutes les
choses qu'ils peuvent faire aujourd'hui.<br>
<br>
En fait, quand Microsoft parle de "s&eacute;curit&eacute;" en rapport
avec Palladium, ce n'est pas avec la m&ecirc;me d&eacute;finition que la
n&ocirc;tre : il ne s'agit pas prot&eacute;ger votre machine des choses
vous ne voulez pas. Il s'agit d'ajouter une protection aux
donn&eacute;es de votre ordinateur, afin que vous ne puissiez pas les
utiliser d'une autre fa&ccedil;on que celle qui est pr&eacute;vue. Une
diapositive de pr&eacute;sentation a expos&eacute; plusieurs types de
secrets pour lesquels le Palladium pourrait &ecirc;tre utilis&eacute;,
comprenant "des secrets de tiers" et "des secrets d'utilisateur" - mais
les "secrets d'utilisateur" &eacute;taient entour&eacute;s de
guillemets, reconnaissant que ce n'est pas pour &ccedil;a que le
Palladium est vraiment con&ccedil;u. <br>
La pr&eacute;sentation fait une utilisation fr&eacute;quente d'autres
termes que nous associons fr&eacute;quemment au contexte de
s&eacute;curit&eacute;, comme "attaque", "code malveillant," "spoofing,"
aussi bien que "trusted" (de confiance)." Aucun d'eux n'a la m&ecirc;me
signification que d'habitude . "attaque" ne veut pas dire "quelqu'un qui
essaye de vous attaquer", cela signifie "vous, essayant de copier de la
musique". "code malveillant" signifie "code install&eacute; par vous,
pour faire ce que quelqu'un d'autre ne veut pas". "Spoofing" ne signifie
pas "quelqu'un vous dupant", cela signifie "vous, contournant le
Palladium". Et ainsi de suite.<br>
<br>
3. Une d&eacute;claration pr&eacute;c&eacute;dente faite par les
d&eacute;veloppeurs de Palladium a expos&eacute; le principe de base
disant que quiconque cr&eacute;e ou rassemble une information doit
pouvoir contr&ocirc;ler totalement la fa&ccedil;on dont vous l'utilisez.
Cela repr&eacute;senterait une vraie r&eacute;volution pour
l'&eacute;thique et pour le syst&egrave;me l&eacute;gal et
cr&eacute;erait un syst&egrave;me de contr&ocirc;le sans
pr&eacute;c&eacute;dent. Ces syst&egrave;mes n'arrivent pas par hasard;
ils sont le r&eacute;sultat d'une volont&eacute; et d'un but non
avou&eacute;. C'est ce but que nous devons rejeter. <br>
<br>
<br>
Copyright 2002 Richard Stallman. La reproduction mot pour mot et la
distribution de l'int&eacute;gralit&eacute; de cet article (NdT: et de
cette traduction) sont permises sans royalties sur quelque support que
ce soit &agrave; condition que cette note soit pr&eacute;serv&eacute;e.<br>
<br>
Note de l'&eacute;diteur : Cet article est d'abord apparu dans le
nouveau livre de Richard Stallman, "<a
 href="http://www.gnu.org/doc/book13.html">Free Software, Free Society</a>".
C'est la premi&egrave;re fois que cet article appara&icirc;t en ligne
et Stallman a ajout&eacute; de nouvelles remarques.<br>
</p>
<br>
<table>
<tr>
<td>
 <A HREF="#a"<font color="#FF0000"><h5>haut de page</font></h5></A>
</td>
<td>
<img src="images/bar2.gif">
</td>
</tr>
</table>
<br>





<p>Pour en savoir plus :<br>
</p>
<ul>
  <li><a
 href="http://www.lemonde.fr/article/0,5987,3244--305691-,00.html">Un
article du Monde</a></li>
</ul>
<p> </p>
<ul>
</ul>
<ul>
  <li><a
 href="http://www.linux-nantes.fr.eu.org/article.php3?id_article=76">DRM,
DMCA, TCPA, Palladium, Fritz chip, ...<br>
    </a></li>
</ul>
<ul>
  <li><a
 href="http://www.linux-nantes.fr.eu.org/article.php3?id_article=76">article
de warpbackspin sur Deviantart.com</a></li>
  <li><a
 href="http://solutions.journaldunet.com/0209/020910_palladium.shtml">(analyse
de cet article) : Microsoft pourra-t-il prendre le contr&ocirc;le des
PC &agrave; distance ?</a></li>
</ul>
<ul>
  <li><a
 href="http://www.linux-nantes.fr.eu.org/article.php3?id_article=76">Microsoft
Palladium (en anglais) </a></li>
</ul>
<ul>
  <li><a href="http://www.deplaine.com/article.php3?id_article=57">Palladium,
le &laquo;&nbsp;big&nbsp;&raquo; projet s&eacute;curit&eacute;         </a></li>
</ul>
<ul>
</ul>
<ul>
  <li><a href="http://www.vnunet.fr/actu/article.htm?numero=9837"><span
 class="titractu">Palladium, la nouvelle strat&eacute;gie
s&eacute;curitaire...</span></a></li>
</ul>
<ul>
  <li><a
 href="http://www.ixus.net/modules.php?name=News&amp;file=article&amp;sid=428">une
inspection de vos ordinateurs &agrave; vos d&eacute;pens</a></li>
</ul>
<ul>
</ul>
<a href="http://www.vnunet.fr/actu/article.htm?numero=9837"><span
 class="titractu"></span></a> Quelques liens pour illustrer la
r&eacute;alit&eacute; de la chose :<br>
<ul style="font-weight: bold;">
  <li><a href="http://linuxfr.org/2003/01/10/10927.html">Le premier
bios TCPA/Palladium</a></li>
</ul>
<ul>
</ul>
<ul>
  <li><a href="http://forum.hardware.fr/forum2.php3?post=15775&amp;cat=11">Un
exemple concret et actuel de DRM</a> et <a
 href="http://linuxfr.org/2002/10/07/9882.html">la nouvelle
correspondante sur linuxfr</a></li>
</ul>
<ul>
  <li><a href="http://news.zdnet.fr/story/0,,t118-s2124221,00.html"><span
 class="titractu">Aussi avec les t&eacute;l&eacute;phones portables !!</span></a></li>
</ul>
<ul>
  <li><a href="http://www.mobipocket.com/fr/Publisher/drmoverview.asp"><span
 class="titractu"></span></a><a
 href="http://www.mobipocket.com/fr/Publisher/drmoverview.asp">Un
exemple pour les livres &eacute;lectroniques</a><br>
  </li>
</ul>
Quelques petites fictions pour vous mettre en app&eacute;tit :<br>
<ul>
  <li><a href="http://www.gnu.org/philosophy/right-to-read.fr.html"
 class="spip_out">Le droit de lire, par Richard Stallman</a></li>
</ul>
<ul>
  <li><a href="http://olivier.rioland.free.fr/linux.php3?sujet=alien"
 class="spip_out">Alien Nation par N. Boulay</a></li>
</ul>
<ul>
  <li><a href="http://www.uzine.net/article138.html" class="spip_out">Lettre
de 2020 par M.&nbsp;Summerfield</a></li>
</ul>
<br>
<table>
<tr>
<td>
 <A HREF="#a"<font color="#FF0000"><h5>haut de page</font></h5></A>
</td>
<td>
<img src="images/bar2.gif">
</td>
</tr>
</table>
<br>

Merci aux relecteurs qui m'ont aid&eacute;.<br>
Pour tout commentaire, conseil, question sur cette page, vous pouvez
contacter <a
 href="mailto:ccomb%7Barobazz%7Dfree.fr?subject=%5BTCPA_Stallman%5D">Christophe
Combelles<br>
</a><br>
<a href="mailto:fillide%7Barobazz%7Dnordnet.fr">Fabien Illide</a> a
aussi fait une <a
 href="http://clx.anet.fr/spip/article.php3?id_article=142">traduction</a>.<br>
<a href="mailto:v.gay%7Barobazz%7Daravissimo.com">Vincent Gay</a> a
aussi fait une <a
 href="http://salug.tuxfamily.org/modules.php?name=News&amp;file=article&amp;sid=255">traduction</a>.<br>
<a href="mailto:m.piaumier%7Barobazz%7Dadullact.org">Matthieu Piaumier</a>
a aussi fait une <a
 href="http://www.adullact.org/article.php3?id_article=69">traduction</a><br>
(Et on s'est tous pomp&eacute; les uns sur les autres pour
am&eacute;liorer nos traductions, ce qui est une bonne chose, et une
bonne illustration du mod&egrave;le du "<a
 href="http://www.linux-france.org/article/these/cathedrale-bazar/cathedrale-bazar.html">bazar</a>")<br>
<br>
<br>
</body>
</html>
