@DATABASE opium.newmail.ru:666/24s.htm
@WORDWRAP

@NODE MAIN
@TITLE " Ave Satanas..."
 
   @{" " link "23s.guide/MAIN"}@{"../pau.gif" link "../pau.gif/MAIN"}
Назад    Черная Библия "Книга Левиафана
 (Вода)"    @{" " link "25s.guide/MAIN"}@{"../pau0.gif" link "../pau0.gif/MAIN"}
Дальше 

Енохианские Ключи 


&nbsp;Магический язык, используемый в сатанинском ритуале - енохианский* язык, считающийся более древним, сем санскрит**, имеет солидную грамматическую и синтаксическую основу. Некоторыми своими звуками он сходен с арабским, а также с древнееврейским и латынью. В печатном виде появился впервые в 1659 году в биографии Джона Ди, известного ясновидца и придворного астролога шестнадцатого века. Этот труд, написанный Мериком Касобоном, отображает оккультную деятельность Ди и его партнера, Эдварда Келли в искусстве прорицания и гадания по кристаллу. 
 ---


&nbsp;Сноска: * Ди и Келли дали языку такое название в честь библейского патриарха Еноха, который по преданиям "ходил с Богом".
 ** Происхождение енохианского языка до сих пор не известно. Учение Ордена Золотой Зари утверждает, что это - архаичный язык, отголоски которого прослеживаются в священных и тайных мистериях древнейших религий всего мира. Обрывки его найдены на глиняных табличках и развалинах древних храмов. Однако существуют серьезные сомнения, что он когда-либо был устным. Скорее всего он являл собой систему знаков и символов. Согласно дневнику Ди, енохианский язык был сообщен его партнеру Келли во время магических сеансов с ангелом, который сам несколько опасался магической силы этого языка, что указывал имена и слова задом наперед и не произносил их вслух дабы не вызвать появления нежеланных демонов. 

&nbsp;Вместо обычного хрустального шара Келли пользовался при прорицании многогранным трапециогедроном. "Ангелы", на которых ссылается Келли в первом откровении енохианских ключей, увиденные им сквозь грани кристалла, - всего лишь "ангелы", поскольку оккультисты и по сей день лежмя лежат страдая метафизическим запором. Ныне же, кристалл проясняется и "ангелы" воспринимаются как "индивидуальные точки зрения"*, распахнутые окна в четвертое измерение, являющие собой Врата Преисподней для людей, охваченных страхом. 
 ---


&nbsp;Сноска: * В оригинале имеется в виду похожесть английских слов ANGELS (ангелы) и ANGLES (в данном контексте - точки зрения). Однако стоит отметить, что одним из основных положений енохианской магии является разделение Вселенной на четыре квадранта, или угла (англ-ANGLE) четырех основных стихий. 

&nbsp;Я представляю свой перевод приведенных ниже воззваний, архаичный, но истинно сатанинский в той мере, в какой он снимает позолоту с перевода, коим пользовался в конце девятнадцатого века Орден Золотой Зари. В енохианском языке, значения слов, сочетающиеся с их звуковой характеристикой, объединяются, создавая звуковые последовательности, способные вызвать сильнейшие реакции в магической атмосфере. Варварские тональные характеристики этого языка наделяют его истинно волшебным эффектом, не поддающимся описанию**. 
 ---


&nbsp;Сноска: ** Существенным упущением Ла Вея является то, что он не приводит правил произношения енохианских слов. Поскольку оно значительно отличается от написания в английском эквиваленте, переводчик счел необходимым привести алфавит (см. ниже) и правила произношения енохианского языка, согласно версии Элистера Краули и Ордена Золотой Зари. 

Произношение 

Десять главных правил енохианского языка: 

1. К большинству согласных прибавляется звук "е" или "ех". Например, B произносится как "бех", K - как "ке" или "кех" и так далее. 

2. К большинству гласных прибавляется звук "х", например A произ-носится как "ах". 

3. Енохианские слова произносятся нараспев, например, слово SOBHA произносится "сох-бех-хах". 

4. Буква G может произноситься как "г" или "й". 

5. Буквы Y и I взаимозаменяемы, также как буквы V и U. Буквы J и W используются очень редко. 

6. Буква X произносится как "с" или "ц". 

7. Буква S произносится как "эсс" или "сех". 

8. Буква R произносится как "рах", "рех" или "ар". 

9. Буква Z произносится как "зод" или "зех". Она взаимозаменяема с буквой S. 

10.Гласная I произносится как длинный звук "и". Правильное произношение имен богов, духов и т.д. оказывает большое влияние на успех магической церемонии. Слоги произносятся текуче и поэтически, редко произносятся резкие и хриплые звуки. 

Вот уже много лет енохианские ключи, или Воззвания, были окружены покровом тайны. Немногие, до сих пор существующие печатные копии, дают в корне неправильные формулировки, поскольку истинный перевод был искажен в результате использования эвфемизмов и годятся разве что только для того, чтобы сбить с толку неопытного чародея и/или людей возжелавших стать инквизиторами. И даже в том недостоверном виде, который они обрели (а кто может сказать, какая мрачная действительность пробуждает к жизни "фантазию"), енохианские Воззвания представляют собой гимны сатанинской веры. Отказавшись от некогда служившего практическим целям отбеливания такими выражениями, как, например, "священный" или "ангельский" и от произвольно выбранных групп номеров, служивших заменителями "богохульных" слов, я представляю ИСТИННЫЕ* енохианские воззвания в том виде, в котором мне их вручила неведомая рука. 
 ---


Сноска: * На самом деле, енохианские ключи, представленные далее, являются слегка измененными версиями ключей и их переводов Элистера Краули. Так, например, в некоторых местах Ла Вей заменяет енохианское IAIDA (Всевышний) на SAITAN (Сатана, Король Ада), вольно трактует понятия PEIAD (Бог у краули, Сатана у Ла Вея), изменяет некоторые цифры (так, например, в третьем ключе в переводе Краули говорится о 456 истинных эпохах, у Ла Вея же - о 9 веках), опускает все даваемые Краули номера и т.д. Следует также отметить, что девятнадцатый ключ у Краули выделен особо и имеет собственное название - "Зов или Ключ к Тридцати Эфирам". 

@{"b"}КЛЮЧ ПЕРВЫЙ@{"ub"} 

Первый енохианский ключ представляет собой изначальное воззвание Сатаны, излагающее начало законов мирских теологических учений и несокрушимой силы, свойственной тем, кто достаточно смел, чтобы признать земные начала и абсолюты. 

Ol sonuf vaoresaji, gohu IAD Balata, elanusaha caelazod: sobrazod-ol Roray i ta nazodapesad, Giraa ta maelpereji, das hoel-qo qaa notahoa zodimezod, od comemahe ta nobeloha zodien; soba tahil ginonupe pereje aladi, das vaurebes obolehe giresam. Casarem ohorela caba Pire: das zodonurenusagi cab: erem ladanahe. 

Pilahe farezodem zodenurezoda adama gono ladapiel das home-tone: 
soba ipame lu ipamus: das sobolo vepe zodomeda poamal, od bogira aai ta piape Piamoei od Vaoah! Zodacare, eca, od zodameranu! odo cicale Qaa; zodoreje, lape zodiredo Noco Mada, hoathahe Saitan! 

"Я правлю вами", - говорит Бог Земли, - "властью, вознесенной с земли до небес, в чьих руках солнце - сверкающий меч, а Луна - пронзающее пламя; ваши одежды находятся средь моих одеяний, власть эта связывает вас воедино, как ладони моих рук и озаряет ваши деяния светом Преисподней. 

Я учредил для вас закон, управляющий святыми, и передал вам жезл в своей высочайшей мудрости. Вы возвысили свои голоса и присягнули Ему - тому, кто живет, торжествуя, у кого не ни начала, ни конца и быть не может; тому, кто сияет как пламя посреди ваших дворцов и правит средь вас, как жизненное равновесие. 

Посему же, покажись немедленно! Открой тайны своего творения! Будь ко мне благосклонен, ибо я равен тебе! - истинный почи-татель высочайшего и несравненного Короля Ада! 

@{"b"}КЛЮЧ ВТОРОЙ@{"ub"} 

Имея целью воздать почтение тем самым вожделениям, которые обеспечивают продолжение самой жизни, второй енохианский ключ простирает это признание нашего земного наследия на талисман власти. 

Adagita vau-pa-ahe zodonugonu fa-a-ipe saladai Vi-i-vau el! Sobame ial-pereji i-zoda-zodazod pi-adapehe casarema aberameji ta ta-labo paracelada qo-ta lores-el-qo turebesa ooge balatohe! Giui cahisa lusada oreri od micalapape cahisa bia ozodonugonui lape noanu tarofe coresa tage o-quo maninu IA-I-DON. Torezodu! gohe-el, zodacare eca ca-no-quoda! zodameranu micalazodo od ozadazodame vaurelar; lape zodir IOIAD! 

Способны ли крылья ветров донести ваши чудесные голоса? О, вы! Великое отродье червей земных! Кого адское пламя порождает в глубинах пасти моей! Кого я приготовил быть чашами на свадьбе или цветами, украшающими спальни вожделения! 

Ваши ноги крепче камней, на которых ничего не растет! Ваши голоса сильнее любых ветров! Поскольку вы подобны зданию, равное коему существует разве что в разуме Всемогущественного правителя Сатаны! 

"Восстань!" - говорит Владыка! Посему, слейтесь с его слугами! Покажите себя во власти и сделайте меня могущественным прорицателем, поскольку я принадлежу Ему, живущему вечно! 

@{"b"}КЛЮЧ ТРЕТИЙ@{"ub"} 

Третий енохианский ключ утверждает власть над землей, находящуюся в руках тех сатанинских чародеев, что веками правили народами мира. 

Micama! goho Pe-IAD! zodir com-selahe azodien biabe os-lon-dohe. Norezodacahisa otahila Gigipahe; vaunud-el-cahisa ta-pu-ime qo-mos-pelehe telocahe; qui-i-inu toltoregi cahisa i cahisaji em ozodien; dasata beregida od torezodul! Ili el-Ol balazodareji, od aala tahilanu-os netaabe: daluga vaomesareji elomusa cape-mi-ali varoesa cala homila; cocasabe fafenu izodizodope, od miinoagi de ginetaabe: vaunu na-na-e-el: panupire malapireji caosaji. Pilada noanu vaunalahe balata od-vaoan. Do-o-i-ape mada: goholore, gohus, amiranu! Micama! Yehusozod ca-ca-com, od do-o-a-ihu noari micaolazoda a-ai-om. Casarameji gohia: Zodacare! Vaunigilaji! od im-ua-mar pugo pelapeli Ananael Qo-a-an. 

"Смотри!" - говорит Сатана, - "я - круг, на чьих руках стоят двенадцать царств. Шесть из них - источники животворного дыхания, остальные подобны острым серпам или Рогам Смерти. И, поэтому существа земные либо живут, либо мертвы лишь в моих собственных руках, что спят, но восстанут ото сна! 

С самого начала я сделал вас своими управляющими и разместил вас в двенадцати правительственных местах, наделив каждого из вас властью на период в девять веков истинного времени для того, чтобы из высочайших сосудов и уголков своих правительств вы могли претворять в жизнь мою мощь, неустанно изливая на землю пламя жизни и плодородия. Посему, вы стали мерилом справедливости и истины. Во имя Сатаны, восстаньте! Покажитесь! Смотрите! Его милости множатся и имя Его обрело среди нас силу. От имени его мы провозглашаем: "Давайте же, вознеситесь! И обратитесь в своем созидании на нас, как посвященных в его тайную мудрость!" 

@{"b"}КЛЮЧ ЧЕТВЕРТЫЙ@{"ub"} 

Четвертый енохианский ключ рассказывает о цикличности веков, составляющих время. 

Otahil elasadi babaje, od dorepaha gohol: gi-cahisaje auauago coremepe peda, dasonuf vi-vau-di-vau? Casaremi oeli meapeme sobame agi coremepo carep-el: casaremeji caro-o-dazodi cahisa od vaugeji; dasata ca-pi-mali cahisa ca-pi-ma-on: od elonusahihu cahisa ta el-o calaa. Torezodu nor-quasahi od fe-caosaga: Bagille zodir e-na-IAD: das iod apila! Do-o-a-ipe quo-A-Al, zodacare! Zodameranu obelisonugi resat aaf normo-lapi! 

Я вступил на Юг и, осмотревшись, молвил: "Не во втором ли углу правят нарастающие громоподобные раскаты? 

Те, в чью власть я вверил тех, кого еще никто не был способен счесть, за исключением Единственного; в ком вторые начала существуют и крепчают, последовательно добавляя временные суммы; силы их воистину стоят первыми среди девяти. 

Восстаньте! Сыны удовольствия и посетите Землю; ибо я - Господь, ваш Бог, который есть и будет вечно! 

Во имя Сатаны, давайте же! Покажите себя дарующими удовольствия, так, чтобы восславить вы могли Его среди сынов человеческих! 

@{"b"}КЛЮЧ ПЯТЫЙ@{"ub"} 

В пятом енохианском ключе дается подтверждение тому, что Сатана был прав, утверждая, что священники и чародеи традиционных религий находятся на этой земле лишь с целью введения людей в заблуждение. 

Sapahe zodimii du-i-be, od noasa ta qu-a-nis, adarocahe dorepehal caosagi od faonutas peripesol ta-be-liore. Casareme A-me-ipezodi na-zodaretahe afa; od dalugare zodizodope zodelida iao-d tahilada das hubare pe-o-al; soba coremefa cahisa ta Ela caosaji tol-toregi; od zod-cahisa esiasacahe ei ta-vi-vau od Vaulasa od Quo-Co-Casabe. Eca niisa od darebesa quo-a-asa: fetahe-ar-ezodi od beliora: ia-ial eda-nasa cicalesa; bagile Ge-iad I-el! 

Громовые звуки проникли в третий угол и стали подобны саженцам глупости. С улыбкой, преисполненной презрения к земному, живя в лучезарности небес, они стали неустанными утешителями для разрушающих самих себя. 

Боги правоверных; те, кому я даровал столпы радости и дал сосуды для орошения Земли ее существами. Они - братья Первого и Второго начала своих собственных владений, украшенных мириадами неугасимых лампад, их числа подобны числам Первого, концов и содержимому времени! 

Посему, идите и повинуйтесь своему творению. Посетите нас в мире и спокойствии. Считайте, что мы принимаем ваши тайны; и в самом деле? Наш Бог и Господин - Всеединый! 

@{"b"}КЛЮЧ ШЕСТОЙ@{"ub"} 

Шестой енохианский ключ утверждает структуру и форму того, что стало Орденом Трапеции и Церковью Сатаны. 

Gahe sa-div cahisa em, micalazoda Pil-zodinu, sobam El haraji mir babalonu od obeloce samevalaji, dalagare malapereji ar-caosaji od acame canale, sobola, zodare fa-beliareda caosaji od cahisa aneta-na miame ta Viv od Da. Daresare Sol-petahe-bienu. Be-ri-ta od zodacame ji-mi-calazodo: sob-ha-atahe tarianu luia-he od ecarinu MADA Qu-a-a-on! 

Духов четвертого угла - девять, могучих духов Трапеции, созданных первыми, чтобы быть пыткой для всех жалких и венцом для нечестивых; он дал им огненные стрелы, дабы ими они усыпали землю; эти неустанные работники, что на своем пути делают остановку на земле, неся ей успокоение, в управлении и постоянстве они - Второй и Третий. 

Посему, прислушайтесь к голосу моему! Я рассказал о вас и ввожу вас во власть и присутствие, чьи труды будут песнью почета и хвалой Богу вашему в вашем творении! 

@{"b"}КЛЮЧ СЕДЬМОЙ@{"ub"} 

Седьмой енохианский ключ используется для того, чтобы вызвать похоть, свидетельствовать почтение очарованию и радоваться удовольствиям плоти. 

Ra-asa isalamanu para-di-zoda oe-cari-mi aao iala-pire-gahe Qui-ihu. Enai butamonu od inoasa ni pa-ra-diala. Casaremeji ujeare cahirelanu, od zodonace lucifatianu, caresa ta vavale-zodirenu tol-hami. Soba lonudohe od nuame cahisa ta Da o Desa vo-ma-dea od pi-beliare itahila rita od miame ca-ni-quola rita! Zodacare! Zodameranu! Iecarimi Quo-a-dahe od I-mica-ol-zododa aaiome. Bajirele papenore idalugama elonusahi-od umapelifa vau-ge-ji Bijil -IAD! 

Восток - это обиталище блудниц, поющих хвалебные песни среди огней, горящих во славу Первого, в том месте, где Темное Божество отвергло свои уста; и стали они подобны живым домам, где ликует сила мужская; и украшены они яркими нарядами; подобные тем, что всех существ они обращают в чудо. Они в царствах своих и нескончаемости своей - Третий и Четвертый, крепкие башни и места покоя, обители удовольствия и продолжения. О, вы, слуги удовольствия, давайте же! Появитесь! Воспойте хвалебные песни и слейтесь с нами в мощи своей! Поэтому сему повиновению придается сила, и сила наша нарастает в нашем утешителе. 

@{"b"}КЛЮЧ ВОСЬМОЙ@{"ub"} 

В восьмом енохианском ключе говорится о наступлении Сатанинской Эры. 

Micaoli beranusaji perejela napeta ialapore, das barinu efafaje Pe vaunupeho olani od obezoda, soba-ca upaahe cahisa catanu od tarananu balie, alare busada so-bolunu od cahisa hoel-qo ca-no-quodi cial. Vaunesa aladonu mom caosago ta iasa olalore gianai limelala. Amema cahisa sobra madarida zod cahisa! Ooa moanu cahisa avini darilapi caosajinu: od butamoni pareme zodumebi canilu. Dazodisa etahamezoda cahisa dao, od mireka ozodola cahisa pidiai Colalala. Ul ci ninu a sobame ucime. Bajile? IAD BALATOHE cahirelanu pare! NIISO! od upe ofafafe; bajile a-cocasahe icoresaka a uniji beliore. 

"Полдень Первого - третья индульгенция, сотворенная из гиацинтовых столпов, где крепнут старейшины, - те, коих подготовил я для отправления моего собственного правосудия", - говорит Сатана, чей долгий век будет подобен щитам для Левиафана. Сколько же их, остающихся во славе земли, которые есть и не увидят смерть до тех пор, пока дом не падет и дракон не уйдет на дно? Возрадуйтесь! Ибо короны храма и одеяния Его, что был, есть и будет коронован, уже более не разделимы! Выйди! Появись ! На ужас земле и во успокоение подготовленным! 

@{"b"}КЛЮЧ ДЕВЯТЫЙ@{"ub"} 

Девятый енохианский ключ предостерегает от использования субстанций, средств и фармацевтических препаратов, могущих ввес-ти в заблуждение и последующее порабощение их владельца. Это - защита от фальшивых ценностей. 

Coraxo cahisa coremepe, od belahusa Lucada azodiazodore paebe Soba iisononu cahisa uirequo ope copehanu od racalire maasi bajile caosagi; das yalaponu dosiji od basajime; od ox ex dazodisa siatarisa od salaberoxa cynuxire faboanu. Vaunala cahisa conusata das daox cocasa ol Oanio yore vohima ol jizod-yazoda od eoresa cocasaji pelosi molui das pajeipe, laraji same darolanu matorebe cocasaji emena. El pataralaxa yolaci matabe nomiji mononusa olara jinayo anujelareda. Ohyo! ohyo! noibe Ohyo! caosagonu! Bajile madarida i zodirope cahiso darisapa! NIISO! capire ipe nidali! 

Могучая огненная гвардия с пламенными обоюдоострыми мечами (содержащими сосуды заблуждения, крылья же их - из полыньи и чистейшей соли) обосновалась на Западе; число их равно числу, служащим им. Они собирают мох земной, как богач собирает свои богатства. Прокляты те, кто одержим их пороками! В глазах их - жернова, крупнее чем Земля, изо ртов их вытекают моря крови. Мозги их усыпаны бриллиантами, а на головах их - куски мрамора. Счастлив тот, на кого не устремлен их неодобрительный взгляд. И, почему? Бог праведности ликует в них! Уходите же и оставьте свои сосуды, ибо пришло время, требующее покоя! 

@{"b"}КЛЮЧ ДЕСЯТЫЙ@{"ub"} 

Десятый енохианский ключ порождает неудержимый гнев и вызывает насилие; если вам неизвестно, как обеспечить свою собственную безопасность, это - молния, поражающая без разбора! 

Oxiayala holado, od zodirome O coraxo das zodialadare raasyo. Od vabezodire cameliaxa od bahala: NIISO! Salarnanu telocahe! Casaremanu hoel-qo, od ti ta zod cahisa soba caremefa i ga. NIISA! bagile aberameji nonucape. Zodacare eca od Zodameranu! odo cicale Qaa! Zodoreje, lape zodiredo Noco Mada, noathahe Saitan! 

На Севере спят громовые раскаты гнева, подобные дубу, ветви коего - наполненные навозом логова горя и плача, доставшиеся в удел земле; они горят днем и ночью и изрыгают головы скорпионов и кипящую серу, смешанную с ядом. Это - громы, в один момент разражающиеся с грохотом сотен страшных землетрясений и такой же тысячей шквалов, которые не стоят на месте и не знают никаких временных ограничений. Одна скала порождает тысячу подобно тому, как сердце человека порождает его мысли. Горе! Горе! Да, горе земле, ибо беззакония ее есть и были великими! Выйдите! Но пусть останутся ваши громогласные звуки! 

@{"b"}КЛЮЧ ОДИННАДЦАТЫЙ@{"ub"} 

Одиннадцатый енохианский ключ используется для возвещения прихода мертвых и для поддержания жизни после смерти. Для того, чтобы связать земными узами Похоронный зов. 

Nonuci dasonuf Babaje od cahisa ob hubaio tibibipe: alalare ataraahe od ef! Darix fafenu mianu ar Enayo ovof! Soba dooainu aai i VONUPEHE. Zodacare, gohusa, od Zodameranu. Odo cicale Qaa! Zodoreje, lape zodiredo Noco Mada, hoathhe Saitan! 

Из могучего трона донеслись раскаты грома и пять грозовых туч полетели на Восток. Орел обрел дар речи и воскликнул: "Выходите из дома смерти!" И собрались они вместе и обрели меру; они - те бессмертные, что оседлали ураганы. Выйдите же! Потому что я приготовил для вас место, - посему, покажитесь! Сбросьте пелену с тайн своего сотворения! Будьте ко мне благосклонны ибо я - ваш Бог, истинный почитатель плоти, живущей вечно! 

@{"b"}КЛЮЧ ДВЕНАДЦАТЫЙ@{"ub"} 

Использование двенадцатого енохианского ключа дает выход вашему недовольству по отношению к людской потребности в несчастьях и приносит страдания и несчастья предвестникам горя. 

Napeai Babajehe das berunu vax ooaona larinuji vonupehe doalime: 

conisa olalogi oresaha das cahisa afefa. Micama isaro Mada od Lonu-sahi-toxa, das ivaumeda aai Jirosabe. Zodacare od Zodameranu. Odo cicale Qaa! Zodoreje, lape zodiredo Noco Mada, hoathahe Saitan! 

О, вы, обитающие на Юге, светочи горя, застегните свои доспехи и посетите нас! Приведите легионы армии Ада, дабы Бог Преисподней, имя которому среди вас - Гнев, был возвеличен! Посему, покажитесь же! Откройте тайны вашего творения! Будьте ко мне благосклонны, ибо я такой же, как вы, истинный почитатель высочайшего и несравненного Короля Ада! 

@{"b"}КЛЮЧ ТРИНАДЦАТЫЙ@{"ub"} 

Использование тринадцатого енохианского ключа делает бесплодных похотливыми и доставляет неприятности тем, кто отвергает сексуальные удовольствия. 

Noroni bajihie pasahasa Oiada! das tarinuta mireca ol tahila dodasa tolahame caosago homida: das berinu orocahe quare: Micama! Bial! Oiad; aisaro toxa das ivame aai Balatima. Zodacare od Zodameranu! Oda cicale Qaa! Zodoreje, lape zodiredo Noco Mada, hoathahe Saitan! 

О, вы, мечи Юга, имеющие глаза, способные раздувать ярость греха, опьяняющего пустых внутри людей; лицезрейте! Обещание Сатаны и Его силы, зовущейся промеж вас мучительной болью! Появитесь же! Откройте тайны вашего сотворения! 

Ибо я служу тому же, кому и вы, вашему Богу, я - истинный почитатель высочайшего и несравненного Короля Ада! 

@{"b"}КЛЮЧ ЧЕТЫРНАДЦАТЫЙ@{"ub"} 

Четырнадцатый енохианский ключ - призыв к отмщению и проявлению справедливости. 

Ilasa! tabaanu li-El pereta, casaremanu upaahi cahisa dareji, das oado caosaji oresacore: das omaxa monasaci Baeouibe od emetajisa Iaiadix. Zodacare od Zodameranu! Odo cicale Qaa. Zodoreje, lape zodiredo Noco Mada, hoathahe Saitan! 

О, вы, сыны и дочери заплесневелых умов, разбирающие мои беззакония - смотрите! Голос Сатаны; обещание Его, зовущееся про-меж вас обвинителем и верховным судией! Появитесь же! Откройте тайны вашего сотворения! Будьте ко мне благосклонны, ибо я - такой же как вы - истинный почитатель высочайшего и несравненного Короля Ада! 

@{"b"}КЛЮЧ ПЯТНАДЦАТЫЙ@{"ub"} 

Пятнадцатый енохианский ключ - это решение понимать и принимать магистров, чей долг состоит в оказании содействия тем, кто ищет духовных богов. 

Ilasa viviala pereta! Salamanu balata, das acaro odazodu busada, od belioraxa balita: das inusi caosaji lusadanu emoda: das ome od taliobe: darilapa iehe ilasa Mada Zodilodarepe. Zodacare od Zodameranu! Odo cicale Qaa! Zodoreje, lape zodiredo Noco Mada, hoathahe Saitan! 

О, ты, владыка первого пламени, под чьими крыльями прялки, оплетающие землю сухой паутиной; знающий великое слово "справедливость" и клеймо фальшивого почета. Появись же! Открой тайны своего сотворения! Будь ко мне благосклонен, ибо я - такой же как ты - истинный почитатель высочайшего и несравненного Короля Ада! 

@{"b"}КЛЮЧ ШЕСТНАДЦАТЫЙ@{"ub"} 

Шестнадцатый енохианский ключ признает чудесные контрасты земли и то, что поддерживает это разнообразие. 

Ilasa dial pereta! Soba vaupaahe cahisa nanuba zodixalayo dodasihe od berinuta faxisa hubaro tasataxa yolasa: soba Iad i Vonupehe o Uonupehe: aladonu dax ila od toatare! Zodacare od Zodameranu! Odo cicale Qaa! Zodoreje, lape zodiredo Noco Mada, hoathahe Saitan! 

О, ты, второе пламя, дом правосудия, берущее свои начала во славе, несущее успокоение праведным; ступающее по земле огненными ногами, принимающее и разделяющее существа. Велико ты в протягивающем руку и побеждающем Боге. Появись же! Будь ко мне благосклонно, ибо я такой же как ты - истинный почитатель высочайшего и несравненного Короля Ада! 

@{"b"}КЛЮЧ СЕМНАДЦАТЫЙ@{"ub"} 

С помощью семнадцатого енохианского ключа проливается свет закостеневшим в своих заблуждениях людям и уничтожается посредством откровения. 

Ilasa micalosoda olapireta ialpereji beliore: das odo Busadire Oiad ouoaresa: casaremeji Laiada eranu berinutasa cafafame das ivemeda aqoso adoho Moz, od maoffasa. Bolape como belioreta pamebeta. Zodacare od Zodameranu! Odo cicale Qaa! Zodoreje, lape zodiredo Noco Mada, hoathahe Saitan! 

О, ты, третье пламя, чьи крылья - шипы, вызывающие беспокойство, мириады живых ламп шествуют пред тобою; Бог твой яростен во гневе - препоясай свои чресла и слушай! Покажись же! Будь ко мне благосклонен, ибо я такой же как ты - истинный почитатель высочайшего и несравненного Короля Ада! 

@{"b"}КЛЮЧ ВОСЕМНАДЦАТЫЙ@{"ub"} 

Восемнадцатый енохианский ключ открывает врата в Ад и вызывает Люцифера с его благословением. 

(В книге текст 18 ключа совпадает с 17 ключем - Op.) 

О, ты, ослепительный свет и горящий камень успокоения! Раскрывающий славу Сатаны до самого центра земли, в ком живут великие секреты истины; именуемый в твоем царстве "силой через радость" и неизмеримый. Будь для меня окном успокоения. Покажись же! Открой тайны своего сотворения! Будь ко мне благосклонен, ибо я такой же как ты - истинный почитатель высочайшего и несравненного Короля Ада! 

@{"b"}КЛЮЧ ДЕВЯТНАДЦАТЫЙ@{"ub"} 

Девятнадцатый енохианский ключ - это великая опора естественного земного равновесия, закон процветания, закон джунглей. Он обнажает все лицемерие, и ханжи под его влиянием непременно становятся рабами. На убогих он навлекает сильнейшую волну гнева и закладывает фундамент успеха для тех, кто любит жизнь. 

Madariatza das perifa LIL cahisa micaolazoda saanire cosago od fifisa balzodizodarasa Iaida. Nonuca gohulime: Micama adoianu MADA faoda beliorebe, soba ooaona cahisa luciftias peripesol, das aberaasasa nonucafe netaaibe caosaji od tilabe adapehaheta damepelozoda, tooata nonucafe jimicalazodoma larasada tofejilo marebe yareyo IDOIGO, od torezodulape yaodafe gohola, Caosaga, tabaoreda saanire, od caharisateosa yorepoila tibela busadire, tilabe noalanu paida oresaba, od dodaremeni zodayolana. Elazodape tilaba paremeji peripesatza, od ta qurelesata booapisa. Lanibame oucaho sayomepe, od caharisateosa ajitoltorenu, mireca qo tiobela lela. Tonu paomebeda dizodalamo asa pianu, od caharisateosa aji-la-tore-torenu paracahe a sayomepe. Coredazodizoda dodapala od fifalazoda, lasa manada, od faregita bamesa omaosa. Conisabera od auauotza tonuji oresa; catabela noasami tabejes a leuitahemonuji. Vanucahi omepetilabe oresa! BagileЖ Moooabe OL coredazodizoda. El capimao itzomatzipe, od cacocasabe gosaa. Bajilenu pii tianuta a babalanuda, od faoregita teloca uo uime. 

Madariatza, torezodu !!! Oadariatza orocaha aboaperi! Tabaori 

periazoda aretabasa! Adarepanu coresata dobitza! Yolacame 

peeriazodi arecoazodiore, od quasabe qotinuji Ripirpaatzata 

sagacore! Umela od peredazodare cacareji Aoiveae coremepeta! Torezodu! Zodacare od Zodameranu, asapeta sibesi butamona das surezodasa Tia balatanu. Qaa, od Ozodazodama pelapeli IADANAMADA! 

О, вы, удовольствия, обитающие в первом воздухе, вы могучи во всех краях земли и исполняете повеление сильных. Сказано вам: 

"Созерцайте лик Сатаны, начало успокоения; глаза его блестят как звезды; он поставил вас править землею и ее невыразимым многообразием; наделив вас проницательностью, дабы вы распоряжались согласно провидению Его, сидящего на Троне Преисподней; кто поднял-ся в самом начале, сказав: "Земля, пусть правят тобою, разделив тебя на части; и пусть произойдет на ней разделение; слава же ее пускай несет в себе похмелье и горечь. Путь же ее пусть сопряжен будет с удовлетворением вожделений; подобно служанке будет служить она им. Одно время года будет свергать другое; и пусть ни на ней, ни в глубине ее ни одно из существ не будет равно другому. Разумные существа земли и род людской пусть ссорятся и истребляют друг-друга; и жилища их пускай забудут их имена. Деяния человеческие, то, чем он гордится, да подвергнутся порче. Строения его да превратятся в пещеры для зверей полевых! Помути рассудок ее тьмою! Да и в самом деле, почему? Я раскаиваюсь в том, что создал человека. Одного - с ее ведома, а другого - неведомого для нее; ибо она - ложе блудницы и обитель Короля Люцифера. 

Распахните врата Ада! Нижние небесные сферы да будут служить вам! Правьте теми, кто правит! Свергайте оступившихся. Возвеличивайте окрепших и уничтожайте слабых. Для них места нет, пусть останутся единицы. Добавляйте и убавляйте до тех пор, пока звезды не будут сочтены. Восстаньте! Давайте же! Предстаньте пред полученным из уст Его заветом, тем, что Он передал нам в справедливости своей. Откройте тайны вашего сотворения и разделите с нами НЕОСКВЕРНЕННУЮ МУДРОСТЬ. 
 ---

 ---

 ---

 ---

 ---

@endnode
