<html>
<body background="../images/fondtexte4.jpg">
<a name="a"></a>
<table>
<tr>
<td>

</td>
<td>
<font color="purple"><font size=5 face="helvetica"><a href="wallisetfutuna.html"target="description"><b>Pr&eacute;sentation de Wallis et Futuna</a> ()</font><br>

</td>
</tr>
</table>
<hr>
<br>


<a name="geo"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Histoire</font></font><font size=1 face="helvetica"> ( <a href="geowallisfutuna.html" target="description">G&eacute;ographie</a></font> <font size=1 face="helvetica"> - &eacute;conomie</font><font size=1 face="helvetica"> - Produits locaux</font><font size=1 face="helvetica"> - Enfants du pays - <a href="popuwallisfutuna.html" target="description">Population</a>)</font></a></STRONG><BR>
</font>
<br>


<br>

Peupl&eacute;e de Polyn&eacute;siens en provenance des Iles Tonga pour Wallis et des Samoa pour Futuna, les deux &icirc;les, visit&eacute;es par des navigateurs au 17&egrave;me si&egrave;cle, ne connaissent pas de pr&eacute;sence europ&eacute;enne notable avant le 19&egrave;me si&egrave;cle et l'implantation de missions catholiques. Les trois royaumes d Uv&eacute;a, d Alo et de Sigave signent un trait&eacute; de protectorat avec la France, ratifi&eacute; en 1887.<br>
Utilis&eacute;es par les Etats-Unis comme base avanc&eacute;e pendant la Seconde Guerre Mondiale, Wallis et Futuna choisissent de devenir Territoire d'Outre-mer par r&eacute;f&eacute;rendum en 1959. Le statut du territoire est fix&eacute; par la loi du 29 Juillet 1961.<br>
<br>
Br&egrave;ve histoire du peuplement de l'Oc&eacute;anie<br>
Les donn&eacute;es les plus r&eacute;centes de l'arch&eacute;ologie, associ&eacute;e &agrave; des recherches en linguistique et en g&eacute;n&eacute;tique, attestent que les migrations humaines de l Asie vers l Oc&eacute;anie se sont d&eacute;roul&eacute;es sur 50.000 ans.<br>
C est tout d abord, il y a 40.000 ans, l Australie qui accueille ses premiers habitants - les Aborig&egrave;nes d aujourd hui alors qu elle est encore soud&eacute;e &agrave; l actuelle Nouvelle-Guin&eacute;e. Le niveau de la mer &eacute;tant plus bas qu aujourd hui du fait de la p&eacute;riode glaciaire, de nombreuses portions de terre alors &eacute;merg&eacute;es permettaient la circulation des populations humaines, ainsi d ailleurs que des animaux et des plantes.<br>
<br>
<br>
<br>
S&eacute;par&eacute;e du continent australien au septi&egrave;me mill&eacute;naire avant notre &egrave;re, l actuelle Nouvelle-Guin&eacute;e accueille, il y a environ 10.000 ans, des cultivateurs de taros qui ont vraisemblablement introduit le porc dans la r&eacute;gion, &agrave; partir de leur lieu de dispersion, l Asie du sud-est.<br>
Les anc&ecirc;tres des Oc&eacute;aniens insulaires actuels ont, au cours des quatre derniers mill&eacute;naires, fait souche sur les divers archipels du Pacifique, encore vierges de toute pr&eacute;sence humaine. Ces migrants plus r&eacute;cents ont implant&eacute; leur civilisation de l Indon&eacute;sie &agrave; l &icirc;le de P&acirc;ques et jusqu &agrave; Hawa&iuml;. Ils appartiennent &agrave; une m&ecirc;me famille linguistique et culturelle, celle des Austron&eacute;siens, qui est aujourd hui r&eacute;partie en trois grands groupes g&eacute;ographiques dans le Pacifique : les Polyn&eacute;siens &agrave; l est, les Micron&eacute;siens au nord-ouest et, plus au sud, les M&eacute;lan&eacute;siens.<br>
<br>
Les institutions coutumi&egrave;res<br>
Une sp&eacute;cificit&eacute; du territoire : trois royaumes dans la R&eacute;publique.<br>
Si le territoire forme une entit&eacute; administrative, l organisation coutumi&egrave;re, respect&eacute;e par la R&eacute;publique, distingue trois royaumes :<br> celui d Uv&eacute;a &agrave; Wallis et ceux d Alo et de Sigave &agrave; Futuna qui se confondent avec les circonscriptions administratives.<br>
<br>
<br>
<br>
A Uv&eacute;a : le roi, ou LAVELUA, d&eacute;tenteur de l autorit&eacute; coutumi&egrave;re, est le chef de la hi&eacute;rarchie coutumi&egrave;re. Il est assist&eacute; d un Premier ministre (Kalae-Kivalu) et de cinq ministres : Mahe Fotuaika, charg&eacute; des relations ; Ului Monua, charg&eacute; de la mer ; Kulitea, charg&eacute; de la culture ; Fotua Tamai, charg&eacute; de la sant&eacute; ; Mukoi Fenua, charg&eacute; de l environnement.<br>
Le LAVELUA nomme sur proposition de la population, les chefs de district, appel&eacute;s " faipule " qui ont eux-m&ecirc;mes autorit&eacute; sur les chefs de village, les " Pule Kolo ". Ces derniers, qui peuvent lever les corv&eacute;es d int&eacute;r&ecirc;t g&eacute;n&eacute;ral, sont pl&eacute;biscit&eacute;s ou destitu&eacute;s au cours d assembl&eacute;es g&eacute;n&eacute;rales, dites " fono " qui ont lieu le dimanche dans une case commune appel&eacute;e " fale fono ".<br>
<br>
L &icirc;le d Uv&eacute;a comprend 21 villages r&eacute;partis en 3 districts :<br>
- Hihifo : Malae, Alele, Vaitupu, Vailala, Tufuone ;<br>
- Hahake : Liku, Akaaka, Mata-Utu (chef-lieu), Ahoa, Falaleu, Haafuasia ;<br>
- Mua : Lavegahau, Tepa, Haatofo, Gahi, Utufua, Malaefoon, Teesi, Kolopopo, Halalo, Vaimalau.<br>
<br>
&nbsp;A&nbsp;Futuna, l'&icirc;le est divis&eacute;e en deux royaumes : Sigave et Alo qui comprennent au total 15 villages :<br>
- Alo : Malae, Taoa, Ono, Kolia, Alofi, Po&iuml;, Vele, Tamana,&nbsp;Tuatafa ;&nbsp;<br>
- Sigave :&nbsp;Leava, Nuku, Vaisei, Fiua, Toloke, Tavai.<br>
<br>
Chaque roi est d&eacute;tenteur de l'autorit&eacute; coutumi&egrave;re pour son royaume.&nbsp;Le Tuiagaifo &agrave; Alo et le Keletaona &agrave; Sigave sont assist&eacute;s de 5 ministres appartenant &agrave;&nbsp;des&nbsp;villages diff&eacute;rents, d'un chef de c&eacute;r&eacute;monies et d'un chef de la police.<br>
Il est &agrave; noter que le roi de Sigave qui porte actuellement le titre de Keletaona, peut porter &eacute;galement celui de Tamolevai, Tuisigave ou Safoka, selon la famille &agrave; laquelle il appartient.<br>
Dans les deux royaumes, les chefs de villages sont d&eacute;sign&eacute;s par un conseil des anciens.<br>
<br>
 Statut<br>&nbsp;
La loi n&deg; 61-814 du 29 juillet 1961 "garantit aux populations du territoire le libre exercice de leur religion, ainsi que le respect de leurs croyances et de leurs coutumes&nbsp;tant qu'elles ne sont pas contraires aux principes g&eacute;n&eacute;raux du droit..." (art. 3).<br>
Le territoire est repr&eacute;sent&eacute; au Parlement&nbsp;de la R&eacute;publique&nbsp;par un d&eacute;put&eacute; et un s&eacute;nateur. Une personnalit&eacute;, d&eacute;sign&eacute;e par le Gouvernement, si&egrave;ge au Conseil&nbsp;&eacute;conomique et social.<br>&nbsp;

<br><br>




 


</body>
</html>