@DATABASE opium.newmail.ru:666/5s.htm
@WORDWRAP

@NODE MAIN
@TITLE " Ave Satanas..."
 
   @{" " link "4s.guide/MAIN"}@{"../pau.gif" link "../pau.gif/MAIN"}
Назад    Черная Библия "Книга Люцифера"
 (Воздух)    @{" " link "6s.guide/MAIN"}@{"../pau0.gif" link "../pau0.gif/MAIN"}
Дальше 

Разыскивается бог - живым или мертвым. 

&nbsp;Весьма популярным заблуждением является представление о том, что Сатанист не верит в Бога. Концепции "Бога" в толковании человека менялись на протяжении столетий столь сильно, что Сатанист просто принимает ту, которая ему подходит больше. Ведь это Человек всегда создавал богов, а не они его. Бог милостив для одних, ужасен для других. Для Сатаниста же, "Бог", каким бы именем он ни был назван, или даже не назван вообще, - видится неким уравновешивающим природу фактором и не имеет отношения к страданию. Эта могущественная сила, пронизывающая и поддерживающая равновесие всей Вселенной, слишком обезличена, чтобы заботиться о счастье или беде существ из плоти и крови, живущих на шарике из грязи, что является нашим домом. 

&nbsp;Тот, кто отождествляет Сатану со злом, должен принять во внимание тех мужчин, женщин, детей и животных, что умерли лишь потому, что на то была "воля Божья". Без сомнения, человек, оплакивающий безвременную кончину своего близкого, предпочел бы находиться рядом с ним, нежели отдать его в руки Бога! Взамен же он получает лишь елейные утешения своего священника, говорящего: "На то была воля Божья" или "Утешься, сын мой, теперь он в руках Господних". Такие слова - очень подходящий для набожников способ мириться с безжалостном Бога или же оправдывать его. Но если Бог столь всемогущ и столь милостив, как объяснить, почему он позволяет твориться этому? Слишком долго набожники припадали к своим библиям и сводам правил, чтобы доказывать или разубеждать, судить, обвинять и толковать. 

&nbsp;Сатанисты исходят из того, что сам человек, а также силы действия и противодействия Вселенной ответственны за все происходящее в природе, и не заблуждается насчет того, что кому-то есть до этого дело. Не будем же сидеть сложа руки и принимать "судьбу" без того, чтобы предпринять что-либо только потому, что так говорится в такой-то главе и в таком-то псалме; и да будет так! Сатанист знает, что проку от молитв не будет - на самом деле они уменьшают шансы на успех, поскольку истово набожные люди слишком часто благодушно бездействуют н вымаливают ситуацию, которую, сделай они хоть что-нибудь сами, удалось бы создать намного быстрее! 

&nbsp;Сатанисты избегают таких понятий, как "надежда" и "мольба", поскольку они указывают на мнительность. Если молиться и надеяться, что произойдет что-либо, то не останется времени на позитивное действие, направленное на то, чтобы это произошло. Сатанист, осознавая, что все, что достается ему, есть плод его собственных усилий, вместо того, чтобы молить Бога, берет ситуацию в свои руки. Позитивное мышление н позитивное действие всегда приносят результаты. 

&nbsp;Точно так же, как Сатанист не молит Бога о помощи, он не просит у него прощения за свои неверные поступки. В других религиях, когда кто-либо совершает неправое деяние, он либо молит Бога о прощении, либо исповедуется посреднику и испрашивает его замолить свои грехи перед Богом. Сатанист же, зная, что в молитвах мало проку, считает, что исповедание такому же как он человеку достигает еще меньшего результата и, более того, является деградацией. Когда Сатанист делает что-либо не так, он осознает, что вполне естественно совершать ошибки - и, если он на самом деле раскаивается в содеянном, то извлечет из этого урок и не сделает того же снова. Если же искренне он не кается в том, что он совершил, и знает, что будет продолжать делать то же самое еще и еще, ему незачем исповедываться и молить прощения. Ведь в жизни так и происходит. Люди каются в своих грехах для того, чтобы очистить свое сознание - и совершать грех снова, обычно тот же самый. 

&nbsp;Существует столь много истолкований Бога в обыденном понимании этого слова, сколь есть типов людей. Представления о нем разнятся от веры в некое неопределенное "универсальное космическое сознание" до изображения его в виде антропоморфного существа с длинной белой бородой и в сандалиях, следящего за каждым деянием каждого индивидуума. 

&nbsp;Даже в рамках отдельно взятой религии личные толкования Бога сильно варьируются. Некоторые секты заходят так далеко, что объявляют всех, кто принадлежит к другим религиозным направлениям, еретиками, хотя их общие доктрины и представления о божественном почти одинаковы. Так, например, католики верят в то, что протестанты обречены сгинуть в аду только потому, что те не принадлежат к Католической церкви. Точно так же многие раскольнические группы христианской веры, такие, например, как евангелистские и ревивалистские церкви веруют в то, что католики - язычники, поклоняющиеся идолам. (Христос изображается в облике, физиологически наиболее сродном тому, кто ему поклоняется, а меж тем христиане критикуют "язычников" за идолопоклонство). Евреев же вообще всегда сопоставляли с Дьяволом. 

&nbsp;Несмотря на то, что Бог во всех этих религиях в основном один и тот же, каждый рассматривает избранный другими путь как предосудительный, и, более того, в довершение ко всему, набожники еще и МОЛЯТСЯ друг другу! Они презирают своих правоверных братьев за то, что их религии несут на себе другие ярлыки и, каким-то образом, эта враждебность должна быть высвобождена. И как нельзя лучше сделать это через "молитву"! Сколь лицемерным является способ сказать: "Ненавижу тебя до смерти" через такое слабо замаскированное средство, известное как молитва за своего врага! Молиться за собственного врага - значит проявлять дешевый гнев и, без сомнения, самого претенциозного и напускного свойства! 

&nbsp;И если существуют столь сильные разногласия по поводу способов служения Богу, сколько же может быть различных истолкований Бога - и какое из них верно? 

&nbsp;Все благочестивые люди заботятся лишь о том, как ублажить Бога, дабы он открыл "Перламутровые Врата" рая для них после их смерти. Хотя, впрочем, если даже человек и прожил свою жизнь, не следуя законам своей веры, он может в свой последний час послать за священником и на смертном одре свершить последнее покаяние. Тут же прибежит поп или проповедник и "уладит" с Богом вопрос о пропуске в Царствие Небесное, (Иезиды, секта дьяволопоклонников, имеют свою точку зрения на этот вопрос. Они веруют в то, что Бог всемогущ и всемилостив, но при жизни они должны ублажать Дьявола, поскольку он вершит их судьбы на земле. Они настолько глубоко веруют в то, что Бог простит все их прегрешения во время отходных церемоний, что не считают нужным считаться с тем, как Бог смотрит на их жизнь). Из-за всех противоречий, существующих в христианских писаниях, многие люди в настоящее время не могут осмысленно воспринимать Христианство так, как оно воспринималось в прошлом. Все большее число людей начинает сомневаться в существовании Бога в традиционном христианском понимании. 

&nbsp;Соответственно, они называют себя "Христианскими Атеистами". Конечно, христианская библия есть нагромождение противоречий, но что может быть более противоречивым, нежели термин "Христианский Атеист"? 

&nbsp;Если даже выдающиеся лидеры христианской веры отвергают толкования Бога своими предшественниками, то как тогда они могут ожидать от своих последователей почитания религиозных традиций? Подытоживая дебаты о том, умер Бог или нет, можно сказать, что если он еще и не мертв, то ему не мешало бы обратиться за МЕДПОМОЩЬЮ! 
 ---

 ---

 ---

 ---

 ---

@endnode
