<html>
<body background="../images/fondtexte2.jpg">
<a name="a"></a>

<table>
<tr>
<td>
<IMG SRC="../images/iconcarte.jpg" alt="icon carte" border=0</a>
</td>
<td>
<font color="purple"><font size=5 face="helvetica"><a href="enteteaquitaine.html"target="description"><b>Pr&eacute;sentation de la r&eacute;gion Aquitaine</b></a> </font>
</td>
</tr>
</table>

<HR>

<br><br>


<a name="geo"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">G&eacute;ographie</font><font size=1 face="helvetica"> ( <A HREF="#eco">Economie</font></a><font size=1 face="helvetica"> - <A HREF="#his">Histoire</font></a><font size=1 face="helvetica"> - <A HREF="#pro">Produits locaux</font></a><font size=1 face="helvetica"> - <A HREF="#enf">Enfants du pays</a>)</font></a></STRONG><BR>
</font>

<BR>
<font size=3 face="helvetica">
L'Aquitaine est situ&eacute; entre le Massif armoricain, le Massif central, l'oc&eacute;an Atlantique et les Pyr&eacute;n&eacute;es !<br>
Sur ses 250 kilom&egrave;tres de littoral sablonneux, se trouve la plus longue plage de France...<br>
Le dunes mouvantes du front de mer(selon les vents), adoss&eacute;es aux mar&eacute;cages emp&ecirc;chent les rivi&egrave;res d'atteindre la mer...<br>
Dans les landes, on trouve la plus vaste for&ecirc;t de pins d'Europe !
<br><br>
<a name="eco"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Economie</font><font size=1 face="helvetica"> ( <A HREF="#geo">G&eacute;ographie</font></a><font size=1 face="helvetica"> - <A HREF="#his">Histoire</font></a><font size=1 face="helvetica"> - <A HREF="#pro">Produits locaux</font></a><font size=1 face="helvetica"> - <A HREF="#enf">Enfants du pays</a>)</font></STRONG><BR>
</font>
<br>
C'est la 3&egrave;me r&eacute;gion agricole fran&ccedil;aise (sa production v&eacute;g&eacute;tale,principalement le ma&iuml;s et le vin, devance sa production animale...)<br>
c'est &eacute;galement la 1&egrave;re r&eacute;gion fran&ccedil;aise pour la production de tabac !<br>
<br>
1&egrave;re activit&eacute; industrielle , l'a&eacute;ronautique avec l'A&eacute;rospatiale (Dassault, la Sogema, la SEP et AIA...leader europ&eacute;en pour l'avionique, l'avion de combat, les laboratoires spatiaux les mat&eacute;riaux composites de haute performance, les missiles et la propulsion spatiale.)<br>
<br>
c'est &eacute;galement la 1&egrave;re unit&eacute; europ&eacute;enne (Calliope)sp&eacute;cialis&eacute;es dans les biotechnologies.<br>
<br>
Bordeaux se voit pourvu d'un Institut de Chimie mol&eacute;culaire...<br>
<bR>
On trouve &eacute;galement de grandes unit&eacute;s industrielles d'agro-alimentaire pour les entremets et l'abattage de volailles...<br> 
<br>
Dans les Landes et la Gasgogne, on exploite le bois (fabriques de p&acirc;te &agrave; papier, de parquet et de lambris).<br>
<br>

On exploite un gisement de gaz sur la zone g&eacute;ographique de Pau-Lacq...<br>
<br>
On joue &eacute;galement la carte du tourisme, avec l'h&ocirc;tellerie et la restauration (avec le littoral atlantique et ses vignobles bordelais, le patrimoine culturel en Dordogne, ses stations thermales et de sports d'hiver dans les Pyr&eacute;n&eacute;es...)<br>
<br>
<br><br>
<a name="his"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Histoire</font><font size=1 face="helvetica"> ( <A HREF="#geo">G&eacute;ographie</font></a><font size=1 face="helvetica"> - <A HREF="#eco">Economie</font></a><font size=1 face="helvetica"> - <A HREF="#pro">Produits locaux</font></a><font size=1 face="helvetica"> - <A HREF="#enf">Enfants du pays</a>)</font></STRONG><BR>
</font>

<br>
- 3&egrave;me si&egrave;cle : elle est divis&eacute;e en 3 provinces par les Romains...<br>
<br>
- 507  : l'Aquitaine est int&eacute;gr&eacute;e au royaume de Clovis !<br>
<br>
- en 781 : Elle devient duch&eacute; franc et est constitu&eacute;e en royaume par Charlemagne.<br>
<br>
- en 877 : ce royaume dispara&icirc;t !<br>

<pre>
- de 951 &agrave; 1137 : La dynastie poitevine r&egrave;gne sur le duch&eacute; d'Aquitaine !
                     de 951 &agrave; 963   -> Guillaume III T&ecirc;te d'Etoupe de 951 &agrave; 963
                     de 963 &agrave; 994   -> Guillaume IV Fierebrace 
                     de 1086 &agrave; 1127 -> Guillaume IX, le &laquo; Prince des troubadours &raquo; 
                     de 1127 &agrave; 1137 -> Guillaume X .
</pre>
<br>
- Louis VII s'empare du duch&eacute; gr&acirc;ce &agrave; son mariage avec Ali&eacute;nor d'Aquitaine...<br>
<br>
- en 1152 : le second mariage d'Ali&eacute;nor d'Aquitaine avec Henri II de Plantagen&ecirc;t voit le duch&eacute; rattach&eacute; &agrave; l'Empire Anglo-Angevin.<br>
<br>
- 12&egrave;me et 13&egrave;me si&egrave;cle : la conqu&ecirc;te Cap&eacute;tienne d&eacute;membre progressivement le duch&eacute;.<br>
<br>
- 13&egrave;me si&egrave;cle : L'Aquitaine rena&icirc;t sous le nom de Guyenne.<br>
<br><br>
<a name="pro"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Produits locaux</font><font size=1 face="helvetica"> ( <A HREF="#geo">G&eacute;ographie</font></a><font size=1 face="helvetica"> - <A HREF="#eco">Economie</font></a><font size=1 face="helvetica"> - <A HREF="#his">Histoire</font></a><font size=1 face="helvetica"> - <A HREF="#enf">Enfants du pays</a>)</font></a></STRONG><BR>
</font>

<br>
-<b> Les plats : </b> Lamproie &agrave; la Bordelaise, crevettes grise &agrave; l'anis, garbure B&eacute;arnaise, pip&eacute;rade, omelete aux c&egrave;pes, tourin, tripoxa, alose &agrave; l'oseille...<br> <br>
- <b>Les fromages :</b><br>  
<br>
- <b>Les Patisseries et confiseries :</b> Le g&acirc;teau russe d'Ol&eacute;ron, le pastis aux pommes, le g&acirc;teau Basque, le clafoutis aux pruneaux d'Agen, les cannel&eacute;s de Bordeaux, les sarments au chocolat du M&eacute;doc, les macarrons de Saint-Emilion...<br>
<br>
- <b>Les boissons :</b> Ch&acirc;teau P&eacute;trus<br> <br> 
<br><br>
<a name="enf"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Enfants du pays</font><font size=1 face="helvetica"> ( <A HREF="#geo">G&eacute;ographie</font></a> <font size=1 face="helvetica"> - <A HREF="#eco">Economie</font></a><font size=1 face="helvetica"> - <A HREF="#his">Histoire</font></a><font size=1 face="helvetica"> - <A HREF="#pro">Produits locaux</a>)</font></STRONG><BR>
</font>
<br>
Henri IV, Montaigne, Maurice Ravel, Danielle Darrieux, Georges Descri&egrave;res, Marie Lafor&ecirc;t, Francis Cabrel, Serge Lama, Charles de Montesquieu, Jacques-Yves Cousteau, Andr&eacute; Courr&egrave;ges, Alain Jupp&eacute;, Jean Borotra, Didier Deschamps, Andr&eacute; Darrigade, Alain Giresse, Jean-Michel Larqu&eacute;<br>

<br>
<br>
<a name="p"></a>
<A HREF="#a"<font color="#FF0000">haut de page</font> </A>
<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>
</body>
</html>

