<html>
<body background="../../images/fondtexte2.jpg" text="black" vlink="blue" border="0">
<a href="25villesetcodepostaux.html#m"target="description"><font color="brown">Malbuisson</font></a> (Altitude : de 846 m &agrave 1 091 m)
<pre>
<hr>
D&eacute;partement : <a href="entetedoubs.html"Target="description">Doubs </a>           R&eacute;gion : <a href="../entetefranchecomte.html"Target="description">Franche-Comt&eacute;</a>

code postal : 25 160

  Habitants : 411 (&agrave; 1 200 selon la saison).
 Superficie : 6,6 Km2 (dont 300 hare de for&ecirc;t)

  Situation : sur la rive droite du Lac de Saint-Point
              &agrave; 15 Km <a href="pontarlier.html"target="description">Pontarlier</a>, 74 Km <a href="besancon.html"target="description">Besan&ccedil;on</a>, 211 Km Lyon

       Plus : Baignade, p&ecirc;che, Cano&euml;-kayak, tennis, &eacute;quitation,
              randonn&eacute;es, p&eacute;dalos, voile
              4 h&ocirc;tels, 1 camping
<hr>
</pre>
Un village dominant le lac de Saint point, r&eacute;put&eacute; en tant que station estivale
et hivernale !<br>
<br>
<a name="lac"</a>
<b>Lac de Saint-Point :</b><br>
<br>
3&egrave;me plus grand lac naturel fran&ccedil;ais apr&egrave;s le lac du bourget et grand lieu !<br>

<table>
<tr>
<td>
<a href="lac_stpoint1jpg.html"><img src="images/lac_stpoint1.jpg" target="description" alt="Photo du Lac Saint Point par Jacques Vanhove" width="123" height="81" border=0</a><br>
</td>
<td>
Surface moyenne : 419 ha<br>
Longueur maxi : 7 200 m<br>
Largeur maxi  : 1 000 m<br>
Altitude : 850 m<br>
Profondeur maxi : 43 m<br>
</td>
<td>

<a href="lacsaintpoint_porttitijpg.html"><img src="images/lac_saintpoint_porttiti.jpg" target="description" alt="Photo du Lac Saint Point par Jacques Vanhove" width="121" height="81" border=0</a><br>
</td>
<td>
Le Port Titi<br>
</tD>
</tr>
</table>



le Lac de Saint-Point est aliment&eacute; par le Doubs qui prend sa source en amont, sur la commune de Mouthe, la petite Sib&eacute;rie fran&ccedil;aise.<br>
A une vingtaine de kilom&egrave;tres au sud de Pontarlier, on peut d&eacute;couvrir la vall&eacute;e qui abrite le lac Saint-Point (et le lac de Remoray).<br> <br>
Un Sentier p&eacute;destre de 23 Km (bien am&eacute;nag&eacute;, et bien entretenu) fait le tour du lac , mais en bordure du lac pour le tiers seulement.
   
<table>
<tr>
<td>
<a href="lacstpointpontpassereljpg.html"><img src="images/lac_stpointpontpasserelle.jpg"target="description" alt="Le pont passerelle au dessus du Doubs par Jacques Vanhove" width="128" height="81" border=0 </a><br>
</td>
<td>
Une curiosit&eacute; sur ce sentier : un pont-passerelle suspendu,(en bois pour
   l'essentiel), enjambe le Doubs au nord du Lac...
</td>
</tr>
</table>
<br>

 <b>En &eacute;t&eacute;</b>, le lac est un site id&eacute;al pour la baignade et la p&ecirc;che.<br>
 Plages am&eacute;nag&eacute;es et baignade surveill&eacute;e (en juillet et ao&ucirc;t)<br>
 Cano&euml;-kayak (ouvert du 01/07 au 31/0): Location de cano&euml;-kayak sur le lac Saint Point, cours particulier de 2h (initiation sur le lac)   et encadrement descente de rivi&egrave;res en 1/2 journ&eacute;e<br>
<br>
 <b>En hiver,</b> il peut geler totalement et devenir ainsi une belle patinoire naturelle.<br>
 <br><br>


  
 

<b>Quelques communes bordant le lac :</b> Malbuisson, Chaon, Les Grangettes et Saint Point Lac.<br>
<br><br>
<b>Son histoire :</b><br>
Il y a 10 000 ans, lors de la disparition des derniers glaciers, une vaste d&eacute;pression c'est cr&eacute;e favorisant l'installation d'un immense lac. Puis, l'apport d'alluvions drain&eacute;s par le Doubs l'a divis&eacute; en deux vastes plan d'eau bien distincts&nbsp;: le lac de Saint-Point (au nord) et celui de Remoray (au sud).<br>

<br><br>
<b>Sa l&eacute;gende</b><br>
Selon la l&eacute;gende, le lac Saint point r&eacute;sulterait de l'engloutissement de la ville de Damvauthier...Les habitants de cette ville oppulente n'ayant pas voulu pr&ecirc;ter assistance &agrave; une malheureuse et &agrave; son enfant ...c'est le moine de Condat (ancien nom de la ville de St Claude), celui que nous connaissons sous le nom de saint Point qui les sauvera... d'o&ugrave; le nom du lac ! <br>



<br><br><br><br><br><br>

 





 


<br><br><br>

</body>
</html>   