<html>
<body background="../../images/fondtexte2.jpg">
<a href="21villesetcodepostaux.html#d"target="description"><font color="brown">Dijon</font></a>        (Altitude : 245 m)
<pre>
<hr>
<a href="../../departements.html"Target="description">D&eacute;partement</a> : <a href="entetecotedor.html"Target="description">C&ocirc;te-d'or </a>           R&eacute;gion : <a href="../entetebourgogne.html"Target="description">Bourgogne</a>

Code Postal : 21 000

  Habitants : 150 800 Dijonnais (en 2005)
 Superficie : 40,41 Km2

  Situation : &agrave; 46 Km <a href="beaune.html"target="description">Beaune</a>, 63 Km <a href="flavignysurozerain.html"target="description">Flavigny-sur-Ozerain</a>, 101 Km <a href="montbard.html"target="description">Montbard</a>

    Plus... :
<hr>
</pre>

Gustave Eiffel : est n&eacute; ici le 15 d&eacute;cembre 1832, quai Nicolas Rolin &agrave; proximit&eacute; du port du canal.<br>
<br><br>
<b>La maison des Cariatides :</b> (28 rue Chaudronnerie)<br>
<br><br>
<b>Le mus&eacute;e des Beaux-Arts :</b><br>
<br><br>
<b>La cath&eacute;drale Saint-B&eacute;nigne :</b><br>
<br><br>
<b>L'&eacute;glise du Sacr&eacute;-Coeur :</b> (1933)<br>
<br><br><br>
<b>HISTOIRE :</b><br>
<br>
- <i>D&eacute;but du 12&egrave;me s&egrave;cle</i> : Dijon n'est que la juxtaposition d'une demi-douzaine de bourgs administrativement distincts, o&ugrave; s'entrem&ecirc;lent les pouvoirs du Duc et ceux des deux abbayes de Saint-Etienne et de Saint-B&eacute;nigne.<br>
<br>
- <i>Le 28 juin 1137</i> : un terrible incendie d&eacute;vaste l'agglom&eacute;ration, les &eacute;glises Saint-B&eacute;nigne et Saint-Etienne sont &eacute;galement gravement endommag&eacute;es.<br>
<br>
Le duc Eudes II en profite pour entreprendre la construction d'une enceinte englobant la quasi totalit&eacute; de l'agglom&eacute;ration.<br>
<br> 
- <i>1808</i> : ach&egrave;vement du canal de Bourgogne (entre Dijon et Saint-Jean-de-Losne).<br>
<br>
- <i>1836</i> : cr&eacute;ation de la place Saint-Pierre (Wilson actuelle)<br>
<br>
- <i>1836-1844</i> : cr&eacute;ation de la place Saint-Bernard.<br>
Henry Darcy  &eacute;tablit les fontaines publiques qui apportent l'eau potable.<br>
<br>
- <i>1851</i> : arriv&eacute;e du chemin de fer !<br>
<br>
- <i>1878 &agrave; 1880</i> : La ville s'entoure d'une ceinture de forts (en 1891, le centre de garnison comptera  4 600 hommes de troupes)<br>
<br>
- <i>1886</i> : ouverture de la gare de triage de Perrigny qui sera &agrave; l'origine du nouveau quartier des Bourroches.<br>
<br>
- <i>1888</i> : cr&eacute;ation de la place de la r&eacute;publique.<br>
<br>
- <i>1893</i> : cr&eacute;ation du Lyc&eacute;e Carnot.<br>
<br>
- <i>1897</i> : la d&eacute;molition du ch&acirc;teau de Louis XI est achev&eacute;e. La poste sera construite sur une partie de cet emplacement !<br>
<br>
- <i>1904</i> : cr&eacute;ation de la place Fran&ccedil;ois Rude.<br>
<br>
- <i>1910</i> : cr&eacute;ation de la place Grangier (devant la poste).<br>
<br> 
</body>
</html>