<html>
<body background="images/fondtexte2.jpg" text="black" vlink="black" border="0">
<title>Le calendrier</title>

<center>

<HR size=2 color=darkred>
<font size=4 color="brown"><strong>LE CALENDRIER</strong></font><br>
<HR size=2 color=darkred>

<br><br>

<TABLE width=550>
<TR><TD>
&Agrave; la fondation de Rome, en 753 av. J.C., le calendrier ne comportait que 10 mois :<br> 
<br>
- le 1er &eacute;tait Martius, d&eacute;di&eacute; &agrave; Mars, dieu de la guerre.<br>

- Le 2&egrave;me &eacute;tait Aprilis, d&eacute;di&eacute; &agrave; Aphrodite (Apru en &eacute;trusque).<br>

- Le 3&egrave;me &eacute;tait Maius, d&eacute;di&eacute; &agrave; Maia, d&eacute;esse du printemps.<br>

- Le 4&egrave;me &eacute;tait Junius, d&eacute;di&eacute; &agrave; Junon, &eacute;pouse de Jupiter.<br>

- Le 5&egrave;me &eacute;tait Quintilis (devenu 7e mois) fut appel&eacute; Julius en l'honneur de Jules C&eacute;sar qui r&eacute;forma le calendrier dit "julien".<br>

- le 6&egrave;me &eacute;tait Sextilis, mais apr&egrave;s une r&eacute;forme julienne mal appliqu&eacute;, une correction fut appliqu&eacute; sous le r&egrave;gne d'Auguste...Du coup, il fut rebaptis&eacute; Augustus !<br>

- Le 7&egrave;me,8&egrave;me,9&egrave;me et 10&egrave;me mois ont tous un rapport avec l'ordre num&eacute;rique qu'ils occupent (sept ->septembre, octo -> octobre..)<br>

<br>

L'ann&eacute;e en 10 mois ne comportant que 304 jours, il fut n&eacute;cessaire d'ajouter deux mois (qui furent d'abord ajout&eacute;s apr&egrave;s d&eacute;cembre).<br>
Januarius &eacute;tait consacr&eacute; &agrave; Janus, le plus ancien roi du Latium et dieu de la paix.<br>
Tous les mois avaient un nombre impair de jours car le nombre pair &eacute;tait r&eacute;put&eacute; fatal, n&eacute;faste. Mais pour des raisons math&eacute;matiques qui seraient trop longues &agrave; expliquer ici, il fallut ajouter un douzi&egrave;me mois avec un nombre pair de jours (28). Ce mois fut Februarius, consacr&eacute; &agrave; Februus, dieu de la purification ("februare" signifie "purifier").<br><br>

<br>
<b>- Le 1er janvier ou Jour de l'An</b> (premier jour de l'ann&eacute;e). Ce n'est pas une f&ecirc;te religieuse. Simplement, on ne travaille pas et on se repose apr&egrave;s avoir beaucoup bu et dans&eacute;.<br>
<br><br>
<b>- L'Epiphanie, la f&ecirc;te des Rois (Le 1er dimanche apr&egrave;s le jour de l'an).</b>, c'est une f&ecirc;te d'origine chr&eacute;tienne en l'honneur des Rois Mages venus apporter des cadeaux &agrave; l'enfant J&eacute;sus.<br>
 Ce jour l&agrave;, on tire les rois, c'est &agrave; dire qu'on mange une galette des rois qui contient une&nbsp;f&egrave;ve cach&eacute;e &agrave; l'int&eacute;rieur. La personne qui la trouve devient le roi ou la reine et doit porter une couronne sur la t&ecirc;te.<br>
<br><br> 
<b>- Le 14 f&eacute;vrier</b>, c'est la Saint-Valentin. C'est la f&ecirc;te des amoureux !<br> 
<br><br>
<b>- Mardi Gras (40 jours apr&egrave;s No&euml;l)</b> ou la Chandeleur qui tire son nom des "chandelles" que l'on faisait br&ucirc;ler chez soi pour &eacute;loigner les orages et les intemp&eacute;ries. C'est une f&ecirc;te religieuse, mais comme dans beaucoup d'autres pays, c'est surtout l'occasion de spectacles : Le carnaval de Nice en est le meilleur exemple !<br>
 Mardi Gras, c'est aussi l'occasion de manger des cr&ecirc;pes...qui seront encore plus appr&eacute;ci&eacute;es accompagn&eacute;es d'un bon cidre bouch&eacute; ;-).<br>
<br>
La tradition veut que pour s'assurer chance et richesse toute l'ann&eacute;e, il faut faire sauter les cr&ecirc;pes une pi&egrave;ce de monnaie dans la main gauche et formuler un souhait (qui se r&eacute;alisera si la cr&ecirc;pe se retourne correctement dans la po&ecirc;le).<br>
<br>
Selon d'anciens rites, la p&eacute;riode de Carnaval pr&eacute;c&egrave;de le Car&ecirc;me (p&eacute;riode d'abstinence et de p&eacute;nitence).<br>
<br>
Carnaval viendrait de "carne levare" (enlever la viande).<br>
 Mardi Gras, veille du 1er jour de Car&ecirc;me, est un jour o&ugrave; l'on pouvais s'autoriser quelques exc&egrave;s (manger de la viande) puisqu'il serait suivi de 40 jours de repentir.&nbsp;<br>
 <br><br>
<b>- P&acirc;ques</b> se f&ecirc;te toujours un dimanche (le dimanche qui suit le 14&egrave;me jour de la lune qui commence en mars)...<br>
C'est une f&ecirc;te religieuse, qui rappelle la r&eacute;surrection de J&eacute;sus Christ. pendant 3 jours (du vendredi saint,date de la mort de J&eacute;sus,jusqu'au dimanche de P&acirc;ques,date de sa r&eacute;surection) les cloches de l'&eacute;glise vont s'arr&ecirc;ter de sonner en signe de deuil.<br>
Selon la l&eacute;gende, les cloches s'arr&ecirc;tent de sonner pour partir &agrave; Rome...et reviennent charg&eacute;es de cadeaux.<br>
Les enfants sortent alors, hors de la maison&nbsp;et partent &agrave; la recherche des cadeaux tomb&eacute;s du ciel (oeufs et objets en chocolat cach&eacute;s dans le jardin)...<br>
<br>
Ce jour l&agrave;, traditionnellement, on mange de l'agneau en famille (il est appel&eacute; l'agneau pascal). Il repr&eacute;sente le mouton qu'Abraham a tu&eacute; en lieu et place de son fils Isaac.<br>

<br><br>
 <b>- Le 1er mai ou F&ecirc;te du Travail</b>... C'est un jour f&eacute;ri&eacute; pour tous les Fran&ccedil;ais. Ce jour-l&agrave;, on offre du muguet &agrave; tout le monde.<br> 
<br><br>
<b>- La F&ecirc;te des M&egrave;res (le dernier dimanche du mois de mai)</b>.<br>
Selon la tradition, les enfants offrent un cadeau &agrave; leur m&egrave;re.<br>
 Savez-vous qui a invent&eacute; cette f&ecirc;te ?<br>
 C'est Napol&eacute;on !<br> 
<br><br>
<b>- Le 8 mai</b> rappelle la fin de la 2&egrave;me Guerre Mondiale et la victoire fran&ccedil;aise sur les Allemands. On l'appelle donc la F&ecirc;te de la Victoire.<br>
 <br><br>
<b>- L'Ascension (toujours un jeudi, 40 jours apr&egrave;s P&acirc;ques)</b>, c'est un jour f&eacute;ri&eacute; et une f&ecirc;te religieuse comm&eacute;morant l'ascension de J&eacute;sus en pr&eacute;sence de ses ap&ocirc;tres (40 jours apr&egrave;s sa r&eacute;surection).<br>
<br><br>
<b>- la Pentec&ocirc;te (toujours un lundi, 50 jours apr&egrave;s P&acirc;ques)</b>, c'est un jour f&eacute;ri&eacute; et une f&ecirc;te chr&eacute;tienne comm&eacute;morant la descente du Saint Esprit sur les ap&ocirc;tres...<br>
<br><br> 
<b>- La f&ecirc;te de la musique (le 21 juin)</b>...<br>
 C'est une nouvelle f&ecirc;te qui existe depuis 1982, invent&eacute;e par le Ministre de la Culture socialiste Jack Lang. Comme le 21 juin est aussi le premier jour de l'&eacute;t&eacute;, il fait doux, et tout le monde sort dans les rues pour jouer d'un instrument, pour danser, ou simplement pour &eacute;couter les nombreux concerts dans la rue : jazz, classique, rock, pop ou rap, on entend toutes sortes de musique partout en France.<br>
 <br><br>

<b>- Le 14 juillet :</b><br>
  C'est un jour f&eacute;ri&eacute; comm&eacute;morant la prise de la bastille (14 juillet 1789)...<br>
Bals et feux d'artifice ont lieu dans toute la France !<br><br>
Le 14 juillet est d&eacute;clar&eacute; f&ecirc;te nationale depuis le 6 juillet 1880 (sur proposition de Benjamin Raspail)...<br>
Le transfert des cendres de Rouget de Lisle ,le 14 juillet 1915, a donn&eacute; naissance au premier d&eacute;fil&eacute; sur les champs-Elys&eacute;es !<br>
<br>

<b>- L'assomption (le 15 Ao&ucirc;t)</b>, c'est un jour f&eacute;ri&eacute; et une f&ecirc;te religieuse qui c&eacute;l&egrave;bre l'assomption de la vierge Marie...<br>
<br><br>
<b>- La Toussaint (le 1er novembre)</b>, c'est une f&ecirc;te religieuse (f&ecirc;te de tous les saints),<br>
suivie par le jour des d&eacute;funts (en pratique, les deux sont confondus).<br>
 Ce jour-l&agrave;, les gens vont au cimeti&egrave;re pour apporter des fleurs sur la tombe des parents et amis qui sont morts, et pour prier.<br>
 <br><br>

 

<b>- L'Armistice (Le 11 novembre)</b>, c'est l'anniversaire de l'armistice qui mit fin à la 1&egrave;re<br>Guerre Mondiale (le 11 novembre 1918). Dans chaque ville il y a des d&eacute;fil&eacute;s officiels, comme pour le 14 juillet. Les &eacute;coles et les bureaux sont ferm&eacute;s, et il y a des drapeaux fran&ccedil;ais partout dans les rues. <br>
 <br><bR>

 
<b>- La Sainte-Catherine (le 25 novembre)</b>, c'est la f&ecirc;te des femmes c&eacute;libataires de plus de 25 ans (On les appelle "les Catherinettes").<br>
<br><br>
<b>- No&euml;l, le 25 d&eacute;cembre</b>, c'est la f&ecirc;te religieuse la plus importante (naissance de J&eacute;sus)...<br>
 Le 24 d&eacute;cembre, les Fran&ccedil;ais se r&eacute;unissent en famille et font la f&ecirc;te tard dans la nuit. On &eacute;change beaucoup de cadeaux. Les enfants sont heureux, et les plus petits croient qu'un personnage imaginaire, le P&egrave;re No&euml;l, leur apporte des cadeaux, qu'ils d&eacute;couvrent le 25 au matin. La veille de No&euml;l (le 24), on fait le r&eacute;veillon, le grand repas de No&euml;l. On y mange du foie gras, des hu&icirc;tres, de la dinde et une b&ucirc;che (le g&acirc;teau de No&euml;l). La majorit&eacute; des Fran&ccedil;ais ne travaille pas le 24 et le 25, et les &eacute;tudiants ont deux semaines de vacances. Les Catholiques vont &agrave; la messe de minuit le 24 d&eacute;cembre. A l'&eacute;poque de No&euml;l, les rues et les maisons sont d&eacute;cor&eacute;es avec des sapins illumin&eacute;s, et beaucoup de familles font une cr&egrave;che, qui repr&eacute;sente la naissance de J&eacute;sus.<br>
<br>
<b>- Le r&eacute;veillon, le 31 d&eacute;cembre</b>, c' est le jour de la Saint-Sylvestre. On sort, on va danser avec les amis, et on attend minuit pour s'embrasser et boire du champagne pour f&ecirc;ter la nouvelle ann&eacute;e qui commence.<br>
 Chaque ville fait tirer un feu d'artifice.<br>
</TD></TR>
</TABLE>

</body>
</html>

