<html>
<body background="images/fondtexte2.jpg"  border="0" link=darkblue vlink=darkred>
<basefont size=2 face="helvetica">
<title>Les citations</title>
<center>
<hr size=2 color=darkred>
<font size=5 color="brown"><strong>Citations</strong></font>
<hr size=2 color=darkred>
</center>
<br>
- C'est parce que la fortune vient en dormant qu'elle arrive si lentement. (Alphonse Allais)<br>
<br>
- Les cimeti&egrave;res sont remplis de gens irrempla&ccedil;ables. (Alphonse Allais)<br>
<br>
- Dieu a sagement agi en pla&ccedil;ant la naissance avant la mort ;<br>
sans cela, que saurait-on de la vie ? (Alphonse Allais)<br>
<br>
- Veni, vidi, vici (je suis venu, j'ai vu, j'ai vaincu) (Jules C&eacute;sar)<br>
<br>
-  Un bon croquis vaut mieux qu'un long discours. (Napol&eacute;on 1er)<br>
<br>
- Si le temps ne changeait jamais, la moiti&eacute; des hommes n'auraient aucun sujet de conversation. (Jules Renard)<br>
<br>
- N'&eacute;coutant que son courage qui ne lui disait rien, il se garda d'intervenir. (Jules Renard)<br>
<br>
- Il y a deux ans que je n'ai pas parl&eacute; &agrave; ma femme, c'&eacute;tait pour ne pas l'interrompre. (Jules Renard)<br>
<br>
- &Eacute;crire, c'est une fa&ccedil;on de parler sans &ecirc;tre interrompu. (Jules Renard)<br>
<br>
- Qui veut noyer son chien l'accuse de la rage. (Moli&egrave;re)<br>
<br>
- C'est de l'enfer des pauvres qu'est fait le paradis des riches. (Victor Hugo)<br>
<br>
- Les femmes ressemblent aux girouettes : elles se fixent quand elles se rouillent. (Voltaires)<br>
<br>
- Prouver que j'ai raison serait accorder que je puisse avoir tort. (Beaumarchais)<br>
<br>
- Le verbe aimer est difficile &agrave; conjuguer : son pass&eacute; n'est pas simple, son pr&eacute;sent n'est qu'indicatif, et son futur est toujours conditionnel. (Jean Cocteau)<br>
<br>
- Comment voulez-vous gouverner un pays o&ugrave; il existe 258 vari&eacute;t&eacute;s de fromage ? (Charles de Gaulle)<br>
<br>
- J'aime bien ceux qui me r&eacute;sistent ; l'ennui, c'est que je ne peux les supporter. (Charles de Gaulle)<br>
<br>
- Pour voir loin, il faut y regarder de pr&egrave;s (Pierre Dac)<br>
<br>
-  Tout ce qui est stable est contestable. (Albert Brie)<br>
<br>
- Un bienfait n'est jamais perdu. C'est peut-être pour ça qu'on n'en trouve jamais ! (Pierre-Jean Vaillard)<br>
<br>
- A force de boire, je me suis altéré. (Maurice Roche)<br>
<br>
- Le souvenir, ce n'est qu'un regret apais&eacute;. (Francis Blanche)<br>
<br>
- Prudence est m&egrave;re de tous les vices. (Francis Blanche)<br>
<br>
- Le pardon est un luxe, il devrait &ecirc;tre un mode de vie. (G&eacute;rard Depardieu)<br>
<br> 
- A vingt ans, les d&eacute;sirs nous emp&ecirc;chent de voir la v&eacute;rit&eacute; ; mais pass&eacute; quarante ans il ne reste que des v&eacute;rit&eacute;s r&eacute;elles et fragiles : les capacit&eacute;s et les lacunes. (G&eacute;rard Depardieu)<br>
<br>
- La science consiste &agrave; oublier ce qu'on croit savoir, et la sagesse &agrave; ne pas s'en soucier. (NodierCharles)<br>
<br> 
- Chaque &eacute;poque a toujours su trouver le moyen d'expliquer, &agrave; d&eacute;faut de comprendre. (Oscar Wilde)<br>
<bR>
- Cacher son &acirc;ge, c'est supprimer ses souvenirs. (Arletty)<br>
<br>
- L'amour peut se passer d'estime, pas l'amiti&eacute;. (Arletty)<br>
<br>
- Le meilleur moyen de se d&eacute;faire d'un ennemi, c'est d'en faire un ami (Henri IV)<br>
<br>
- Ceux qui ne font pas les choses les racontent. Ceux qui les font se taisent. (Jean Cocteaux)<br>
<br>
- Si je pr&eacute;f&egrave;re les chats aux chiens, c'est parce qu'il n'y a pas de chat policier. (Jean Cocteaux)<br>
<br>
- Les enfants, il vaut mieux les r&eacute;ussir, sinon ils ne vous ratent pas. (Jean Cocteaux)<br>
<br>
- Un g&eacute;n&eacute;ral ne se rend jamais, m&ecirc;me &agrave; l'&eacute;vidence. (Jean Cocteaux)<br>
<br>
- On ferme les yeux des morts avec douceur ; c'est aussi avec douceur qu'il faut ouvrir les yeux des vivants. (Jean Cocteaux)<br>
<br>
- La sup&eacute;riorit&eacute; de la t&eacute;l&eacute;vision sur la radio : vous n'entendez pas seulement les parasites mais vous les voyez. (?)<br>
<br>
- Ceux qui ont de la chance ne croient pas au hasard (Yvan Audouard)<br>
<br>
- il y a des gens qui parlent, qui parlent...jusqu'&agrave; ce qu'ils aient enfin trouv&eacute; quelque chose &agrave; dire. (jean-Claude Brialy)<br>
<br>
- Travailler d'accord, encore faut-il avoir le temps... (Jacques Dutronc)<br>
<br>
- Hâtons-nous de succomber à la tentation, avant qu'elle ne s'éloigne. (Epicure)<br>
<br> 
- Plus on pédale moins fort, moins on avance plus vite. (Coluche)<br>
<br>
- Le retour à la norme me paraît plus inquiétant que la folie. (Claude Chabrol)<br>
<br> 
- Faire des manières, c'est en manquer. (Yvan Audouard)<br>
<br>
- L'intelligence, c'est comme les parachutes, quand on n'en a pas, on s'&eacute;crase. (Pierre Desproges)<br>
<br>
</body>
</html>