<html>


<head>

<script language="Javascript">

if (parent.frames.length < 1) {
    if ( document.location.href.substring(0,4) == "http" ) {
        document.location.href = 'http://www.marsupilami.free.fr';
    }
}

function franc_euro(tp)
{
    replace(tp.francs);
    tp.totaleuro.value=tp.francs.value/tp.taux.value;
    format(tp.totaleuro,2);
    replace2(tp.francs);
}

function euro_franc(tp)
{
    replace(tp.euro);
    tp.totalfrancs.value=tp.euro.value*tp.taux.value;
    format(tp.totalfrancs,2);
    replace2(tp.euro);
}

function format(decimal,nbdec)
{
    nbdec=nbdec+1;
    var i=0;
    while (i<eval(decimal.value.length)) {
        if (decimal.value.charAt(i)=="," || decimal.value.charAt(i)==".") {
            valtp = decimal.value.substring(i+1,i+nbdec);
            if (decimal.value.charAt(i+nbdec)>=5) {
                valtp = eval(valtp) +1;
                if (valtp<10) {
                    valtp="0"+valtp;
                }
            }
            decimal.value=decimal.value.substring(0,i)+","+ valtp;
            if (decimal.value.substring(0,i)!="") {
                if (valtp==100) {
                    decimal.value=eval(decimal.value.substring(0,i)) +1 +",00";
                }
            }
            else {
                if (valtp==100) {
                    decimal.value="1,00";
                }
                else {
                    decimal.value="0,"+ valtp;
                }
            }
        }
        i++;
    }
}

function replace(decimal)
{
    var i=0;
    while (i<eval(decimal.value.length)) {
        if (decimal.value.charAt(i)==",") {
            decimal.value=decimal.value.substring(0,i)+"."+decimal.value.substring(i+1,decimal.value.length);
        }
        i++;
    }
}

function replace2(decimal)
{
    var i=0;
    while (i<eval(decimal.value.length)) {
        if (decimal.value.charAt(i)==".") {
            decimal.value=decimal.value.substring(0,i)+","+decimal.value.substring(i+1,decimal.value.length);
        }
        i++;
    }
}

</script>

</head>



<body background="images/fondtexte2.jpg" text="black" link="darkblue" vlink=darkred border="0">
<title>G&eacute;n&eacute;ralit&eacute;s</title>
<basefont size=2 face="helvetica" color=#000000>
<a name="a"></a>
<center>
<table width=500>
<TR><TD align=center valign=TOP>
<TABLE width=100%>
<TR><TD width=20>&nbsp</TD>
<TD>
<font size=2 face="helvetica">
<center>
<HR size=2 color=darkred>
<font size=5 color="darkred" face="helvetica"><strong>G&eacute;n&eacute;ralit&eacute;s sur l'histoire de France</strong></font>
<HR size=2 color=darkred>
</center>
<BR>

La France est une r&eacute;publique au climat temp&eacute;r&eacute;...Elle est arros&eacute;e par de grands fleuves et travers&eacute;e par de belles montagnes couvertes de for&ecirc;ts...<br>
<br>
<b>Environnement</b><br>
<br>
 &middot;&nbsp;Les zones de production agricole et foresti&egrave;re repr&eacute;sentent 82&nbsp;% du territoire m&eacute;tropolitain.<br>
<br>
 &middot;&nbsp;Le massif forestier (3&egrave;me massif de l'Union europ&eacute;enne apr&egrave;s ceux de Su&egrave;de et de Finlande) repr&eacute;sente &agrave; lui    seul 26&nbsp;% du territoire ...On d&eacute;nombre 136 essences d'arbres en France, ce qui est exceptionnel pour un        pays europ&eacute;en<br>
<br>
Pour la sauvegarde et la mise en valeur du patrimoine naturel de la France, l'&eacute;tat &agrave; cr&eacute;e <a href="parcsnationaux/parcsnaturelsnationaux.html"target="description">7 parcs nationaux</a>, <a href="parcsregionaux/parcsnaturelsregionaux.html"target="description">40 parcs naturels r&eacute;gionaux</a> (couvrant plus de 7&nbsp;% du territoire), <a href="reservesnaturelles.html"target="description">153 r&eacute;serves naturelles</a>, 463 zones de protection de biotopes et 389 sites prot&eacute;g&eacute;s par le Conservatoire du littoral ...</font><br>

<br><br><br>
<b>Son drapeau :</b><br>

<table>

<tr>
<td>
<img src="images/drapeau.gif"><br>
</td>

<td>
<font size=2 face="helvetica">

Apr&egrave;s la R&eacute;volution de 1789, le drapeau tricolore remplace le drapeau blanc &agrave; fleurs de lys, symbole de la royaut&eacute;.C'est en 1792 que David D'Angers dessine le premier drapeau de la Nation fran&ccedil;aise.<br>&nbsp;
Le drapeau de David d'Angers est tricolore : bleu, blanc et rouge.<br>
Le bleu et le rouge sont les couleurs de la ville de Paris. Quant au blanc, il fait r&eacute;f&eacute;rence &agrave; la couleur de la cocarde royale et symbolise la r&eacute;conciliation entre la France d'avant et d'apr&egrave;s la R&eacute;volution.</font><br>
</td>
</tr>

</table>

<br>
<b>Sa devise</b><br>
<br>
Libert&eacute;, &eacute;galit&eacute;, fraternit&eacute;<br>
<br>
<a name="hymne"</a>
<b>L'hymne nationnal</b><br>

<table>
<tr>
<td>
<img src="images/marseillaiserougetdelisle2.jpg">
</td>

<td>
<font size=2 face="helvetica">

Ce 25 avril 1792, &agrave; Strasbourg, Joseph Rouget de Lisle se trouve dans le salon du maire de la ville (le Baron de Dietrich)...Sur sa demande, il va &eacute;crire le Chant de guerre pour l'arm&eacute;e du Rhin, Cela fait d&eacute;j&agrave; 5 jours que la France &agrave; d&eacute;clar&eacute; la guerre &agrave; l'Autriche...<br>
Joseph Rouget de Lisle  (originaire de <a href="franchecomte/jura/lonslesaunier.html"target="description">Lons-le-Saulnier</a>) a alors 32 ans !<br>
Le chant de guerre pour l'arm&eacute;e du Rhin deviendra <a href="marseillaise.html"Target="description">LA MARSEILLAISE</a> et sera d&eacute;cr&eacute;t&eacute; hymne national le 14 juillet 1795. ! </font><br>
</td>
</tr>
</table>

<br>
<b>N&ocirc;tre Marianne nationale</b><br>
<br>
<font size=2 face="helvetica">
 - 25 septembre 1792 Apr&egrave;s la R&eacute;volution les repr&eacute;sentations &eacute;tatiques h&eacute;rit&eacute;es de l'Ancien R&eacute;gime  se devaient d' &ecirc;tre remplac&eacute;es...Sur proposition de l'abb&eacute; Gr&eacute;goire le nouveau sceau de l'Etat sera une &laquo;figure de la libert&eacute; &laquo;, c'est-&agrave;-dire une femme avec un bonnet phrygien.<br>
<br>
-  Guillaume Lavabre (chansonnier d'expression occitane et cordonnier protestant ) de Puylaurens, fait imprimer une chanson intitul&eacute;e "La Garisou de Marianno" : cette chanson occitane donnera un pr&eacute;nom &agrave; la R&eacute;publique...</font><br>
<br>

<table>
<tr>
<td>
<img src="images/laliberteeugenedelacroix.jpg">
</td>

<td valign=top>
<font size=2 face="helvetica">

- Eug&egrave;ne delacroix peindra un chef d'oeuvre, "La Libert&eacute; guidant le peuple aux barricades". Elle exalte un combat r&eacute;volutionnaire, celui que le Paris patriote a men&eacute; contre Charles X lors des Trois Glorieuses, les 27, 28 et 29 juillet 1830, et dont est sortie la monarchie de Juillet.</font><br>
</td>
</tr>
</table>
<br>


<table>
<tr>
<td valign=TOP>
<img src="images/lebustedemarianne.jpg">
</td>
<td valign=BOTTOM>
<img src="images/lebonnetfrigient.jpg"
</td>

<td>
<font size=2 face="helvetica">
- 1870 La femme &agrave; bonnet phrygien se voit donc d&eacute;sormais partout, sur les pi&egrave;ces de monnaie ou sur les timbres-poste... <br>
<br>
Dans les mairies,  Le buste de Marianne, signifie r&eacute;gime r&eacute;publicain... <br>
<br>
 Marianne, n&eacute;e Libert&eacute; devient peu &agrave; peu R&eacute;publique fran&ccedil;aise...<br>
<br>
Elle a surv&eacute;cu aux 5 R&eacute;publiques et &agrave; tous les bouleversements de l'histoire...<br>
 Auparavent Brigitte Bardot et Catherine Deneuve avaient pr&ecirc;t&eacute;es leus traits &agrave; notre Marianne...<br>
<br>
- en 2000, C'est Laetitia Casta qui a servit de mod&egrave;le &agrave; Marie-Paule Deville-Chabrolle pour r&eacute;aliser le dernier buste de Marianne ...</font><br>
</td>
</tr>
</table>
<br>
 
<br>
<b>Notre langue: le Fran&ccedil;ais</b><br>
<br>
<font size=2 face="helvetica">
Le Fran&ccedil;ais existe depuis environ 1200 ans...Gloses de Reichenau a &eacute;crit le premier dictionnaire Latin-Fran&ccedil;ais vers l'an 750...<br>
Le premier texte Fran&ccedil;ais fut prononc&eacute; par Louis le Germanique en l'an 842; il s'agit du manuscrit du Serment de Strasbourg, un accord o&ugrave; les 2 fr&egrave;res Louis le Germanique et Charles le Chauve (petits-fils de Charlemagne) se promettaient de s'aider mutuellement...</font><br>
<br><br>
<b>Mais d'o&ugrave; vient elle ?</b><br>
<br>
<font size=2 face="helvetica">
Le Fran&ccedil;ais  est venu du latin populaire parl&eacute; en Gaule apr&egrave;s la conqu&ecirc;te romaine. Le Fran&ccedil;ais fut d'abord le Roman, il se d&eacute;clinait en plusieurs dialectes ou patois (langue d'OC et langue d'O&iuml;l)...<br>
Le dialecte de l'Ile-de France le <b>francien</b> devint la langue Fran&ccedil;aise vers le 14 &egrave;me si&egrave;cle...<br>
Mais c'est au d&eacute;but du 17&egrave;me si&egrave;cle apr&egrave;s s'&ecirc;tre enrichi de mots nouveaux emprunt&eacute;s &agrave; diverses langues (grec, latin, germaniques, italien , espagnol, orientales et anglaise)
qu'on le retrouvera &agrave; peu pr&egrave;s telle que nous le parlons aujourd'hui !</font><br>
<br><br>
<a name="parle"</a>
<b>Qui le parle ?</b><br>
<br>
<font size=2 face="helvetica">
Le fran&ccedil;ais se parle &eacute;galement en dehors du territoire fran&ccedil;ais : dans une partie de la Suisse (Suisse romande) et de la Belgique (Wallonie) et dans presque tout le Canada...
Tout comme dans un certain nombre d'autres pays o&ugrave; la France a eu des colonies: Afrique du nord, Afrique noire, Madagascar, Oc&eacute;anie, Asie, Antilles<br>
Aujourd'hui, <a href="indexfrancophonie.html"target="_top">la francophonie</a> repr&eacute;sente 500 millions de personnes r&eacute;partis sur les 5 continents...<br>
C'est aussi la langue diplomatique des pays civilis&eacute;s...</font><br>

<br><br>
<a name="cal"</a>
<b>La monnaie</b><br>
<br>
<font size=2 face="helvetica">
L' euro est d&eacute;sormais la monnaie officielle de la France ! <br>
1 euro = 6,55957 francs fran&ccedil;ais</font><br> 



<CENTER>
<TABLE>
<TR><TD>

<FORM>
<INPUT TYPE="HIDDEN" NAME="taux" VALUE="6.55957">
<BR>
<table>
<tr>
<td>


<TABLE BORDER=1>
<TR>
<TD>
Montant en Francs
</TD>
<TD>
<INPUT TYPE="TEXT" NAME="francs">
</TD>
</TR>

<TR>
<TD COLSPAN=2 ALIGN="CENTER">
<INPUT TYPE="BUTTON" VALUE="Convertir" onClick="franc_euro(this.form);">
<INPUT TYPE="RESET" VALUE="Effacer">
</TD>
</TR>

<TR>
<TD>
R&eacute;sultat en Euros
</TD>
<TD>
<INPUT TYPE="TEXT" NAME="totaleuro">
</TD>
</TR>
</TABLE>
</FORM>

</TD><TD>

<FORM>
<INPUT TYPE="HIDDEN" NAME="taux" VALUE="6.55957">
<TABLE BORDER=1>
<TR>
<TD>
Montant en Euros
</TD>
<TD>
<INPUT TYPE="TEXT" NAME="euro">
</TD>
</TR>
<TR>
<TD COLSPAN=2 ALIGN="CENTER">
<INPUT TYPE="BUTTON" VALUE="Convertir" onClick="euro_franc(this.form);">
<INPUT TYPE="RESET" VALUE="Effacer">
</TD>
</TR>
<TR>
<TD> R&eacute;sultat en Francs
</TD>
<TD>
<INPUT TYPE="TEXT" NAME="totalfrancs">
</TD>
</TR>
</TABLE>

</TR></TD>
</TABLE>

</CENTER>

</FORM>
<br>


<b>Le SMIC :</b> (salaire minimum interprofessionnel de croissance)<br> 
<br>
<font size=2 face="helvetica">
Au 1er juillet 2007, le montant mensuel brut (pour une base 35 heures par semaine) &eacute;tait de 1 280 euros (pour 151,67 heures mensuel) au taux horaire de 8,44 euros.</font>
<br>
<br>
<b>Cong&eacute;s pay&eacute;s l&eacute;gaux&nbsp;:</b> 5 semaines par an.
<br><br><br>
<A HREF="#a"<font color="#FF0000">haut de page</font> </A><br>
<br>
</TD></TR>
</TABLE>

</TD></TR>
</TABLE>
</body>
</html>
