<html>
<body background="images/fondtexte2.jpg"  border="0" link=darkblue vlink=darkred>
<basefont size=2 face="helvetica">
<title>Les expressions</title>
<center>
<hr size=2 color=darkred>
<font size=5 color=brown><b>Quelques expressions populaires</b></font>
<hr size=2 color=darkred>
</center>
<br><br><br>
<font size=3 color=brown>
<b>Arriver comme un cheveu sur la soupe</b><br>
</font>
<br><br>
<font size=3 color=brown>
<b>Attaquer bille en t&ecirc;te</b><br>
</font>
<br><br>
<font size=3 color=brown>
<b>Avoir le cul entre deux chaises</b><br>
</font>
<br><br>
<font size=3 color=brown>
<b>Avoir les jetons</b><br>
</font>
<br><br>
<font size=3 color=brown>
<b>Boire &agrave; tire la Rigaud  (ou boire comme un sonneur) !</b><br>
</font>

En 1282, un chanoine de Lyon, aurait offert &agrave; son &eacute;glise une cloche nomm&eacute;e "Rigaud" et une vigne dont le vin &eacute;tait r&eacute;serv&eacute; &agrave; ceux qui sonneraient la cloche.<br> 
<br><br>
<font size=3 color=brown>
<b>Comment allez-vous ?</b><br>
</font>
<b>- 17&egrave;me si&egrave;cle :</b> A cette &eacute;poque, les repas des grands de ce monde &eacute;taient tellement copieux qu'ont leurs attribuaient bien des maux (attaque d'apoplexie etc...)<br>
Les m&eacute;decins n'avaient alors que 2 "rem&egrave;des"... la saign&eacute;e et le clyst&egrave;re !<br>
<br>
En fait, lorsqu'on se rencontrait en disant "Comment allez-vous ?" ce n'&eacute;tait qu'une abr&eacute;viation pudique de "Comment allez-vous &agrave; la selle ?"<br>
<br><br>
<font size=3 color=brown>
<b>Faire du ramdam...</b><br>
</font>
<br><br>



<font size=3 color=brown>
<b>La monnaie de singe...</b><br>
</font>
Au moyen Age, lors de leurs d&eacute;placements, les saltimbanques s'acquittaient des droits et p&eacute;ages  en produisant un spectacle qui valait droit de passage. Ce qui leur permettait de voyager sans frais...
<br><br>
<font size=3 color=brown>
<b>Les quatre cents coups...</b><BR>
</font>
<br><br>


<font size=3 color=brown>
<b>M&eacute;nager la ch&egrave;vre et le choux...</b><br>
</font>
<br><br>


<font size=3 color=brown>
<b>Arriver comme un cheveu sur la soupe</b><br>
</font>
<br><br>
<font size=3 color=brown>
<b>Mettre 107 ans...</b><br>
</font>
Cette expression fait r&eacute;f&eacute;rence &agrave; la construction de Notre-Dame de Paris qui a dur&eacute; pr&eacute;cis&eacute;ment 107 ans. C'est de l&agrave; que vient l'expression "mettre 107 ans" (lorsque l'on veut dire que quelque chose dure tr&egrave;s longtemps) !<br>
<br><br>
<font size=3 color=brown>
<b>Passer l'arme &agrave; gauche...</b><br>
</font>
<br><br>
<font size=3 color=brown>
<b>Toucher le Pactole</b><br>
</font>
Cette expression fait r&eacute;f&eacute;rence &agrave; la rivi&egrave;re Pactole (situ&eacute;e &agrave; Sardes la capitale du royaume de Lydie, ancien pays &agrave; l'Ouest de l'Asie Mineure) et &agrave; ses p&eacute;pites d'or qui sont &agrave; l'origine de la fabuleuse richesse du roi Cr&eacute;sus.

<br><br>
<font size=3 color=brown>
<b>Verser des larmes de crocodiles</b><br>
</font>
Cette expression date de l'Antiquit&eacute; gr&eacute;co-latine.<br>
Elle fait r&eacute;f&eacute;rence &agrave; la l&eacute;gende qui affirmait que les crocodiles pr&eacute;sents sur les bords du Nil (Egypte) poussaient des g&eacute;missements &agrave; fendre les pierres pour attirer les candides...<br>
<br><br>
<br><br><br><br><br>
</body>
</html>