<html>
<body background="images/fondtexte2.jpg" text="black" vlink="green" border="0">
<title>Histoire de l'aviation</title>
<center><font size=5><font color="brown">L'AVIATION</font></font></center>



<table>
<tr>
<td WIDTH=120 valign="TOP" align="right">
<b>juin 1783 :</b>
</td>
<td> Joseph et Etienne MONTGOLFIER (originaires d'<a href="rhonealpes/ardeche/annonay.html"Target="description">Annonay</a>) r&eacute;ussisent &agrave; parcourir 2,5 Km &agrave; bord de leur montgolfi&egrave;re...attirant ainsi l'attention de l'acad&eacute;mie des sciences !<br><br>
</td>
</tr>

<tr>
<td valign="TOP" align="right">
<b>septembre 1783 :</b>
</td>
<td>
 Les fr&egrave;res Montgolfier pr&eacute;sentent leur ballon au roi Louis&nbsp;XVI et &agrave; Marie-Antoinette. La nacelle transportait un canard, un coq et un mouton, prouvant ainsi l'innocuit&eacute; du vol en atmosph&egrave;re.<br><br>
</td>
</tr>

<tr>
<td valign="TOP" align="right">
 <b>novembre 1783 :</b>
</td>
<td>
 Pil&acirc;tre de Rozier effectue le premier voyage a&eacute;rien, au-dessus de Paris.<br><br>
</td>
</tr>
<tr>
<td valign="TOP" align="right">
<b>1797 :</b>
</td>
<td>
 Premier saut en parachute r&eacute;alis&eacute; par le Fran&ccedil;ais Andr&eacute;-Jacques Garnerin.<br>
Il sauta d'un ballon &agrave; 650 m d'altitude (au-dessus de la plaine Monceau &agrave; Paris).<br><br>
</td>
</tr>

<tr>
<td valign="TOP" align="right">
<b>1799 :</b>
</td>
<td>
 Premier saut en parachute d'une femme r&eacute;alis&eacute; par la Fran&ccedil;aise Jeanne-Genevi&egrave;ve Labrosse.<br><br>
</td>
</tr>

<tr>
<td valign="TOP" align="right">
 <b>D&eacute;cembre 1856 :</b>
</td>
<td>
 Jean-Marie Le Bris r&eacute;ussit le 1er vol attest&eacute; d'un plus lourd que l'air !<br>
 Sur la plage de Tr&eacute;feuntec (Finist&egrave;re), avis de coup de vent. une charrette lanc&eacute;e &agrave; pleine vitesse tire un &eacute;trange canot ail&eacute;, l'Albatros...<br>
 gr&acirc;ce &agrave; la vitesse cumul&eacute;e du vent et de la charrette, le planeur breton a d&eacute;coll&eacute;, arrachant m&ecirc;me le pilote de son si&egrave;ge et l'&eacute;levant &agrave; 100m d'altitude !<br><br>
</td>
</tr>
</table> 
      
 
<table>
<tr>
<td WIDTH=120 align="TOP" align="right">
<b>9 octobre 1890 :</b> 
 <img src="images/clementader.jpg" alt="Cl&eacute;ment ADER" width="70" height="92">
</td>
<td>

 <a href="celebrites/clementader.html"target="description">Cl&eacute;ment ADER</a> r&eacute;ussit &agrave; faire un bond de 50 m &agrave; 20 cm du sol dans le parc du ch&acirc;teau d'Armainvilliers...<br>
</td>

<td>
</td>
<td>
<img src="images/avion_eole.jpg" alt="L'&eacute;ole">
</td>
</tr>
</table>
<table>
<tr>
<td WIDTH=120 valign="TOP" align="right">
</td>
<td>
sans autre aide que le moteur &agrave; vapeur de son engin (l'Eole) pour lequel il a cr&eacute;e le mot "avion" (&agrave; partir du mot latin "avis"="oiseau")<br><br>
</td>
</tr>
</table>

<table>
<tr>
<td WIDTH=120 valign="TOP" align="right">
<b>14 mai 1908 :</b> 
<img src="images/wilburwright.jpg" alt="Wilbur Wright">
</td>
<td>

Wilbur Wright r&eacute;alise au &Eacute;tats-Unis le premier vol au monde avec un passager.<br> 
<td>
<img src="images/farman.jpg" alt="Henri Farman">
</td>
<td>

 Henri Farman r&eacute;alisera le m&ecirc;me exploit en France 15 jours plus tard.<br>
</td>
</tr>
</table>
<br>
<table>
<tr>
<td WIDTH=120 valign="TOP" align="right">
<b>25 juillet 1909 :</b>
<img src="images/bleriot.jpg" alt="Louis Bl&eacute;riot">
</td>
<td>
Louis Bl&eacute;riot r&eacute;alise la 1&egrave;re travers&eacute;e de la Manche (en reliant Calais &agrave; Northfall Meadow en 38 minutes).<br><br>
</td>
</tr>
</table>
<br>
<table>
<tr>
<td WIDTH=120 valign="TOP" align="right">
<b>1913 :</b>
<img src="images/rolandgarros.jpg" alt="Roland GARROS" width="71" height="78">
</td>
<td>
Roland GARROS officier et aviateur fran&ccedil;ais r&eacute;ussit la premi&egrave;re travers&eacute;e a&eacute;rienne de la mer M&eacute;diterran&eacute;e !<br><br>
</td>
</tr>
</table>
<br>
<table>
<tr>
<td WIDTH=120 valign="TOP" align="right">

<b>1921 :</b>
</td>

<td>
 Vol du 1er h&eacute;licopt&egrave;re dans le Doubs (&agrave; 8 m d'altitude)<br><br>
</td>

</tr>

<tr>
<td valign="TOP" align="right">
<b>1933 :</b>
</td>

<td>
 La fusion de plusieurs soci&eacute;t&eacute;s priv&eacute;es (Farman, Air Orient, l'A&eacute;ropostale, la compagnie franco-roumaine de navigation a&eacute;rienne, Air Union) va donn&eacute; naissance &agrave; Air France.<br><br>
</td>
</tr>
</table>  

</body>
</html>

