<html>
<body background="fondtexte2.jpg" text="black"  border="0">

La cuisine est n&eacute;e de la cueillette et de la chasse, mais c'est la d&eacute;couverte du
feu qui lui fera faire un pas d&eacute;cisif...<br>
<br>
L'av&egrave;nement de la gastronomie (mot invent&eacute; par un certain Monsieur BERCHOUX !) a eu
 lieu lorsque la n&eacute;cessit&eacute; de manger a fait place au plaisir, lorsque la pr&eacute;paration 
des mets est devenu un art ... <br>
<br><br>


<b>1437 :</b> Platine (1421-1481), &eacute;crit le 1er livre de cuisine imprim&eacute;... <br>&nbsp;
<br><br>
<b>17 &egrave;me si&egrave;cle :</b> Apparition du potage !<br>
<br>
L'usage de la fourchette nous vient de Venise et ne date que de 3 si&egrave;cles !<br>
<br><br><br>





<b>La moutarde</b><br>
La moutarde de Dijon, d&eacute;j&agrave; fameuse au 13&egrave;me si&egrave;cle, n'a pas toujours eu l'aspect qu'on
lui connait. A cette &eacute;poque elle arrivait s&egrave;che ou en pastilles 
(on la conservait ainsi pendant plusieurs ann&eacute;es) chez le consommateur qui la d&eacute;layait ensuite avec du
vinaigre ....<br>
<br>
 La moutarde d'Angers, &eacute;galement fort renomm&eacute;e, &eacute;tait liquide et s'exp&eacute;diait dans de 
petits barils.<br>
 Ce n'est que vers le 17&egrave;me si&egrave;cle que Dijon se mit &agrave; vendre &eacute;galement de la moutarde 
liquide...(Pour en assurer sa conservation, on y plongeait des charbons ardents).<br>
<br>

 La moutarde a inspir&eacute; un nombre incalculable de proverbes dont certains sont arriv&eacute;s jusqu'&agrave;
nous comme:<br>
"La moutarde lui monte au nez" se dit d'une personne qui s'impatiente, se met en col&egrave;re.<br>
"De la moutarde apr&egrave;s d&icirc;ner" se dit d'une chose qui arrive trop tard, quand on n'en a
plus besoin.<br>

<br><br><br>

<b>Le poivre :</b><br>
Plante tropicale, de type liane qui peut atteindre 6 m de hauteur...<br>
Le fruit du poivrier se pr&eacute;sente sous la forme d'une grappe pendante form&eacute;e de 20 &agrave; 30
grains serr&eacute;s contre l'axe, d'abord verts et ensuite jaunes &agrave; leur maturit&eacute;.<br>
<br>
 On cueille les grappes lorsque les grains sont jaunes puis on les fait s&eacute;cher jusqu'&agrave;
ce qu'ils deviennent un peu plus bruns ou plus noir&acirc;tres...<br>

<br><br><br>
<hr>
<b>Le sucre :</b><br>
<br>
Vers la fin du 15&egrave;me si&egrave;cle : les europ&eacute;ens abordent les c&ocirc;tes africaines. On d&eacute;couvre la canne &agrave; sucre...<br>
<br>
16, 17, 18&eacute;me si&egrave;cles :(jusqu'&agrave; peu apr&egrave;s la R&eacute;volution fran&ccedil;aise), l'histoire du sucre,  c'est l'histoire de l'esclavage. Le sucre qui au début &eacute;tait un ingr&eacute;dient pour les pharmacies a du succ&egrave;s... Progressivement, il va remplacer le miel, sa consommation augmente, l'esclavage suit...<br>
<br>

La France produit, selon les ann&eacute;es, 4,5 millions de tonnes de sucre, tr&egrave;s souvent &agrave; partir de betteraves. En effet 230 &agrave; 280 milliers de tonnes sont produites dans les d&eacute;partements d'Outre-mer, &agrave; partir de cannes &agrave; sucre.
En m&eacute;tropole, le sol betteravier repr&eacute;sente environ 400 000 hectares et les r&eacute;coltes, &agrave; l'hectare, d&eacute;passent d&eacute;sormais r&eacute;guli&egrave;rement 11 &agrave; 12 tonnes de sucre, ce qui place la France parmi les r&eacute;gions les plus grandes du monde en mati&egrave;re sucri&egrave;re. La France compte 34 sucreries qui transforment les betteraves en sucre, et deux autres transformant le sucre brut de cannes en sucre blanc, &agrave; Marseille et &agrave; Nantes.<br>
<br><br>
La canne &agrave; sucre :<br>
<br>
La canne &agrave; sucre ressemble au roseau. Elle pousse dans les pays chauds et humides comme en Asie (la Chine, l'Inde, les Philippines) en Am&eacute;rique (le Mexique, le Br&eacute;sil, les Antilles), en Afrique et en Australie.
Le pourcentage de sucre contenu dans les tiges varie de 6 &agrave; 16%. On enl&egrave;ve le sucre de sa tige. La canne est coup&eacute;e au ras du sol car c'est le bas qui contient le plus de sucre. La canne &agrave; sucre grandit pendant un an, puis on la coupe &agrave; la main ou avec une machine. On l'apporte &agrave; la sucrerie : d&eacute;coup&eacute;e en morceaux, broy&eacute;e, elle passe dans un moulin qui extrait un jus sucr&eacute;. Ce jus est purifi&eacute;(4) et chauff&eacute; jusqu'&agrave; obtenir un sirop, puis du sucre. Le jus de cette canne &agrave; sucre est filtr&eacute;. On le d&eacute;barrasse des impuret&eacute;s.<br>
<br><br>


La betterave &agrave; sucre :<br>
<br>
La betterave sucri&egrave;re est une plante bisannuelle(5), mais la r&eacute;colte de la racine a lieu tous les ans. L'am&eacute;lioration(6) des vari&eacute;t&eacute;s permet maintenant de la cultiver dans des r&eacute;gions au climat m&eacute;diterran&eacute;en (Gr&egrave;ce, Californie, Afrique du Nord).
La production en sucre des racines varie de 15 &agrave; 20% du poids. Les semis ont lieu habituellement &agrave; la fin de l'hiver, dans un sol tr&egrave;s travaill&eacute;. Fragile comme la canne &agrave; sucre, cette plante pousse bien en plaine sous un climat temp&eacute;r&eacute;. Le traitement des racines de betterave doit se faire juste apr&egrave;s la r&eacute;colte, sinon la betterave perd son sucre. Arriv&eacute;es &agrave; la sucrerie, les betteraves sont coup&eacute;es en lani&egrave;res, " les cosettes ", qui, plac&eacute;es dans de grands r&eacute;cipients rotatifs(8), vont perdre leur sucre. On obtient alors un jus sucr&eacute; contenant 13 &agrave; 14% de sucre et les impuret&eacute;s seront enlev&eacute;es par un traitement &agrave; la chaux.<br>
<br><br>


 6.Le sucre, ingr&eacute;dient important pour nous :
Ingr&eacute;dient qui vient de la nature, &eacute;galement connu sous le nom de saccharose, le sucre est un ingr&eacute;dient du quotidien alimentaire, qui doit en effet comporter entre 50 et 55% de sucre. Le sucre est essentiel au bien-&ecirc;tre et &agrave; l'&eacute;quilibre.

 7.Toutes les sortes de sucre :
Le sucre se pr&eacute;sente sous plusieurs formes. La couleur varie du brun au blanc.Le blanc est plus raffin&eacute;(9) que le roux. Il y a 7 sortes de sucre : le sucre cristallis&eacute;, le sucre candi, le sucre liquide, la cassonade, le sucre glace, le sucre en poudre et le sucre en morceaux.

 8.Questions :
1.A quoi ressemble la canne &agrave; sucre ?
A un roseau.

2.Combien de fois par an se r&eacute;coltent les betteraves ?
Tous les 2 ans.

 3.Combien de sucre doit-on manger par jour pour une alimentation &eacute;quilibr&eacute;e ?
50 &agrave; 55 %.

 4.Quand on coupe les betteraves en lani&egrave;res comment cela s'appelle ?
Cela s'appelle des cossettes.

 5.Qui a d&eacute;couvert la canne &agrave; sucre ?
Les europ&eacute;ens !
</pre>
<hr>
<br><br>
<b>Le sandwich :</b><br>
C'est John Montagu (4&egrave;me comte de Sandwich 1718-1792) qui donna ses lettre de noblesse
&agrave; ce qui n'&eacute;tait &agrave; l'origine qu'un en-cas de gigot d'agneau &eacute;minc&eacute; ou de jambon fum&eacute;
serr&eacute; entre 2 tranches de pain de mie destin&eacute; &agrave; nourrir sans interrompre les joueurs
acharn&eacute;s d'une table de jeu...<br>
<br><br>


La science qui nourrit les hommes en vaut bien d'autres ;-))<br>

</body>
</html>








