<html>
<body background="images/fondtexte2.jpg" text="black" vlink="black" border="0">
<title>La poste</title>
 
<center><font size=5><font color="brown">LA POSTE</font></font></center><br>
<br><br>





 La France a &eacute;t&eacute; le premier pays &agrave; &eacute;tablir le service de la poste... c'est donc la France qui en cr&eacute;ant cette institution importante l'a enseign&eacute; aux autres nations ce qui a permis un immense progr&egrave;s social...<br>
<br>
Contrairement aux relais de l'antiquit&eacute; romaine (exclusivement r&eacute;serv&eacute; aux courriers du souverain et entretenus aux frais des habitants , ce qui &eacute;tait pour le peuple des villes, et surtout des campagnes,  un imp&ocirc;t des plus on&eacute;reux), ceux de l'administration fran&ccedil;aise, &eacute;taient financ&eacute;s &agrave; l'origine par le Tr&eacute;sor public avant de se suffire &agrave; eux m&ecirc;me...De plus, les courriers n'&eacute;taient plus r&eacute;serv&eacute;s &agrave; l'usage  exclusif du roi, les particuliers pouvaient enfin en profiter...<br>
<br>
- Au milieu du 15&egrave;me si&egrave;cle, c'est Louis XI qui mettra en place les premi&egrave;res bases de l'institution des postes.<br>

<br>





 Certes, on peut soutenir qu'il y a eu des postes dans plusieurs empires de l'Antiquit&eacute;, en ce sens que les souverains avaient soin d'entretenir sur les principales routes des relais destin&eacute;s &agrave; leurs courriers. C'est ce qu'avaient fait en Perse le grand Cyrus et &agrave; Rome, Auguste et ses successeurs. Mais c'était uniquement pour l'état !<br>
<br>
 Les uns &eacute;taient tout monarchiques, tandis que les autres sont tout populaires ; les uns ne servaient qu'aux affaires du souverain, tandis que les autres servent aux affaires de tout le monde. Le perfectionnement que la poste aux lettres a introduit dans les soci&eacute;t&eacute;s est v&eacute;ritablement immense, et certainement bien sup&eacute;rieur &agrave; celui que les relais entretenus par les souverains avaient pu introduire dans l'administration de leurs &Eacute;tats...<br>


</body>
</html>