<html>
<body background="images/fondtexte2.jpg" text="black" vlink="black" border="0">
<title>La D&eacute;claration des Droits de l'Homme et du Citoyen</title>

<center><font size=5><font color="brown">La D&eacute;claration des Droits de l'Homme et du Citoyen</font></font></center><br>
<br>
Inspir&eacute;e de la d&eacute;claration de l'ind&eacute;pendance am&eacute;ricaine de 1776 et de l'esprit philosophique du XVIII&egrave;me si&egrave;cle, la D&eacute;claration des Droits de l'Homme et du Citoyen de 1789 marque la fin de l'Ancien R&eacute;gime et le d&eacute;but d'une &egrave;re nouvelle. Express&eacute;ment vis&eacute;e par la Constitution de la V&egrave;me R&eacute;publique, elle fait aujourd'hui partie de nos textes de r&eacute;f&eacute;rence.<br>
<br>
<b>L'histoire<br></b>
<br>
La D&eacute;claration des Droits de l'Homme et du Citoyen est, avec les d&eacute;crets des 4 et 11 ao&ucirc;t 1789 sur la suppression des droits f&eacute;odaux, un des textes fondamentaux vot&eacute;s par l'Assembl&eacute;e nationale constituante form&eacute;e &agrave; la suite de la r&eacute;union des Etats G&eacute;n&eacute;raux.<br>
<br>
Adopt&eacute;e dans son principe avant le 14 juillet 1789, elle donne lieu &agrave; l'&eacute;laboration de nombreux projets. Apr&egrave;s de longs d&eacute;bats, les d&eacute;put&eacute;s votent le texte final le 26 ao&ucirc;t 1789.<br>
<br>
Elle comporte un pr&eacute;ambule et 17 articles qui m&ecirc;lent des dispositions concernant l'individu et la Nation. Elle d&eacute;finit des droits "naturels et imprescriptibles" comme la libert&eacute;, la propri&eacute;t&eacute;, la s&ucirc;ret&eacute;, la r&eacute;sistance &agrave; l'oppression. La D&eacute;claration reconna&icirc;t &eacute;galement l'&eacute;galit&eacute;, notamment devant la loi et la justice. Elle affirme enfin le principe de la s&eacute;paration des pouvoirs.<br>
<br>
Ratifi&eacute;e seulement le 5 octobre par Louis XVI sous la pression de l'Assembl&eacute;e et du peuple accouru &agrave; Versailles, elle sert de pr&eacute;ambule &agrave; la premi&egrave;re Constitution de la R&eacute;volution Fran&ccedil;aise, adopt&eacute;e en 1791. Bien que la R&eacute;volution elle-m&ecirc;me ait, par la suite, reni&eacute; certains de ses principes et &eacute;labor&eacute; deux autres d&eacute;clarations des Droits de l'Homme en 1793 et 1795, c'est le texte du 26 ao&ucirc;t 1789 qui est devenu une r&eacute;f&eacute;rence pour nos institutions, notamment dans les Constitutions de 1852, 1946 et 1958.<br>
<br>
La D&eacute;claration de 1789 inspire, au XIX&egrave;me si&egrave;cle, des textes similaires dans de nombreux pays d'Europe et d'Am&eacute;rique latine. La tradition r&eacute;volutionnaire fran&ccedil;aise est &eacute;galement pr&eacute;sente dans la Convention europ&eacute;enne des Droits de l'Homme sign&eacute;e &agrave; Rome le 4 novembre 1950.<br>
<br>
<b>Le texte<br></b>
<br>
Les repr&eacute;sentants du peuple fran&ccedil;ais, constitu&eacute;s en Assembl&eacute;e nationale, consid&eacute;rant que l'ignorance, l'oubli ou le m&eacute;pris des droits de l'homme sont les seules causes des malheurs publics et de la corruption des gouvernements, ont r&eacute;solu d'exposer, dans une d&eacute;claration solennelle, les droits naturels, inali&eacute;nables et sacr&eacute;s de l'homme, afin que cette d&eacute;claration, constamment pr&eacute;sente &agrave; tous les membres du corps social, leur rappelle sans cesse leurs droits et leurs devoirs ; afin que les actes du pouvoir l&eacute;gislatif et ceux du pouvoir ex&eacute;cutif, pouvant &ecirc;tre &agrave; chaque instant compar&eacute;s avec le but de toute institution politique, en soient plus respect&eacute;s ; afin que les r&eacute;clamations des citoyens, fond&eacute;es d&eacute;sormais sur des principes simples et incontestables, tournent toujours au maintien de la Constitution et au bonheur de tous.<br>
<br>
En cons&eacute;quence, l'Assembl&eacute;e nationale reconna&icirc;t et d&eacute;clare, en pr&eacute;sence et sous les auspices de l'Etre Supr&ecirc;me, les droits suivants de l'homme et du citoyen.<br>
<br>
<b>Article premier.</b><br>
<br>
- Les hommes naissent et demeurent libres et &eacute;gaux en droits. Les distinctions sociales ne peuvent &ecirc;tre fond&eacute;es que sur l'utilit&eacute; commune.<br>
<br>
<b>Article 2.</b><br>
<br>
- Le but de toute association politique est la conservation des droits naturels et imprescriptibles de l'homme. Ces droits sont la libert&eacute;, la propri&eacute;t&eacute;, la s&ucirc;ret&eacute; et la r&eacute;sistance &agrave; l'oppression.<br>&nbsp;
<br>
<b>Article 3.</b><br>
<br>
- Le principe de toute souverainet&eacute; r&eacute;side essentiellement dans la Nation. Nul corps, nul individu ne peut exercer d'autorit&eacute; qui n'en &eacute;mane express&eacute;ment.<br>
<br>
<b>Article 4.</b><br>
<br>
- La libert&eacute; consiste &agrave; pouvoir faire tout ce qui ne nuit pas &agrave; autrui : ainsi, l'exercice des droits naturels de chaque homme n'a de bornes que celles qui assurent aux autres membres de la soci&eacute;t&eacute; la jouissance de ces m&ecirc;mes droits Ces bornes ne peuvent &ecirc;tre d&eacute;termin&eacute;es que par la loi.<br>
<br>
<b>Article 5.</b><br>
<br>
- La loi n'a le droit de d&eacute;fendre que les actions nuisibles &agrave; la soci&eacute;t&eacute;. Tout ce qui n'est pas d&eacute;fendu par la loi ne peut &ecirc;tre emp&ecirc;ch&eacute;, et nul ne peut &ecirc;tre contraint &agrave; faire ce qu'elle n'ordonne pas.<br>
<br>
<b>Article 6.</b><br>
<br>
- La loi est l'expression de la volont&eacute; g&eacute;n&eacute;rale. Tous les citoyens ont droit de concourir personnellement ou par leurs repr&eacute;sentants &agrave; sa formation. Elle doit &ecirc;tre la m&ecirc;me pour tous, soit qu'elle prot&egrave;ge, soit qu'elle punisse. Tous les citoyens, &eacute;tant &eacute;gaux &agrave; ses yeux, sont &eacute;galement admissibles &agrave; toutes dignit&eacute;s, places et emplois publics, selon leur capacit&eacute; et sans autre distinction que celle de leurs vertus et de leurs talents.<br>
<br>
<b>Article 7.</b><br>
<br>
- Nul homme ne peut &ecirc;tre accus&eacute;, arr&ecirc;t&eacute; ou d&eacute;tenu que dans les cas d&eacute;termin&eacute;s par la loi et selon les formes qu'elle a prescrites. Ceux qui sollicitent, exp&eacute;dient, ex&eacute;cutent ou font ex&eacute;cuter des ordres arbitraires doivent &ecirc;tre punis ; mais tout citoyen appel&eacute; ou saisi en vertu de la loi doit ob&eacute;ir &agrave; l'instant ; il se rend coupable par la r&eacute;sistance.<br>
<br>
<b>Article 8.</b><br>
<br>
- La loi ne doit &eacute;tablir que des peines strictement et &eacute;videmment n&eacute;cessaires, et nul ne peut &ecirc;tre puni qu'en vertu d'une loi &eacute;tablie et promulgu&eacute;e ant&eacute;rieurement au d&eacute;lit, et l&eacute;galement appliqu&eacute;e.<br>
<br>
<b>Article 9.</b><br>
<br>
Tout homme &eacute;tant pr&eacute;sum&eacute; innocent jusqu'&agrave; ce qu'il ait &eacute;t&eacute; d&eacute;clar&eacute; coupable, s'il est jug&eacute; indispensable de l'arr&ecirc;ter, toute rigueur qui ne serait pas n&eacute;cessaire pour s'assurer de sa personne doit &ecirc;tre s&eacute;v&egrave;rement r&eacute;prim&eacute;e par la loi.<br>
<br>
<b>Article 10.</b><br>
<br>
- Nul ne doit &ecirc;tre inqui&eacute;t&eacute; pour ses opinions, m&ecirc;me religieuses, pourvu que leur manifestation ne trouble pas l'ordre public &eacute;tabli par la loi.&nbsp;<br>
<br>
<b>Article 11.</b><br>
<br>
- La libre communication des pens&eacute;es et des opinions est un des droits les plus pr&eacute;cieux de l'homme ; tout citoyen peut donc parler, &eacute;crire, imprimer librement, sauf &agrave; r&eacute;pondre de l'abus de cette libert&eacute; dans les cas d&eacute;termin&eacute;s par la loi.<br>
<br>
<b>Article 12.</b><br>
<br>
- La garantie des droits de l'homme et du citoyen n&eacute;cessite une force publique ; cette force est donc institu&eacute;e pour l'avantage de tous, et non pour l'utilit&eacute; particuli&egrave;re de ceux &agrave; qui elle est confi&eacute;e.<br>
<br>
<b>Article 13.</b><br>
<br>
- Pour l'entretien de la force publique, et pour les d&eacute;penses d'administration, une contribution commune est indispensable ; elle doit &ecirc;tre &eacute;galement r&eacute;partie entre les citoyens, en raison de leurs facult&eacute;s.<br>
<br>
<b>Article 14.</b><br>
<br>
- Les citoyens ont le droit de constater, par eux-m&ecirc;mes ou par leurs repr&eacute;sentants, la n&eacute;cessit&eacute; de la contribution publique, de la consentir librement, d'en suivre l'emploi, et d'en d&eacute;terminer la quotit&eacute;, l'assiette, le recouvrement et la dur&eacute;e.<br>
<br>
<b>Article 15.</b><br>
<br>
- La soci&eacute;t&eacute; a le droit de demander compte &agrave; tout agent public de son administration.&nbsp;<br>
<br>
<b>Article 16.</b><br>
<br>
- Toute soci&eacute;t&eacute; dans laquelle la garantie des droits n'est pas assur&eacute;e ni la s&eacute;paration des pouvoirs d&eacute;termin&eacute;e, n'a point de Constitution.&nbsp;<br>
<br>
<b>Article 17.</b><br>
<br>
- La propri&eacute;t&eacute; &eacute;tant un droit inviolable et sacr&eacute;, nul ne peut en &ecirc;tre priv&eacute;, si ce n'est lorsque la n&eacute;cessit&eacute; publique, l&eacute;galement constat&eacute;e, l'exige &eacute;videmment, et sous la condition d'une juste et pr&eacute;alable indemnit&eacute;.<br>

</body>
</html>