<html>
<title>Les dates de l'histoire</title>

<body background="images/fondtexte2.jpg">
<a name="a"></a>

<center>

<HR size=2 color=darkred>
<font size=5 color="brown"><strong>LES DATES de L'HISTOIRE</strong></font>
<HR size=2 color=darkred>

<br><br>

<TABLE width=550>
<TR><TD>
<font size=3 face="helvetica">
- <b>vers 52 avant J.C</b> Jules C&eacute;sar et ses l&eacute;gions envahissent la Gaule.<br>
<br>
- <b>en 481 et jusqu'en 511</b> Ce sont les Francs de Clovis  qui y r&egrave;gneront jusqu'&agrave; la mort de ce dernier (511)<br>
<br>
- <b>En 771</b> Charlemagne prend le pouvoir<br>
<br>
- <b>En 843</b> Lors du partage de l'empire de Charlemagne (trait&eacute; de Verdun), elle revient &agrave; charles II le Chauve.<br>
<br>

- <b>1347</b> &Eacute;pidemie de peste noire<br>
<BR>
- <b>Septembre 1494</b> 

Premi&egrave;re exp&eacute;dition men&eacute;e en Italie par Charles VIII.<br> 
<br> 
- <b>22 f&eacute;vrier 1495</b> Charles VIII entre dans Naples.<br> 
<br> 
- <b>Juin 1496</b> Perte de Naples par les Fran&ccedil;ais<br> 
<br> 
- <b>7 avril 1498</b> Mort de Charles VIII, LOUIS XII roi de France.<br> 
<br> 
- <b>Septembre 1499</b> LOUIS XII conquiert le Milanais.<br> 
<br> 
- <b>11 novembre 1500</b> Trait&eacute; de Grenade qui pr&eacute;voit le partage du Royaume de Naples entre Louis XII et Ferdinand d'Aragon.<br> 
<br> 
- <b>1501</b> Conqu&ecirc;te du Royaume de Naples par les Fran&ccedil;ais.<br> 
<br> 
- <b>Juin 1502</b> L'application du trait&eacute; de Grenade d&eacute;clenche la reprise de la guerre entre les Fran&ccedil;ais et les Espagnols<br>  
<br> 
- <b>Juin 1503</b> Les Fran&ccedil;ais sont chass&eacute;s du royaume de Naples et de Sicile par le roi d'Aragon.<br>
 
 Jules II prend la succession du pape Pie III...<br>

 Amerigo Vespucci pense que&nbsp; les terres d&eacute;couvertes par Christophe Colomb pourraient ne pas &ecirc;tre les Indes mais un nouveau continent.<br>




<br> 
- <b>Mars 1504</b> Par la tr&ecirc;ve de Blois, LOUIS XII abandonne la royaume de Naples &agrave; Ferdinand d'Aragon.<br> 
<br> 
- <b>1507</b> R&eacute;volte de G&ecirc;nes contre les Fran&ccedil;ais. Bayard rejoint l'arm&eacute;e fran&ccedil;aise.<br>
<br>
- <b>1508</b> La France et le pape Jules II forment la ligue de Cambrai contre Venise<br> 
<br> 
- <b>1509</b> Mort D'Henri VII en Angleterre, av&egrave;nement d'Henri VIII.<br> 
<br> 
- <b>15 mai 1509</b> Victoire fran&ccedil;aise &agrave; Agnadel contre Venise.<br> 
<br> 
- <b>4 octobre 1511</b> Formation d'une Sainte Ligue contre la France.<br> 
<br> 
- <b>11 avril 1512</b> Gaston de FOIX l'emporte &agrave; Ravenne contre la Sainte Ligue.<br> 
<br> 
- <b>11 mars 1513</b> LEON X (Jean de M&eacute;dicis) est &eacute;lu pape.<br> 
<br> 
- <b>6 juin 1513</b> Les Fran&ccedil;ais battus &agrave; Novare, quittent le Milanais.<br> 
<br> 
- <b>18 d&eacute;cembre 1513</b> Fin de la guerre d'Italie par la r&eacute;conciliation de LOUIS XII et du pape LEON X.<br> 
<br> 
- <b>1er janvier 1515</b> Mort de LOUIS XII. Av&egrave;nement de FRANCOIS Ier.<br> 
<br> 
- <b>14 septembre 1515</b> Apr&egrave;s la victoire de Marignan, FRANCOIS Ier occupe le Milanais.<br>  
<br> 
- <b>Mars 1516</b> Apr&egrave;s la mort de Julien de M&eacute;dicis, L&eacute;onard de Vinci accepte l'invitation de Fran&ccedil;ois 1er... Le Clos Luc&eacute; (appel&eacute; &agrave; l'&eacute;poque Manoir du Cloux) pr&egrave;s du ch&acirc;teau d'Amboise sera sa demeure. 
<br>  
<br> 
- <b>18 ao&ucirc;t 1516</b> Concordat de Bologne entre FRANCOIS Ier et le pape LEON X.<br> 
<br> 
- <b>29 novembre 1516</b> Paix perp&eacute;tuelle entre la France et les cantons Suisses.<br> 
<br> 
- <b>7 f&eacute;vrier 1517</b> FRANCOIS Ier d&eacute;cide de la cr&eacute;ation du port du Havre-de-Gr&acirc;ce.<br> 
<br> 
- <b>31 octobre 1517</b> Parution des 95 th&egrave;ses de Martin LUTHER.<br> 
<br> 
- <b>2 mai 1519</b> Mort de L&eacute;onard de VINCI au clos-Luc&eacute; d'Amboise.(il repose dans la chapelle Saint Hubert, au ch&acirc;teau d'Amboise...)<br>
<br> 
- <b>28 juin 1519</b> CHARLES Ier, roi d'Espagne, devient l'empereur CHARLES QUINT<br> 
<br> 

- <b>1520</b> Fran&ccedil;ois 1er fonde la Biblioth&egrave;que&nbsp; Royale (Paris) qui deviendra (apr&egrave;s la r&eacute;volution) la Biblioth&egrave;que Nationale<br>
<br> 
- <b>3 janvier 1521 :</b> Excommunication du moine allemand Martin LUTHER<br>
<br>
- <b>Ao&ucirc;t 1521</b> Guerre entre CHARLES QUINT et FRANCOIS Ier.<br> 
<br> 
- <b>1er d&eacute;cembre 1521</b> Mort de LEON X.<br> 
<br> 
- <b>29 avril 1522 </b> Le mar&eacute;chal LAUTREC est battu &agrave; la bataille de La Bicocque.<br> 
<br> 
-<b>24 f&eacute;vrier 1525</b> CHARLES QUINT bat FRANCOIS Ier &agrave; Pavie et le retient prisonnier en Italie puis &agrave; Madrid.<br> 
<br> 
- <b>14 janvier 1526</b> Trait&eacute; de Madrid que FRANCOIS Ier refusa d'Honorer.<br> 
<br> 
- <b>22 mai 1526</b> FRANCOIS Ier, le pape, le duc de Milan, le doge de Venise concluent la Ligue de Cognac contre CHARLES QUINT.<br> 
<br> 
- <b>Mai 1527</b> Sac de Rome par les troupes imp&eacute;riales.<br> 
<br> 
- <b>Avril 1529</b> La grande Rebeyne de Lyon, &eacute;meute contre la vie ch&egrave;re et le manque de subsistance.<br> 
<br> 
- <b>3 ao&ucirc;t 1529</b> Trait&eacute; de Cambrai, ou paix des Dames, sign&eacute; entre Louise de Savoie et Marguerite d'Autriche.<br> 
<br> 
- <b>13 ao&ucirc;t 1532</b> R&eacute;union de La Bretagne &agrave; la France.<br> 
<br> 
- <b>Septembre 1532</b> Les Vaudois adh&egrave;rent au protestantisme.<br> 
<br> 
- <b>14 ao&ucirc;t 1534</b> IGNACE DE LOYOLA forme &agrave; Paris le noyau de la future compagnie de JESUS.<br> 
<br> 
- <b>17-18 octobre 1534</b> Affaire des Placards en France.Les protestants posent des affiches dans Paris et jusque dans la chambre du roi, contre l'Eglise, contre le pape.<br> 
<br> 
- <b>Octobre 1534</b> Jacques CARTIER est au Canada.<br> 
<br> 
- <b>1535</b> Premi&egrave;re Bible protestante en Fran&ccedil;ais.<br> 
<br> 
- <b>16 juillet 1535</b> Edit de Coucy qui mod&egrave;re les pers&eacute;cutions contre certains r&eacute;form&eacute;s en France.<br> 
<br> 
- <b>F&eacute;vrier 1536</b> Commerce fran&ccedil;ais avec Le Levant, favoris&eacute; par les "capitulations" accord&eacute;es par SOLIMAN LE MAGNIFIQUE &agrave; FRANCOIS 1er.<br> 
<br> 
- <b>Automne 1536</b> FRANCOIS 1er envahit la Savoie et CHARLES QUINT la Provence.<br> 
<br> 
- <b>1537</b> Le chantier de Chambord, entrepris en 1519, est achev&eacute;.<br> 

- <b>30 ao&ucirc;t 1539</b> Ordonnance de Villers-Cotter&ecirc;t (FRANCOIS 1er oblige notamment la publication des actes officiels en fran&ccedil;ais et non plus en latin).<br> 
<br> 
- <b>1541</b> Traduction et premi&egrave;re &eacute;dition fran&ccedil;aise de "l'institution de la religion chrestienne" de CALVIN.<br> 
<br> 
- <b>1542</b> Reprise de la guerre entre CHARLES QUINT et FRANCOIS 1er.<br> 
<br> 
- <b>14 avril 1544</b> Victoire fran&ccedil;aise &agrave; C&eacute;risoles.<br> 
<br> 
- <b>Ao&ucirc;t 1544</b> HENRI VIII alli&eacute; de CHARLES QUINT s'empare de Boulogne et menace Paris.<br> 
<br> 
- <b>18 septembre 1544</b> CHARLES QUINT et FRANCOIS 1er signent le trait&eacute; de Cr&eacute;py-en-Laonnois.<br> 
<br> 
- <b>Avril 1545</b> Massacre des vaudois de Provence, &agrave; M&eacute;rindol et &agrave; Cabri&egrave;res.<br> 
<br> 
- <b>7 juin 1576</b> Paix d'Ardres entre FRANCOIS 1er et HENRI VIII. La France r&eacute;cup&egrave;re Boulogne en &eacute;change d'une indemnit&eacute;.<br> 
<br> 
- <b>28 janvier 1547</b> Mort d'HENRI VIII.<br> 
<br> 
- <b>31 mars 1547</b> Mort de FRANCOIS 1er. HENRI II roi de France.<br> 
<br> 
- <b>Et&eacute; 1548</b> R&eacute;volte de la gabelle dans le sud-ouest de la France.<br> 
<br> 
- <b>27 juin 1551</b> Edit de Chateaubriant contre les r&eacute;form&eacute;s de France.<br>  
<br> 
- <b>1552</b> Cr&eacute;ation des Pr&eacute;sidiaux<br> 
<br> 
- <b>15 janvier 1552</b> Trait&eacute; de Chambord entre HENRI II et des princes allemands luth&eacute;rien.<br> 
<br> 
- <b>Avril 1552</b> HENRI II occupe les &eacute;piscopales imp&eacute;riales de Metz, Toul et Verdun.<br> 
<br> 
- <b>1er janvier 1553</b> &Eacute;chec de CHARLES QUINT devant Metz.<br> 
<br> 
- <b>6 juin 1553</b> Mort d'EDOUARD VI; sa demi-soeur Marie TUDOR devient reine d'Angleterre.<br> 
<br> 
- <b>25 octobre 1555</b> CHARLES QUINT transmet les Pays-Bas &agrave; son fils PHILIPPE.<br> 
<br> 
- <b>15 f&eacute;vrier 1556</b> Tr&ecirc;ve de Vaucelles entre HENRI II et CHARLES QUINT.<br> 
<br> 
- <b>Septembre 1556</b> FERDINAND, fr&egrave;re de CHARLES QUINT, re&ccedil;oit les possessions h&eacute;r&eacute;ditaires des Habsbourg et PHILIPPE II h&eacute;rite de la Couronne d'Espagne.<br> 
<br> 
- <b>10 ao&ucirc;t 1557</b> l'Espagne d&eacute;fait l'arm&eacute;e fran&ccedil;aise &agrave; Saint-Quentin.<br> 
<br> 
- <b>8 janvier 1558</b> Fran&ccedil;ois de GUISE enl&egrave;ve Calais. La ville, anglaise depuis 1347, revient &agrave; la France.<br> 
<br> 
- <b>12 septembre 1558</b> Mort de CHARLES QUINT.<br> 
<br> 
- <b>7 novembre 1558</b> Mort de Marie TUDOR. &Eacute;lisabeth 1re devient reine d'Angleterre.<br> 
<br> 
- <b>2-3avril 1559</b> Trait&eacute; du Cateau-Cambr&eacute;sis.<br> 
<br> 
- <b>2 juin 1559</b> Edit d'&Eacute;couen, imposant l'abjuration ou l''exil aux r&eacute;form&eacute;s du royaume de France.<br> 
<br> 
- <b>10 juiillet 1559</b> Mort de HENRI II. Av&egrave;nement de FRANCOIS II.<br> 
<br> 
- <b>F&eacute;vrier-mars 1560</b> Episode de la conjuration d'Amboise.<br> 
<br> 
- <b>5 D&eacute;cembre 1560</b> Mort de FRANCOIS II. CHARLES IX roi et Catherine de MEDICIS r&eacute;gente.<br> 
<br> 
- <b>17 Janvier 1562</b> Edit qui officialise la reconnaissance du protestantisme et permet la c&eacute;l&eacute;bration conditionnelle du culte.<br> 
<br> 
- <b>1er mars 1562</b> Massacre de Wassy en Champagne (1&egrave;re guerre de religion)<br> 
<br> 
- <b>Avril-octobre 1562</b> Vague iconoclaste en France.<br> 
<br>  
- <b>18 f&eacute;vrier 1563</b> Le duc Fran&ccedil;ois de GUISE est tu&eacute; devant Orl&eacute;ans par Poltros de MERE.<br> 
<br> 
- <b>19 mars 1563</b> Paix d'Amboise, fin de la premi&egrave;re guerre de religion<br> 
<br> 
- <b>17 ao&ucirc;t 1563</b> CHARLES IX proclam&eacute; majeur dans un lit de justice tenu au Parlement de Rouen.<br> 
<br> 
- <b>24 janvier 1564</b> D&eacute;but du long voyage de CHARLES IX et de Catherine de MEDICIS dans le royaume.<br> 
<br> 
- <b>27 mai 1564</b> Mort de CALVIN.<br> 
<br> 
- <b>26-28 septembre 1567</b> Surprise de Meaux et d&eacute;clenchement de la seconde guerre de religion.<br> 
<br> 
- <b>10 novembre 1567</b> Bataille de Saint-Denis.<br> 
<br> 
- <b>27 mars 1568</b> Paix de Longjumeau (Fin de la seconde guerre de religion).<br> 
<br> 
- <b>28 septembre 1568</b> Appel aux armes de Jeanne d'ALBRET (D&eacute;but de la troisi&egrave;me guerre de religion).<br> 
<br> 
- <b>13 mars 1569</b> Victoire des catholiques &agrave; la bataille de Jarnac; mort de Louis de CONDE. COLIGNY devient chef de guerre.<br> 
<br> 
- <b>3 octobre 1569</b> Victoire des catholiques dans la bataille de Moncontour.<br> 
<br> 
- <b>Juin 1570</b> Victoire des protestants dans la bataille d'Arnay-le-Duc.<br> 
<br> 
-<b>8 ao&ucirc;t 1570</b> La troisi&egrave;me guerre de religion est close par la paix de Saint-Germain.<br> 
<br> 
-<b>18 ao&ucirc;t 1572</b> Mariage de Henri de NAVARRE et de Marguerite DE VALOIS (1553-1615).<br> 
<br> 
-<b>24 ao&ucirc;t 1572</b> La Saint-Barth&eacute;lemy (quatri&egrave;me guerre de religion).<br> 
<br> 
-<b>Fin ao&ucirc;t-d&eacute;but octobre 1572</b> Saison des Saint-Barth&eacute;lemy.<br> 
<br> 
-<b>Octobre 1572</b> D&eacute;but du si&egrave;ge de La Rochelle par les Catholiques.<br> 
<br> 
-<b>9 Mai 1573</b> Henri de VALOIS, duc d'Anjou (1551-1589) est &eacute;lu roi de Pologne.<br> 
<br> 
-<b>21 Juin 1573</b> Capitulation de La Rochelle.<br> 
<br> 
-<b>11 Juillet 1573</b> Paix de La Rochelle, &eacute;dit de Boulogne. Fin de la quatri&egrave;me guerre de Religion.<br> 
<br> 
-<b>30 mai 1574</b> HENRI III roi de France, Catherine de MEDICIS, r&eacute;gente jusqu'&agrave; son retour de Pologne le 6 septembre.<br>  
<br> 
-<b>3 novembre 1574</b> Manifeste de DAMVILLE justifiant la prise d'arme contre la cour. D&eacute;but de la cinqui&egrave;me guerre de Religion.<br>  
<br> 
-<b>11 octobre 1575</b> Victoire des catholiques dans la bataille de Dormans.<br>  
<br> 
-<b>3 f&eacute;vrier 1576</b> Henri de NAVARRE, retenu prisonnier &agrave; la cour depuis la nuit de la Saint-Barth&eacute;lemy., s'&eacute;vade.<br>  
<br> 
-<b>6 mai 1576</b> Paix de Monsieur (Par l'entremise de Fran&ccedil;ois d'ALENCON), ratifi&eacute;e par de Beaulieu-L&egrave;s-Loches. Fin de la cinqui&egrave;me guerre de Religion.<br> 
<br> 
-<b>Ao&ucirc;t 1576</b> Prise d'Agen par les protestants. D&eacute;but de la sixi&egrave;me guerre de Religion.<br>  
<br> 
-<b>29 d&eacute;cembre 1576</b> HENRI III se d&eacute;clare chef de la Ligue et &eacute;vince les GUISE.<br>  
<br> 
-<b>1er mai 1577</b> Victoire des catholiques dans la bataille de La-Charit&eacute;-sur-Loire (Ni&egrave;vre).<br>  
<br> 
-<b>12 juin 1577</b> Victoire des catholiques dans la bataille d'Issoire (Puy-de-dome).<br>  
<br> 
-<b>Ao&ucirc;t 1577</b> Prise de Brouage par les catholiques.<br>  
<br> 
-<b>17 septembre</b> Paix de Bergerac; &eacute;dit de Poitiers. Fin de la sixi&egrave;me guerre de Religion.<br> 
<br> 
-<b>29 novembre 1579</b> Prise de la F&egrave;re par les protestants. D&eacute;but de la septi&egrave;me guerre de Religion.<br> 
<br> 
-<b>27 mai 1580</b> Prise de Cahors par les protestants.<br>  
<br> 
-<b>Septembre 1580</b> Reprise de La F&egrave;re par les catholiques. Prise de Bergerac par les protestants.<br>  
<br> 
-<b>26 novembre 1580</b> Conf&eacute;rences de paix &agrave; Fleix et &agrave; Coutras (16 d&eacute;cembre). Les stipulations de cette paix sont ratifi&eacute;es par la d&eacute;claration de Blois (24 d&eacute;cembre). Fin de la septi&egrave;me guerre de Religion.<br> 
<br> 
-<b>10 juin 1584</b> Mort de Fran&ccedil;ois d'ALENCON, dernier pr&eacute;tendant des Valois au tr&ocirc;ne, Henri de NAVARRE devient h&eacute;ritier pr&eacute;somptif de la couronne.<br>  
<br> <br> 
-<b>31 d&eacute;cembre 1584</b> Trait&eacute; de Joinville (Haute-Marne); PHILIPPE II d'Espagne s'allie aux GUISE et soutient la Ligue.<br>  
<br> 
-<b>Mars 1585</b> Les chefs de la Ligue se rendent ma&icirc;tres de la Normandie, Picardie, Bretagne, Bourgogne, Champagne.<br> 
<br> 
-<b>7 juillet 1585</b> Trait&eacute; de Nemours, HENRI III accorde aux ligueurs des places fortes et des subventions pour l'entretien de leurs troupes.<br>  
<br> 
-<b>15 juillet 1585</b> Edit d'HENRI III d&eacute;fendant l'exercice du culte r&eacute;form&eacute;, r&eacute;voquant les &eacute;dits de pacification ant&eacute;rieurs et d&eacute;clarant Henri de NAVARRE d&eacute;chu de tous ses droits de succession au tr&ocirc;ne.<br>  
<br> 
-<b>Septembre 1585</b> Prise d'armes des protestants du Languedoc et de La Rochelle. Huiti&egrave;me guerre de Religion ( Elle se double d'une guerre de succession au tr&ocirc;ne).<br>  
<br> 
-<b>21 d&eacute;cembre</b> Excommunication d'Henri de NAVARRE et d'Henri de CONDE par le pape SIXTE-QUINT (ou SIXTE V).<br>  
<br> 
-<b>Ao&ucirc;t 1586</b> Tr&ecirc;ve entre HENRI III et Henri de NAVARRE: arr&ecirc;t des combats dans l'Ouest.<br>  
<br> 
-<b>20 octobre 1587</b> Victoire des protestants dans la bataille de Coutras.<br>  
<br> 
-<b>26 octobre 1587</b> Victoire des catholiques dans la bataille de Vimory (Loiret).<br>  
<br> 
-<b>24 novembre 1587</b> Victoire des catholiques dans la bataille d'Auneau (Eure et Loire).<br>  
<br> 
-<b>9 mai 1588</b> Entr&eacute;e d'Henri de GUISE le Balafr&eacute; &agrave; Paris malgr&eacute; la d&eacute;fense express d'HENRI III qui s'oppose aux demandes de la Ligue.<br>  
<br> 
-<b>11 ou 12 mai 1588</b> Entr&eacute;e dans Paris des troupes royales; journ&eacute;e des barricades le 12. HENRI III doit abandonner la capitale aux ligueurs.<br>  
<br> 
-<b>23-24 d&eacute;cembre 1588</b> Assassinat &agrave; Blois d'Henri de GUISE le Balafr&eacute; par ordre d'HENRI III et de Louis II de GUISE dit le Cardinal.<br>  
<br> 
-<b>7 janvier 1589</b> Edit de l'Union: la Sorbonne d&eacute;lie "le peuple du royaume de France" de l'ob&eacute;issance &agrave; HENRI III.<br>  
<br> 
-<b>Mars 1589</b> Rouen, Lyon, Bourges, Reims, Toulouse, rallient la Ligue.<br>  
<br> 
-<b>30 avril 1589</b> Entrevue de Plessis-les-tours: r&eacute;conciliation et alliance d'HENRI III avec Henri de NAVARRE qui entament ensemble le si&egrave;ge de Paris (juillet). <br> 
<br>  
-<b>1 ao&ucirc;t 1589</b> Assassinat d'HENRI III par le moine dominicain ligueur, Jacques CLEMENT. Henri III n'ayant pas d'enfants, c'est son plus proche parent Henri de Navarre qui va devenir Henri IV...Mais &eacute;tant le chef des protestants, seul 5 villes reconnaitront son autorit&eacute;...Il lui faudra 9 ans pour conqu&eacute;rir les provinces tenues par les chefs ligueurs...<br>  
<br> 
-<b>4 ao&ucirc;t 1589</b> D&eacute;claration de Saint-Cloud: HENRI IV, promet de conserver la religion catholique dans le royaume.<br>  
<br> 
-<b>6 ao&ucirc;t 1589</b> HENRI IV l&egrave;ve le si&egrave;ge de Paris.<br>  
<br> 
-<b>21 septembre 1589</b> Victoire protestante dans la bataille d'Arques (Seine-Maritime).<br>  
<br> 
-<b>21 novembre 1589</b> Charles de BOURBON dit le Cardinal est couronn&eacute; roi par la Ligue sous le nom de CHARLES X.<br>  
<br> 
-<b>14 mars 1590</b> Victoire protestante dans la bataille d'Ivry (Eure).<br>  
<br> 
-<b>30 avril 1590</b> Reprise du si&egrave;ge de Paris par HENRI IV. <br> 
<br> 
-<b>30 ao&ucirc;t 1590</b> Alexandre FARNESE (1545-1592), g&eacute;n&eacute;ral espagnol, alli&eacute; de la ligue, d&eacute;bloque Paris.<br>  
<br> 
-<b>Septembre 1590</b> Prise d'Aix-en-Provence par la Ligue.<br>  
<br> 
-<b>Octobre 1590</b> Les ligueurs prennent Marseille.<br>  
<br> 
-<b>23 novembre 1591</b> D&eacute;but du si&egrave;ge de Rouen par HENRI IV.<br>  
<br> 
-<b>20 avril 1592</b> FARNESE d&eacute;bloque Rouen.<br>  
<br> 
-<b>26 jan.-8 ao&ucirc;t 1593</b> R&eacute;union des &eacute;tats g&eacute;n&eacute;raux de la Ligue &agrave; Paris pour s'accorder sur un nouveau roi de confession catholique. <br> 
<br> 
-<b>15 mai 1593</b> Par peur de voir la couronne lui &eacute;chapper, HENRI IV (le protestant) renonce &agrave; sa religion... (le parti catholique et la ligue ne le reconnaissant pas comme souverain). <br> 
<br> 
-<b>20 mai 1593</b> PHILIPPE II d'Espagne annonce la candidature de sa fille, l'infante Isabelle-Claire-Eug&eacute;nie.<br>  
<br> 
-<b>28 juin 1593</b> Arr&ecirc;t dit de la Loi salique du Parlement de Paris contre l'accession d'une femme ou d'un &eacute;tranger au tr&ocirc;ne.<br>  
<br> 
-<b>Janvier 1594</b> Soumission des ligueurs en Provence.<br>  
<br> 
-<b>27 f&eacute;vrier 1594</b> HENRI IV est couronn&eacute; &agrave; Chartres. <br> 
<br> 
-<b>22 mars 1594</b> Entr&eacute;e d'HENRI IV &agrave; Paris. <br> 
<br> 
-<b>Mars 1594</b> Soumission des ligueurs en Normandie. <br> 
<br>
-<b>22 avril 1594</b> La Sorbonne reconna&icirc;t HENRI IV comme roi l&eacute;gitime des Fran&ccedil;ais.<br>  
<br> 
-<b>Ao&ucirc;t 1594</b> Soumission des ligueurs en Champagne.<br>  
<br> 
-<b>17 janvier 1595</b> D&eacute;claration de guerre &agrave; l'Espagne. <br> 
<br> 
-<b>5 juin 1595</b> Victoire d'HENRI IV sur les Espagnols &agrave; Fontaine-Fran&ccedil;aise (C&ocirc;te D'or).<br>  
<br> 
-<b>31 juillet 1595</b> Prise de Doullens (Somme) par les Espagnols.<br>  
<br> 
-<b>30 ao&ucirc;t 1595</b> Reprise de Cambrai par les Espagnols.<br>  
<br> 
-<b>Janvier 1596</b> Soumission des ligueurs en Bourgogne, ainsi que dans le Languedoc en f&eacute;vrier.<br>  
<br> 
-<b>12 mars 1597</b> Prise d'Amiens par les Espagnols (de Philippe II).<br>  
<br> 
-<b>25 septembre 1597</b> Reprise d'Amiens par HENRI IV. <br> 
<br> 
-<b>20 mars 1598</b> Fin de la Ligue; soumission des derniers ligueurs en Bretagne.<br>  
<br> 
-<b>13 avril 1598</b> L'&eacute;dit de Nantes donne un statu d&eacute;finitif aux protestants et permettra de mettre fin aux guerres de religions...<br> 
<br> 
-<b>2 mai 1598</b> Le trait&eacute; de Vervins entre HENRI IV et PHILIPPE II d'Espagne r&eacute;tablit la paix avec l'Espagne...<br>  
<br> 
-<b>13 septembre 1598</b> Mort de Philippe II.<br> 
<br> 
-<b>1603</b> Angleterre: mort d'ELISABETH 1re; JACQUES 1er.<br>  
<br> 
-<b>12 d&eacute;cembre 1604</b> Les charges des officiers de justice et de finance deviennent h&eacute;r&eacute;ditaires (&eacute;dit de la "Paulette") en &eacute;change de taxe annuelle qui procure d'importante ressource au Roi...<br>
<br>
-<b>17 avril 1607</b> Armand Jean du Plessis de Richelieu est sacr&eacute; &eacute;v&ecirc;que de Lu&ccedil;on (il n'a alors que 22ans)..<br>
<br>
-<b>14 mai 1610</b> Assassinat d'HENRI IV par Ravaillac. LOUIS XIII roi de France n'ayant pas encore 9 ans, c'est sa m&egrave;re Marie de M&eacute;dicis qui prendra la t&ecirc;te de l'&eacute;tat jusqu'en avril 1617.<br>  
<br> 
-<b>24 avril 1617</b> Le jeune roi Louis XIII fait assassiner le Mar&eacute;chal d'Ancre (Concino Concini) mettant fin &agrave; la r&eacute;gence ! D&eacute;bute alors le v&eacute;ritable r&egrave;gne de Louis XIII ...<br>
<br>
-<b>25 juin 1617</b> Arr&ecirc;t du conseil ordonnant le r&eacute;tablissement du culte catholique et la restitution des biens de l'Eglise en B&eacute;arn.<br>  
<br> 
-<b>1619</b> FERDINAND II, empereur du Saint Empire Romain Germanique.<br>  
<br> 
-<b>Ao&ucirc;t 1620</b> Invasion du B&eacute;arn et prise de Pau ( 15 octobre) par les troupes royales. Guerre du B&eacute;arn. <br> 
<br> 
-<b>25 d&eacute;cembre 1520</b> Prise d'armes des protestants de La Rochelle.<br>  
<br> 
-<b>27 mai 1610</b> C'est avec un courage sans faille qu'&agrave; l'aube du 27 mai Ravaillac (l'assassin d'Henri IV) eut les jambes bris&eacute;s par l'application de brodequins avant d'&ecirc;tre conduit en place de Gr&egrave;ve ou le bourreau versa dans les plaies ouvertes (&agrave; l'aide de tenailles rougies par le feu) du souffre liqu&eacute;fi&eacute; et des r&eacute;sines brulantes avant de finir par &ecirc;tre &eacute;cartel&eacute; par 4 chevaux...<br>
<br>
-<b>Novembre 1615</b> Mariage de Louis XIII et d'Anne d'Autriche (&agrave; Bordeaux) ils ont tous les deux 14ans...<br>
<br>

-<b>1621</b> Mort de PHILPPE III D`ESPAGNE; PHILIPPE IV et OLIVARES.<br>  
<br> 
-<b>Sept.-nov. 1621</b> Si&egrave;ge manqu&eacute; de Montauban par les troupes royales.<br>  
<br> 
-<b>16 avril 1622</b> Victoire royale dans la bataille de L'&icirc;le de R&eacute;. <br> 
<br> 
-<b>Ao&ucirc;t-sept. 1622</b> Si&egrave;ge manqu&eacute; de Montpellier par les troupes royales.<br>  
<br> 
-<b>19 octobre 1622</b> Paix de Montpellier. Fin de la guerre du B&eacute;arn. <br> 
<br> 
-<b>29 avril 1624</b> Armand du Plessis, duc et cardinal de RICHELIEU (1585-1642) entre au conseil du roi et est nomm&eacute; principal ministre.<br>  
<br> 
-<b>1625</b> Mort de JACQUES 1er d'Angleterre; CHARLES 1er. <br> 
<br> 
-<b>Janvier 1625</b> Victoire de SOUBISE, chef protestant dans la bataille navale de Blavet (Morbihan) et prise de l''&icirc;le d'Ol&eacute;ron.Guerre du Midi. <br> 
<br> 
-<b>28 juin 1625</b> Victoire royale dans la bataille de Castre.<br>  
<br> 
-<b>15 septembre 1625</b> Victoire royale dans la Bataille de l'&icirc;le de R&eacute; et reprise de l'&icirc;le d'Ol&eacute;ron: SOUBISE s'enfuit &agrave; Londres.<br>  
<br> 
-<b>22 juillet 1627</b> D&eacute;barquement anglais sur l'&icirc;le de R&eacute; sous le commandement de Georges VILLIERS, duc de BUCKINGHAM (1592-1628).<br>  
<br> 
-<b>10 ao&ucirc;t 1627</b> D&eacute;but du si&egrave;ge de La Rochelle par les troupes royales.<br>  
<br> 
-<b>10 septembre 1627</b> Prise d'armes des protestants du Haut-Languedoc et des C&eacute;vennes. <br> 
<br> 
-<b>6 novembre 1627</b> Victoire royale dans la bataille de l'&icirc;le de r&eacute; et retraite des Anglais. <br> 
<br> 
-<b>1er mars 1628</b> Ach&egrave;vement de la ligne de circonvallation de La Rochelle et renforcement du si&egrave;ge par RICHELIEU.<br>  
<br> 
-<b>11-19 mai 1628</b> Premi&egrave;re exp&eacute;dition anglaise de secours (&eacute;chou&eacute;e) &agrave; La Rochelle.<br>  
<br> 
-<b>28 sept.-28 oct. 1628</b> Seconde exp&eacute;dition, &eacute;chou&eacute;e, de la part des Anglais.<br>  
<br> 
-<b>28 octobre 1628</b> Capitulation de La Rochelle. r&eacute;vocation de tous ses droits et privil&egrave;ges, d&eacute;molition de ses fortifications et remparts.<br>  
<br> 
-<b>3 mai 1629</b> Trait&eacute; d'alliance entre ROHAN ET PHILIPPE IV d'Espagne.<br>  
<br> 
-<b>27 mai 1629</b> Destruction de Privat (Ard&egrave;che) par les troupes royales.<br>  
<br> 
-<b>17 juin 1629</b> Capitulation d'Al&egrave;s (Gard).<br>  
<br> 
-<b>27 juin 1629</b> Paix d'Al&egrave;s: D&eacute;mant&egrave;lement des structures politiques et militaires des Protestants (Fin de la guerre du Midi).<br>  
<br> 
-<b>1635</b> Entr&eacute;e de la France dans la Guerre de Trente ans en d&eacute;clarant la guerre &agrave; l'Espagne.<br>  
<br> 
-<b>1637</b> Mort de FERDINAND II. FERDINAND III, Empereur du Saint-Empire Romain Germanique. 
<br> 
-<b>1642</b> Mort de Richelieu.<br> 
<br> 
-<b>mai 1643</b> Mort de LOUIS XIII. LOUIS XIV roi de France; r&eacute;gence d'Anne d'Autriche jusqu'en mai 1652.<br>  
<br> 
-<b>1648-1653</b> La Fronde.<br> 
<br> 
-<b>21 mai 1652</b> D&eacute;claration de Saint-Germain-en-Laye (Yvelines): LOUIS XIV confirme l'Edit de Nantes en remerciant les protestants de leur fid&eacute;lit&eacute; lors des pr&eacute;c&eacute;dents troubles de la Fronde.<br>  
<br> 
-<b>18 juillet 1656</b> D&eacute;claration royale &eacute;tablissant des commissaires royaux charg&eacute;s de faire respecter dans les provinces les clauses de l'Edit de Nantes.<br>  
<br> 
-<b>1657</b> Mort de FERDINAND III; LEOPOLD 1er empereur du Saint-Empire Romain Germanique.<br>  
<br> 
-<b>7 novembre 1659</b> Trait&eacute; des Pyr&eacute;n&eacute;es (fin de la guerre entre la France et l'Espagne qui avaient continu&eacute; d'en d&eacute;coudre apr&egrave;s la guerre de trente ans).<br>  
<br> 
-<b>1661</b> D&eacute;but de la fermeture des temples par des commissaires royaux envoy&eacute;s dans chaque province afin de contr&ocirc;ler la conformit&eacute; des lieux du culte avec les stipulations de l'Edit de Nantes.<br>  
<br> 
-<b>1661</b> Chute de FOUQUET et de son r&eacute;seau remplac&eacute; par COLBERT et sa client&egrave;le. <br> 
<br> 
-<b>9 mars 1661</b> Mort de MAZARIN et D&eacute;but du r&egrave;gne personnel de LOUIS XIV <br> 
<br> 
-<b>1664</b> D&eacute;but de l'exclusion des protestants des m&eacute;tiers jur&eacute;s, profession lib&eacute;rale, charges publiques et offices royaux dont sont concern&eacute;s par la suite les juges des seigneurier (1679), les sages-femmes (1680), les commis d'imp&ocirc;ts (1680), les procureurs, les notaires, les huissiers (1681), les libraires et imprimeurs, les m&eacute;decins, pharmaciens et chirurgiens.<br>  
<br> 
-<b>1665</b> Mort de PHILIPPE IV D'ESPAGNE, CHARLES II.<br>  
<br> 
-<b>1667-1668</b> Guerre de D&eacute;volution (Trait&eacute; d'aix-la-Chapelle, 1668).<br>  
<br> 
-<b>1672-1678</b> Guerre de Hollande (Trait&eacute; de Nim&egrave;ge).<br>  
<br> 
-<b>1676</b> R&eacute;organisation de la caisse des conversions par Paul PELISSON (1624-1693) qui devient directeur de la nouvelle "Caisse des Economats" destin&eacute;e &agrave; verser des "Primes de conversion" aux protestants abjurant leur foi.<br>  
<br> 
-<b>Mars-octobre 1681</b> Dragonnade du Poitou.<br>  
<br> 
-<b>Mai-juillet 1683</b> "R&eacute;volte de Brousson"; mouvement de r&eacute;sistance pacifique des protestants du Midi contre la fermeture des Temples, dirig&eacute; par l'avocat Claude BROUSSON (1647-1698).<br>  
<br> 
-<b>Ao&ucirc;t-septembre 1683</b> Radicalisation du mouvement en Vivarais et en Dauphin&eacute; o&ugrave; des assembl&eacute;es arm&eacute;es de protestants sont s&eacute;v&egrave;rement r&eacute;prim&eacute;es par les troupes royales.<br>  
<br> 
-<b>1683</b> Mort de COLBERT et si&egrave;ge de Ratisbonne.<br> 
<br> 
-<b>Octobre 1683</b> Dragonnade des C&eacute;vennes. <br> 
<br> 
-<b>1685</b> Mort de CHARLES II D'ANGLETERRE; JACQUES II.<br>  
<br> 
-<b>Mai-octobre 1685</b> Grande dragonnade du Midi. <br> 
<br> 
-<b>18 octobre 1685</b> Edit de Fontainebleau, r&eacute;voquant l'Edit de Nantes et toute la l&eacute;gislation adopt&eacute; depuis en faveur des protestants.<br>  
<br> 
-<b>Octobre 1685-mars 1686</b> Dragonnade en Normandie, Picardie, Champagne, Bourgogne. Environ 200 000 protestants s'enfuient &agrave; l'&eacute;tranger et s''installent dans les pays du "Refuge Huguenot".<br>  
<br> 
-<b>1688-1689</b> R&eacute;volution d'Angleterre.<br>  
<br> 
-<b>Avril 1689</b> Av&eacute;nement en Angleterre de Guillaume III (Guillaume d'Orange) et de Marie II Stuart.<br>  
<br> 
-<b>1689-1697</b> Guerre de la Ligue d'Ausbourg (Trait&eacute; de Ryswick, 1697).<br>  
<br> 
-<b>1695</b> Cr&eacute;ation de la Capitation.<br>  
<br> 
-<b>1700</b> Mort de CHARLES II D'ESPAGNE.<br> 
<br> 
-<b>1701</b> FREDERIC 1er, Ancien &eacute;lecteur de Brandebourg (1688-1701) sous le nom de Frederic III, devient le premier roi de Prusse.<br>  
<br> 
-<b>1702</b> Mort de GUILLAUME III en Angleterre; Anne STUART.<br>  
<br> 
-<b>1702</b> R&eacute;volte des camisards dans les C&eacute;vennes.<br>  
<br> 
-<b>1702</b> Guerre de Succession d'Espagne (trait&eacute;s d'Utecht et de Rastadt).<br>  
<br> 
-<b>13 ao&ucirc;t 1704</b> Bataille de Blenheim.<br>  
<br> 
-<b>1705</b> Mort de LEOPOLD 1er; JOSEPH 1er, empereur du Saint Empire Romain Germanique.<br> 
<br> 
-<b>22 mai 1706</b> Bataille de Ramillies.<br>  
<br> 
-<b>25 avril 1707</b> Bataille d'Almonsa.<br> 
<br> 
-<b>1709</b> Bataille de Malplaquet.<br>  
<br> 
-<b>1711</b> Mort de JOSEPH 1er; CHARLES VI empereur du Saint-Empire Romain Germanique.<br>  
<br> 
-<b>1713</b> Mort de FREDERIC 1er; FREDERIC-GUILLAUME 1er roi de Prusse.<br>  
<br> 
-<b>1713</b> Trait&eacute; d'Utrecht.<br>  
<br> 
-<b>1713</b> LOUIS XIV obtient du pape la bulle "Unigenitus" contre les jans&eacute;nistes.<br>  
<br> 
-<b>1714</b> Trait&eacute; de Rastadt. Fin de la guerre de succession d'Espagne.<br>  
<br> 
-<b>1714</b> Mort d''Anne STUART, GEORGE 1er roi d'Angleterre.<br>  
<br> 
-<b>1715</b> Mort de LOUIS XIV; LOUIS XV roi mais r&eacute;gence de PHILIPPE D'ORLEANS.<br>  
<br> 
-<b>1716</b> Cr&eacute;ation de la banque de Law.<br>  
<br> 
-<b>1717</b> Triple Alliance de la Haye.<br>  
<br> 
-<b>1718-1720</b> Guerre de la Quadruple Alliance (trait&eacute; de la Hague, 17 f&eacute;vrier 1720).<br>  
<br> 
-<b>1718</b> Fondation de la Nouvelle-Orl&eacute;ans.<br>  
<br> 
-<b>1720</b> Effondrement du syst&egrave;me de Law. <br> 
<br> 
-<b>1723-1726</b> Le Duc de BOURBON, premier ministre.<br>  
<br> 
-<b>1726-1743</b> Le Cardinal de Fleury, premier ministre.<br>  
<br> 
-<b>1728</b> Angleterre: Mort de GEORGE 1er; GEORGE II.<br>  
<br> 
-<b>1730</b> D&eacute;claration royale faisant de la bulle "Unigenitus" une loi d''Etat.<br>  
<br> 
-<b>1730</b> ORRY, contr&ocirc;leur g&eacute;n&eacute;ral des Finances.<br>  
<br> 
-<b>1733</b> Imp&ocirc;t du dixi&egrave;me. 
<br> 
-<b>1733</b> Guerre de succession de Pologne ( Trait&eacute; de Vienne, 1738).<br>  
<br> 
-<b>1735</b> Invention de la m&eacute;tallurgie au coke par DARBYO.<br> 
<br> 
-<b>1740</b> Mort de FREDERIC-GUILLAUME 1er; FREDERIC II roi de Prusse.<br>  
<br> 
-<b>1740</b> Mort de CHARLES VI; MARIE-THERESE imp&eacute;ratrice du Saint Empire.<br>  
<br> 
-<b>1740</b> D&eacute;but de la guerre de succession d'Autriche, invasion de La Sil&eacute;sie par la Prusse ( Trait&eacute; d'Aix-la-Chapelle,       1748).<br>  
<br> 
-<b>1745</b> Bataille de Fontenoy.<br>  
<br> 
-<b>1746</b> Mort de PHILIPPE V d'Espagne; FERDINAND VI.<br>  
<br> 
-<b>1746</b> Prise de Madras (en Inde) par les Fran&ccedil;ais.<br> 
<br> 
-<b>1749</b> Imp&ocirc;t du vingti&egrave;me.<br> 
<br> 
-<b>1754</b> Guerres indiennes et fran&ccedil;aises (Trait&eacute; de Paris 1763).<br>  
<br> 
-<b>1756</b> Renversement des alliances, D&eacute;but de la guerre de sept ans (Trait&eacute; de Paris 1763).<br>  
<br> 
-<b>1758-1770</b> Minist&egrave;re CHOISEUL.<br>  
<br> 
-<b>3 juin-27juillet 1758</b> Si&eacute;ge par les Anglais de Louisbourg (Guerres indiennes et fran&ccedil;aises).<br>  
<br> 
-<b>13 septembre 1759</b> Bataille des plaines d'Abraham (Guerres indiennes et fran&ccedil;aises). D&eacute;faite fran&ccedil;aise.<br>  
<br> 
-<b>17 septembre 1759</b> Chute de Qu&eacute;bec (Guerres indiennes et fran&ccedil;aises). D&eacute;faite fran&ccedil;aise.<br> 
<br> 
-<b>1760</b> Angleterre: Mort de GEORGE II; GEORGE III.<br>  
<br> 
-<b>Septembre 1760</b> Capitulation du Canada fran&ccedil;ais.<br>  
<br> 
-<b>1766</b> La Lorraine devient fran&ccedil;aise.<br>  
<br> 
-<b>1767</b> Les j&eacute;suites expuls&eacute;s d'Espagne et de France.<br>  
<br> 
-<b>1769</b> Mise au point de la machine &agrave; vapeur par WATT.<br> 
<br> 
-<b>1771</b> R&eacute;forme judiciaire de MAUPEOU.<br>  
<br> 
-<b>1774</b> Mort de LOUIS XV; LOUIS XVI. TURGOT contr&ocirc;leur g&eacute;n&eacute;ral des finances.<br>  
<br> 
-<b>1776</b> Disgr&acirc;ce de TURGOT. NECKER directeur du tr&eacute;sor royal.<br>  
<br> 
-<b>1776</b> D&eacute;claration d'ind&eacute;pendance des Etats-Unis. D&eacute;but v&eacute;ritable de la guerre d'ind&eacute;pendance.<br>  
<br> 
-<b>17 octobre 1777</b> Victoire de WASHINGTON sur les Anglais &agrave; Saratoga.<br>  
<br> 
-<b>1780</b> Mort de MARIE-THERESE; JOSEPH II, empereur du Saint Empire. <br> 
<br> 
-<b>19 mai 1781</b> Disgr&acirc;ce de NECKER. <br> 
<br> 
-<b>19 octobre 1781</b> Capitulation anglaise de Yorktown.<br>  
<br> 
-<b>1783</b> LAVOISIER r&eacute;alise l'analyse de l'eau. <br> 
<br> 
-<b>1783</b> CALONNE contr&ocirc;leur g&eacute;n&eacute;ral des Finances.<br>  
<br> 
-<b>3 septembre 1783</b> Trait&eacute; de Versailles. Fin de la guerre d'ind&eacute;pendance am&eacute;ricaine.<br>  
<br> 
-<b>1785</b> Invention du m&eacute;tier m&eacute;canique de CARTWRIGHT. <br> 
<br> 
-<b>1786</b> Mort de FREDERIC II; FREDERIC-GUILLAUME II roi de Prusse.<br>  
<br> 
-<b>1787</b> Constitution des Etats-Unis d'Am&eacute;rique. <br> 
<br> 
-<b>1787</b> Renvoi de CALONNE; appel de LOMENIE DE BRIENNE.<br>  
<br> 
-<b>8 mai 1788</b> R&eacute;forme qui r&eacute;duit les pouvoirs des parlements. Agitation.<br>  
<br> 
-<b>Septembre 1788</b> R&eacute;tablissement des Parlements. Le Parlement de Paris demande que les Etats g&eacute;n&eacute;raux soient convoqu&eacute;s dans les formes de 1614.<br>  
<br> 
-<b>27 d&eacute;cembre 1788</b> Le conseil du roi se prononce pour le doublement du tiers.<br>  
<br> 
-<b>5 mai 1789</b> R&eacute;union des &eacute;tats g&eacute;n&eacute;raux en France.<br> 
<br> 
-<b>1789</b> la r&eacute;volution fran&ccedil;aise met fin &agrave; la royaut&eacute;<br>
<br>
-<b>1792</b> la 1er r&eacute;publique est proclam&eacute;e<br>
<br>
-<b>Octobre 1944</b> Les femmes obtiennent le droit de vote...<br>
<br>
-<b>1946</b> Naissance de la 4&egrave;me r&eacute;publique<br>
<br>
-<b>depuis 1958</b> nous vivons sous la 5&egrave;me r&eacute;publique.<br>
</TD></TR>
</TABLE>
<br><br>
<A HREF="#a"<font color="#FF0000">haut de page</font> </A><br>
<br>
</body>
</html>