<html>
<body background="images/fondtexte2.jpg" text="black" vlink="black" border="0">
<title>Les inventions</title>
<pre>
1610 : le microscope

1690 : la machine &agrave; vapeur

1776 : Le sous-marin

1800 : la pile &eacute;lectrique

1810 : Conserve

1826 : La photographie

1885 : l'automobile

1888 : le cin&eacute;ma

1896 : la radiologie

1909 : <a href="lavevaiselle.html"target="description">Le lave-vaiselle</a>

1914 : <a href="refrigerateur.html"target="description">Le r&eacute;frig&eacute;rateur</a>

1920 : <a href="machinelaver.html"target="description">La machine &agrave; laver</a>

1948 : <a href="cocotte.html"target="description">la cocotte-minute</a>

1965 : le K-way

1972 : - le TGV
       - le scanner (pour imagerie m&eacute;dicale)  
       
1973 : L'ABS

1974 : la carte &agrave; puce

1980 : le minitel

1982 : le CD audio

1994 : le MP3


</pre>
<hr>
<b>LE PAPIER :</b><br>
<br>

 Si tu d&eacute;chires une feuille de papier, tu peux remarquer de tout petits fils : ce sont des fibres de bois (cellulose) avec lesquelles est faite la p&acirc;te &agrave; papier. Aujourd'hui, nous consommons beaucoup de papier (livres, emballages, cahiers...) C'EST UNE MATIERE INDISPENSABLE.<br>
<br><br>
 LES ANCETRES DU PAPIER<br>
<br><br>
- Le papyrus:<br>
<br>
 d&egrave;s 1800 avant J&eacute;sus -Christ : Les égyptiens ont utilis&eacute; un roseau sauvage, le papyrus ! Sa tige &eacute;tait coup&eacute;e en tron&ccedil;ons puis la moelle &eacute;tait d&eacute;bit&eacute;e en fines lamelles qui &eacute;taient ensuite superpos&eacute;es dans un sens puis dans un autre avant d'&ecirc;tre martel&eacute;es et aplaties pour former une feuille encore humide qu'on laisait s&eacute;cher sous un poids.<br>
<br><br>
- Le parchemin:<br>
<br>
 Les peaux de mouton ou de ch&egrave;vres sont &eacute;pil&eacute;es, racl&eacute;es, tendues, s&eacute;ch&eacute;es et polies &agrave; la pierre ponce.<br>
<br><br>
- L'invention du papier en Chine<br>
<br>
 En 105 apr&egrave;s J.C :  Tsai-Lun (un chinois) inventa le papier en observant les gu&ecirc;pes ! En effet, pour construire leur nid les gu&ecirc;pes arrachent des fibres de bambous qu'elles ramollissent avec leur salive pour en faire une bouillie. En s&eacute;chant celle ci forme des cloisons tr&egrave;s rigides. Tsai-Lun imita donc les gu&ecirc;pes: en broyant des morceaux de bambous dans l'eau. Il obtint une p&acirc;te liquide qu'il filtra &agrave; travers un tamis. Puis il la laissa s&eacute;cher au soleil...<br>
<br><br>
Les Chinois garderont leur secret pendant 700 ans !<br>
Les Chinois l'apprendrons aux Arabes...<br>
En France, ce n'est qu'au Moyen Age que les Crois&eacute;s le d&eacute;couvrent &agrave; leur tour et le rapportent de leurs exp&eacute;ditions...<br> 
<br>
<br>
De nos jours, en usine les machines fabriquent 800 m&egrave;tres de papier &agrave; la minute. Les op&eacute;rations sont command&eacute;es et contr&ocirc;l&eacute;es par ordinateur. L'immense feuille est ensuite enroul&eacute;e sur des bobines qui peuvent mesurer 13 Kilom&egrave;tres de long !<br>
<hr>
<b>LA ROUE LIBRE</b><br>
<br>
 1&egrave;re &eacute;tape : 1885 - Un outil de per&ccedil;age<br>
 Jean FASANO (1848-1924) est un pionnier dans la fabrication des armes de chasse. Il est le cr&eacute;ateur de nombreuses machines-outils et de m&eacute;thodes modernes de fabrication. En 1885, il invente ainsi un outil performant pour percer le m&eacute;tal. L'utilisation d'une roue libre permettait de supprimer le mouvement de rotation alternatif de la m&egrave;che.<br>
<br>
 2&egrave;me &eacute;tape : 1897 - La bicyclette<br>
Remarqu&eacute; par messieurs MIMARD et BLACHON, FASANO devient sous-directeur de la Manufacture fran&ccedil;aise d'armes et cycles de Saint-Etienne (Manufrance). A partir de 1897, profitant du savoir faire de Mimard dans le domaine du marketing, l'invention de la roue-libre sera appliqu&eacute;e &agrave; la bicyclette. Cette derni&egrave;re incorporera &eacute;galement deux nouvelles inventions de Fasano : le syst&egrave;me &agrave; deux cha&icirc;nes et le changement de vitesse.<br>
<br>
 L'anc&ecirc;tre de la perceuse : la technique du foret-outil<br>
 L'ouvrier armurier manoeuvre de la main droite, dans un mouvement de va-et-vient, l'archet dont la corde est entour&eacute;e autour de l'arbre porte-foret (le mandrin). De la main gauche l'ouvrier maintient le plastron (la conscience) contre son torse, et ainsi prot&eacute;g&eacute;, il appuie avec l'ensemble de son corps sur le porte-foret. La main droite assure le mouvement rotatif alors que la main gauche assure, avec le torse, &agrave; la fois la pression et la pr&eacute;cision. L'ancien syst&egrave;me produisait une double rotation de la m&egrave;che. La roue libre invent&eacute;e par Fasano permet un seul sens de rotation, la m&egrave;che &eacute;tant immobile lors du retour de l'archet.<br>
<br><br>
<hr>
<b>LA MACHINE A COUDRE</b><br>
<br>
Barth&eacute;l&eacute;my Thimonnier, n&eacute; en 1793 &agrave; l'Arbresle (Rh&ocirc;ne), suivit une formation de tailleur d'habits. En 1825, il s'installa &agrave; Valbeno&icirc;te (aujourd'hui commune de Saint-Etienne) et r&eacute;fl&eacute;chit &agrave; une machine qui pourrait faciliter ses travaux de couture. En 1830, avec Ferrand, ing&eacute;nieur de l'Ecole des Mines de Saint-Etienne, il d&eacute;posa un brevet d'invention pour une machine &agrave; coudre, point de cha&icirc;nette, &agrave; un fil et une aiguille.<br>
<br>
 Malheureusement, il connut de nombreux d&eacute;boires et, malgr&eacute; de multiples efforts, ne parvint pas &agrave; diffuser son invention. Il faut dire que le principal handicap du point de cha&icirc;nette est sa grande facilit&eacute; &agrave; se d&eacute;faire...<br>
<br>
 Il faut attendre les brevets de l'am&eacute;ricain Elias Howe, en 1846, pour voir appara&icirc;tre une machine &agrave; coudre &agrave; deux fils, une aiguille et une navette.<br>
<br>

 Machine &agrave; coudre, prototype de Thimonnier (1793-1857)<br>
pour son brevet du 7 avril 1830<br>
 Collection S.-A Thimonnier, mus&eacute;e de la machine &agrave; coudre<br>
<br>

 Il n'emp&ecirc;che que c'est bien &agrave; Saint-Etienne, au coeur d'un v&eacute;ritable vivier d'ing&eacute;nieurs, de techniciens et d'inventeurs, en relation &eacute;troite avec l'Ecole des Mines, qu'est n&eacute;e la premi&egrave;re machine &agrave; coudre, pratiquement en m&ecirc;me temps que le chemin de fer.<br>
<br><br>
<hr>
<b>LA TURBINE HYDRAULIQUE</b><br>
<br>
 Beno&icirc;t Fourneyron (St-Etienne 1802 - Paris 1867), ing&eacute;nieur civil brillant, sorti de l'Ecole des Mines, fut attach&eacute; &agrave; l'exploitation des mines du Creusot. Il contribua &agrave; la cr&eacute;ation d'importants &eacute;tablissements m&eacute;tallurgiques. Beaunier lui confia l'avant-projet de la ligne de chemin de fer St-Etienne-Andr&eacute;zieux.<br>
<br>
 En avril 1827, il pr&eacute;sente une premi&egrave;re turbine hydraulique d'essai de 6 CV (puissance sous une chute de 1,40 m&egrave;tres) puis augmente sa puissance progressivement &agrave; 50 CV. Cette invention est en fait un perfectionnement des &eacute;tudes de son professeur &agrave; l'Ecole des Mines, Claude Burdin, pr&eacute;sent&eacute;es &agrave; l'Acad&eacute;mie des Sciences en 1824.<br>
<br>
Le brevet est d&eacute;pos&eacute; en 1832 sous le nom de "roue &agrave; pression universelle et continue". La m&ecirc;me ann&eacute;e, Fourneyron fut couronn&eacute; par l'Acad&eacute;mie des Sciences. La turbine est aussit&ocirc;t adopt&eacute;e dans toute l'Europe, puis en Am&eacute;rique.<br>
<br>
 En 1835, il con&ccedil;oit les premi&egrave;res conduites forc&eacute;es permettant la ma&icirc;trise de la "houille blanche". En 1850, Fourneyron s'installe au Chambon-Feugerolles pour perfectionner sa turbine et ouvre une fonderie. L'action politique de Beno&icirc;t Fourneyron se traduit notamment par sa lutte contre la Compagnie des Mines de la Loire. En 1847, il fut candidat de la liste d'opposition du deuxi&egrave;me arrondissement de la mairie de Paris et fut envoy&eacute; &agrave; l'Assembl&eacute;e en 1848 comme repr&eacute;sentant de la Loire.<br>
<br><br>
<hr>
<b>La ceinture de s&eacute;curit&eacute; :</b><br>
<br> 
- 1903 : le fran&ccedil;ais Gustave D&eacute;sir&eacute; Liebau d&eacute;pose un brevet concernant des "bretelles
protectrices pour voitures automobiles et autres"<br>
<br>
- 1973 : la ceinture de s&eacute;curit&eacute; est rendue obligatoire en France (sur les v&eacute;hicules
de tourisme) <br>

</body>
</html>