<html>
<body background="images/fondtexte2.jpg" text="black" vlink="green" border="0">
<title>Le train</title>
<center><font size=5><font color="brown">LE TRAIN</font></font></center>

<br><br>

Le premier chemin de fer fran&ccedil;ais<br>
<br>
 <a href="rhonealpes/loire/saintetienne.html"Target="description">Saint-Etienne</a> devient au tout d&eacute;but du 19&egrave;me si&egrave;cle le bassin houiller le plus
important de France. L'ing&eacute;nieur Beaunier proposa la construction d'un "chemin
de fer" entre Saint-Etienne et Andr&eacute;zieux, petite commune des bords de Loire,
pour faciliter l'&eacute;vacuation du charbon vers la r&eacute;gion parisienne. La ligne,
 longue d'environ 20 km, fut ouverte en 1827. A Andr&eacute;zieux, le charbon &eacute;tait
embarqu&eacute; sur des bateaux &agrave; fond plat : les "rambertes".<br>
La premi&egrave;re ligne de chemin de fer de France &eacute;tait lanc&eacute;e.<br>
<br>


 En 1832, une seconde ligne est ouverte, assurant &agrave; la fois le transport des marchandises
 et des personnes entre Saint-Etienne et Lyon, notamment gr&acirc;ce &agrave; l'intervention de
 l'ing&eacute;nieur Claude Verpilleux.<br>
Le chemin de fer fait ainsi dispara&icirc;tre pour quelques d&eacute;cennies l'un des handicaps les
plus notables auxquels &eacute;tait confront&eacute; Saint-Etienne. Ces 144 kilom&egrave;tres de voies ferr&eacute;es
install&eacute;es seront pour un temps les seules de France.<br>
Le r&eacute;seau fran&ccedil;ais commence &agrave; prendre forme ensuite autour de Paris.<br>
<br>


 A propos du billet de chemin de fer<br>
<br>
 Le Mus&eacute;e du Vieux Saint-Etienne a le privil&egrave;ge de poss&eacute;der le premier billet de chemin
de fer connu dans le monde (dat&eacute; du 17 f&eacute;vrier 1834, il a &eacute;t&eacute; imprim&eacute; pour &ecirc;tre diffus&eacute;
d&egrave;s 1833). Le billet reproduit dans l'ouvrage de L.-J. Gras, Histoire des premiers
chemins de fer fran&ccedil;ais, n'en est que la copie recompos&eacute;e par le typographe,
d&eacute;barrass&eacute;e des surcharges manuscrites. Un deuxi&egrave;me exemplaire du billet de la ligne
Saint-Etienne - Lyon, dat&eacute; de 1836, est visible au mus&eacute;e de Gadagne &agrave; Lyon.<br>
<br>
 En revanche, &nbsp;le Science Museum poss&egrave;de un jeton de cuivre octogonal dat&eacute; de 1832 et
utilis&eacute; par la compagnie "Leicester and Swannington Ry". Mais d'apr&egrave;s Alain Mercier,
dans son article "Arch&eacute;ologie du billet de train" (La Revue du Mus&eacute;e des arts et m&eacute;tiers,
mars 1996, pp. 43-50), "le support m&eacute;tallique se pr&ecirc;tait mal &agrave; la diversit&eacute; et &agrave; la
modification des informations" et l'on se retourna vers le bon vieux billet d&eacute;j&agrave; 
utilis&eacute; par les compagnies de diligences et de malle-poste.<br>
<br><br>





 LOUIS-ANTOINE BEAUNIER<br>
<br>
 Cet ing&eacute;nieur (Melun 1779-Paris 1835), &eacute;l&egrave;ve de la premi&egrave;re promotion de l'Ecole des
Mines de Paris (1793), donna un &eacute;lan d&eacute;cisif au d&eacute;veloppement industriel de la r&eacute;gion
st&eacute;phanoise &agrave; partir de 1812. Apr&egrave;s avoir contribu&eacute; &agrave; sa fondation, il dirigea l'Ecole
des Mineurs, favorisa l'introduction de la fabrication de l'acier fondu et participa 
au projet de cr&eacute;ation de la premi&egrave;re ligne de chemin de fer.<br>
<br><br>


 LA CHAUDIERE TUBULAIRE DE MARC SEGUIN<br>
<br>
 Marc Seguin (1786-1875) fut le premier constructeur de locomotives. Il d&eacute;posa le 
brevet de la chaudi&egrave;re tubulaire en 1827 apr&egrave;s avoir analys&eacute; les d&eacute;fauts des 
locomotives Stephenson sur la ligne Saint-Etienne - Andr&eacute;zieux. La chaudi&egrave;re est
entour&eacute;e d'un circuit d'eau et munie d'un conduit qui vient traverser la chaudi&egrave;re
par de multiples tubes. L'eau &eacute;tait ainsi chauff&eacute;e plus efficacement. En 1829,
Seguin livra &agrave; la Compagnie de la ligne Saint-Etienne - Lyon deux locomotives de
type &laquo; Fus&eacute;e &raquo;. Ing&eacute;nieur de la ligne de chemin de fer Saint-Etienne - Lyon en
1830-1832, il fut &eacute;galement l'inventeur des ponts suspendus.<br>






</body>
</html>

