<html>
<body background="images/fondtexte2.jpg" text="black" vlink="black" border="0">
<title>La machine &agrave; laver</title>




<font color="blue"><h3><b>LA MACHINE &agrave; LAVER :</b></h3></font><br>
<br>
<b>- 1898</b>  La premi&egrave;re machine &agrave; laver (sans moteur) fran&ccedil;aise est n&eacute;e dans le nord de la france &agrave; Wattrelos (chez Flandria). C'est une machine en bois en forme de demi-tambour effectuant un mouvement de va-et-vient et command&eacute;e manuellement.<br>
<br>


 
<b>- 1920</b>  La premi&egrave;re machine &agrave; laver le linge fran&ccedil;aise &agrave; moteur (la Speed) est pr&eacute;sent&eacute;e &agrave; la Foire de Paris. <br>
<br>
<b>-  A partir de 1925</b>, de nombreux mod&egrave;les apparaissent <br>
<br>
<b>-  1929</b> apparition des premi&egrave;res machines &agrave; laver fran&ccedil;aise avec un essorage incorpor&eacute;.<br>
<br>

<b>- A partir 1950 :</b>


 Les mod&egrave;les en bois c&egrave;dent progressivement la place aux mod&egrave;les &agrave; rev&ecirc;tement &eacute;maill&eacute;.<br>&nbsp;


 Les machines &agrave; agitateur sont remplac&eacute;es peu &agrave; peu par des machines &agrave; pulsateur.<br>&nbsp;


 Apparaissent des machines combin&eacute;es (machine &agrave; laver et essoreuse centrifuge).<br>&nbsp;


 Des mod&egrave;les fonctionnant au gaz ou &agrave; l'&eacute;lectricit&eacute; arrivent sur le march&eacute;.<br>
<br>

<b>- A partir de 1954</b>, la machine &agrave; laver &agrave; chargement par le dessus s'impose en France.<br>
<br>
 La production de masse permet la baisse des prix et met la machine &agrave; laver &agrave; la port&eacute;e de beaucoup de foyers.<br>
<br>
<b>- Entre 1950 et 1960</b> les premiers mod&egrave;les automatiques arrivent sur le march&eacute;. Les machines peuvent encha&icirc;ner pr&eacute;lavage, chauffage-lavage, rin&ccedil;age et essorage dans la m&ecirc;me cuve supprimant ainsi les manipulations de linge. Il est aussi possible de choisir un programme de lavage diff&eacute;rent selon la nature du linge.<br>
<br>
<b>- 1963</b> la premi&egrave;re machine &agrave; laver enti&egrave;rement automatique avec programmation du lavage, du rin&ccedil;age et de l'essorage lib&egrave;re la femme fran&ccedil;aise...&nbsp;<br>
<br>
<b>- 1977</b>  La premi&egrave;re machine &agrave; laver s&eacute;chante appara&icirc;t en France.<br>
<br>
<b>-  A partir de 1978</b> de nouvelles fonctions font leur apparition: &eacute;co, rapide... les vitesses d'essorage sont de plus en plus &eacute;lev&eacute;es et on d&eacute;couvre l'essorage variable (en fonction du type de linge)...<br>
<br>
<b>-  Entre 1970 et 1980</b> l'&eacute;lectronique entre progressivement dans la conception des machines &agrave; laver...<br>
<br>
<b>-  A partir de 1985</b>, il est possible de laver une petite quantit&eacute; de linge en diminuant les consommations d'eau et d'&eacute;lectricit&eacute; gr&acirc;ce &agrave; la capacit&eacute; variable automatique, d'adapter parfaitement tous les param&egrave;tres de lavage, rin&ccedil;age, essorage... gr&acirc;ce &agrave; l'&eacute;lectronique (Fuzzy Logic - logique floue), de laver des textiles d&eacute;licats (laine, soie, textiles lavable &agrave; la main...).<br>
<br>
<br>

</body>
</html>