<html>
<body background="images/fondtexte2.jpg" text="black" vlink="black" border="0">
<a name="a"></a>
<title>La monnaie</title>
<center><font size=5><font color="brown">LA MONNAIE</font></font></center><br>
<br><br>
<b>Les premi&egrave;res pi&egrave;ces circulant sur le sol Fran&ccedil;ais</b><br>
<br>
Alors que les Celtes occupent le territoire que l'on appelera plus tard la Gaule, les premi&egrave;res pi&egrave;ces font leur apparition par l'interm&eacute;diaire de mercenaires aux service de Philippe II de mac&eacute;doine (359 - 336 av.JC)<br>
Il s'agit de copie de stat&egrave;re d'or (&eacute;talon mon&eacute;taire valant de 20 &agrave; 28 drachmes)<br>
<br><br>
<b>Vers l'an 50 av J.-C.</b><br>
<br>
les Gaulois alors sous la domination des Romains  vont progressivement adopter leur syst&egrave;me mon&eacute;taire :<br>
L'aureus, le denier, le sesterce, le dupondius et l'as <br>
<br><br>
<b>Le solidus ou le sou</b><br>
<br>
Pour enrayer la crise mon&eacute;taire Constantin (306-337)  cr&eacute;e une nouvelle monnaie d'or, le solidus ou sou, avec son sous-multiple, le tr&eacute;missis...<br>
les peuples barbares occupant l'Empire d'Occident l'utiliseront encore apr&egrave;s 476...<br>
<br><br>


<b>Un nouveau syst&egrave;me mon&eacute;taire</b><br>
<br>
P&eacute;pin le Bref (751-768) poursuivant les r&eacute;formes de son p&egrave;re (Charlemagne 768-814) abandonne le syst&egrave;me mon&eacute;taire reposant sur le sou d'or. Il va mettre en place un nouvel &eacute;talon emprunt&eacute; aux mesures de poids, la livre de 322,2 g valant 20 sous de 12 deniers chacun, soit 240 deniers.<br>
<br><br>
<b>Au Xe si&egrave;cle</b><br>
<br>
Les souverains carolingiens ne pouvant imposer leur autorit&eacute;, les comtes, &eacute;v&ecirc;ques et abb&eacute;s en profitent pour frapper leur propre monnaie, dont le poids varie suivant les r&eacute;gions...<br>
<br><br>
<b>Sous le r&egrave;gne de Louis IX (1226-1270)</b><br>
<br>

Pour pallier la faiblesse du denier, Louis IX fait alors frapper deux pi&egrave;ces de forte valeur : le sou tournois (en argent, valant 12 deniers surnom&eacute; aussi gros tournois en raison de sa taille) et l'&eacute;cu (en or, valant 10 sous tournois)<br>
<br><br>
<b>On peut enfin lire la valeur d'une pi&egrave;ce</b><br>
<br>
Le royaume de  Philippe le Bel (1285-1314) essuyant de nombreuses crises mon&eacute;taires il va cr&eacute;e le double tournois, dont la valeur en argent ne repr&eacute;sente qu'une fois et demie celle du denier (la valeur d'une pi&egrave;ce n'est plus d&eacute;termin&eacute;e par son poids de m&eacute;tal pr&eacute;cieux, mais par la confiance qu'inspire l'Etat). Pour la premi&egrave;re fois, l' inscription de sa valeur appara&icirc;t sur une pi&egrave;ce.<br>
<br><br>
<b>Premi&egrave;re apparition du franc</b><br>
<br>
Le franc, une pi&egrave;ce d'or valant une livre tournois et repr&eacute;sentant Jean II le Bon (1350-1364) appara&icirc;t pour la premi&egrave;re fois en 1360...<br>

<br><br>
<b>Une monnaie de papier</b><br>
<br>
 En 1789, une monnaie de papier (ou m&eacute;tallique) gag&eacute;e sur les biens confisqu&eacute;s de l'Eglise est mis en circulation par l'&eacute;tat...c'est l'assignat !
Mais en 1797 il dispara&icirc;t (sa valeur chutant de trop).
Cependant, les r&eacute;volutionnaires auront l&eacute;gu&eacute; un syst&egrave;me tr&egrave;s important : l'indexation de la monnaie sur le syst&egrave;me d&eacute;cimal.
En ao&ucirc;t 1795, le franc, nouvelle unit&eacute; mon&eacute;taire rempla&ccedil;ant la traditionnelle trilogie livre-sou-denier, est divis&eacute; en 10 tranches valant chacune 10 centimes.
Dans un premier temps, seules seront frapp&eacute;es des pi&egrave;ces de 5 francs (grav&eacute;es par Augustin Dupr&eacute; et symbolisant le Peuple, la Libert&eacute; et l'Egalit&eacute;). La nouvelle division est rendue effective par la loi consulaire du 17 germinal an XI (1803).<br>
La premi&egrave;re pi&egrave;ce de 1 franc est frapp&eacute;e sous le Consulat, &agrave; l'effigie de Bonaparte.<br>
<br><br>
<b>Cr&eacute;ation de la banque de france</b><br>
<br>
R&eacute;apparition du billet et cr&eacute;ation de la banque de france en 1800 <br>
<br><br>
<b>La semeuse</b><br>
<br>
La c&eacute;l&egrave;bre semeuse grav&eacute;e par Oscar Roty appara&icirc;t en 1898.<br>
<br><br>
<b>Pendant la guerre 14-18</b><br>
<br>
l'Etat prend des mesures pour sauvegarder la monnaie et instaure le cours forc&eacute; du billet de banque tout en retirant l'or de la circulation(La frappe de pi&egrave;ces en argent se poursuit).<br>
Mais devant le manque de petite monnaie, les chambres de commerce et &eacute;tablissements priv&eacute;s sont autoris&eacute;s &agrave; &eacute;mettre des "monnaies de n&eacute;cessit&eacute;" (jetons m&eacute;talliques, petits billets, timbres dans une capsule)...<br>



<br><br>
<b>Le nouveau franc</b><br>
<br>
- Le 27 d&eacute;cembre 1958, le G&eacute;n&eacute;ral de Gaulle instaure le nouveau franc dont la valeur est &eacute;gale &agrave; 100 anciens francs.<br>
- 1960 apparition de 2 nouvelles pi&egrave;ces de 1 et 5 francs<br>
<br>
- 1988, apparition d'une pi&egrave;ce de 10 francs bicolore<br>
- 1992, apparition de la pi&egrave;ce de 20 francs (tripartite)<br>
<br>







<br><br>
<b>L'EURO</b><br>
<br>


<b> Les euro-dates &agrave; retenir</b><br>
<br>

<b>- Apr&egrave;s le 17 f&eacute;vrier 2005</b>, vous n'aurez plus la possibilit&eacute;e d'&eacute;changer gratuitement vos pi&egrave;ces 
aupr&egrave;s de la Banque de France et du Tr&eacute;sor Public ...<br>
(Les anciennes pi&egrave;ces des pays de la zone euro ne sont pas &eacute;changeables en France !)<br> 
<br>
<b>- Apr&egrave;s le 17 f&eacute;vrier 2012</b> se sera au tour des billets<br>




<br><br>
<b> Bon &agrave; savoir :</b><br>
<br>
 1 euro = 6,56 francs fran&ccedil;ais ou :<br>
<br>
1 euro =1936,27 lires italienne<br>
<br>
1 euro = 1,95583 mark allemands<br>
<br>

1 euro = 13,7603 schillings autrichiens<br>
<br>

1 euro = 40,3399 francs belges<br>
<br>

1 euro = 166,386 pesetas espagnoles<br>
<br>

1 euro = 5,94573 marks finlandais<br>
<br>

1 euro = 340,750 drachmes grecques<br>
<br>

1 euro = 0,787564 livre irlandaise<br>
<br>
1 euro = 40,3399 francs luxembourgeois<br>
<br>
1 euro = 2,20371 florins n&eacute;erlandais<br>
<br>
1 euro = 200,482 escudos portugais<br>
<br><br>



L' euro est d&eacute;sormais la monnaie officielle de la France et de
11 autres pays de l'Union Europ&eacute;enne. <br> 
<br>
 
<A HREF="#a"<font color="#FF0000">haut de page</font> </A><br>
<br>



  

</body>
</html>
 

 