<html>
<body background="../images/fondtexte4.jpg">
<a name="a"></a>
<table>
<tr>
<td>
</td>
<td>
<font color="purple"><font size=5 face="helvetica"><a href="lamartinique.html"target="description"><b>Pr&eacute;sentation de la Martinique</a> ( )</font><br>

</td>
</tr>
</table>
<hr>
<br>


<a name="geo"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Histoire</font></font><font size=1 face="helvetica"> ( <a href="geomartinique.html" target="description">G&eacute;ographie</a></font> <font size=1 face="helvetica"> - &eacute;conomie</font><font size=1 face="helvetica"> - Produits locaux</font><font size=1 face="helvetica"> - Enfants du pays)</font></a></STRONG><BR>
</font>
<br>


Appel&eacute;e Madinina, &laquo; l'&icirc;le aux fleurs &raquo; ou Jouanacaera, &laquo; l'&icirc;le aux iguanes &raquo;<br>
<br>
<b>- 100 avant J-C :</b> les Arawaks (venus du bassin de l'Or&eacute;noque,actuel Venezu&eacute;la) s'installent en Martinique !<br> 
<br>
<b>- 1350 :</b> Les Cara&iuml;bes s'intallent en Martinique !<br>
<br>
<b>- 15 juin 1502 :</b> arriv&eacute;e de Christophe Colomb (sur le site de l'actuelle commune du Carbet), le jour de la Saint-Martin.<br>
<br>
<b>- 1635 :</b> la Martinique devient fran&ccedil;aise, et est g&eacute;r&eacute;e par la Compagnie des Isles d Am&eacute;rique (ou "Compagnie Saint-Christophe".) cr&eacute;&eacute;e par Richelieu.<br>
Un contrat est pass&eacute; entre celle-ci et les Sieurs Lienard de l'Olive et Duplessis d'Ossonville, qui s engagent d&egrave;s lors &agrave; occuper et &agrave; gouverner pour son compte, les &icirc;les de la Cara&iuml;be relevant de la couronne de France.<br>
<br>
<b>- 1er septembre 1635 :</b> Arriv&eacute; du Normand Pierre Belain d'Esnambuc (sur le site de l'actuelle commune de Saint-Pierre)qui s'&eacute;tablit en Martinique avec une centaine de compagnons. <br>
<br>
Les fondements de la soci&eacute;t&eacute; d habitation, une premi&egrave;re fois sap&eacute;s par l abolition de l esclavage, proclam&eacute;e le 22 mai 1848 apr&egrave;s la r&eacute;volte des esclaves de la r&eacute;gion de Saint-Pierre, vont &ecirc;tre progressivement remis en cause pendant le XX&egrave;me si&egrave;cle.<br> 
<br>
<b>- 8 mai 1902 :</b> &eacute;ruption de la Montagne Pel&eacute;e qui d&eacute;truit la ville de Saint-Pierre et 30.000 de ses habitants.<br>
<br>
<b>- 19 mars 1946 :</b> La Martinique devient un d&eacute;partement d'outre-mer.<br>
<br>




Le premier statut institutionnel de la Martinique est alors celui d une terre fran&ccedil;aise administr&eacute;e et exploit&eacute;e par une compagnie &agrave; vocation commerciale.<br>
Le d&eacute;veloppement de la culture de l indigo, du caf&eacute; puis, au fur et &agrave; mesure de la conqu&ecirc;te de terres arables aux d&eacute;pens des Cara&iuml;bes, de la canne &agrave; sucre, s'accompagne de la mise en place d un syst&egrave;me &eacute;conomique bas&eacute; sur l esclavage. La traite transatlantique, qui ne s ach&egrave;vera qu au d&eacute;but du XIX&egrave;me si&egrave;cle, am&egrave;ne en Martinique et dans toute la Cara&iuml;be des centaines de milliers de captifs originaires pour l essentiel d Afrique occidentale.<br>
<br>
<b>- 1685 :</b> Mise en place du Code Noir par Colbert (ministre des Finances de Louis XIV) qui est destin&eacute; &agrave; r&eacute;glementer l'esclavage dans la colonie en donnant un statut sp&eacute;cial et l&eacute;gal au syst&egrave;me sur lequel repose l'&eacute;conomie de la colonie.<br>
 Les esclaves sont d&eacute;finis comme des biens mobiliers, certains s&eacute;vices sont interdits tandis que d autres sont institutionnalis&eacute;s.<br>
<br>
<b>- 1674 :</b> le Roi retrouve ses pr&eacute;rogatives et met en place un gouvernement militaire unique pour les colonies de la Cara&iuml;be, qui r&eacute;side en Martinique.<br>
<br>
<b>- 1794 &agrave; 1802 :</b> occupation anglaise<br>
<br>
<b>- 24 f&eacute;vrier 1848 :</b> la monarchie de Juillet est renvers&eacute;e. Fran&ccedil;ois Arago, ministre de la Marine et des colonies, admet la n&eacute;cessit&eacute; d'une &eacute;mancipation des Noirs, mais pr&eacute;f&egrave;re ajourner cette question jusqu'au gouvernement d&eacute;finitif !<br>
<br>
<b>- 27 avril 1848 :</b> Sous l'intervention pressante de Victor Schoelcher (sous-secr&eacute;taire d'Etat aux colonies), une s&eacute;rie de d&eacute;crets sont promulgu&eacute;s.<br>
Le 1er abolit l'esclavage (en pr&eacute;voyant un d&eacute;lai de 2 mois et une indemnisation des anciens propri&eacute;taires d'esclaves.)<br>
<br>
Mais les esclaves, ayant eu vent de ce qui se trame en m&eacute;tropole, ne souhaitent pas attendre. C'est la r&eacute;volte !<br>
<br>
<b>- 22 et 23 mai 1848 :</b> lutte arm&eacute;e des esclaves de Saint-Pierre.  les d&eacute;crets entrent imm&eacute;diatement en vigueur. <br>
<br>
<b>- entre 1870 et 1885 :</b> retour des institutions r&eacute;publicaines. Les citoyens choisissent librement leurs d&eacute;put&eacute;s, leurs conseillers g&eacute;n&eacute;raux et leurs conseillers municipaux. Les s&eacute;nateurs sont &eacute;lus au suffrage indirect. La bourgeoisie de couleur occupe progressivement la repr&eacute;sentation politique.<br>
<br>
<b>- La loi du 27 juillet 1881 :</b> instaure la libert&eacute; de la presse et de l'imprimerie.<br>

<br>
<b>- 19 mars 1946 :</b> D'apr&egrave;s une proposition de loi &agrave; l'Assembl&eacute; Nationale, Aim&eacute; C&eacute;saire (jeune d&eacute;put&eacute;-maire de Fort-de-France), L&eacute;opold Bissol et Georges Gratiant,la Martinique devient un d&eacute;partement Fran&ccedil;ais ! (tout comme la Guadeloupe, La R&eacute;union, et la Guyane fran&ccedil;aise) <br>
<br>
<b>- 2 mars 1982 :</b> La Martinique  devient une collectivit&eacute; territoriale de plein exercice ce qui fait d'elle une des 26 r&eacute;gions fran&ccedil;aises.<br>
 
<br>
<A HREF="#a"<font color="#FF0000">haut de page</font> </A><br>
<br>
</body>
</html>