@DATABASE opium.newmail.ru:666/20s.htm
@WORDWRAP

@NODE MAIN
@TITLE " Ave Satanas..."
 
   @{" " link "19s.guide/MAIN"}@{"../pau.gif" link "../pau.gif/MAIN"}
Назад    Черная Библия "Книга Белиала
 (Земля)"    @{" " link "20_1s.guide/MAIN"}@{"../pau0.gif" link "../pau0.gif/MAIN"}
Дальше 

Составные части практикования Сатанинской Магии @{" " link "me="1"/MAIN"}Желание 

&nbsp;Первая составная часть в выполнении ритуала - желание, известное также как мотив, искушение или эмоциональная убежденность. Если вы искренне не желаете конечного результата, не следует и пытаться исполнить ритуал. Такая вещь, как "привычно исполненное" действие, исключена, ибо единственный способ для выполнения таких "трюков", как передвижение неподвижных объектов, требует наличия сильной эмоциональной потребности в совершении действия. Является правдой то, что, если чародей хочет добиться влияния, производя на других впечатление искусством своей магии, он должен предъявить осязаемое доказательство своих способностей. Как бы то ни было, в Сатанинской системе представлений о магии нет места получению удовлетворения путем доказательства своего магического мастерства. 

&nbsp;Сатанист исполняет свой ритуал для того, чтобы обеспечить исполнение своих желаний, и он не будет попусту тратить свое время или напрягать спою волю па что-либо неубедительное, такое, например, действие, как попытку заставить карандаш скатиться со стола или что-то в том же духе, пользуясь при этом магией. Количество энергии, требуемое для поднятия в воздух чайной чашки (настоящего поднятия) было бы достаточно, чтобы перенести на другой конец света свою идею в головы целой группы людей и побудить их поступать в соответствии с вашей волей. Сатанист знает, что если вам даже и удалось поднять со стола чайную чашку, то люди все равно будут считать, что в ход было пущено трюкачество. Поэтому, если Сатанист хочет поднимать объекты в воздух, он воспользуется проволокой, зеркалами и другими приспособлениями и сохранит тем самым свою силу для самовозвышения. Все "одаренные" медиумы и мистики, исповедующие белую магию, практикуют чистую прикладную сценическую магию с завязыванием глаз и запечатыванием конвертов и любой, достаточно компетентный иллюзионист, карнавальщик или салонный затейник сможет воспроизвести те же самые эффекты, хотя, вероятнее всего, в них не будет присутствовать ханжеских "спиритуальных" обертонов. 

&nbsp;Маленький ребенок усваивает, что если чего-нибудь сильно пожелать, то это обязательно сбудется. Это имеет большое значение. Желание указывает на стремление, в то время как молитва сопровождается тревогой. Священное писание исказило желание, представив его в виде вожделения, алчности и жадности. Уподобьтесь ребенку и не подавляйте желание, ибо так вы утратите связь с первой составной частью магической практики. Вводитесь во искушение и овладевайте тем, что вас искушает, всякий раз, как представляется возможность! @{" " link "me="2"/MAIN"}Выбор времени 

&nbsp;В каждой успешной ситуации один из самых важных элементов - выбор подходящего времени. В исполнении магического ритуала выбор времени может означать успех или провал в еще большей степени. Наилучшее время для привораживания, насылания чар, заклятий и проклятий - то, в которое ваш объект находится в наиболее восприимчивом состоянии. Покорность воле чародея гарантирована в том случае, если объект как можно более пассивен, И какая бы сильная воля ни была у человека, во время сна пассивность - его естественное состояние; и поэтому, самое лучшее время для посылки магической энергии на ваш объект - это время его или ее сна. В цикле сна существуют определенные периоды, наиболее выгодные для внешних воздействий. Человек, пришедший в естественное состояние усталости после дневных трудов, будет "спать как убитый", пока его тело и разум не отдохнут. Этот период глубокого сна обычно длится около четырех часов, после чего наступает фаза сновидений, продолжающаяся два или три часа, то есть до пробуждения. Как раз во время этих сновидений разум наиболее восприимчив к внешним или неосознанным воздействиям. 

&nbsp;Предположим, маг желает наслать чары на человека, который обычно ложится в одиннадцать вечера и встает в семь утра. Самое эффективное время для выполнения ритуала наступит приблизительно в пять часов утра, то есть за два часа до пробуждения объекта, Следует подчеркнуть, что маг должен находиться в наилучшей форме, ибо при исполнении ритуала он олицетворяет собой "насылающий" фактор. Традиционно, ведьмы и колдуны - ночные люди, и, понятно, почему. Существует ли лучший режим жизни для посыпания мыслей ничего не подозревающим спящим людям?! Если бы люди знали, какие мысли вводят в их умы во время сна! Фаза сновидений - это состояние, в котором фактически и зарождается будущее. Великие мысли возникают при пробуждении, и разум, который в состоянии бодрствования сохраняет эти мысли, способен многое сотворить. Но тот, кто руководствуется неосознанными мыслями, будет оказываться в тех ситуациях, что позднее будут истолкованы как "судьба", "воля божья" или несчастный случай. В дне каждого человека существуют и другие временные промежутки, годные для восприятия воли чародея. Эти промежутки, характеризующиеся грезами, усталостью или скучно тянущимся временем - также плодотворные периоды для внушения. 

&nbsp;Если объектом ваших чар является женщина, не следует забывать о важности менструального цикла. Если бы чувства мужчины не были бы притуплены подавившим их эволюционным развитием, то он знал бы, как знает любое животное, когда самка склонна к совокуплению. Нос человека, не испытывающий даже воздействия дешевых опиатов, не приспособлен распознавать в нормальном состоянии такие красноречивые эротические запахи. Даже если бы ему были дарованы такие обонятельные способности, объект его притязаний скорее всего сбил бы его со следа с помощью большого количества парфюмерии с целью заглушения и подавления "дурных" испарений, или пользуясь удушающим действием мощных дезодорантов, совсем бы уничтожил возможность их обнаружения. 

&nbsp;Несмотря на эти обескураживающие факторы, в зависимости от склада мужчины, в нем все же пробуждается желание или отвращение, когда у него возникает подсознательное осознание перемен в женском обмене веществ. Это проявляется в форме намека со стороны (органов чувств обонятельного характера). 

&nbsp;Обращение вспять, что было бы равнозначно возвращению в стадию животного, по-видимому, было бы наилучшим путем сознательного использования этих способностей, хотя для людей брезгливых, это, возможно, и отдает дикарством. Хотя существует и более легкий путь, то есть, простое выяснение даты и частоты менструального цикла женщины, к которой вас влечет. Средняя женщина наиболее всего сексуально доступна непосредственно перед самим периодом или же сразу после него. Поэтому, время сна во время таких циклов - наиболее эффективно для внушения мыслей или побуждений сексуального характера. 

&nbsp;Ведьмы и колдуньи обладают куда более широким выбором времени для привораживания избранного ими мужчины. Поскольку мужчина более постоянен в своем сексуальном влечении, чем женщина (хотя, существует множество женщин, в равной или даже в большей степени возбудимых), расчет времени с точностью до дня не играет столь важной роли. Любой мужчина, если его сексуальная энергия еще не совсем иссякла, представляет собой "подсадную утку" для опытной ведьмы. Время года, следующее за весенним равноденствием, как никакое другое время наполняет мужчину сексуальной энергией и все его поведение говорит об этом; но ведьме, в свою очередь, придется вкладывать в свою магию больше сил, поскольку, как она может легко убедиться, глаза мужчины блуждают. 

&nbsp;На вопрос боязливого: "Неужели никак невозможно защититься от такого колдовства?" ответ один - "Да, защититься можно. Вы не должны никогда спать, не должны никогда грезить, ум ваш никогда не должны покидать важные мысли и вы никогда не должны открывать свои мысли другим. Вот тогда вы будете защищены от воздействия магических сил"< @{" " link "me="3"/MAIN"}Образ 

&nbsp;Подросток, с превеликой тщательностью вырезающий на дереве сердце, внутри которого инициалы его и предмета его любви; малыш, часами просиживающий за рисованием роскошных автомобилей такими, какими они ему видятся; маленькая девочка, укачивающая на руках старую потрепанную куклу, считая ее при этом своим прекрасным ребенком, - все это примеры одаренных ведьм и колдуний, прирожденных магов. Все они пользуются магическим элементом, известным под названием "образ" от которого зависит успех любого ритуала. 

&nbsp;Дети, которые не знают, обладают ли они какими-либо артистическими навыками или творческими талантами, и которых это совершенно не волнует, стремятся к достижению своей цели, используя изготовленные ими самими образы, в то время как "цивилизовнные" взрослые относятся к своим творческим потугам намного критичнее. Вот почему "примитивный" колдун может успешно использовать в своих церемониях глиняную куклу или грубый рисунок. Для НЕГО этот образ в достаточной степени точен. 

&nbsp;Все, что служит усилению эмоций во время ритуала, будет служить его успешному завершению. Любой рисунок, картина, скульптура, надпись, фотография, предмет одежды, запах, звук, музыка, инсценировка реальной или вымышленной ситуации - все, что может быть использовано в церемонии, послужит на пользу магу. 

&nbsp;Образ - постоянное напоминание, средство, экономящее интеллектуальную энергию, рабочий заменитель реального предмета. Образом можно манипулировать, его можно конструировать, в него можно вносить изменения и создавать - и все это проделывается в согласии с волей чародея и сама модель, создаваемая образом, становится формулой, устремленной в действительность. 

&nbsp;Если вы желаете вкусить сексуальных удовольствий с избранным вами человеком, необходимо создать желаемую ситуацию на бумаге, холсте и т.д., внеся в ситуацию как можно больше преувеличений - и все это будет неотъемлемой частью церемонии. 

&nbsp;Если же ваши желания материального плана, вам следует смотреть на образы, их представляющие - окружить себя запахами и звуками, которые привлекут соответствующие ситуации; создайте магнит, что притянет к себе желаемую ситуацию или предмет! 

&nbsp;Для того, чтобы гарантировать уничтожение врага, необходимо уничтожить его заменитель! Его нужно застрелить, заколоть, наслать на него болезнь, сжечь, разломать, утопить или растерзать как можно более живописнее и убедительнее. Легко понять, почему религии правосторонней ориентации осуждают сотворение "идолов". Образ, используемый магом, - рабочая модель материальной действительности, что полностью противоречит эзотерической духовности. 

&nbsp;Один греческий джентльмен, верящий в магию, однажды возжелал женщину, которая удовлетворила бы его во всех отношениях, и он был столь одержим бесплотным предметом своих грез, что начал ваять это прекрасное существо. Когда работа его была завершена, он настолько искре н не и безумно влюбился в сотворенную им женщину, что вместо камня она обрела бренную плоть и наполнилась жизнью и теплом; таким вот образом маг Пигмаллион получил величайшее из магических благословений и отныне прекрасная Галатея всецело принадлежала ему. @{" " link "me="4"/MAIN"}Направление 

&nbsp;Один из наиболее часто игнорируемых элементов в практике ритуальной магии - накопление и последующее направление силы для эффективного завершения ритуала. 

&nbsp;Как правило, слишком многие люди, стремящиеся стать ведьмами и колдунами, исполняют ритуал, а затем с нетерпением ожидают первого признака успешного исполнения. В сущности, с таким же успехом они могли бы опуститься на колени и молиться, так как само их волнение в ожидании результата сводит на нет всякую реальную возможность успеха. Более того, сомнительно, чтобы с таким отношением они были в состоянии накопить достаточно концентрированной энергии даже для того, чтобы как следует исполнить церемонию. 

&nbsp;Размышления или постоянные жалобы насчет ситуации, на которой будет основан ваш ритуал, послужат лишь гарантией ослабления ритуально направленной силы, распыляя и ослабляя ее. После того, как желание достаточно усилено, чтобы пустить в ход силы магии, должны быть предприняты все усилия, чтобы дать символический выход этих желаний ЧЕРЕЗ ИСПОЛНЕНИЕ РИТУАЛА - НО НЕ ДО И НЕ ПОСЛЕ! 

&nbsp;Цель ритуала - ОСВОБОДИТЬ мага от мыслей, могущих поглотить его, если он постоянно будет обращаться к ним. Размышления, грезы и постоянное обдумывание всех возможных вариантов дальнейшего развития событий сжигают эмоциональную энергию, которая могла бы быть сконцентрирована в силе, чью динамику можно использовать; не стоит даже и упоминать о том, что эффективность любой, даже повседневной деятельности резко снижается из-за таких всепоглощающих забот. 

&nbsp;Ведьма, насылающая свои чары в промежутках между длительными ожиданиями у телефона звонка того, на кого эти чары насылаются; терпящий нужду колдун, взывающий о милости у Сатаны, а затем на иголках ожидающий прибытия чека; человек, в отчаянии от причиненных ему обид, проклявший своего врага, и затем, с вытянувшимся лицом и нахмуренным челом, влачащий свой крест дальше - все это распространенные примеры неверно расходуемой эмоциональной энергии. 

&nbsp;Нечего и удивляться тому, что "белый" волшебник опасается возмездия после насылания "злых" чар! Возмездие охваченным страхом отправителям обеспечено уже самим их озабоченным состоянием! @{" " link "me="5"/MAIN"}Уравновешивающий фактор 

&nbsp;Использование такого ингредиента, как уравновешивающий фактор, в практике ритуальной магии более оправдано в сексуальных и благотворных ритуалах, нежели при насылании проклятия. Значение его, несмотря на кажущуюся незначительность, тем не менее велико. 

&nbsp;Полное овладение и осознание этого фактора - способность, которой обладают весьма немногие ведьмы и колдуны. Говоря проще, - это осознание типов личностей и ситуаций и подбор соответствующей магии для достижения наибольшего эффекта. Осознание собственных ограничений может показаться странным способом самосовершенствования человека, которому суждено совершать невозможное, но при многих обстоятельствах именно оно может определить разницу между успехом и неудачей. 

&nbsp;Если в попытке достичь желанной цели средствами большой или малой магии вы постоянно терпите поражение, задумайтесь над следующими вещами: Не стали ли вы жертвой своего собственного заблудшего и чрезмерно раздутого эго, которое заставляет вас хотеть чего-то или кого-то, когда на это практически нет шансов? А может вы - бесталанный, лишенный музыкального слуха индивидуум, который пытается через магию добиться великого признания своей немузыкальности? А может вы простая, лишенная шика ведьма с непропорциональными размерами обуви, носа и эго, да и к тому же с запущенной прыщавостью, насылающая любовные чары на звезд экрана? А может вы - пошлый, брюхатый, слюнявый и кривозубый старый ботинок, возжелавший молодую, роскошную стриптизерку? Если так, то вам немедленно нужно научиться пользоваться уравновешивающим фактором, иначе продолжайте постоянно ожидать провалов! 

&nbsp;Быть в состоянии привести свои желания в соответствие со своими способностями уже само по себе недюжинное достижение, но есть еще слишком много людей, не способных осознать, что если они не в состоянии добиться максимума, то "половина куска все же лучше, чем ничего". Никем иным, как хроническим неудачником можно назвать того человека, который, ничего не имея и не в состоянии заработать миллион долларов, отклоняет шанс сделать пятьдесят тысяч с ухмылкой отвращения. 

&nbsp;Одно из самых мощных орудий мага - его самоосознание, осознание своих талантов, возможностей, физически привлекательных и отталкивающих черт и т.д., а также того, где, когда и с КЕМ их лучше всего использовать. Человек, которому нечего предложить, по сравнению с тем, кто добивается успехов с помощью грандиозных проектов и обещаний великого богатства, подобен по своей значимости блохе, карабкающейся по ноге слонихи с целью изнасиловать ее! 

&nbsp;Начинающий колдун, уверенный в том, что достаточно сильное магическое действие ВСЕГДА увенчивается успехом, несмотря на магический дисбаланс, забывает одно из главнейших правил: МАГИЯ ПОДОБНА САМОЙ ПРИРОДЕ И УСПЕХ В МАГИИ ТРЕБУЕТ ГАРМОНИЧНОГО ВЗАИМОДЕЙСТВИЯ С ПРИРОДОЙ, А НЕ ОТРИЦАНИЯ ЕЕ. 
 ---

 ---

 ---

 ---

 ---

@endnode
