@DATABASE opium.newmail.ru:666/13s.htm
@WORDWRAP

@NODE MAIN
@TITLE " Ave Satanas..."
 
   @{" " link "12s.guide/MAIN"}@{"../pau.gif" link "../pau.gif/MAIN"}
Назад    Черная Библия "Книга Люцифера
 (Воздух)"    @{" " link "14s.guide/MAIN"}@{"../pau0.gif" link "../pau0.gif/MAIN"}
Дальше 

Потворство... но не принуждение 

Высшая стадия человеческого развития есть осознание плоти! 

&nbsp;Сатанизм одобряет действия своих последователей, когда они дают волю своим естественным желаниям. Только так можно стать полностью удовлетворенным человеком без разочарований, могущих принести вред вам и окружающим. Эта фраза содержит самое упрощенное описание смысла Сатанинской веры: 

Потворство вместо воздержания 

&nbsp;Люди часто принимают принуждение за потворство, но между этими понятиями существует большое различие. Принуждение никогда не создается потворством, а, наоборот, возникает в результате неспособности потакать. Если сделать из чего-либо табу, то это послужит усилению желания. Все любят делать то, что им запрещено делать. "Запретные плоды самые сладкие". 

&nbsp;Уэбстерский энциклопедический словарь определяет потворство так: "Поддаваться, не сопротивляться и не идти против; давать волю, удовлетворяться, уступать". Словарное определение принуждении таково: "Акт принуждения или заставления силой, физически или морально; сдерживание воли". Другими словами, потворство предоставляет выбор, в то время как акт воздержания указывает на отсутствие его. 

&nbsp;Когда у человека нет соответствующего выхода для своих желаний, они быстро нарастают и становятся принуждением. Если у каждого было бы подходящее место и время для периодического удовлетворения своих желаний без страха затруднений или укора, то им было бы намного легче вести жизнь без разочарований в этом мире. Они были бы вольны окунаться с головой в любое выбранное ими предприятие, вместо того, чтобы исполнять свой долг спустя рукава, подавив свои творческие порывы отрицанием своих естественных желаний. Это правило подходит к большинству случаев, но, как всегда, найдутся те, кто лучше выполняют свою работу под принуждением. В основном, те, кто нуждается в испытании твердостью, дабы трудиться с полной отдачей, принадлежат к артистическим кругам (далее будет рассмотрено подробнее удовлетворение через самоотрицание). Это вовсе не означает, что все люди попадают под эту категорию. Наоборот, многие художники не могут творить, пока их животные нужды не удовлетворены. 

&nbsp;По большей части, вовсе не художникам и индивидуалистам, а среднестатистическим работающим мужчинам и женщинам из среднего класса недостает подобающего выхода их желаниям. Ирония заключается в том, что ответственный, уважаемый человек, - тот, кто платит по счетам общества, становится тем, кто менее всего получает взамен. Именно он должен постоянно осознавать свои моральные обязанности и обречен на нормальное удовлетворение своих естественных желаний. 

Сатанинская религия считает это большой несправедливостью. Тот, кто добросовестно выполняет свои обязанности, должен быть наиболее вознагражден удовольствиями по своему выбору, без цензуры со стороны общества, которому ОН служит. 

&nbsp;Наконец сформирована религия (Сатанизм), которая поощряет и награждает тех, кто поддерживает общество, в котором они живут, вместо осуждения за их человеческие потребности. Из любого набора принципов (будь то религиозные, политические или философские) можно извлечь некоторую выгоду. Среди безумия гитлеровской концепции, одно положение выделяется ярким тому примером - "сила через радость". Гитлер знал, что делает, когда предлагал немецкому народу счастье на личном уровне в обмен на лояльность по отношению к нему при высокой эффективности в работе. 

&nbsp;Совершенно точно установлено, что большинство болезней имеют психосоматическую природу, которая, в свою очередь, является прямым продуктом разочарований. Есть поговорка: "Лучшие умирают молодыми". Ибо, лучшие, по христианским стандартам, и ДОЛЖНЫ умереть молодыми! Расстройство наших естественных инстинктов - вот причина, ведущая к разрушению наших душ и тел. 

&nbsp;Стало очень модным сосредотачиваться на улучшении духа и считать удовольствия тела (той самой субстанции, без которой душа и тело не могли бы существовать) грубыми и непристойными. В ПОСЛЕДНЕЕ ВРЕМЯ, МНОГИЕ ЛЮДИ, ПОЛАГАЮЩИЕ. ЧТО ОНИ ВОЗВЫСИЛИСЬ, ДОБИЛИСЬ ЛИШЬ ТОГО, ЧТО ИХ НОРМАЛЬНОСТЬ ПЕРЕШЛА В ИДИОТСТВО! Сгибая свои спины, чтобы встретиться со своим пупком, существуя на таких экзотических диетах, как коричневый рис и чай, они думают, что достигнут великого состояния духовного развития. 

&nbsp;"Пойло для свиней!" - говорит Сатанист. Он предпочитает хорошую и здоровую пищу, упражняя свое воображение и прогрессируя путем физического и духовного удовлетворения. Сатанист подразумевает, что, после многовекового бега в упряжи необоснованных религиозных требований, человек должен приветствовать шанс наконец стать человеком! 

&nbsp;Если кто-либо думает, что, отрицая естественные потребности, можно избежать посредственности, он должен изучить восточный мистицизм, пользующийся в последние годы благосклонностью интеллектуалов. Христианство - "старая шляпа" и те, кто хотел бы избежать его оков, обратились к так называемым просвещенным религиям, таким, как буддизм. Несмотря на то, что христианство, несомненно, заслужило свою критику, оно, по-видимому, все же получает больше своей доли заслуженных им обвинений. Последователи мистических течений также могут быть обвинены в малом гуманизме, как и "заблудшие" христиане. Все религии основаны на избитых философиях, но адепты мистицизма претендуют на просвещенность и возвышенность над закомплексованной виной догмой, представляемой христианством. Однако, восточные мистики даже более, чем христиане, озабочены избеганием анималистических признаков, которые напоминают им, что они не "святые", а всего лишь люди - другая форма животных, иногда лучших, гораздо чаще же - худших, чем те, кто ходит на четырех лапах и, кто, вследствие своего интеллектуального и духовного развития стали самыми опасными из всех животных! 

&nbsp;Сатанист спрашивает: "Что же неправедного в том, что бытность человеком имеет свои достоинства и недостатки? Отрицая свои желания, мистик не приближается к преодолению присуждения более, чем его родственная душа - христианин. Восточные мистические верования научили людей касаться головой своего пупка, стоять на голове, пялиться на пустые стены, избегать ярлыков в повседневной жизни и ограничивать себя в каждом желании материальных удовольствий. Тем не менее, я уверен, что вам доводилось видеть множество так называемых йогов с такой же неспособностью бросить курить, как и у всех людей, или "возвысившихся" буддистов, которые становятся такими же возбужденными, как и "менее отвлеченный" человек, при встрече с лицом противоположного, а в некоторых ситуациях и одного с ним пола. Однако же, будучи испрошены объяснить причину своего лицемерия, эти люди отступают в двусмысленность, характеризующую их веру - никто не может их осуждать, не получив прямых ответов. Простой, по своей сути факт - этот тип людей, обратившись к вере, исповедующей воздержание, приходит к потворству. Их принудительный мазохизм является причиной выбора религии, которая не только отстаивает самоотрицание, но и поощряет его и, более того, дает им освященный путь для выражения своих мазохистских нужд. Чем большую дозу плохого обращения они могут снести, тем "святее" они становятся. 

&nbsp;Мазохизм для многих людей представляет отрицание потворства. Сатанизм указывает на смысл, кроющийся за избитым и наиболее употребительным пониманием этого слова, и считает мазохизм потворством в том случае, если любая попытка отвратить или излечить человека от мазохизма встречена с негодованием и/или кончается неудачей, Сатанист не винит этих людей за выражение своих мазохистских наклонностей, но испытывает величайшее презрение к тем, кто не может быть честен (по крайней мере, с самим собой) в осознании и принятии своего мазохихма как естественной части их личности. 

&nbsp;Использование религии в качестве оправдания своему мазохизму уже само по себе достаточно плохо, но люди, занимающиеся этим, на деле еще и имеют наглость чувствовать превосходство над теми, кто не связан самообманчивостью выражения собственных фетишей Они первыми обвинят челоиека, находящего еженедельный выход своим фантазиям с партнером, избивающим его от души, тем самым освобождая себя от того, что, будучи неосвобожденным, сделало бы его, как сделало уже их, вынужденным ходить в церковь, или религиозным фанатиком. Находя адекватный выход своим мазохистским страстям, он более не нуждается в самоунижении и самообвинении каждую секунду, как это требуется вынужденному мазохисту. 

&nbsp;Сатанисты поощряемы совершать семь "смертных грехов", если только они не причиняют никому вреда. Грехи были придуманы христианской церковью, дабы гарантированно можно было бы обвинить любого из своих прихожан. Церкви прекрасно известно, что никому не дано избежать греходеянни. поскольку они являются ничем иным, что мы, будучи людьми, каждодневно делаем. А после неизбежных прегрешений, денежные подношения церкви, имеющие целью "откупиться" от Бога, играют роль подачки для сознания прихожанина! 

&nbsp;Сатане никогда не был нужен свод правил, поскольку естественные жизненные силы поддерживали человека "во грехе", имея целью самосохранение человека и его чувств. Однако, было предпринято множество деморализующих экспериментов на теле ради "спасения души", что лишь подтверждает насколько неверно толковались и использовались ярлыки "потворство" и "воздержание". 

&nbsp;Сатанизм, конечно же, одобряет и поощряет сексуальную деятельность, но тот факт, что наша религия - единственная, которая занимает такую позицию, является причиной, по которой ей уделялось так много предвзятого внимания. Когда такое большинство людей принадлежит к религиям, подавляющим их в сексуальном плане, то все, что написано по этому соблазнительному поводу, обречено на успех. Если все попытки продать что-нибудь (будь то продукт или идея) проваливаются, - нужно звать на помощь секс! Причина заключается в том, что, несмотря на то, что люди сейчас осознанно воспринимают секс как естественную и необходимую функцию организма, их подсознание все еще связано разного рода табу, навязанными ему религией. Вновь упомянем, что запрещенное всегда наиболее желаемо. Именно пугало секса позволяет литературе, посвященной Сатанинским взглядам на эту тему, затмевать все, что написано собственно о Сатанизме. 

&nbsp;Настоящий Сатанист не более озабочен сексом, чем любыми другими своими желаниями. Он, скорее, подчиняет его себе, как и все приятные вещи, чем впадает в зависимость от него. Он не является ни дьявольским извращением, только и ждущим возможности дефлорировать всех молодых девственниц, ни боязливым дегенератом, болтающимся у "грязных" книжных магазинов, помешанным на "непристойных" картинках. Если порнография подходит его нуждам в данный момент, он, не стыдясь, покупает нужные ему вещи и без чувства ложной вины пользуется ими. 

&nbsp;"Мы должны принять во внимание тот факт, что человек становится раздраженным от постоянного подавления, но должны также сделать и все возможное, чтобы, по крайней мере, умерить грешные человеческие страсти, иначе они станут безудержны в этой новой эпохе", - говорят набожники правоверного пути Сатанисту, вопрошающему: "Зачем продолжать считать эти желания постыдными и нуждающимися в подавлении, если теперь вы признаете их естественными!?" Но не может ли статься так, что последователи религий белого света, строящие кислые мины при упоминании о том, что до Сатанизма им и в голову не приходила мысль о новой религии, быть последователем которой было бы приятно, хотели бы извлечь из жизни немного больше удовольствий, но из страха потерять лицо, боятся признать это? Не может ли статься и так, что они боятся того, что люди, услышав о Сатанизме, скажут: "Вот это как раз для меня, - зачем продолжать исповедовать религию, которая обвиняет меня во всем. что я делаю, даже если в этом нет ничего дурного?" Сатанист считает последнюю мысль более вероятной. 

&nbsp;Есть несомненные свидетельства тому, что религии прошлого каждый день снимают все больше и больше своих смешных и нелепых ограничений. Но, несмотря на это, если целая религия основана на принципе "воздержание вместо потворства" (словно так это и должно быть), то от нее остается весьма мало, когда она пересматривается с целью удовлетворения современных человеческих потребностей. Следовательно, зачем тратить время "покупая овес для дохлой лошади?"< 

Лозунг Сатанизма - ПОТВОРСТВО вместо "воздержания"... НО потворство - это не принуждение. 
 ---

 ---

 ---

 ---

 ---

@endnode
