@DATABASE opium.newmail.ru:666/14s.htm
@WORDWRAP

@NODE MAIN
@TITLE " Ave Satanas..."
 
   @{" " link "13s.guide/MAIN"}@{"../pau.gif" link "../pau.gif/MAIN"}
Назад    Черная Библия "Книга Люцифера
 (Воздух)"    @{" " link "14_1s.guide/MAIN"}@{"../pau0.gif" link "../pau0.gif/MAIN"}
Дальше 

К вопросу о человеческом жертвоприношении. 

&nbsp;Предполагается, что цель исполнения ритуала жертвоприношения - выброс энергии, запасенной в крови только что убитой жертвы, в атмосферу магического действий, повышающий тем самым шансы мага на успех. 

&nbsp;"Белый" волшебник полагает, что раз кровь представляет собой жизненную силу, то нет лучшего способа ублажить богов или демонов, чем предоставить им необходимое количество ее. Соедините это логическое объяснение с тем фактом, что умирающее существо в избытке тратит адреналин и другие биохимические элементы и вы получаете кажущееся неоспоримым утверждение. 

&nbsp;"Белый" волшебник, опасаясь последствий, связанных с убийством человеческого существа, обычно использует птиц или других "низших" животных в своих церемониях. Думается, эти ханжеские негодяи не испытывают вины, отбирая жизнь животного вместо людской. 

&nbsp;В действительности же, если маг достоин своего звания, он не будет стеснен в высвобождении необходимой энергии из своего собственного тела, вместо умерщвления не желающей и не заслуживающей того жертвы! 

&nbsp;В противоположность всей магической теории, освобождение этой силы проявляется не в пролитии крови, а в смертных муках живого существа. Разрядка биологической энергии - тот же феномен, что проявляется в глубоком усилении таких проявлений человеческого существа, как сексуальный оргазм, слепая ярость, смертельный ужас, всепоглощающее горе и т.д. Из всех этих эмоций самые простые в достижении по собственной воле - сексуальный оргазм, а также гнев и горе, уступающее некоторым образом предыдущим двум чувствам. Памятуя о том, что первые две наиболее достижимые эмоции (сексуальный оргазм и гнев) выжжены набожниками в подсознании как "грешные", неудивительно, что они избегаемы "белыми" волшебниками, влачащими величайшее бремя вины из всех людей! Тупая ослиная абсурдность нужды убийства невинного живого существа в ритуале, практиковавшегося "колдунами" прошлого, есть, очевидно, меньшее из зол, когда требуется разряд энергии. Эти бедные глупцы, мучимые угрызениями совести, называвшие себя ведьмами и колдунами, скорее были готовы отрубить голову козлу или цыпленку в попытке использовать их предсмертную агонию, нежели "богохульно" мастурбировать пред ликом Иеговы, которого, по их утверждениям, они же и отрицали! Единственный способ, которым эти мистические трусы могли ритуально освободить себя, была агония чужой смерти (на самом деле, по доверенности, - своей собственной), предпочитаемой ими потворствующей силе, производящей жизнь! Шагающие по пути белого света, на самом деле холодны и мертвы! Неудивительно, что эти хихикающие прыщики ^"истического знания" должны были стоять внутри защитных кругов и связывать "злые" силы для того, чтобы чувствовать себя в "безопасности" от нападения - ПОСКОЛЬКУ ОДИН ХОРОШИЙ ОРГАЗМ УБИЛ БЫ ИХ! 

&nbsp;Использование человеческой жертвы в Сатанинском ритуале не подразумевает убийства ради "ублажения богов". Символически жертва уничтожается через наговор или проклятие, что, в свою очередь, приводит к физическому, духовному или эмоциональному разрушению "жертвы" способами, которые нельзя затем приписать волшебнику. Сатанист приносит человеческую жертву только тогда, когда она может послужить двум целям сразу: для освобождения волшебника от зла в форме проклятия и, что более важно, для избавления от весьма отвратительного и заслуживающего того индивидуума. 

&nbsp;НИ при каких обстоятельствах Сатанист не приносит в жертву животное или ребенка! Веками пропагандисты правоверного пути лепетали о предполагаемых убийствах маленьких детей и сладострастных девиц, приносимых дьяволопоклонниками в жертву. Естественным было бы предполагать, что любой, читающий или слушающий эти истории, немедленно испросит подтверждения их достоверности, подвергнув сомнению пристрастные источники этих сказок. Но, в противоположность этому, как и вся "святая ложь", принимаемая без оговорок, этот Сатанинский "modus орerandi" существует и по сей день! 

&nbsp;Причины, по которым Сатанисты не могут совершать подобных действий, ясны и логичны. Человек, равно как и животное, является божеством для Сатаписта. Чистейшая форма плотского бытия таится в телах животных и детей, которые еще недостаточно выросли, чтобы подавлять свои естественные желания. Они могут воспринимать то, о чем взрослые не могут и мечтать. Поэтому Сатанист рассматривает эти существа со святым убеждением, что может научиться многому у этих естественных волшебников мира сего. Сатанисту известно об обычае, бытующем среди последователей пути Агарти - богоубийстве. Ввилу того, что боги всегда создаются по образу и подобию людскому, а средний человек ненавидит себя за то, что он находит в себе, - неизбежное должно произойти: жертвоприношение бога, представляющего человека. Сатанист же НЕ ненавидит ни себя, ни богов, избранных им, и не имеет желания разрушать себя или того, кому он привержен! По этой же причине он никогда не принесет осознанного вреда животному или ребенку. 

&nbsp;Возникает вопрос: "Кто же тогда должен считаться подходящей и должной человеческой жертвой, и как следует принимать решение в отношении такого человека?" Ответ очень прост. Любой, кто поступил с вами неправильно, - тот, кто "сошел со своего пути", чтобы причинить вам вред, кто намеренно вызвал неприятности и трудности для вас и тех, кто вам дорог и близок. Короче говоря, человек, напрашивающийся на проклятие своими действиями. 

&nbsp;Когда человек своим предосудительным поведением практически кричит о том, чтобы его уничтожили, то, без сомнения, ваш моральный долг состоит в том, чтобы исполнить его желание. Человек, не упускающий возможности "зацепить" других, часто ошибочно называется "садистом". Но, на самом деле, этот человек - заплутавший мазохист, напрашивающийся на свое уничтожение. Причина, по которой такие люди злобно нападают на вас, состоит в том, что они боятся либо вас, либо того, чего вы представляете, либо же обижены вашим счастьем. Они слабы, подвержены опасности и ходят по зыбкой почве, поэтому, когда вы напускаете на них свое проклятие, становятся идеальными человеческими жертвами. 

&nbsp;Иногда очень легко просмотреть зло, чинимое жертвой вашего проклятия, если пытаться рассматривать насколько она несчастна на самом деле. Не так легко, однако, восстановить все разрушительные следы вашего антагониста и исправить все испорченные ими ситуации. 

&nbsp;"Идеальная жертва" может быть эмоционально подвержена опасности, но, тем не менее, может путем махинаций собственной небезопасности вызвать серьезные нарушения вашего спокойствия, либо запятнать вашу репутацию. "Нервный срыв", "неумение приспособиться к окружающей обстановке", "невроз беспокойства", "ребячье соперничество" и т.д, и т.п., до бесконечности. Все эти синдромы слишком долго были подходящими извинениями для злобных и безответственных поступков. Любой, говорящий, что "мы должны попытаться понять" тех, кто превращает жизнь в страдание для тех, кто не заслужил его, плодит и подстрекает рак общества! Апологеты этих бешеных псов заслуживают любого избиения, получаемого ими от рук тех, кому они попечительствуют! 

&nbsp;Бешеных псов уничтожают, но они нуждаются в помощи куда большей, чем те люди, у которых у рта появляется пена, когда лишь речь заходит об иррациональном поведении! Легко сказать: "Ну и что? Эти люди неустойчивы; они не могут причинить мне вреда". Но факт остается фактом - при первой же возможности они уничтожат вас! 

&nbsp;Следовательно, у вас есть все права на то, чтобы (символически) уничтожить их, и, если ваше проклятие приводит к настоящему уничтожению, утешайтесь мыслью о том, что вы послужили инструментом в избавлении мира от вредителя! Если вашему успеху или счастью мешает кто-либо, - вы перед ним ни в чем не обязаны! Он заслуживает участи быть раздавленным под каблуком! ЕСЛИ БЫ ЛЮДИ ОЩУЩАЛИ ПОСЛЕДСТВИЯ СОБСТВЕННЫХ ПОСТУПКОВ, ОНИ БЫ ДУМАЛИ ДВАЖДЫ! 
 ---

 ---

 ---

 ---

 ---

@endnode
