<html>
<body background="../images/fondtexte2.jpg">
<a name="a"></a>

<table>
<tr>
<td>
<IMG SRC="../images/iconcarte.jpg" alt="icon carte" border=0</a>
</td>
<td>
<font color="purple"><font size=5 face="helvetica"><a href="enteteauvergne.html"target="description"><b>Pr&eacute;sentation de la r&eacute;gion Auvergne</b></a> </font>
</td>
</tr>
</table>

<HR>
Une r&eacute;gion aux paysages uniques qui ne ressemble &agrave; aucune autre montagne, &agrave; aucune autre campagne.<br>
<br>

Ici les sommets ne sont pas inaccessibles et arrogants...ici, on vient seulement pour ressentir et contempler,  C'est le royaume du silence, le pays du r&ecirc;ve et de l'espoir...<br>
<br>

 L'Auvergne, c'est choisir &agrave; la fois le recueil et le d&eacute;foulement, la ville et la montagne, Au diable les m&eacute;tropoles et leur couronne de nature r&eacute;duite &agrave; l'&eacute;tat de conservatoire ; ici tout est vivant et humain... et doit le rester !<br>
<br><br>


<a name="geo"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">G&eacute;ographie</font><font size=1 face="helvetica"> ( <A HREF="#eco">Economie</font></a><font size=1 face="helvetica"> - <A HREF="#his">Histoire</font></a><font size=1 face="helvetica"> - <A HREF="#pro">Produits locaux</font></a><font size=1 face="helvetica"> - <A HREF="#enf">Enfants du pays</a>)</font></a></STRONG><BR>
</font>

<BR>
<font size=3 face="helvetica">
Les for&ecirc;ts recouvrent le quart du territoire r&eacute;gional !<br>
<br><br>
<a name="eco"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Economie</font><font size=1 face="helvetica"> ( <A HREF="#geo">G&eacute;ographie</font></a><font size=1 face="helvetica"> - <A HREF="#his">Histoire</font></a><font size=1 face="helvetica"> - <A HREF="#pro">Produits locaux</font></a><font size=1 face="helvetica"> - <A HREF="#enf">Enfants du pays</a>)</font></STRONG><BR>
</font>
<br>
La r&eacute;gion concentre aujourd'hui ses efforts sur 5 domaines &eacute;conomiques; &agrave; savoir l'agro-industrie, la m&eacute;canique, la plasturgie, la sant&eacute;-beaut&eacute; et le tourisme-loisirs...<br>
<br>
- L'industrie du lait est orient&eacute;e vers la production de fromages gr&acirc;ce aux coop&eacute;ratives telles que Alliance Agro-alimentaire et Richemonts.<br>
La viande bovine, la volaille, la salaisonnerie sont &eacute;galement bien repr&eacute;sent&eacute;s sans oublier "le p&eacute;trole de l'auvergne" &agrave; savoir, les eaux min&eacute;rales Volvic et Vichy...<br> 
<br>
- Pour le travail et la transformation des m&eacute;taux, on trouve les soci&eacute;t&eacute;s Interforge, Fortech, P&eacute;chiney-C&eacute;gedur-Rh&eacute;nalu, et la S.M.E. (leader europ&eacute;en dans la transformation des alliages l&eacute;gers d'aluminium). Les aci&eacute;ries sont repr&eacute;sent&eacute;es par Aubert et Duval et la Commentryenne des Aciers Fins.<br>
Sans oublier la coutellerie &agrave; Thiers qui r&eacute;alise 70% de la production fran&ccedil;aise !<br> 
<br>

- La transformation des mati&egrave;res plastiques est r&eacute;alis&eacute;e par Saint-Sigol&egrave;ne, assurant 30% de la production fran&ccedil;aise de plaques et films en mati&egrave;re plastique !<br>
Michelin &agrave; Clermont-Ferrand est le 1er fabricant mondial de pneumatiques et le 1er employeur de la r&eacute;gion.<br>
L'imprimerie de la Banque de France (&agrave; Chamali&egrave;res) est le 2&egrave;me employeur de la r&eacute;gion.<br>
 A noter la pr&eacute;sence de &laquo; Dunlop-Sumitomo &raquo; &agrave; Montlu&ccedil;on.<br>
<br>
- la chimie est repr&eacute;sent&eacute; par Rh&ocirc;ne-Poulenc nutrition animale et Roussel Uclaf.<br>
 La para-chimie et la pharmacie par MSD, Chibret, Merck and Co, R&eacute;ti et l'Or&eacute;al. <br>
<br>
- Le tourisme et surtout le thermalisme offrent une ressource non-n&eacute;gligeable &agrave; la r&eacute;gion.<br>
<br>
A noter la pr&eacute;sence des soci&eacute;t&eacute;s : Bendix, Sagem Allumage et Val&eacute;o (&eacute;quipement automobile), Sagem-Matra (armement), Sat Cables (&eacute;lectronique), et CSEE (bois et ameublement de tradition).<br>
 
<br><br>
<a name="his"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Histoire</font><font size=1 face="helvetica"> ( <A HREF="#geo">G&eacute;ographie</font></a><font size=1 face="helvetica"> - <A HREF="#eco">Economie</font></a><font size=1 face="helvetica"> - <A HREF="#pro">Produits locaux</font></a><font size=1 face="helvetica"> - <A HREF="#enf">Enfants du pays</a>)</font></STRONG><BR>
</font>

<br>

<br><br>
<a name="pro"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Produits locaux</font><font size=1 face="helvetica"> ( <A HREF="#geo">G&eacute;ographie</font></a><font size=1 face="helvetica"> - <A HREF="#eco">Economie</font></a><font size=1 face="helvetica"> - <A HREF="#his">Histoire</font></a><font size=1 face="helvetica"> - <A HREF="#enf">Enfants du pays</a>)</font></a></STRONG><BR>
</font>
La truffade<br>
<br>
-<b> Les plats :</b> La pot&eacute;e Auvergnate, la truffade, le pounti (sorte de clafoutis &agrave; la viande hach&eacute;e)<br> <br>
- <b>Les fromages :</b> Le cantal, le saint-nectaire, le bleu d'Auvergne<br>  
<br>
- <b>Les Patisseries et confiseries : </b><br>
<br>
- <b>Les boissons :</b> Les eaux min&eacute;rales avec Volvic et Vichy<br> <br> 
<br><br>
<a name="enf"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Enfants du pays</font><font size=1 face="helvetica"> ( <A HREF="#geo">G&eacute;ographie</font></a> <font size=1 face="helvetica"> - <A HREF="#eco">Economie</font></a><font size=1 face="helvetica"> - <A HREF="#his">Histoire</font></a><font size=1 face="helvetica"> - <A HREF="#pro">Produits locaux</a>)</font></STRONG><BR>
</font>

<br>
Vercing&eacute;torix, Blaise Pascal, Lafayette, Fernand Reynaud, Richard Bohringer, Maurice Pialat, Paul Doumer, Georges Pompidou, Val&eacute;rie Giscard d'Estaing, Fernand Forest, Jules Romain, Rapha&euml;l G&eacute;miniani, Antonin Magne, Dani&egrave;le Gilbert etc...<br>
<br><br>
<A HREF="#a"<font color="#FF0000">haut de page</font> </A>
<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>
</body>
</html>

