@DATABASE opium.newmail.ru:666/7s.htm
@WORDWRAP

@NODE MAIN
@TITLE " Ave Satanas..."
 
   @{" " link "6s.guide/MAIN"}@{"../pau.gif" link "../pau.gif/MAIN"}
Назад    Черная Библия "Книга Люцифера
 (Воздух)"    @{" " link "8s.guide/MAIN"}@{"../pau0.gif" link "../pau0.gif/MAIN"}
Дальше 

Некоторые признаки новой сатанинской эры. 

&nbsp;Христианская вера определяет семь смертных грехов: жадность, гордыня, зависть, гнев, обжорство, вожделение и леность. Сатанизм же выступает за потворство каждому из них, если это ведет к физическому, духовному и эмоциональному удовлетворению. 

&nbsp;Сатанист знает, что ничего предосудительного в жадности нет, поскольку жадность означает лишь то, что человек желает большего, чем он уже обладает. За завистью кроется пристрастное рассмотрение имущества других и желание иметь подобные вещи у себя. Зависть и жадность есть движущие силы амбиции, а без амбиции весьма немного чего-либо значимого может быть достигнуто. 

&nbsp;Обжорство - значит просто есть больше, чем нужно для поддержания жизни. Когда вы наедаетесь до ожирения, другой грех - гордыня, побудит вас сохранить наружность, а значит, и самоуважение. 

&nbsp;Любой, кто покупает одежду для целей иных, нежели прикрыть свое тело и предохранить его от стихии, виновен в гордыни. Сатанисты часто сталкиваются с насмешниками, которые утверждают, что можно обойтись без отличительных знаков принадлежности к вере. Следует указать этим уничтожителям ярлыков, что, по крайней мере, одна, а то и многие вещи, которые они сами носят, не совсем обязательно утепляют их. 

&nbsp;Нет на земле человека полностью лишенного украшений. 

&nbsp;Сатанист говорит, что любое украшение на теле насмешника указывает на то, что этот человек также повинен в гордыне. Независимо от того, сколь многословен может быть циник в интеллектуальных упражнениях описания своей свободы, он все же сам несет на себе признаки гордыни. Нежелание подниматься утром ведет к обвинению в лености, и, если лежать в постели достаточно долго, то можно найти себя совершающим еще один грех - вожделение. Испытывать малейшее шевеление сексуального желания - значит быть виновным в вожделении. Чтобы подстраховать процесс размножения человечества, природа сделала вожделение вторым по силе инстинктом после самосохранения. Осознавая это, христианская церковь, тем не менее, сделала блуд "первородным грехом". Таким образом, получается так, что никому не удается избежать греха. Ведь сам факт нашего существования есть результат греха - Первородного греха. 

&nbsp;Самый сильный инстинкт во всякой живой твари - инстинкт самосохранения, который приводит нас к последнему из семи смертных грехов - гневу. Разве не инстинкт самосохранения пробуждается когда кто-то наносит нам обиду, когда мы становимся достаточно разгневанными, чтобы защитить себя от дальнейших атак? Сатанист практикует принцип: "Если ударят тебя по одной щеке, сокруши обидчика своего в другую его щеку!" Не оставляйте ничего неудовлетворенным. Будьте львом на тропе, опасным даже в защите! 

&nbsp;Раз естественные инстинкты человека вводят его во грех, все люди есть грешники; а грешники попадают в ад. Если все мы попадем в ад, то встретим там своих друзей. Рай же должен быть населен весьма странными существами, коли все, для чего они вели праведную жизнь на земле. - это попасть в место, где они целую вечность могли бы бренчать на арфах. 

&nbsp;"Времена изменились. Религиозные лидеры более не проповедуют, что все наши естественные поступки греховны. Пожалуй, никто уже не считает, что секс грязен, или что гордиться собой постыдно, или что желать кого-то порочно". Конечно, нет, ведь времена изменились! "Если вы хотите доказательств тому, взгляните сколь вольны стали церкви. Они следуют за всеми новыми веяниями". 

&nbsp;Сатанисты слышат такие и подобные высказывания все время; и они всем сердцем соглашаются с ними, НО, если мир изменился так сильно, зачем продолжать цепляться за обрывки умирающей веры? Если многие религии отрицают свои же устаревшие писания и проповедуют философию Сатанизма, то почему не называть это подобающим именем - Сатанизмом? Без сомнения, это было бы куда менее ханжеским. 

&nbsp;В последние годы было немало попыток очеловечить духовную концепцию христианства. Они нашли свое отражение в самых насущных недуховных предметах. Мессы, читавшиеся ранее на латыни, произносятся теперь на родных языках - что, впрочем, приводит лишь к более легкому усвоению бессмыслицы, лишая в то же время церемонию ее эзотерической природы, согласующейся с догматическими принципами. Много проще достичь необходимой эмоциональной реакции, используя слова и фразы, недоступные пониманию, чем утверждения, которые даже самый немудреный разум подвергнет вопрошению хотя бы только из-за того, что они произнесены на родном языке. Если бы священники и попы использовали те уловки, которые они применяют сегодня, для того, чтобы заполнить свои церкви, сто лет назад, они были бы обвинены в ереси, названы дьяволами, подвергнуты гонениям, и, безо всякого сомнения, немедленно отлучены от церкви. 

&nbsp;Набожники воют: "Мы должны идти в ногу со временем", забывая о том, что в силу ограничивающих факторов и глубоко высеченных законов религий белого света они никогда не могут быть достаточно изменены, чтобы удовлетворить насущные нужды человека. 

&nbsp;Религии прошлого всегда представляли духовную природу человека, мало или вообще не уделяя внимания его плотским и мирским нуждам. Они воспринимали земную жизнь как нечто преходящее, а плоть - всего лишь оболочкой; физическое удовольствие -не имеющим значения, а боль - достойным приготовлением к "Царствию небесному". Как явственно крайнее лицемерие проступает наружу, когда "праведники" изменяют свою религию, чтобы поспеть за естественными изменениями человека! Единственный способ, коим христианство может полностью услужить человеческим нуждам - БЕЗ ПРОМЕДЛЕНИЯ стать Сатанизмом. 

&nbsp;Новой религии, основанной на естественных человеческих инстинктах, необхдимо уже выйти на сцену. ОНИ назвали ее. Имя ей - Сатанизм. Ведь именно эта осуждаемая сила вызвала религиозную полемику о мерах контроля рождаемости, и раздраженное признание, что сексуальной деятельности ради удовольствия есть место в жизни человека. 

&nbsp;Ведь это "Дьявол" заставил женщин открыть свои ноги, чтобы возбуждать мужчин - те самые ноги, которыми общество теперь позволяет любоваться; открывают ноги и юные монашки, фланирующие в своих укороченных рясах. Какой чудесный шаг в правом (или левом) направлении! Возможно ли, что в скором будущем мы сможем увидеть как монахини, обнажив груди, будут чувственно изгибать свои тела под "Missa Solemnis Rock"? Сатана улыбается и говорит, что ему бы это понравилось - ведь многие монашки - очень симпатичные девушки с чудесными ногами. Во многих церквях с одними из самых больших приходов исполняется теперь чувственная музыка, под которую прихожане хлопают в ладоши - и это также вдохновлено Сатаной. В конце концов, самые лучшие мелодии - у Дьявола. Церковные пикники, несмотря на разговоры тети Марты об Обильном Урожае Господнем, являются ничем иным, как хитрой отговоркой для воскресного обжорства; и ни для кого не является секретом, что в кустах происходят вещи поинтереснее, чем чтение Библии. 

&nbsp;Для многих церковных базаров характерным дополнением стало теперь мероприятие по сбору средств, широко известное как карнавал, который раньше считался празднеством плоти; ныне же, он не противоречит церковным заповедям, потому что деньги текут в церковь, дабы она могла совершать молитвы против дьявольского искушения! Да будет сказано, что все эти обычаи и церемонии - языческие, и христиане лишь заимствовали их. Язычники праздновали удовольствия плоти и были обвиняемы теми же людьми, которые теперь чуть ли не буквально следуют их же ритуалам, заменив лишь их названия. 

&nbsp;Попы и священники идут в первых рядах мирных демонстраций и ложатся на рельсы перед поездами, перевозящими военное снаряжение с тем же усердием, как их братья по духовному сану, выпускники тех же семинарий, в качестве капелланов благословляют пули, бомбы и воинов в вооруженных силах. Кто-то из них неправ. А может, Сатана должен быть обвинен в этом? Конечно же, они так и говорят. 

&nbsp;Когда щенок достигает зрелости, он становится собакой; когда лед тает, он становится водой; когда стали использоваться 12 месяцев, мы получили новый календарь с соответствующим названием; когда магия становится научным фактом, мы соотносимся с ней как с медициной, астрономией и т.д. Когда название не подходит более к данной вещи, весьма логично изменить его на новое, которое лучше отражает ее сущность. Тогда почему же мы не следуем этому правилу, когда дело касается религии? Зачем продолжать называть религию тем же названием, если принципы ее уже вышли за рамки ее изначальной сути? Или, если религия проповедует то же, что и всегда, но ее последователи не практикуют на деле ни одно из ее учений, зачем они все еще называют себя именем. данным последователям той религии? 

&nbsp;Если вы не верите тому, чему учит ваша религия, зачем продолжать поддерживать веру, противоречащую вашим чувствам? Вы никогда не проголосуете за человека или партию, которой вы не верите; так зачем же отдавать свой духовный голос за религию, не совместимую с вашими убеждениями? У вас нет права на недовольство политической ситуацией, за которую вы проголосовали или поддержали иным путем, - что включает в себя сидение и благодушное соглашение с соседями, которым эта ситуация по нраву; и все это потому, что вы слишком лживы и трусливы, чтобы высказать, что у вас на душе. То же самое и с религиозной баллотировкой. Даже если вы не можете быть агрессивно искренними в своих взглядах ввиду неблагоприятных последствий от работодателей, общественных деятелей и т.д., вы можете быть, по крайней мере, искренни с самим собой, В уединении своего дома, с близкими друзьями вы ДОЛЖНЫ поддержать религию, в сердце которой ВАШИ насущные интересы. 

&nbsp;"Сатанизм основан на здоровой философии", -говорит свободный в выборе человек, - "но почему бы не назвать это гуманизмом или названием колдовской группы, названием менее эзотеричным, каким-нибудь менее вульгарным?" На то существует масса причин. Гуманизм - не религия. Гуманизм есть просто образ жизни без церемоний и догм. У Сатанизма же есть и церемония и догма, которые, как будет объяснено далее, необходимы для религии. 

&nbsp;Сатанизм сильно отличается от других так называемых белосветных или "белых" колдовских и магических групп, существующих в настоящее время. Эти самоправедные и высокомерные "религии" торжественно заявляют, что их последователи используют магические силы только для альтруистических целей. Сатанисты с презрением смотрят на "белые" колдовские группы, осознавая, что альтруизм - это грех безынициативности. 

&nbsp;Неестественно не иметь желания получать для себя выгоду. Сатанизм представляет собой разновидность управляемого эгоизма. Это не значит, что вы никогда не делаете ничего ни для кого. Если вы делаете что-то для кого-нибудь, заботиться о ком доставляет вам счастье, его счастье доставит вам чувство удовлетворения. Сатанизм придерживается измененной формы Золотого Правила. Наша интерпретация его такова: "Воздай другим то, что воздали тебе они", потому что если "Воздаешь ты каждому, как воздали бы тебе они" а они, в ответ, относятся к вам плохо, самой человеческой природе противно продолжать относиться к ним с уважением. Вы могли бы воздать другим, как если бы воздали они вам, но если ваша обходительность не была возвращена, к ним следует относиться с заслуженной ими яростью. 

&nbsp;Белые волшебники говорят, что если наслать проклятие на человека, оно возвратится - троекратью усиленное, возвратится в ваш дом, либо вернется каким-либо путем к пославшему его. Это еще один пример философии вины, которой придерживаются эти неоязыческие псевдо-христианские группы. Белые колдуны желают углубиться в магию, но не могут расстаться с клеймом, выжженном на ней. Поэтому они и зовут себя белыми волшебниками и базируют 75% своей философии на избитых и затасканных постулатах христианства. Тот, кто притворяется, что магия или оккультизм интересуют его по причинам иным, нежели достижение личной власти, является худшим образчиком ханжества и лицемерия. Сатанист уважает христианство по крайней мере за то, что оно последовательно в своей философии комплекса вины, но может лишь презирать людей, пытающихся показать себя освобожденными от комплекса вины, вступая в колдовскую группу, чтобы затем практиковать в основном ту же философию, что и христианство. 

&nbsp;Обычно считается, что белая магия используется только для хороших и неэгоистических целей, а черная, втолковывают нам, - лишь для эгоцентричных, или "злых" дел. Сатанизм не проводит разделительной черты. Магия есть магия, будь она применена для помощи или для помехи. Сатанист, будучи волшебником, должен быть в силах решить сам. что справедливо, а затем приложить силы волшебства для достижения своей цели. 

&nbsp;В течение церемоний белой магии практикующие стоят внутри пентаграммы, чтобы защитить себя от "злых" сил, которые они вызывают для помощи. Для Сатаниста кажется немного двуличным: призывать эти силы, в то же самое время защищая себя от вызванных для содействия стихий. Сатанист осознает, что только заключив союз с этими силами, можно в полной мере и нелицемерно пользоваться Силами Тьмы для своей выгоды. 

&nbsp;В Сатанинской магической церемонии ее участники НЕ: смыкают рук и не водят хороводов; не жгут свечей разных цветов для исполнения соответствующих желаний; не называют имен Отца, Сына и Святого Духа во время занятий Черным Искусством; не выбирают "Святого" персонального проводника для получения помощи в решении своих проблем; не вымачивают себя в пахучих маслах, тешась надеждой, что к ним прилипнут деньги; не медитируют для достижения "великого духовного пробуждения"; не читают длинных заклинаний, обильно сдобренных после каждого слова именем Иисуса и т.д. и т.п. ad nauseam! (Ad nauseam (лат.) - пока не затошнит (прим. перев.)) 

&nbsp;ПОТОМУ ЧТО - это НЕ способ практиковать Сатанинскую магию. Пока вы не освободите себя от лицемерного самообмана, вам никогда не стать преуспевающим волшебником, а тем более - Сатанистом. 

&nbsp;Сатанинская религия не только приподняла монету, она еще и полностью перевернула ее. Следовательно, зачем ей поддерживать принципы, которым она противоречит; называя себя чем угодно, но неназванным, которое неразрывно связано с обращенными доктринами, составляющими Сатанинскую философию, Сатанизм - это не религия белого света; это религия плотская, мирская, телесная - все, чем правит Сатана, есть олицетворение Левого Пути. Неизбежно возникает следующий вопрос: "Допустим, нельзя называть это гуманизмом, поскольку гуманизм - не религия, но зачем же тогда выдвигать на первое место религию, если все, что вы делаете, в конце концов, естественно? Не проще ли просто делать это?"< 

&nbsp;Современный человек прошел долгий путь; он расколдован от бессмысленных догм религий прошлого. Мы живем в эпоху просвещения. Психиатрия сделала огромные шаги в направлении понимания человеком своей подлинной сути. Мы живем в эру интеллектуального осознания, какой еще не видел мир. 

&nbsp;При всей нужности и полезности этого процесса есть один изъян в новом состоянии сознания. Одно дело - принимать что-либо разумом, другое дело - эмоционально. Один из вопросов, еще не освещенных психиатрией - врожденная потребность человека излить свои эмоции через догму. Человеку нужна церемония н ритуал, фантазия и волшебство. Психиатрия, несмотря на всю принесенную ей пользу, украла у человека чудо и фантазию, которых ему предоставляли п прошлом религия. 

&nbsp;Сатанизм, принимая во внимание текущие потребности человека, заполняет большую серую пустоту между религией и психиатрией. Сатанинская философия сочетает фундаментальные основы психологии и хорошее, искреннее чувствоизлияние или догму. Она предоставляет человеку столь необходимую ему фантазию. Нет ничего плохого в догме, основанной на идеях и действиях, не противоречащих человеческой природе. 

&nbsp;Кратчайший путь между двумя точками - прямая линия. Если все накопленные грехи могут быть обращены в выгоду, это освобождает от нужды интеллектуального очищения души в попытке отмыть ее от сдерживающих факторов. Сатанизм - единственная известная миру религия, принимающая человека таким, каким он есть на самом деле, и предлагает логическое обоснование превращения плохого в хорошее вместо того,чтобы исхитряться уничтожать плохое. 

&nbsp;Таким образом, если после мысленной оценки ваших проблем с помощью того, чему психиатрия научила нас, вы все еще не в состоянии освободиться от недозволенности греха и применить эту теорию на практике, значит, нужно научиться заставлять этот грех работать на себя. Вы должны поступать в согласии с естественными инстинктами, и затем, если вы все еще не можете делать этого, не продолжая чувствовать вину, то проявитесь в ней. Это может звучать противоречиво на словах, но если поразмыслить над этим, то можно прийти к выводу, что вина зачастую может добавить стимул чувствам. Взрослым неплохо было бы поучиться кое-чему у детей, которые часто находят огромное удовольствие, делая то, что, как им известно, они не должны делать. 

&nbsp;Да, изменились времена, но не человек. Начальные понятия Сатанизма существовали всегда. Единственное, что есть нового - формальная организация религии, основанной на общих характерных чертах человека. Веками величественные постройки из камня, извести и стали были посвящаемы человеческому воздержанию. Настала пора, когда человеческие существа должны перестать бороться сами с собой н посвятить время постройке храмов для людских вольностей. 

&nbsp;Несмотря на то, что времена меняются и будут меняться всегда, человек в основе своей остается тем же. Два тысячелетия он нес наказание за то, в чем он не должен был быть обвинен вообще. Мы устали от недостатка заслуженных нами удовольствий жизни. Сегодня, как и всегда, человеку нужно насладиться здесь и сейчас, вместо того, чтобы ждать получения своих наград в раю. Так почему бы нам не заиметь религию, основанную на вольности? Несомненно, она согласуется с природой зверя. Мы более не немощные просители, трепещущие пред беспощадным "Богом", которому по большому счету плевать живы мы или мертвы. Мы - гордые, уважающие себя люди, мы - Сатанисты! @{"bp.gif" link "bp.gif/MAIN"}
 ---

 ---

 ---

 ---

 ---

@endnode
