 <html>

 <head>
 <title>MorphOS : l'OS &eacute;clair</title>
 </head>

 <body bgcolor="#ffffff" text="#000000">

 <p>
 <a name="Title"></a>
 <center>
 <font face="Arial, Helvetica, sans-serif" size="6"><b>MorphOS : l'OS &eacute;clair</b></font><br>
 </center>
 </p><p>

 <a name="Introduction">&nbsp;<br></a>

 <b>Qu'est-ce que MorphOS ?</b>
 </p><p>
 Je pense que ce sera la question qui reviendra le plus souvent parmi tous
les lecteurs de cet article. Il est probable que vous n'ayez encore jamais
entendu parler de ce nom auparavant... Par contre, il y a plus de chance
que vous ayez entendu parler d'un autre nom : l'Amiga. Cette introduction
sous-entend que MorphOS est actuellement un clone  am&eacute;lior&eacute; de l'AmigaOS
(La section <a href="#Appendix3">Notes Historiques</a> explore
les d&eacute;tails de cette parent&eacute;e).
 </p><p>
 <a href="morphos2jpg.html" title="MorphOS en action 2" target="_top"><img src="MorphOS2_tn.jpg" alt="MorphOS en action 2" align="right" border="1" hspace="5" vspace="5"></a>
 <a href="morphos1jpg.html" title="MorphOS en action 1" target="_top"><img src="MorphOS1_tn.jpg" alt="MorphOS en action 1" align="right" border="1" hspace="5" vspace="5"></a>
 Bien qu'un clone fonctionnel du syst&egrave;me d'exploitation de l'Amiga soit une exp&eacute;rience 
 int&eacute;ressante, le vrai potentiel de MorphOS se trouve 
dans sa capacit&eacute; &agrave; donner acc&egrave;s &agrave; des caract&eacute;ristiques plus avanc&eacute;es 
que l'on ne retrouvaient pas dans AmigaOS.  
Ces avanc&eacute;es sont rendu possible parce que MorphOS est construit autour d'un micronoyau tr&egrave;s flexible,
 puissant, et compact appel&eacute; <i>Quark</i>.
Sa structure est totalement ind&eacute;pendante et n'a aucun rapport avec les noyaux Amiga et Linux.
 </p><p>
 L'une des caract&eacute;ristique distinctive de MorphOS est qu'il est <em>« tr&egrave;s l&eacute;ger »</em>. 
Une installation compl&egrave;te de l'OS n&eacute;cessite moins de 20 m&eacute;ga-octets. 
Et moins de la moiti&eacute;, si on d&eacute;sire optimiser l'environnement...  
en enlevant les parties inutilis&eacute;es et/ou non essentielles de l'OS. 
Une des autres caract&eacute;ristiques distinctives de MorphOS est sa vitesse. On ne le certifie pas en tant
qu'OS en temps r&eacute; (Real Time Operating System: Syst&egrave;me d'exploitation en temps r&eacute;el).
Mais si vous l'utilisez sur sa machine de pr&eacute;dilection, vous verrez que 
les temps de r&eacute;ponse sont tr&egrave;s proches de traitements en temps r&eacute;el.
 </p><p>

 <a name="Section1">&nbsp;<br></a>

 <b>Plateforme mat&eacute;rielle</b>
 </p>
 <p>
 MorphOS fonctionne exclusivement sur des processeurs  PowerPC. 
Deux plateformes mat&eacute;rielles sp&eacute;cifiques sont actuellement support&eacute;es : 
les cartes acc&eacute;l&eacute;ratrices PowerPC pour les micro-ordinateurs Amiga classiques (d&eacute;velopp&eacute;s par Phase5 et connus 
sous le nom de CyberStorm et Blizzard) et les cartes m&egrave;res <a href="http://www.pegasosppc.com/pegasos.php">PegasosPPC</a>
(distribu&eacute;es par <a href="http://www.genesippc.com/">Genesi</a> et &eacute;galement utilis&eacute;es dans un ordinateur compact 
complet appel&eacute; <a href="http://www.pegasosppc.com/odw.php">ODW</a>, Open Desktop Workstation).
Les cartes PegasosPPC sont initialis&eacute;es par le firmware HAL/OF (Hardware Abstraction Layer /
Open Firmware), un logiciel ressemblant au BIOS, cr&eacute;&eacute; et maintenu par Genesi pour ses produits bas&eacute;s sur l'architecture PowerPC 
(et disponible sous licence pour chaque concepteur/fabricant de produits bas&eacute;s sur les PowerPC).
Potentiellement, MorphOS peut fonctionner avec des changements mineurs sur n'importe quelle carte PowerPC initialis&eacute;e par HAL/OF: on sait par exemple, que cet OS fonctionne d&eacute;j&agrave; sur les cartes-m&egrave;res 
<a href="http://www.pegasosppc.com/efika.php">EFIKA
5K2</a>. </p>
 <p>
 MorphOS est un syst&egrave;me d'exploitation propri&eacute;taire &agrave; l'exception de quelques parties qui sont Open Source. 
Il est actuellement disponible gratuitement pour les propri&eacute;taires du mat&eacute;riel Amiga/Pegasos mentionn&eacute; ci-dessus. 
Apr&egrave;s un enregistrement en ligne, les propri&eacute;taires peuvent se connecter &agrave; un site ftp  où il est possible de t&eacute;l&eacute;charger
une image ISO &agrave; graver pour obtenir un CD d'initialisation (bootable) de MorphOS. En outre, les diff&eacute;rentes mises &agrave; jour logicielles sont disponibles sur le site ftp. </p>
 <p>

 <a name="Section2">&nbsp;<br></a>

 <b>Installation</b>
 </p>
 <p>
 L'installation de la plupart des syst&egrave;mes  d'exploitation est habituellement 
une  op&eacute;ration longue, et peut parfois devenir un v&eacute;ritable cauchemar si vous n'&ecirc;tes pas chanceux ou un peu experiment&eacute;. 
Un OS<em> besoin de peu de ressources </em> comme MorphOS montre ses avantages m&ecirc;me dans la phase d'installation, en termes de temps 
et de simplicit&eacute;. </p>
 <p>
 Inserez le CD d'initialisation de MorphOS dans votre lecteur de CD/DVD et s&eacute;lectionnez-le en tant que p&eacute;riph&eacute;rique de d&eacute;marrage 
dans HAL/OF. MorphOS se lance directement &agrave; partir du CD dans une configuration par d&eacute;faut 
avec des besoins en mat&eacute;riel  minimum.
Ce qui prend moins d'une minute! 
Maintenant, vous allez devoir employer l'utilitaire de partitionnement de l'OS
pour cr&eacute;er au moins une partition d'initialisation (de boot) sur votre disque dur, 
et l'utilitaire de formatage pour pr&eacute;parer cette partition. 
Vous pourrez alors lancer le script d'installation qui installera  MorphOS sur cette derni&egrave;re
(le script contr&ocirc;le un certain nombre de circonstances et de cas sp&eacute;ciaux, mais fondamentalement 
il copie, du CD vers le disque dur, tous les dossiers et fichiers syst&egrave;me, avec leurs fichiers de configuration par d&eacute;faut). </p>
 <p>
 Maintenant, vous devez &eacute;jecter et enlever le CD d'initialisation de MorphOS de votre lecteur CD/DVD, 
et red&eacute;marrer le Pegasos/ODW (en appuyant sur le bouton de reset ou avec la combinaison principale CTRL-WIN-WIN e.g. CRTL-Amiga-Amiga). 
Apr&egrave;s quelques secondes vous revenez &agrave; l'&eacute;cran HAL/OF, où vous allez placer une variable d'environnement 
qui m&eacute;morisera l'emplacement de votre partition de boot.
 </p>
 <p>
 C'est fini! <span id="q_1104e75be3f7ba03_3">(Sur de vieille version du firmware HAL/OF, l'utilisateur devra
 effectuer des actions l&eacute;g&egrave;rement plus complexes, mais les
 nouveaux venus ne pourront qu'obtenir les nouvelles versions).<br>
 </span> </p>
 <p>
 Temps total requis pour toutes les op&eacute;rations pr&eacute;c&eacute;dentes : pas plus de 5 minutes ! Mais vous aurez une autre surprise : 
d&eacute;marrez MorphOS &agrave; partir de votre disque dur et comptez le temps qui lui est n&eacute;cessaire pour initialiser l'environnement complet de l'OS. 
Vous constaterez que celui-ci se charge en moins de cinq secondes: bienvenue sur l'OS &eacute;clair !
 </p>
 <p>

 <a name="Section3">&nbsp;<br></a>

 <b>Caract&eacute;ristiques de MorphOS</b>
 </p>
 <p>
 Le noyau de MorphOS est compress&eacute; et stock&eacute; &agrave; l'int&eacute;rieur du fichier <i>boot.img</i> 
qui doit r&eacute;sider sur un support de stockage accessible par le HAL/OF. 
Ce fichier est charg&eacute; par  HAL/OF et d&eacute;marre le micronoyau <i>Quark</i>, 
ainsi qu'un certain nombre d'autres composants bas niveau  n&eacute;cessaire &agrave; l'OS. 
Le reste de l'OS est compos&eacute; de fichiers, se trouvant sur le disque dur, qui 
sont lanc&eacute;s &agrave; partir de cette couche logiciel. </p>
 <p>
 L'Amiga &eacute;tait caract&eacute;ris&eacute; par les possibilit&eacute;s bas niveau  que fournissait son micronoyau, 
<i>Exec</i>, comme le traitement multit&acirc;che pr&eacute;emptif, la communication interprocessus, etc., 
qui &eacute;taient absents sur tous les  autres micro-ordinateurs populaires des ann&eacute;es 80 
(les micro-ordinateurs Macs, PCs, Atari, etc...). 
Naturellement dans MorphOS, toutes ces caract&eacute;ristiques sont fournis par <i>Quark</i>, 
qui peut &eacute;galement supporter des caract&eacute;ristiques plus modernes comme la protection de m&eacute;moire,
la m&eacute;moire virtuelle, et bien plus encore. 
<i>Quark</i> peut &eacute;galement fournir un certain nombre de &quot;boxes&quot; (syst&egrave;mes d'exploitation virtuels) qui
peuvent &ecirc;tre lanc&eacute;s ind&eacute;pendamment. 
Actuellement, deux &quot;boxes&quot; sont impl&eacute;ment&eacute;s : la <i>QBox</i>, 
qui  pour le moment est uniquement employ&eacute;e pour des processus bas niveau, 
et l'<i>ABox</i>, qui fournit une API sp&eacute;ciale pour les programmes et les applications. 
En effet, cette API est enti&egrave;rement compatible avec AmigaOS 3.1 
(le dernier syst&egrave;me d'exploitation cr&eacute;&eacute; et distribu&eacute; par  Commodore pour ses ordinateurs Amiga Classiques). 
Elle fournit &eacute;galement <i>Trance</i> (un puissant compilateur temps r&eacute;el pour les ex&eacute;cutables Amiga), ce qui  garantit un degr&eacute; &eacute;lev&eacute; de ompatibilit&eacute; 
pour un grand nombre d'applications Amiga. 
Les op&eacute;rations complexes ex&eacute;cut&eacute;es par <i>Trance</i> sont instantan&eacute;es et transparentes pour l'utilisateur:
<i>Trance</i> d&eacute;tecte automatiquement n'importe quel ex&eacute;cutable Amiga lanc&eacute;, 
le convertit en ex&eacute;cutable PowerPC, et le lance dans la foul&eacute;e. </p>
 <p>
<a name="superfrog"</a>

 <a href="UAE_SuperFrogpng.html" title="Jouer &agrave; des jeux avec UAE" target="_top"><img src="UAE_SuperFrog_tn.jpg" alt="Jouer &agrave; des jeux avec UAE" align="left" border="1" hspace="5" vspace="5"></a>
 <a href="UAE_Workbenchpng.html" title="Workbench sous UAE" target="_top"><img src="UAE_Workbench_tn.jpg" alt="Workbench sous UAE" align="left" border="1" hspace="5" vspace="5"></a>
 Notez que le nombre &eacute;norme d'excellents jeux, qui ont rendu  c&eacute;l&egrave;bre l'Amiga vers la fin des ann&eacute;es 80 
et au d&eacute;but des ann&eacute;es 90, ne peuvent pas se lancer directement dans l'environnement de MorphOS. 
Les micro-ordinateurs Amiga &eacute;taient &eacute;quip&eacute;s de circuits int&eacute;gr&eacute;s graphiques et sonores propri&eacute;taires. 
Leurs op&eacute;rations sont totalement incompatibles avec un syst&egrave;me moderne comme MorphOS, 
qui peut contr&ocirc;ler les cartes graphiques 2D/3D actuelles et les cartes sons PCI ou le syst&egrave;me audio pr&eacute;sent sur la carte m&egrave;re. 
Si vous voulez jouer &agrave; de vieux jeux sur un Pegasos/ODW,  
c'est bien s&ucirc;r possible, mais pour cela, il vous faudra utiliser <i>UAE</i> (Universal Amiga Emulator: l'&eacute;mulateur universel Amiga), 
qui est &eacute;galement disponible pour MorphOS et qui fournit la compatibilit&eacute; n&eacute;cessaire. </p>
 <p>
 La compatibilit&eacute; native de MorphOS avec les anciens logiciels Amiga &agrave; une cible diff&eacute;rente.
Les utilisateurs peuvent lancer presque toutes les applications Amiga les plus r&eacute;centes et les plus avanc&eacute;es sachant contr&ocirc;ler les cartes graphiques et audios additionnelles (cr&eacute;&eacute;es pour les derniers ordinateurs Amiga Classiques). 
Les couches logiciels appropri&eacute;es , connues sous le nom de <i>CGX</i> (CyberGraphX) et <i>AHI</i> 
(Audio Hardware Interface : interface mat&eacute;riel audio) sont parfaitement int&eacute;gr&eacute;es dans MorphOS, ce qui permet une gestion transparente
de ces cartes aditionnelles. </p>
<a name="mui"</a>
 <p>
 <a href="ShowGirlsjpg.html" title="ShowGirls et MUI Preferences" target="_top"><img src="ShowGirls_tn.jpg" alt="ShowGirls et MUI Preferences" align="right" border="1" hspace="5" vspace="5"></a>
 <a href="muiprefspng.html" title="Pr&eacute;f&eacute;rences MUI" target="_top"><img src="MUIPrefs.png" alt="Pr&eacute;f&eacute;rences MUI" align="right" border="1" height="128" hspace="5" vspace="5" width="160"></a>
 <a href="AboutMUIpng.html" title="Informations MUI"><img src="AboutMUI.png" alt="Informations MUI" align="right" border="1" height="128" hspace="5" vspace="5" width="160"></a>
 Comme AmigaOS, MorphOS poss&egrave;de deux interfaces int&eacute;gr&eacute;es compactes, efficaces et  int&eacute;gr&eacute;es
(une Interface de Commande en Ligne &quot;CLI&quot; et Interface Graphique Utilisateur &quot;GUI&quot;) 
pour le shell et les applications. Bien que ce syst&egrave;me « incorpor&eacute; » de CLI/GUI &quot;int&eacute;gr&eacute;&quot; permette d'obtenir facilement le travail
souhait&eacute;, beaucoup pr&eacute;f&egrave;rent les caract&eacute;ristiques plus avanc&eacute;s et l'aspect plus plaisant d'une GUI (Interface Graphique Utilisateur). 
Pour r&eacute;pondre &agrave; cette exigence, MorphOS a adopt&eacute; <em>MUI
(Magic User Interface), </em>une GUI plus orient&eacute;e vers la programmation objet. <i>MUI</i> fournit non seulement au programmeur des interactions plus sophistiqu&eacute;es sur la repr&eacute;sentation d'une GUI, mais permet &eacute;galement aux utilisateurs de param&eacute;trer enti&egrave;rement ces GUIs selon leurs besoins et  leurs goûts personnels. 
En fait, <i>MUI</i> est l'un des composants de MorphOS les plus distinctifs,
en termes de fonctionnalit&eacute;s et d'esth&eacute;tique. </p>
 <p>
<a name="shell"</a>
 <a href="Shellpng.html" title="Le shell MorphOS"><img src="Shell.png" alt="Le shell MorphOS" align="left" border="1" height="128" hspace="5" vspace="5" width="160"></a>
 Le shell de MorphOS est un shell comparable &agrave; celui d'Unix, dot&eacute; de toutes les caract&eacute;ristiques que vous attendez
d'un tel composant : commandes AmigaDOS (la plupart semblable &agrave; Unix), variables locales et globales, 
substitution de commande,  redirection de commande, pipes nomm&eacute;s et anonymes, historique, menus programmables,
shells multiples dans une fen&ecirc;tre, compatibilit&eacute; avec la norme ANSI, s&eacute;lection des couleurs, etc.... 
Naturellement l'ensemble des commandes incluses permet la r&eacute;alisation de scripts. 
En conclusion : les adeptes de la ligne de commande ne seront pas d&eacute;&ccedil;us. </p>
 <p>
 <a href="MorphOS0jpg.html" title="Le bureau MorphOS" target="_top"><img src="MorphOS0_tn.jpg" alt="Le bureau MorphOS" align="right" border="1" hspace="5" vspace="5"></a>
 <a href="MainPrefspng.html" title="Les pr&eacute;f&eacute;rences g&eacute;n&eacute;rales"><img src="MainPrefs.png" alt="Les pr&eacute;f&eacute;rences g&eacute;n&eacute;rales" align="right" border="1" height="128" hspace="5" vspace="5" width="160"></a>
 <a href="AmbientSettingspng.html" title="Les r&eacute;glages d'Ambient"><img src="AmbientSettings.png" alt="Les r&eacute;glages d'Ambient" align="right" border="1" height="128" hspace="5" vspace="5" width="160"></a>
 <i>Ambient</i> est bas&eacute; sur <i>MUI</i>, totalement asynchrone et multi-thread, c'est le 
bureau natif de MorphOS. Bien qu'Open Source, dans la pratique <i>Ambient</i> est un composant disponible exclusivement pour MorphOS, 
parce qu'il est tellement li&eacute; &agrave; <i>MUI</i> et au reste de l'OS que sa conversion  sur un autre environnement serait tr&egrave;s difficile.
<i>Ambient</i> fournit un programme de gestion des ic&ocirc;nes,
un explorateur de r&eacute;pertoires, de lancement de programmes, de manipulation des fichiers, et tout ce qui est n&eacute;cessaire pour contr&ocirc;ler le syst&egrave;me.
<i>Ambient</i> s'adapte aux goûts de l'utilisateur : 
la gestion des fichiers peut &ecirc;tre r&eacute;alis&eacute;e selon un mode classique (spatial) ou en mode navigateur,
en utilisant une vue par ic&ocirc;nes ou  par liste. La reconnaissance des types de fichiers est r&eacute;alis&eacute;e au moyen d'analyse directe des fichiers et /ou mimetype, mais les utilisateurs ont un contr&ocirc;le total et des possibilit&eacute;s d'&eacute;dition sur les mimetypes pour obtenir une configuration personnalis&eacute;e des  actions li&eacute;es &agrave; ces derniers.
<i>Ambient</i> permet &agrave; l'utilisateur d'ex&eacute;cuter facilement tout type d'activit&eacute; avec les outils incorpor&eacute;s: utilitaire de recherche de fichiers,
visualiseur de texte, visualiseur d'images, lecteur audio,
moniteur syst&egrave;me, utilitaire de formatage de disque, utilitaire de gestion des commodit&eacute;s,
et bien plus encore. A partir des menus d'<i>Ambient</i>, les utilisateurs peuvent contr&ocirc;ler tous les param&egrave;tres de leur environnement MorphOS, 
incluant les param&egrave;tres de <i>MUI</i> et du bureau lui-m&ecirc;me. </p>
 <p>
 Laissez-moi  mentionner en passant que les utilisateurs ne sont pas oblig&eacute;s d'utiliser <i>Ambient</i>. 
D'autres environnements de bureau communs &agrave; l'univers Amiga peuvent &ecirc;tre lanc&eacute;s en m&ecirc;me temps 
ou peuvent se substituer compl&egrave;tement &agrave; <i>Ambient</i>, comme par exemple :
<i>Directory Opus</i> (&eacute;galement  disponible pour les utilisateurs PC comme un substitut &agrave; Windows 
<i>Explorer</i>), <i>Scalos</i>, et m&ecirc;me le <i>Workbench</i> des Amiga Classiques
(mais ceci est r&eacute;serv&eacute; aux utilisateurs passionn&eacute;s de &quot;hacking&quot;). </p>
 <p>
 Les composants de l'OS que nous venons d'aborder sont ceux que l'utilisateur voit et utilise tout le temps : leur impact visuel
et leur manipulation simple ont une grande influence sur l'opinion que s'en font les utilisateurs.
Les utilisateurs d'<i>Ambient</i>, par exemple, peuvent choisir des skins diff&eacute;rents, 
changeant &agrave; la vol&eacute;e l'aspect g&eacute;n&eacute;ral de toutes les fen&ecirc;tres, gadgets, et autres &eacute;l&eacute;ments graphiques du bureau 
(diff&eacute;rentes skins sont visibles sur les images accompagnant ce texte). 
De plus, d'autres logiciels syst&egrave;mes se lancent de fa&ccedil;on invisible et silencieuse, ce qui ne les emp&ecirc;chent pas d'&ecirc;tre  &eacute;galement importants puisque sans eux l'ordinateur serait inutilisable. 
Parmi les exemples que l'on peut citer, il y a les syst&egrave;mes de fichiers (filesystems), la gestion de l'USB, les logiciels d'impression,
les syst&egrave;mes de scripting avanc&eacute;s, etc... Bien sûr tous ces composants sont pr&eacute;sents
dans MorphOS, mais seules de courtes descriptions sont donn&eacute;es ici, la plupart du temps concernant les caract&eacute;ristiques sp&eacute;ciales  s'ajoutant
&agrave;  celles que les utilisateurs emploient automatiquement dans ces logiciels. </p>
 <p>
 Les syst&egrave;mes de fichiers pour les disques durs sont des composants tr&egrave;s importants devant prendre le plus grand soin de donn&eacute;es pr&eacute;cieuses.
MorphOS est fourni avec une implementation de <i>FFS</i>,
le syst&egrave;me de fichiers standard et rapide de l'Amiga,  pr&eacute;sent le plus souvent pour des raisons de compatibilit&eacute;s.
<i>SFS</i> (Smart File System) est un syst&egrave;me de fichiers beaucoup plus rapide et plus fiable, il conserve la trace dles derni&egrave;res actions de
copie/d&eacute;placement/effacement avant que celles-ci soient appliqu&eacute;es.
En d'autres termes, c'est un syst&egrave;me de fichiers  journalis&eacute; garantissant l'int&eacute;grit&eacute; des donn&eacute;es m&ecirc;me en cas de plantage de l'ordinateur durant
des op&eacute;rations d'&eacute;criture sur le disque dur.
<i>SFS</i> est le syst&egrave;me de fichiers par d&eacute;faut de MorphOS, mais MorphOS supporte &eacute;galement d'autres  syst&egrave;mes de fichiers
comme l'impressionnant <i>PFS</i> (Professional File System) disponible commercialement pour les ordinateurs Amiga,
et m&ecirc;me l'omnipr&eacute;sent <i>FAT</i> (File Allocation Table) issu des environnements MS-DOS.
Des utilitaires de r&eacute;cup&eacute;ration sont disponibles pour <i>PFS</i> et
<i>SFS</i> (<i>SFSDoctor</i> est un utilitaire   cr&eacute;&eacute; r&eacute;cemment  et disponible uniquement pour MorphOS).
Ils effectuent des op&eacute;rations comme la r&eacute;cup&eacute;ration de donn&eacute;es effac&eacute;es, la r&eacute;paration de la structure des syst&egrave;mes de fichiers,
et m&ecirc;me la r&eacute;organisation des donn&eacute;es pour diminuer la fragmentation (ou d&eacute;fragmentation). Les utilisateurs de Windows et Linux
seront heureux d'apprendre qu'il est &eacute;galement possible de travailler avec des partitions <i>NTFS</i>
et <i>EXT2FS</i> au moyen de version pr&eacute;liminaires gratuites de ces syst&egrave;mes de fichiers. </p>
 <p>
 La pile USB de MorphOS est nomm&eacute;e <i>Poseidon</i> est probablement la pile USB la plus efficace  sur une plateforme informatique.
La meilleure description de ces caract&eacute;ristiques est certainement donn&eacute;e par son auteur (Chris Hodges), dont les mots sont rapport&eacute;s dans les lignes suivantes : 
 "<i>Poseidon</i> est une solution logicielle qui d&eacute;montre les possibilit&eacute;s de l'Universal Serial Bus (USB) et des dispositifs
avec interface USB, allant des souris, claviers, tablettes graphiques, joysticks, imprimantes, scanners, webcams,
digicams, lecteurs de cartes flash, lecteurs zip, lecteurs de disquettes, disques durs,
cartes m&eacute;moires, adaptateurs &eacute;thernet, adaptateurs scanners et audio aux choses moins communes comme les boitiers d'alimentations, les GPS ou
les lecteurs d'empreintes digitales.
Poseidon a une conception modulaire s'adaptant parfaitement &agrave; l'environnement AmigaOS/MorphOS.
Ce n'est pas la conversion d'un syst&egrave;me existant (comme la pile USB Linux),
Poseidon a &eacute;t&eacute; cr&eacute;&eacute; en gardant &agrave; l'esprit les caract&eacute;ristiques uniques des AmigaOS/MorphOS, rendant ces syst&egrave;mes d'exploitations si efficaces."<br>
 Laissez moi ajouter que <i>Poseidon</i> essaie toujours de faire son travail d'une mani&egrave;re compl&egrave;tement automatique,
mais au cas où l'utilisateur aurait besoin de le personnaliser pour un dispositif USB sp&eacute;cifique,
Poseidon r&eacute;v&egrave;le alors ses incroyables possibilit&eacute;s de configuration permettant &agrave; l'utilisateur de r&eacute;soudre presque n'importe quel probl&egrave;me.
 </p>
 <p>
 Le syst&egrave;me d'impression adopt&eacute;e par MorphOS est <i>TurboPrint</i>, un logiciel commercial &eacute;galement distribu&eacute; dans le monde Linux.
Il permet le contr&ocirc;le total de l'imprimante et de ses couleurs (s'il y en a), et  fonctionne de mani&egrave;re transparente pour toutes les applications. La version de 
<i>TurboPrint</i> int&eacute;gr&eacute;e dans MorphOS requiert une mise &agrave; jour si l'utilisateur a besoin de pilotes pour des imprimantes r&eacute;centes. Mais le package de mise &agrave; jour est aussi int&eacute;ressant gr&acirc;ce &agrave; la pr&eacute;sence de quelques utilitaires d'impression  absents dans MorphOS. </p>
 <p>
 Le syst&egrave;me de scripts avanc&eacute;s qui caract&eacute;rise AmigaOS depuis la version 2.0 est 
<i>ARexx</i>, une impl&eacute;mentation de REXX, un langage de programmation interpr&eacute;t&eacute;, structur&eacute;, de haut niveau introduit par IBM. 
Sur  Amiga la plupart des applications importantes ont un port ARexx qui permet le contr&ocirc;le externe au moyen de scripts Arexx, ou m&ecirc;me au moyen de commandes Arexx provenant d'autres programmes. 
Dans certains cas, les utilisateurs avanc&eacute;s peuvent g&eacute;n&eacute;rer et contr&ocirc;ler des op&eacute;rations interactives parmi un nombre de programmes ind&eacute;pendants, mais 
aussi des activit&eacute;s totalement automatis&eacute;es par un seul programme, au moyen de proc&eacute;dures <i>ARexx</i> simples (dont l'utilisation et
la structure ont &eacute;t&eacute; enti&egrave;rement explor&eacute; durant des ann&eacute;es d'utilisation dans l'environnement Amiga). MorphOS
poss&egrave;de une impl&eacute;mentation native de ce langage (except&eacute; une biblioth&egrave;que qui est toujours en cours de codage, et qui doit &ecirc;tre r&eacute;cup&eacute;r&eacute;e par l'utilisateur sur son CD d'AmigaOS). </p>
 <p>

 <a name="Section4">&nbsp;<br></a>

 <b>Int&eacute;gration de MorphOS</b>
 </p>
 <p>
 Aujourd'hui, il y a un certain nombre d'applications dont les gens s'attendent &agrave; ce qu'elles fassent partie des composants standard d'un OS: un utilitaire d'installation 
pour les logiciels, un &eacute;diteur de texte, une pile TCP/IP, un lecteur de courrier et un navigateur. 
En utilisant MorphOS pendant quelques temps, vous noterez l'absence de ces programmes (dans sa distribution courante 1.4.5). 
Cependant, quelques recherches sur internet vous prouveront que presque aucun utilisateur  MorphOS (exception faite des nouveaux venus) ne se plaint
de l'absence de ces programmes. En fait, cette contradiction apparente est un  effet de l'histoire tourment&eacute;e de l'Amiga, 
et n'affecte pas MorphOS.
Laissez-moi consacrer quelques mots &agrave; ce sujet, pour vous montrez une vision
correcte avant que vous ne commenciez &agrave; penser, &agrave; tort, que MorphOS est un
OS inachev&eacute;.</p>
 <p>
 Sous sa forme actuelle, MorphOS est parfaitement adapt&eacute; &agrave; sa communaut&eacute; d'utilisateur courant, c.-&agrave;-d. un groupe d'utilisateurs inconditionnels de l'Amiga. 
De telles personnes, avec l'&eacute;volution rapide de l'&egrave;re de Wintel, ont fait face au probl&egrave;me li&eacute; &agrave; l'utilisation d'un OS qui n'&eacute;tait plus am&eacute;lior&eacute;.
En effet, dans les ann&eacute;es 90, apr&egrave;s la cessassion d'activit&eacute; de Commodore, les propri&eacute;taires de la marque ont gel&eacute; les d&eacute;veloppements de l'AmigaOS. 
Cet OS a surv&eacute;cu gr&acirc;ce &agrave; l'impulsion fournie par beaucoup de d&eacute;veloppeurs ind&eacute;pendants qui ont lentement permis d'ajouter presque n'importe quel type de caract&eacute;ristiques absentes.  La majeure partie de ces logiciels sont disponibles sur Aminet, un d&eacute;p&ocirc;t &eacute;norme de logiciels libres ou sharewares  Amiga, 
qui contient actuellement 76.000 logiciels. Ainsi, le principe de base pour les utilisateurs Amiga est: si   quelque chose manque, on le t&eacute;l&eacute;charge  sur
Aminet. Et, naturellement, cette r&egrave;gle se prolonge &agrave; tous les nouveaux-venus
sur MorphOS.
 </p>
 <p>
 <i>Morphos n'a pas d'utilitaire d'installation pour les applications courantes et anciennes.</i><br>
 Allez sur Aminet et t&eacute;l&eacute;chargez le programme '<i>Installer 43.3</i>. Naturellement, c'est un
fichier autonome &agrave; d&eacute;poser tout simplement dans un dossier strat&eacute;gique de votre
disque dur.
 </p>
 <p>
 <i>MorphOS n'a aucun &eacute;diteur de texte pour modifier les scripts de d&eacute;marrage et les textes.</i><br>
 Il y a une abondance d'&eacute;diteurs de texte sur<em> Aminet</em>. Vous pouvez y aller,  recherchez et t&eacute;l&eacute;chargez tout ce dont vous avez besoin.Vous trouverez &eacute;galement quelques &eacute;diteurs de textes d&eacute;j&agrave; convertis et compil&eacute;s en code natif PowerPC pour MorphOS.
 </p>
 <p>
 <i>MorphOS n'a pas de pile TCP/IP.</i><br>
 Allez sur Aminet et t&eacute;l&eacute;chargez <em>MOSNet</em>, qui est une pile TCP/IP compil&eacute;e en code natif PowerPC, et cr&eacute;&eacute;e pour MorphOS.
 </p>
 <p>
 <i>MorphOS n'a aucun lecteur de courrier.</i><br>
 Les deux lecteurs de courriers les plus diffus&eacute;s sur Amiga sont Open Source. Vous pouvez t&eacute;l&eacute;charger
<i>YAM</i> ou <i>SimpleMail</i> sur SourceForge ou sur leurs pages d'accueil. 
Il existe aussi des versions cr&eacute;&eacute;es en code natif PowerPC pour MorphOS.
 </p>
 <p>
 <i>MorphOS n'a aucun navigateur.</i><br>
 Le code source d'<i>AWeb</i>, autrefois un navigateur commercial, a &eacute;t&eacute; donn&eacute; par l'auteur &agrave; la communaut&eacute; Amiga au d&eacute;but du nouveau mill&eacute;naire.
Toutes les mises &agrave; jour pour ce navigateur (cr&eacute;&eacute; par l'&eacute;quipe  de d&eacute;veloppement actuelle sont disponibles &agrave; la page d'accueil d'<i>AWeb</i>, 
m&ecirc;me dans une version native  MorphOS).
 </p>
 <p>
 (Veuillez noter svp que toutes les applications pr&eacute;c&eacute;dentes sont des logiciels Open Source, hormis  l'<em>installateur 43.3</em> qui est librement distribuable.
Leur utilisation ne compromet en aucune fa&ccedil;on les droit de
propri&eacute;t&eacute; de MorphOS et les logiciels &eacute;crits/distribu&eacute;s par les d&eacute;veloppeurs
et/ou les firmes de logiciels ind&eacute;pendants pour des buts commerciaux.)
 </p>
 <p>
 <i>MorphOS a une documentation tr&egrave;s minimale.</i><br>
 En raison de la compatibilit&eacute; de l'API, la documentation de l'AmigaOS 3.1 couvre 75% de toutes les questions possibles. 
Cependant, MorphOS n'est pas un simple clone de l'AmigaOS: il incarned&eacute;j&agrave; un grand nombre de perfectionnements, 
dont la majeure partie n'est pas imm&eacute;diatement visible par l'utilisateur novice. 
Ici la communaut&eacute; a encore offert son aide avec la cr&eacute;ation du <a href="http://lelivredupegasos.wikipeg.org/">livre du Pegasos</a> (<a href="http://thepegasosbook.wikipeg.org/">The Pegasos
Book</a>), qui rassemble en un livre simple, un ensemble &eacute;norme d'informations tr&egrave;s utiles et importantes au sujet du mat&eacute;riel, des logiciels, 
et des questions de configurations qu'il est important de conna&icirc;tre lorsque quelqu'un emploie le duo Pegasos/MorphOS. 
 </p>
 <p>
 En conclusion, le point principal que vous devriez comprendre est que la communaut&eacute; qui emploie actuellement MorphOS est seulement 
la plateforme de lancement de cet OS. La future communaut&eacute; devrait &ecirc;tre plus grande et pas n&eacute;cessairement issue de la communaut&eacute; Amiga ; 
les futures versions de MorphOS peuvent &ecirc;tre commerciales.  Dans ce cas, naturellement, l'&eacute;quipe de d&eacute;veloppement de MorphOS
tiendra compte de n'importe quel changement sur la base des utilisateurs vis&eacute;e.
Les nouvelles distributions contiendront des versions propri&eacute;taires de logiciels absents 
(par exemple, on sait d&eacute;j&agrave; qu'une pile int&eacute;gr&eacute;e TCP/IP existe), 
ou dirigeront explicitement l'utilisateur inexp&eacute;riment&eacute; non-Amigaïste vers les composants externes.
 </p>
 <p>

<a name="Section5">&nbsp;<br></a>

 <b>D&eacute;veloppement de MorphOS</b>
 </p>
 <p>
 Dans la premi&egrave;re phase de son histoire, MorphOS n'&eacute;tait qu'un r&ecirc;ve qui  lentement est devenu r&eacute;alit&eacute; gr&acirc;ce &agrave; de jeunes programmeurs talentueux.
Puis, le d&eacute;veloppement de la machine de bPlan (qui est maintenant la branche mat&eacute;riel de Genesi) arrivait &agrave; son terme, 
MorphOS devint le seul OS distribu&eacute; avec la distribution initiale des 200 premi&egrave;res machines estampill&eacute;es betatesteurs, le d&eacute;veloppement &eacute;tait alors bien soutenu, voir acc&eacute;l&eacute;r&eacute;.
Depuis les deux derni&egrave;res ann&eacute;es, le d&eacute;veloppement de MorphOS a ralenti, notamment &agrave; cause de Genesi qui a concentr&eacute; la plupart de ses activit&eacute;s sur la 
conception d'un nouveau mat&eacute;riel, mais aussi sur le d&eacute;veloppement du logiciel  bas niveau qu'est le firmware HAL/OF et sur d'autres syst&egrave;mes 
d'exploitation comme les diverses distributions Linux (qui naturellement ont une plus grande base d'utilisateurs potentiels).
 </p> 
 <p>
 Aujourd'hui, le d&eacute;veloppement de MorphOS est plus lent, mais reste constant avec un nombre d'activit&eacute;s simultan&eacute;es:
 </p>
 <p>
 (1) Le noyau interne (le fichier<i>  boot.img</i>)  est g&eacute;r&eacute; exclusivement par l'&eacute;quipe de d&eacute;veloppement de MorphOS. 
Quand des am&eacute;liorations sur ce noyau sont effectu&eacute;es, des test sont r&eacute;alis&eacute;s par des membres de l'&eacute;quipe, avant d'&ecirc;tre pr&ecirc;t &agrave; &ecirc;tre distribuer 
aux utilisateurs. Habituellement, une image ISO de CD est cr&eacute;&eacute;e, incluant le nouveau fichier boot.img, ainsi qu'une installation compl&egrave;te de MorphOS, 
point de d&eacute;part d'une nouvelle version.<br>
 Peu de choses filtre au sujet des am&eacute;liorations en cours, mais on sait que les membres de l'&eacute;quipe de d&eacute;veloppement de MorphOS utilisent d&eacute;j&agrave; un nouveau fichier 
<i>boot.img</i> dont nombre de composants ont &eacute;t&eacute; modifi&eacute;s. 
Par exemple, l'Altivec (l'ensemble des instructions pour les calculs num&eacute;riques parall&egrave;les avec les nombres entiers et &agrave; virgules flottantes, SIMD - instruction simple, donn&eacute;es multiples - 
ensemble des 162 instructions d&eacute;di&eacute;s aux derniers processeurs  PowerPC) est pleinement support&eacute; dans tous les composants du syst&egrave;me où il peut
&ecirc;tre employ&eacute; pour des gains de vitesse &eacute;lev&eacute;s .
 </p>
 <p>
 (2) D'autres parties de MorphOS r&eacute;sidant en dehors du fichier <i>boot.img</i> sont mises &agrave; jour et mises &agrave; disposition pour les utilisateurs enregistr&eacute;s sous forme
de fichiers binaires que l'on doit t&eacute;l&eacute;charger et installer manuellement. 
Ce type de distribution logiciel est une particularit&eacute; n&eacute;cessaire qui sert &agrave; rendre disponible de nouvelles caract&eacute;ristiques, &agrave; corriger d'&eacute;ventuelles 
erreurs, ou m&ecirc;me &agrave; offrir un aper&ccedil;u sur ce qu'une future version proposera (logiciels alpha ou beta).<br>
Cela concerne par exemple, la version 4 de <i>MUI</i>, la version 6 d'<i>AHI</i>, la version 3.3 de <i>Poseidon</i>, l'am&eacute;lioration des pilotes <i>CGX 3D</i>, les versions corrig&eacute;es 
de quelques biblioth&egrave;ques &agrave; niveau &eacute;lev&eacute;, etc...
 </p>
 <p>
 (3) Le d&eacute;veloppement Open Source r&eacute;alis&eacute; par des d&eacute;veloppeurs ind&eacute;pendants est &eacute;galement appr&eacute;ci&eacute; non seulement pour son activit&eacute;, mais &eacute;galement pour 
sa qualit&eacute; et ses grands d&eacute;bats/discussions. Le bureau <i>Ambient</i> est un cas sp&eacute;cial! Devenu Open Source, quelques membres de l'&eacute;quipe MorphOS s'y sont 
activement impliqu&eacute;s.<br> 
<i>Ambient</i> &eacute;volue rapidement et de mani&egrave;re flagrante pour les utilisateurs, qui peuvent t&eacute;l&eacute;charger et installer des "compilations nocturnes&quot; (nightly builds) 
de ce bureau.
 </p>
 <p>
 (4) Dans le but d'attirer l'attention des d&eacute;veloppeurs ind&eacute;pendants, les utilisateurs se sont rassembl&eacute;s pour mettre en place un syst&egrave;me de « Bounty » o&ugrave; les utilisateurs (et les codeurs) peuvent soumettre des id&eacute;es et contribuer financi&egrave;rement &agrave; leurs r&eacute;alisations. 
Cette id&eacute;e est n&eacute;e apr&egrave;s des tentatives similaires sur d'autres plateformes. 
Plusieurs projets notables sont sortis gr&acirc;ce &agrave; ce syst&egrave;me de « Bounty », comme <i>SFSDoctor</i>, <i>MOSNet</i> (tous les deux mentionn&eacute;s dans les sections pr&eacute;c&eacute;dentes),
et <i>MorphUp</i> (un gestionnaire de paquet sophistiqu&eacute; pour l'installation et la mise &agrave; niveau automatiques des applications). 
Le syst&egrave;me de Bounty est &eacute;galement employ&eacute; pour acc&eacute;l&eacute;rer le d&eacute;veloppement des parties de l'OS qui ont une valeur particuli&egrave;re pour les utilisateurs. 
Ce qui exige la collaboration des membres de l'&eacute;quipe de d&eacute;veloppement de MorphOS, comme dans le cas de la derni&egrave;re biblioth&egrave;que ARexx native absente de 
MorphOS (<i>rexxsyslib.library</i>).
 </p>
 <p>
 Quel est l'objectif final de ce d&eacute;veloppement quelque peu anarchique ? Nous connaissons son nom probable: MorphOS 1.5, et nous savons qu'il est ambitieux.
Cette version de l'OS devrait finalement r&eacute;soudre la plupart des besoins actuellement satisfaits par des programmes externes, et pr&eacute;parera MorphOS pour 
ses d&eacute;buts en dehors de la communaut&eacute; Amiga. Malheureusement, on ne conna&icirc;t pas sa date de sortie, bien qu'elle ne semble pas &ecirc;tre tr&egrave;s proche. 
Dans une &eacute;change priv&eacute;e r&eacute;cent, Frank Mariak, un des chefs de l'&eacute;quipe de d&eacute;veloppement de MorphOS, m'a &eacute;crit que MorphOS 1.5 est toujours une chose &agrave; 
venir parce que "l'ensemble des caract&eacute;ristiques n'est pas encore sp&eacute;cifi&eacute; de mani&egrave;re d&eacute;finitive".
 </p><p>

 <a name="Section6">&nbsp;<br></a>

 <b>Outils de d&eacute;veloppements</b>
 </p>
 <p>
 Toutes les sections pr&eacute;c&eacute;dentes sont principalement destin&eacute;es aux gens  qui veulent conna&icirc;tre MorphOS selon le point de vue d'un simple utilisateur.
Mais il y a des utilisateurs moins communs, qui ont  un int&eacute;r&ecirc;t sp&eacute;cifique pour d'autres d&eacute;tails
concernant l'environnement de MorphOS : les d&eacute;veloppeurs. Ce sont les personnes les plus importantes quelque soit la plateforme
d'ordinateur, parce que sans elles il n'y a pas de nouveau logiciel, et la plateforme ne progresse plus.
Dirig&eacute; par des int&eacute;r&ecirc;ts professionnels ou simplement par passion, n'importe quel codeur veut conna&icirc;tre l'environnement
disponible pour son activit&eacute;.
 </p>
 <p>
 MorphOS est dot&eacute; en standard d'un kit d&eacute;di&eacute; au d&eacute;veloppement  logiciel  permettant &agrave; n'importe quel programmeur de cr&eacute;er des applications.
Le SDK est compl&egrave;tement libre : n'importe quel d&eacute;veloppeur peut s'inscrire sur le site Web <a href="http://developer.morphosppc.com/">MorphOS Developer
Connection</a>, et t&eacute;l&eacute;charger les archives appropri&eacute;es. Veuillez noter que le SDK est disponible pour tous, 
m&ecirc;me pour ceux qui ne poss&egrave;dent pas le mat&eacute;riel n&eacute;cessaire pour lancer MorphOS. 
Ce qui a deux effets importants: permettre la cr&eacute;ation d'environnements de d&eacute;veloppements int&eacute;gr&eacute;s (<a href="http://aixite.ebytehost.com/index.htm"><i>Cubic IDE</i></a>) par des programmeurs ind&eacute;pendants, et laisser &eacute;galement la possibilit&eacute; de cross-compiler 
depuis n'importe quelle plateforme, en particulier &agrave; partir de Linux, ou de Windows au moyen de <i>cygwin</i> (sites relatifs: 
<a href="http://www.zerohero.se/cross/mos.html">Cross-compilation pour MorphOS</a>,
<a href="http://amidevcpp.amiga-world.de/">AmiDevCpp</a>). 
Le site web <a href="http://developer.morphosppc.com/">MorphOS Developer Connection</a> poss&egrave;de un forum de d&eacute;veloppeurs où tous les sujets concernant le d&eacute;veloppement et les questions relatives &agrave; ce dernier peuvent &ecirc;tre discut&eacute;s.
 </p>
 <p>
 Le SDK de MorphOS contient toutes les "includes systems". La documentation pour les d&eacute;veloppeurs comprend des autodocs,
des articles, des exemples de codes,  des informations g&eacute;n&eacute;rales; des outils pour progammeurs ind&eacute;pendants et  leurs documentations relatives, ainsi que  deux composants tr&egrave;s utiles, <i>MorphEd </i>et l'environnement <i>Geek Gadgets</i>.
<i>MorphEd</i> est un &eacute;diteur de texte avanc&eacute; qui offre   toutes les fonctions habituellement pr&eacute;vues pour l'&eacute;dition de textes, mais &eacute;galement la coloration syntaxique, un support de l'environnement de d&eacute;veloppement, l'int&eacute;gration des compilateurs <i>GCC</i> ou   <i>vbcc</i>,
etc... Les <i>Geek Gadgets</i> sont un ensemble d'outils de d&eacute;veloppement qui ont &eacute;t&eacute; port&eacute;s sur Amiga/MorphOS et qui sont disponibles
sous forme de sources et sous forme binaires.
Le package contient, entre autres choses, beaucoup de commandes disponibles pour les shells Linux,
et son but est de fournir &agrave; des personnes accoutum&eacute;es aux environnements  Linux, un environnement de commandes familier
dans le shell de MorphOS.
 </p>
 <p>
 La disponibilit&eacute; de <i>GCC</i>, le compilateur  C le plus diffus&eacute;, n'en exclu pas pour autant les autres, ceci n'est pas une liste exhaustive d'interpr&egrave;teurs 
et de compilateurs existant sous MorphOS : les choix sont vastes, s'&eacute;tendant des assembleurs de langage machine PowerPC pour la programmation 
de bas niveau aux langages de haut niveau comme le <i>FreePascal</i> classique jusqu'aux produits plus modernes comme le langage interpr&eacute;t&eacute; <i>Python</i>.
 </p>
 <p>

 <a name="Section7">&nbsp;<br></a>

 <b>Graphismes 3D</b>
 </p>
 <p>
 La plupart des OSs alternatifs actuellement disponibles n'ont aucun support pour l'acc&eacute;l&eacute;ration graphique 3D, ou fournissent seulement un  support minimal. 
Ceci est dû au fait que les quelques compagnies qui d&eacute;veloppent des cartes graphiques ont une politique tr&egrave;s restrictives : elles ne distribuent pas  la documention technique du tout, 
ou la rende disponible sous une forme qui occasionne beaucoup d'obstacles pour les d&eacute;veloppeurs ind&eacute;pendants. 
Elles fournissent leurs propres pilotes pour Windows, les autres OS n'auront droit qu'&agrave; une documentation qui par ailleurs est tr&egrave;s difficile &agrave; obtenir et &agrave; utiliser.
 </p>
 <p>
 Dans ce sc&eacute;nario pour le manque de support pour la 3D, MorphOS rel&egrave;ve de l'exception (jusqu'&agrave; certaines limites!).
Il y a deux raisons &agrave; cela : La premi&egrave;re est la cr&eacute;ation de la <i>tinygl.library</i>, un composant logiciel tr&egrave;s important
qui (en d&eacute;pit de son nom) est une r&eacute;impl&eacute;mentation sp&eacute;cifique d'OpenGL tr&egrave;s compatible et plut&ocirc;t compl&egrave;te des caract&eacute;ristiques d'OpenGL sous MorphOS. 
La seconde est que l'&eacute;quipe de d&eacute;veloppement de MorphOS a d&eacute;cid&eacute; de concentrer tous ses efforts concernant la 3D 
sur un nombre restreint de cartes de graphiques compatibles avec le mat&eacute;riel  PegasosPPC.
 </p>
 <p>
 L'Open Graphics Library  (OpenGL) est une norme d&eacute;finie par un document qui indique un ensemble de plus de 250 appels &agrave; des fonctions
diff&eacute;rentes dont l'utilisation permet de dessiner des sc&egrave;nes 3D complexes &agrave; partir de simples primitives. 
Son importance se situe dans le fait qu'elle d&eacute;finit une API ind&eacute;pendante de la plateforme . 
Les d&eacute;veloppeurs qui emploient OpenGL pour &eacute;crire leurs applications peuvent &ecirc;tre sûrs que ces programmes produiront 
des graphismes 3D sur tous les ordinateurs ayant une impl&eacute;mentation  de cette biblioth&egrave;que. OpenGL, d&eacute;velopp&eacute; &agrave; l'origine par 
Silicon Graphics, est important pour l'industrie du jeu (où il est uniquement concurrenc&eacute; par Direct3D sur la plateforme Windows). OpenGL est &eacute;galement employ&eacute; pour des applications professionnelles où une gestion simple des graphismes 3D est importante 
(cela va des simulateurs de vol aux simulateurs de r&eacute;alit&eacute;s virtuelles en passant 
par la visualisation de haute qualit&eacute; pour les  applications et les pr&eacute;sentations scientifiques de l'information, jusqu'aux applications techniques comme CAD).
 </p>
 <p>
 Quant &agrave; TinyGL, l'&eacute;quipe de d&eacute;veloppement de MorphOS est tr&egrave;s clair : "TinyGL a &eacute;t&eacute; cr&eacute;&eacute; &agrave; l'origine par Fabrice Bellard comme un sous-ensemble d'OpenGL pour les syst&egrave;mes embarqu&eacute;s et les jeux. 
Il a &eacute;t&eacute; con&ccedil;u sans penser &agrave; l'acc&eacute;l&eacute;ration 3D mat&eacute;riel, seuls les appels principaux d'OpenGL ont &eacute;t&eacute; mis en application. 
La version MorphOS de TinyGL  est bas&eacute;e sur l'impl&eacute;mentation originale. 
Elle a &eacute;t&eacute; r&eacute;&eacute;crite pour profiter pleinement de l'acc&eacute;l&eacute;ration du mat&eacute;riel 3D. 
En outre, elle contient plusieurs caract&eacute;ristiques soigneusement choisies &agrave; partir du syst&egrave;me  MESA. 
TinyGL sur MorphOS fournit un ensemble de caract&eacute;ristiques beaucoup plus riche que la version originale tout en la surpassanr en rapidit&eacute; d'ex&eacute;cution."
 </p>
 <p>
 Naturellement OpenGL/TinyGL n'est pas suffisant pour la gestion compl&egrave;te des cartes  graphiques 3D. 
Des pilotes sp&eacute;cifiques sont n&eacute;cessaires pour utiliser l'acc&eacute;l&eacute;ration 3D de ces cartes. 
L'&eacute;quipe de d&eacute;veloppement de MorphOS a cr&eacute;&eacute; des pilotes pour les cartes  PCI et/ou AGP suivantes: 
3dfx Voodoo 3, Voodoo 4, Voodoo 5; ATI Radeon 7000, Radeon 7200, Radeon 7500, Radeon 8500, Radeon 9000, Radeon 9100, 
Radeon 9200, Radeon 9250. Comme vous pouvez le voir, ce ne sont certainement pas les cartes  graphiques les plus r&eacute;centes disponibles
sur le march&eacute;, mais elles sont bien support&eacute;es par les pilotes et permettent d'obtenir des performances
optimales sur le PegasosPPC.
 </p><p>

 <a name="Section8">&nbsp;<br></a>

 <b>Jeux</b>
 </p>
 <p>
 Puisque les graphismes 3D sous MorphOS ne sont pas au niveau de ce qui peut se faire actuellement, 
vous pourriez vous demander pourquoi nous ajoutons cette section. 
Ici l'int&eacute;r&ecirc;t principal est de fournir quelques informations essentielles sur les limites techniques atteintes par MorphOS, dans ce domaine particulier. 
En connaissant quelques conversions de jeux et le niveau de qualit&eacute; atteint quand ils sont montr&eacute;s, 
les experts pourront &eacute;valuer l'&eacute;tat actuel des graphismes 3D sur MorphOS.
 </p>
<a name="vgp"</a>
 <p>
 <a href="VGP2_001png.html" title="Virtual Grand Prix 2" target="_top"><img src="VGP2_001_tn.jpg" alt="Virtual Grand Prix 2" align="left" border="1" hspace="5" vspace="5"></a>
 <a href="VGP2_007png.html" title="Virtual Grand Prix 2" target="_top"><img src="VGP2_007_tn.jpg" alt="Virtual Grand Prix 2" align="left" border="1" hspace="5" vspace="5"></a>
 Un des jeux les plus notables disponibles sur MorphOS est sans aucun doute
<i>Virtual Grand Prix 2</i>, publi&eacute; par Alassoft. C'est une simulation de Formule 1 tr&egrave;s r&eacute;aliste
(probablement l'une des plus r&eacute;alistes toutes plateformes confondues),
avec de beaux graphismes utilisant l'acc&eacute;l&eacute;ration 3D, et sachant g&eacute;rer les 
p&eacute;riph&eacute;riques analogiques via la pile USB <i>Poseidon</i> et la nouvelle <i>lowlevel.library</i>.  
La version MorphOS a &eacute;t&eacute; r&eacute;alis&eacute;e peu de temps apr&egrave;s les versions Mac et Windows, en raison de fortes racines Amigaïste du programmeur principal
Paolo Cattani. D'ailleurs, on peut noter que la version MorphOS est compl&eacute;tement gratuite
(seule une donation Paypal de 5.90 EUR est  sugger&eacute;e afin de soutenir et d'encourager le developpeur &agrave; donner des suites sur MorphOS). 
Le jeu inclus la plupart des vrais circuits, tr&egrave;s bien r&eacute;alis&eacute;s, et facilement reconnaissables. 
Ceux qui ne sont pas inclus ont &eacute;t&eacute; cr&eacute;&eacute;s par des utilisateurs et peuvent &ecirc;tre trouv&eacute;s sur internet en tant que packages additionnels.
Le jeu est rapide et jouable m&ecirc;me  sur une configuration de base (G3 @ 600MHz et Voodoo3, par exemple).
 </p>
<a name="wipeout"</a>
 <p>
 <a href="Wipeout2097png.html" title="Wipeout 2097" target="_top"><img src="Wipeout2097_tn.jpg" alt="Wipeout 2097" align="right" border="1" hspace="5" vspace="5"></a>
 D'autres jeux commerciaux sont disponibles pour MorphOS, incluant tous ceux r&eacute;alis&eacute;s pour les ordinateurs Amiga classique 
&eacute;quip&eacute; d'une carte acc&eacute;l&eacute;ratrice PowerPC. Ce qui inclus le port de  <i><i>Wipeout 2097</i> </i>distibu&eacute; par<i> Digital Images </i>et le port d<i>'Heretic 2</i> par Hyperion Entertainment.  <em>WipeOut</em> est une belle adaptation du c&eacute;l&egrave;bre jeu, 
qui a su prendre le meilleur de la version PlayStation (la plus jouable) et de la version Windows (les graphismes en haute 
r&eacute;solution, par exemple), ce qui fait de la conversion Amiga la meilleure de toutes les versions.<i>Wipeout 2097</i>
est un ex&eacute;cutable WarpUp, utilisant la couche Amiga <i>Warp3D</i> pour l'acc&eacute;l&eacute;ration graphique, mais, comme d'habitude, 
les utilisateurs de MorphOS n'ont pas &agrave; s'en pr&eacute;occuper. En effet, <i>Wipeout 2097</i> fonctionne de mani&egrave;re transparente (aussi bien
en plein &eacute;cran qu'en mode fen&ecirc;tr&eacute;), supporte les cartes graphiques et les cartes audios non g&eacute;r&eacute;es par les Amiga classique, 
vous donne la possibilit&eacute; d' y jouer en utilisant un contr&ocirc;leur USB et vous offre naturellement une rapidit&eacute; jamais atteinte  sur n'importe quel 
Amiga classique.
 </p>
<a name="quake"</a>
 <p>
 <a href="quake3_003jpg.html" title="Quake III" target="_top"><img src="quake3_003_tn.jpg" alt="Quake III" align="left" border="1" hspace="5" vspace="5"></a>
 Beaucoup de jeux Open Source ont &eacute;t&eacute; port&eacute;s sur MorphOS, y compris plusieurs jeux commerciaux dont les sources ont &eacute;t&eacute; distribu&eacute;es : <i>Wolfenstein3D</i>, <i>Doom</i>, <i>Doom II</i>, <i>Quake</i>,
<i>Quake 2</i> et <i>Quake III</i>. La s&eacute;rie des <i>Quake</i> supporte l'acc&eacute;l&eacute;ration 3D et dans le cas du premier &eacute;pisode, m&ecirc;me les meilleures versions alternatives <i>Fuhquake</i>, <i>GLQuake</i>, <i>BlitzQuake </i>ont &eacute;t&eacute; port&eacute;s.  
Tous ces jeux fonctionnent de fa&ccedil;on fluide en haute r&eacute;solution gr&acirc;ce &agrave; l'acc&eacute;l&eacute;ration 3D. 
 </p>
 <p>
 On peut &eacute;galement parler d'autres jeux de tirs subjectifs (avec une vue &agrave; la premi&egrave;re personne) comme <i>Cube</i>, <i>AlephOne</i> ou bien le tr&egrave;s r&eacute;cent jeu freeware <i>Warsow</i>
qui vient d'&ecirc;tre r&eacute;alis&eacute;. <i>Warsow</i> est sans doute le projet graphique le plus complexe jamais port&eacute; sur MorphOS 
(m&ecirc;me s'il est bas&eacute; sur le moteur vieillissant de <i>Quake 2</i>), 
et ne pourrait pas &ecirc;tre lanc&eacute; &agrave; une vitesse d&eacute;cente sur un processeur G3 n'&eacute;tant associ&eacute; qu'&agrave; une carte graphique Voodoo. 
Cela d&eacute;montre qu'un meilleur mat&eacute;riel ne reste pas inutilis&eacute; sur MorphOS.
 </p>
<a name="freespace"</a>
 <p>
 <a href="freespace2jpg.html" title="FreeSpace 2" target="_top"><img src="freespace2_tn.jpg" alt="FreeSpace 2" align="right" border="1" hspace="5" vspace="5"></a>
 D'autres projets Open Source sont disponibles sous MorphOS, comme les jeux <i>Freespace 1</i> et <i>2</i> d'icculus.org (ces deux jeux ont besoin des versions originales pour &ecirc;tre compl&egrave;tement op&eacute;rationnelles)... des jeux comme <i>NeverBall,</i><i>FooBillard</i>  (le jeu de billard en 3D), mais &eacute;galement <i>Open Transport Tycoon Deluxe</i>, la r&eacute;impl&eacute;mentation gratuite et Open Source du jeu de Microprose <i> Transport Tycoon Deluxe</i>. La version MorphOS (qui comme toutes les autres versions &agrave; des fichiers originaux du jeu pour fonctionner) est d'ailleurs synchronis&eacute;e avec les versions officielles. Ce qui signifie qu'elle est disponible sur la page d'accueil du projet. 
<i>Open Transport Tycoon Deluxe</i> utilise la PowerSDL.library pour &ecirc;tre lancer. Cette library (dont les caract&eacute;ristiques sp&eacute;ciales sont discut&eacute; <a href="#PowerSDL">ci-dessous</a>) &agrave; d&eacute;j&agrave; permis la conversion de douzaines de jeux SDL, libres et Open Source vers MorphOS.
 </p>
<a name="robin"</a>
 <p>
 <a href="robinh_000jpg.html" title="Robin Hood" target="_top"><img src="robinh_000_tn.jpg" alt="Robin Hood" align="left" border="1" hspace="5" vspace="5"></a>
 Il y a &eacute;galement au moins une soci&eacute;t&eacute; d'&eacute;dition de logiciels commerciaux qui r&eacute;alise des conversions pour MorphOS: RuneSoft 
(autrefois connu sous le nom d'Epic Interactive). 
Ils ont distribu&eacute; <i>Knights and Merchants</i> depuis pas mail de temps, lorsque MorphOS faisait ses premiers pas... et r&eacute;cemment, ils ont distribu&eacute;s  <i>Robin Hood</i>. <i>Knights and Merchants</i> est un jeu de strat&eacute;gie dans le style de
<i>The Settlers</i>,  avec de bien meilleurs graphismes  que le premier &eacute;pisode de cette c&eacute;l&egrave;bre saga (qui a commenc&eacute; sur Amiga en 1993). 
<i>Robin Hood</i> est un jeu strat&eacute;gie/arcade sur le mod&egrave;le de <i>Commandos</i> (distribu&eacute; &agrave; l'origine sur PC par
Spellbound) avec probablement les meilleurs graphismes et la meilleure ambiance sonore jamais rencontr&eacute; dans un jeu 2D sur  MorphOS. Et m&ecirc;me 
si le jeu est un peu exigeant, il a &eacute;t&eacute; soigneusement optimis&eacute; pour que le jeu soit fluide m&ecirc;me sur un Pegasos G3. RuneSoft a d'autres jeux en 
pr&eacute;paration, et s'ils trouvent de la viabilit&eacute; sur ce march&eacute;, ils  continueront &agrave; soutenir MorphOS. Ils mettent toujours &agrave; disposition 
des versions de d&eacute;monstration de leurs conversions: les utilisateurs peuvent donc tester leurs jeux, avant de se d&eacute;cider ou non &agrave; les soutenir et &agrave; les acheter.. </p>
<a name="scum"</a>
 <p>
 <a href="scummvm_000jpg.html" title="ScummVM" target="_top"><img src="scummvm_000_tn.jpg" alt="ScummVM" align="right" border="1" hspace="5" vspace="5"></a>
 Naturellement, sur MorphOS l'utilisateur n'est pas simplement cantonn&eacute; &agrave; se divertir avec des ex&eacute;cutables plus ou moins natifs: il y a &eacute;galement de nombreux &eacute;mulateurs et 
machines virtuelles. Un des plus connus est <i>ScummVM</i>, une r&eacute;impl&eacute;mentation gratuite du moteur derri&egrave;re la majorit&eacute; des jeux d'aventures Lucas 
Arts/Lucas Games. Les versions les plus r&eacute;centes sont &eacute;galement compatibles avec quelques jeux d'autres &eacute;diteurs (comme <i>Beneath a Steel Sky</i> ou
<i>Broken Sword</i> de R&eacute;volution) et sont heureusement disponibles pour MorphOS. Mais, le plus int&eacute;ressant reste la possibilit&eacute; de lancer certaines  
aventures qui n'ont jamais vu le jour sur  Amiga (Lucas Arts a arr&ecirc;t&eacute; le d&eacute;veloppement sur Amiga apr&egrave;s <i>Indiana Jones 4 (Indiana Jones and the 
Fate of Atlantis)</i>. Le moteur fonctionne parfaitement, et ces jeux, avec leur aspect r&eacute;tro, sont toujours tr&egrave;s amusants. </p>
<a name="mame"</a>
 <p>
 <a href="MAME_MorphOS004jpg.html" title="MAME" target="_top"><img src="MAME_MorphOS004_tn.jpg" alt="MAME" align="left" border="1" hspace="5" vspace="5"></a>
 <a href="fpse_000jpg.html" title="FPSE" target="_top"><img src="fpse_000_tn.jpg" alt="FPSE" align="left" border="1" hspace="5" vspace="5"></a>
 La cat&eacute;gorie des "vrais" &eacute;mulateurs inclut  <i>Genesis Plus</i> et <i>SMS Plus</i> pour les consoles Sega, <i>SNES 9x</i>
pour la SuperNintendo (ou Super Famicon), <i>VICE</i> pour les s&eacute;ries des ordinateurs VICs de Commodore,  MAME pour les machines  
d'arcades. Tous ces logiciels sont le fruit d'un superbe travail. Il ne s'agit pas l&agrave; de ports rapides, puisque par exemple, ils supportent tous l'overlay 
(afin de permettre le retailler et de remettre &agrave; l'&eacute;chelle en temps r&eacute;el une fen&ecirc;tre) et les joypads USB. La cerise sur le g&acirc;teau est sans aucun doute <i>FPSE</i>, l'&eacute;mulateur PlayStation qui 
m&ecirc;me s'il a besoin d'<i>OS4Emu</i> pour  fonctionner (c'est une version AmigaOS 4), une fois lanc&eacute;, il est aussi rapide  qu'un programme 
natif. </p>
 <p>

 <a name="Section9">&nbsp;<br>
 </a>

 <b>Logiciels exclusifs pour MorphOS</b>
 </p>
 <p>
 La taille r&eacute;duite de l'OS et sa structure simple (en termes relatifs) impliquent, entre autres,
que beaucoup de projets  exigeant une &eacute;quipe de programmeurs sur d'autres plateformes deviennent souvent des projets individuels 
modestes dans les environnements MorphOS/Amiga. Cela ralentis le d&eacute;veloppement, mais donne &eacute;galement une excellente efficacit&eacute;,  simplicit&eacute; 
et compacit&eacute; au code.
Dans cette section, nous mentionnons quelques excellents outils pour MorphOS, alors que dans la prochaine section vous trouverez 
des descriptions pour les applications les plus importantes et les plus puissantes. 
 </p>
<a name="anr"</a>
 <p>
 <i>AmiNetRadio</i><br>
 <a href="ANR_003jpg.html" title="AmiNetRadio" target="_top"><img src="ANR_003_tn.jpg" alt="AmiNetRadio" align="right" border="1" hspace="5" vspace="5"></a>
 <i>ANR</i> est un lecteur audio qui &agrave; la base n'&eacute;tait qu'un simple lecteur de radios ShoutCast. Il s'est vite transform&eacute; jusqu'&agrave; devenir  un lecteur complet et  
extr&ecirc;mement modulaire supportant un grand nombre de formats audio et de greffons graphiques (plugins). Il est capable de restituer les formats : RIFF WAVE, Ogg Vorbis, MPEG audio, CDDA, AIFF, et les modules  
ProTracker. De plus, un SDK document&eacute; expliquant comment coder les players additionnels est disponible,et a permis la gestion, avec l'appui de programmeurs ind&eacute;pendants, des formats  MIDI, ScreamTracker, FastTracker, ainsi que d'autres formats plus rares (incluant les formats NES, SuperNES,
GameBoy, MegaDrive et AtariST). 
Ceci fait d'<i>ANR</i>, l'un des candidats les plus adapt&eacute;s pour se substituer au lecteur audio 
interne d'<i>Ambient</i> au moyen de la configuration de vos mimetypes.<br>
 Une chose int&eacute;ressante &agrave; mentionner est qu'<i>ANR</i> est r&eacute;ellement un ex&eacute;cutable AmigaOS 3.x
en code 68k. Le transparence et l'efficacit&eacute; de l'&eacute;mulation dans MorphOS sont si bons que la plupart des lecteurs mentionn&eacute;s 
ci-dessus sont compil&eacute;s exclusivement pour MorphOS en code PowerPC, et peuvent &ecirc;tre mix&eacute;s sans que l'utilisateur ne s'en rende compte. Et il en est de m&ecirc;me pour les greffons (plugins) vid&eacute;os: <i>ANR</i> est compatible avec 
l'API d'<i>AmiAMP</i> (une vieille version Amiga de <i>WinAMP</i>), et  il est donc possible de m&eacute;langer greffons 68k et PowerPC.
Notez qu'il est possible 
d'employer des greffons compil&eacute;s pour les vieux formats ex&eacute;cutables PPC (PowerUp et WarpUp,  introduits il y a quelques ann&eacute;es, &agrave; l'&eacute;poque des cartes acc&eacute;l&eacute;ratrices PowerPC 
sur Amiga classique). Les personnes n'&eacute;tant pas issu du monde Amiga ne doivent pas s'en inqui&eacute;ter : tout se fait de mani&egrave;re transparente avec la totalit&eacute; des 
ex&eacute;cutables que la communaut&eacute; Amiga a introduit dans le pass&eacute;, tant que ceux-ci ont &eacute;t&eacute; cod&eacute;s d'une fa&ccedil;on "system-friendly". ANR lui-m&ecirc;me se sert de 
quelques extensions des API AmigaOS 3.x pour am&eacute;liorer les possibilit&eacute;s, il en r&eacute;sulte un programme MorphOS compos&eacute; de code 68k. </p>
<a name="showgirls"</a>
 <p>
 <a href="ShowGirls_001jpg.html" title="ShowGirls" target="_top"><img src="showgirls_001_tn.jpg" alt="ShowGirls" align="left" border="1" hspace="5" vspace="5"></a>
 <i>ShowGirls</i><br>
 Comme son nom l'indique (et si cela ne vous &eacute;voque rien, cela signifie juste que vous n'&ecirc;tes pas assez geek), 
c'est une visionneuse d'image. La visionneuse interne d'<i>Ambient</i> est tr&egrave;s basique : 
elle vous laisse regarder l'image, la redimensionne &agrave; la taille de la fen&ecirc;tre, la tourne, et c'est tout.
<i>ShowGirls</i> permet beaucoup plus : son interface est habituellement divis&eacute;e en deux parties, d'un c&ocirc;t&eacute; il y a les miniatures 
(avec support du format EXIF des images JPEG, ce qui signifie qu'il n'est pas
n&eacute;cessaire de charger une image de 3MB ou plus juste pour montrer une vignette de 50x50) 
et de l'autre c&ocirc;t&eacute; l'image choisie est montr&eacute;e. L'image 
peut &ecirc;tre visualis&eacute;e en plein &eacute;cran, peut &ecirc;tre zoom&eacute;e (agrandissement ou retr&eacute;cissement) et peut-&ecirc;tre retravaill&eacute;e. 
ShowGirls comporte en effet quelques outils de base afin de manipuler les images : d'ajuster les couleurs, de changer la r&eacute;solution de l'image,
d'effectuer des op&eacute;rations de  lissage et de nettet&eacute;, de r&eacute;duire le bruit, des effets de lueur et de flouttage, et permet 
la d&eacute;coupe, la rotation, le renversement, ainsi que des conversions par lots. 
Il est possible d'utiliser une vue 3D (avec le rendu 3D acc&eacute;l&eacute;r&eacute;), mais c'est la plupart du temps, juste une option sympathique et secondaire. 
Le programme &eacute;tait &agrave; l'origine d&eacute;velopp&eacute; en tant qu'outil de gestion pour les appareils-photo num&eacute;riques, et peut d&eacute;sormais effectuer toutes les op&eacute;rations n&eacute;cessaires sur des dossiers d'un dispositif de m&eacute;moire de masse. Si votre 
appareil-photo supporte la norme PTP, vous pourriez vouloir vous tourner vers une autre solution. </p>
<a name="digcam"</a>
 <p>
 <i>PTPDigCam</i><br>
 <a href="PTPDigCam_001jpg.html" title="PTPDigCam" target="_top"><img src="PTPDigCam_001_tn.jpg" alt="PTPDigCam" align="right" border="1" hspace="5" vspace="5"></a>
 Ceci est un logiciel natif et original (qui n'est pas bas&eacute; sur une conversion de biblioth&egrave;ques issu du monde Linux) 
qui permet de t&eacute;l&eacute;charger et de supprimer des images, des videos et des fichiers audio sur les appareils-photos Canon, Nikon, Kodak, Sony 
fonctionnant avec la norme PTP. Les derni&egrave;res versions supportent le format EXIF, l'utilisateur peut donc visualiser ses photos sous forme de vignettes, le programme est bien &eacute;crit, avec une interface MUI agr&eacute;able. Ce n'est pas le programme le plus complexe 
au monde, mais il montre l'esprit de la vieille communaut&eacute; Amiga : la plupart des OSs alternatifs ne soutiennent pas le standard PTP 
et exigent l'achat d'un lecteur de cartes. Aussi peu coûteux soit-il, il vaut toujours mieux avoir un logiciel supportant cette norme, m&ecirc;me si elle n'est pas largement  reconnue.
Il y a &eacute;galement une alternative, appel&eacute;e <i>SimpleCam</i> et bas&eacute;e sur la <i>libPTP</i> port&eacute; &agrave; partir de l'environnement Linux, mais avec une 
GUI <i>MUI</i>. Et pour ceux qui veulent contr&ocirc;ler leur appareil photo num&eacute;rique &agrave; distance, il y a <i>CanonToolBox</i>, bas&eacute; &eacute;galement sur la 
<i>libPTP</i>. </p>
<a name="chromium"</a>
 <p>
 <a href="chromium_004jpg.html" title="PowerSDL games" target="_top"><img src="chromium_004_tn.jpg" alt="PowerSDL games" align="left" border="1" hspace="5" vspace="5"></a>
 <a name="PowerSDL"><i>PowerSDL</i></a><br>
 Ce nom &eacute;voque un logiciel, dont le port permet d'&eacute;largir, indirectement, la 
disponibilit&eacute; de logiciel sur MorphOS. Simple DirectMedia Layer (SDL) est une biblioth&egrave;que de multim&eacute;dia et multi-plateforme
qui fournit une couche d'abstraction pour les graphismes, les sons, et les APIs d'entr&eacute;e sur les plateformes les plus diverses. 
SDL permet au d&eacute;veloppeur d'&eacute;crire des jeux  ou des applications multim&eacute;dia qui fonctionneront sur beaucoup de 
syst&egrave;mes d'exploitation rendant ainsi beaucoup de ports possibles. La version MorphOS a &eacute;t&eacute; consid&eacute;rablement am&eacute;lior&eacute;e 
par rapport &agrave; la conversion Amiga originale. Elle est maintenant constitu&eacute;e par un certain nombre de biblioth&egrave;ques partag&eacute;es (ce qui permet d'ailleurs de les utiliser avec des sources logicielles 
ferm&eacute;es, non GPL) utilisant pleinement l'API MorphOS. </p>
 <p>
 <i>OS4Emu</i><br>
 C'est un exemple de logiciel qui permet d'augmenter directement le nombre d'applications fonctionnant sous MorphOS : il redirige les appels aux APIs AmigaOS 4 (qui est 
tr&egrave;s semblable &agrave; MorphOS, &eacute;tant donn&eacute; l'h&eacute;ritage commun) vers les fonctions correspondantes de MorphOS. Ce qui signifie qu'en double-cliquant sur 
l'ic&ocirc;ne d'un ex&eacute;cutable AmigaOS 4 (ou en &eacute;crivant son nom dans une fen&ecirc;tre CLI), il y a de fortes chances pour qu'il se lance. Les exemples notables 
incluent <em>FPSE</em>, l'&eacute;mulateur PlayStation, qui, ironiquement, gr&acirc;ce &agrave; Poseidon (la pile USB incluse dans MorphOS), supporte les joypads USB... contrairement &agrave; ce qui se produit dans son 
environnement naturel, AmigaOS 4 ! (Un dispositif simple, permet &agrave; <em>Poseidon</em> d'associer une direction ou une touche du joypad &agrave; une touche du clavier). D'autres titres 
OS4 fonctionnent comme <em>SID4Amiga</em> (un lecteur pour les musiques du C64), quelques d&eacute;mos de la sc&egrave;ne, beaucoup de commandes shell, utilitaires, 
etc... La compatibilit&eacute; n'est pas totale, mais elle s'am&eacute;liore &agrave; chaque nouvelle version. </p>
 <p>

 <a name="Section10">&nbsp;<br></a>

 <b>Expansion de la plateforme</b>
 </p>
<a name="cubic"</a>
 <p>
 <a href="CubicIDEpng.html" title="Cubic IDE" target="_top"><img src="CubicIDE_tn.jpg" alt="Cubic IDE" align="right" border="1" hspace="5" vspace="5"></a>
 Un des effets positifs les plus importants de la compatibilit&eacute; de MorphOS avec des programmes Amiga est le fait que les 
utilisateurs de MorphOS peuvent lancer directement la plupart des logiciels commerciaux achet&eacute;s 
pour leur Amiga, avec le grand avantage de la puissance et de la vitesse. La plateforme informatique  MorphOS/Pegasos n'est donc pas partie de z&eacute;ro !
Bien que la mort officielle de Commodore soit dat&eacute;e du 29 avril 1994, beaucoup de logiciels Amiga ont encore 
&eacute;t&eacute; d&eacute;velopp&eacute;s pendant des ann&eacute;es apr&egrave;s cette date. Et un certain nombre de programmes importants sont 
encore activement d&eacute;velopp&eacute;s aujourd'hui, comme, par exemple,  <em>PageStream</em> (qui est actuellement 
disponible pour les plateformes Amiga, Linux, MacOS, et Windows, ainsi qu'en  code natif PowerPC pour 
MorphOS), l'&eacute;diteur de texte avan&ccedil;&eacute; GoldEd (qui est maintenant le noyau de <a href="http://aixite.ebytehost.com/index.htm">
<i>Cubic IDE</i></a>, un environnement de d&eacute;veloppement int&eacute;gr&eacute; qui 
couvre tous les langages de programmation et SDKs principaux disponibles pour AmigaOS/MorphOS), le dernier programme de pr&eacute;sentation <a href="http://www.airsoftsoftwair.com/"> <i>Hollywood</i></a> (digne h&eacute;ritier de son illustre pr&eacute;decesseur,  <i>Hollywood </i>est enti&egrave;rement  compatible avec <em>Scala</em>, et ajoute toutes les caract&eacute;ristiques permises par les syst&egrave;mes graphiques modernes), etc... </p>
 <p>
 Quoi qu'il en soit, quand une plateforme informatique a une petite base 
d'utilisateurs comme MorphOS, le d&eacute;veloppement de nouveaux logiciels devient difficile. La production de logiciel commercial n'est 
pas encourag&eacute;e, puisqu'il n'y a qu'une petite probabilit&eacute; de trouver un nombre suffisamment grand d'acheteurs. La production de logiciel
Open Source et de shareware est constante, ou augmente tr&egrave;s lentement, parce qu'elle ne trouve pas une base 
suffisamment grande de codeurs : chacun &eacute;tant d&eacute;j&agrave; concentr&eacute; sur un certain nombre de projets ne leur laissant pas de temps pour d'autres. 
Dans ces conditions, il existe une solution qui parfois peut r&eacute;duire consid&eacute;rablement le temps d'&eacute;laboration d'une application : la conversion d'un 
logiciel issu d'une autre plateforme. </p>
<a name="mplayer"</a>
 <p>
 <a href="MPlayerjpg.html" title="MPlayer" target="_top"><img src="MPlayer_tn.jpg" alt="MPlayer" align="left" border="1" hspace="5" vspace="5"></a>
 <a href="Blenderjpg.html" title="Blender" target="_top"><img src="Blender_tn.jpg" alt="Blender" align="left" border="1" hspace="5" vspace="5"></a>
 Quand AmigaOS a &eacute;t&eacute; con&ccedil;u, un certain nombre de structures et de caract&eacute;ristiques ont &eacute;t&eacute; inspir&eacute;es par Unix, et  naturellement  
on les retrouvent dans l'<i>ABox</i>, l'API de MorphOS. Ainsi la conversion de commandes shell, utilitaires, programmes, et jeux d'Unix &agrave; 
AmigaOS, et maintenant de Linux &agrave; MorphOS, n'est parfois pas difficile.
Deux biblioth&egrave;ques syst&egrave;me sp&eacute;cifiques (<i>ixemul.library</i> et <i>ixnet.library</i>) permettent de faciliter la conversion de programmes  exigeant des routines sp&eacute;ciales Linux. M&ecirc;me de grandes et complexes applications comme <i>MPlayer</i>,
<i>MEncoder</i>, <i>MLDonkey</i>, <i>E-UAE</i>, <i>MAME</i>, <i>Blender</i>, ont &eacute;t&eacute; port&eacute;es sur MorphOS. </p>
 <p>
 Les principaux obstacles  pour convertir le code sont l'absence de la fonction <i>fork()</i> dans AmigaOS et l'<i>ABox</i> de 
MorphOS, le fait qu'AmigaOS/MorphOS ne sont pas 
enti&egrave;rement conforme &agrave; la norme POSIX, et l'extr&ecirc;me  difficult&eacute; de la conversion de la GUI. Les GUIs Linux sont bas&eacute;s sur les syst&egrave;mes 
de fen&ecirc;trage qui sont habituellement des parties de grands environnements de bureau, et ne sont pas int&eacute;gr&eacute;s 
dans l'OS. Mis &agrave; part un port rapide et embryonnaire tr&egrave;s r&eacute;cent de X-Windows, aucun syst&egrave;me de fen&ecirc;trage de Linux n'a &eacute;t&eacute; jamais port&eacute; sur
AmigaOS/MorphOS. Un tel port n'offrirait d'ailleurs aucun r&eacute;el avantage... Tout d'abord parce que le port serait tr&egrave;s difficile &agrave; faire et ensuite parce que le plus petit syst&egrave;me de fen&ecirc;trage Linux est au moins 5 fois plus grand que MorphOS lui-m&ecirc;me. La simple conversion d'une GUI exigerait la perte compl&egrave;te du caract&egrave;re compact de MorphOS,  et le transformerait en nouveau et inutile OS de style Linux.. </p>
 <p>
 Ainsi, contrairement &agrave; d'autres plateformes, de tr&egrave;s grandes et importantes applications comme <i>Mozilla</i> et <i>Open Office</i>  n'ont jamais &eacute;t&eacute; port&eacute;es sur AmigaOS/MorphOS. L'absence de tels programmes, tant appr&eacute;ci&eacute;s et fondamentaux pour l'utilisateur normal voulant
connecter son ordinateur (sans probl&egrave;me de compatibilit&eacute;) avec le cyber-espace, est l'un des plus gros 
obstacles &agrave; une plus grande adoption de MorphOS sur le march&eacute; des ordinateurs de bureau. </p>
 <p>
 Une fois reconnue l'inutilit&eacute; de convertir de grandes parties de distributions Linux vers MorphOS,
une meilleure id&eacute;e a &eacute;merg&eacute;e : la cr&eacute;ation d'un grand pack reliant tous les appels &agrave; certaines structures
basiques d'un syst&egrave;me vers leurs &eacute;quivalences dans d'autres syst&egrave;mes. Une tentative dans cette direction concerne
<i>GTK</i> (la trousse &agrave; outils de GIMP, o&ugrave; GIMP est l'acronyme  GNU du programme de manipulation d'images), qui essaie de relier cette trousse &agrave; outils populaire de widget afin de cr&eacute;er des  GUIs pour
le syst&egrave;me X-Window correspondant aux widgets 
<i>MUI</i>. Toutefois, le plus important dans cette tentative concerne <i>KHTML</i>,
le moteur de rendu HTML cr&eacute;e par le projet KDE.  
Un grand pack  reliant <i>KHTML</i> &agrave; <i>MUI</i> est en cours (la premi&egrave;re b&ecirc;ta version a &eacute;t&eacute; distribu&eacute;e en 
Novembre 2006. Le projet sera tr&egrave;s probablement enti&egrave;rement utilisable en 2007). 
Le succ&egrave;s de cet effort aura une grosse influence sur le futur de la plateforme MorphOS/Pegasos. 
Les utilisateurs de MorphOS auront un navigateur dernier cri (les navigateurs natifs actuels n'&eacute;tant pas  &agrave; jour), 
de nouveaux utilisateurs potentiels seront plus dispos&eacute;s &agrave; se lancer, et le succ&egrave;s dans ce domaine encouragera des efforts semblables 
vers d'autres directions (comme la conversion  d'Open Office). </p>
 <p>

 <a name="Section11">&nbsp;<br></a>

 <b>Qui a besoin de MorphOS?</b>
 </p>
 <p>
 Les arguments pr&eacute;c&eacute;dents sugg&egrave;rent que l'utilisation de MorphOS en tant qu'OS principal 
comporte un certain nombre de limitations qui emp&ecirc;chent actuellement son adoption par les professionnels. 
Mais MorphOS est d&eacute;j&agrave; utilisable pour un march&eacute; professionnel cibl&eacute;, et convient tr&egrave;s bien aux semi-professionnel et aux amateurs. Naturellement, ses limitations actuelles ne sont plus pertinentes sur le march&eacute; 
de l'embarqu&eacute;, où les caract&eacute;ristiques les plus importantes sont sa petite taille et sa rapidit&eacute; d'execution. </p>
 <p>
 Bien que vous puissiez juger la phrase suivante comme un paradoxe, laissez moi vous dire que ceux qui peut para&icirc;tre 
comme des limitations dans un environnement professionnel est per&ccedil;u comme des avantages par les utilisateurs courants. 
En fait, ces utilisateurs avan&ccedil;&eacute;s peuvent compenser presque n'importe quelle insuffisance logiciel 
au moyen de logiciels libres, shareware, et logiciels commerciaux qui existe d&eacute;j&agrave; sur la plateforme Amiga ou 
 en phase de 
d&eacute;veloppement pour MorphOS. Ils emploient d&eacute;j&agrave; MorphOS &agrave; son meilleur niveau obtenant une r&eacute;ponse in&eacute;gal&eacute;e sur toutes les plateformes informatiques. De plus, leur environnement est totalement immunis&eacute; de tous  virus, ver, cheval de troie, spyware, adware et bestioles semblables venant d'internet. 
Ils peuvent installer Linux et MacOSX (en utilisant MacOnLinux) sur leur Pegasos, pour employer <i>FireFox</i> et <i>Office</i> quand c'est n&eacute;cessaire. Ils peuvent &eacute;galement utiliser l'outil <i>RDesktop</i> dans l'environnement de MorphOS et commander un PC &agrave; distance. 
 </p>
 <p>
 D'autres utilisateurs potentiels de MorphOS pourraient &ecirc;tre ceux qui veulent &ecirc;tre « lib&eacute;r&eacute;s » de l'oppression d'un environnement 
 monolithique et autoritaire comme Windows, et/ou ne veulent pas « &ecirc;tre menac&eacute;s » par les profondeurs insondables d'un syst&egrave;me  Unix (que seuls les geeks issus du monde Linux contr&ocirc;lent enti&egrave;rement). Naturellement MorphOS est &eacute;galement le meilleur choix pour les utilisateurs nostalgiques de l'Amiga qui veulent la vitesse de la nouveaut&eacute; au lieu d'un environnement 
synth&eacute;tique plus lent fourni par UAE. Cette liste de personnes n'est &eacute;videment pas exhaustive et gageons qu'elle ne repr&eacute;sentera pas  tous les utilisateurs potentiels de MorphOS. Si cet OS est utilis&eacute; sur des cartes PowerPC dans le march&eacute; de l'embarqu&eacute;, un autre groupe d'utilisateurs sp&eacute;cifiques rejoindra les autres : les d&eacute;veloppeurs 
d'applications pour l'embarqu&eacute;. Ils auront besoin d'un environnement de travail confortablel, et 
d&eacute;couvriront &eacute;galement l'utilit&eacute; du dialogue avec une communaut&eacute; où un grand pourcentage de ses membres (plus &eacute;lev&eacute; que sur la 
plupart des autres plateformes) sont des programmeurs habiles pr&ecirc;ts &agrave; aider &agrave; chaque fois qu'ils sont sollicit&eacute;s. </p>
 <p>
 L'&eacute;volution 
du syst&egrave;me devrait enlever les limitations actuelles et permettre de tendre les bras &agrave; une plus grande base d'utilisateurs : des gens qui pourront 
ouvrir de nouveaux horizons et &eacute;largir le march&eacute; niche actuel. </p>
 <p>

 <a name="Conclusions">&nbsp;<br></a>

 <b>Conclusions</b>
 </p>
 <p>
 Cet article a essay&eacute; de faire d&eacute;couvrir MorphOS, un travail essentiel dont les progr&egrave;s sont lents, mais constants. Son faible besoin en ressources et sa rapidit&eacute; font de  
MorphOS un candidat viable pour &ecirc;tre un OS de bureau, mais ces caract&eacute;ristiques prennent encore plus de valeurs si l'on consid&egrave;re le march&eacute; de l'embarqu&eacute;, où 
l'absence de disques durs, le faible besoin en RAM, et l'utilisation des processeurs bas de gamme sont des conditions tr&egrave;s communes. Essayez d'imaginer 
les possibilit&eacute;s offertes par un syst&egrave;me d'exploitation tr&egrave;s rapide, enti&egrave;rement stock&eacute; sur une petite flashrom... </p>
 <p>
 MorphOS attend des personnes capables de reconnaitre et d'utiliser ses caract&eacute;ristiques et ses potentialit&eacute;s int&eacute;ressantes... Ce qui pourrait d&eacute;clencher
le lancement d'une nouvelle phase de d&eacute;veloppement rapide et bien support&eacute;e. Parmi les lecteurs de cet article, il peut &eacute;galement y avoir de nouveaux 
utilisateurs attir&eacute;s par l'efficience, la flexibilit&eacute;, ou l'aspect &eacute;sot&eacute;rique de MorphOS. Et peut-&ecirc;tre que cet article sera lu par des VIPs qui 
pourraient voir l&agrave; une belle opportunit&eacute; de profit  pour leurs entreprises, ce qui  aidera &agrave; construire un futur brillant pour cet OS. </p>
 <p>

 <a name="Appendix1">&nbsp;<br></a>

 <b>Liens utiles</b>
 </p>
 <p>
 <i>Sites de la communaut&eacute; MorphOS:</i><br>
 Tout gravite autour de <a href="http://www.morphzone.org/modules/news/">MorphZone</a>; d'autres sites importants sont: <a href="http://www.pegasos.org/">Pegasos.org</a>; <a href="http://obligement.free.fr/">Obligement</a>; <a href="http://amigazeux.org/">#amigazeux</a>; <a href="http://www.amigaimpact.org/">Amiga Impact</a>.<br>
 <br>
 <i>Nouveaux sites et Forums:</i><br>
 <a href="http://www.morphos-news.de/">MorphOS-News</a>; <a href="http://www.amiga-news.de/en/">Amiga-News</a>; <a href="http://amigann.com/">AmigaNN</a>; <a href="http://www.amiga.org/">Amiga.org</a>; <a href="http://moobunny.dreamhosters.com/amiga/">Moo bunny</a><br><br>
 <i>Sites de d&eacute;veloppement :</i><br>
 <a href="http://www.guru-meditation.net/main.php3">Guru-méditation</a>; <a href="http://morphos-team.net/">MorphOS-Team</a>; <a href="http://ambient-desktop.org/">Ambient Desktop</a>; <a href="http://developer.morphosppc.com/">MorphOS Developer Connection</a>.<br><br>
 <i>Sites en relation avec le mat&eacute;riel:</i><br>
 <a href="http://www.genesippc.com/">Genesi</a>; <a href="http://www.pegasosppc.com/">PegasosPPC</a>; <a href="http://www.morphosppc.com/">MorphOSPPC</a>; <a href="http://www.freescale.com/webapp/sps/site/display.jsp?nodeId=093623&amp;filePath=/media_center/news_releases/2006/tspg/02-20-06_MOBILEGT.html&amp;title=News%20Release&amp;tid=MCH">Freescale MobileGT Platform</a>.<br><br>
 <i>Sites en relation avec les logiciels:</i><br>
 <a href="http://main.aminet.net/">Aminet</a>; <a href="http://www.morphos-news.de/software.php?lg=en">MorphOS-news</a>; <a href="http://www.morphzone.org/modules/mydownloads/">MorphZone</a>.<br><br>
 <i>Histoire de l'Amiga:</i><br>
 <a href="http://www.amigahistory.co.uk/">Amiga history guide</a>; <a href="http://www.pegasosppc.de/chronike.html">The history of the Pegasos</a>.<br><br>
 <i>Manuels</i> (au format PDF):<br>
 <a href="http://lelivredupegasos.wikipeg.org/">Le livre du Pegasos</a>; et ses traductions: <a href="http://thepegasosbook.wikipeg.org/">The Pegasos Book, etc.</a>.<br><br>
 <i>FAQs</i><br>
 <a href="http://www.morphzone.org/modules/xoopsfaq/">MorphZone Quick Help</a><br><br>
 <i>Revues:</i><br>
 <a href="http://www.webalice.it/fulvio.peruggi/public/Pegasos&amp;MorphOS/index.html">DoctorMorbius_FP Homepage</a>.
 </p><p>

 <a name="Appendix2">&nbsp;<br></a>

 <b>Questions fr&eacute;quemment pos&eacute;es</b>
 </p>
 <p>
   <i>Comment peut-on t&eacute;l&eacute;charger une pile TCP/IP si le CD de MorphOS n'en contient pas ?</i><br>
   [R&eacute;ponse ironique] SVP, expliquez-nous comment vous avez t&eacute;l&eacute;charg&eacute; le CD de MorphOS&hellip; <br>
   [R&eacute;ponse s&eacute;rieuse] Dans la pratique cette question  n'existe pas. (1) Si vous avez un Amiga avec une carte acc&eacute;l&eacute;ratrice PowerPC, vous avez d&eacute;j&agrave; une pile TCP/IP et vous pouvez l'utiliser avec MorphOS. (2) Si vous avez achet&eacute; un ODW de Genesi, vous avez d&eacute;j&agrave; une  distribution Linux  install&eacute;e, ainsi vous pouvez employer l'environnement Linux pour t&eacute;l&eacute;charger tout ce que vous avez besoin pour MorphOS. (3) Le probl&egrave;me peut vraiment se produire si vous achetez seulement la carte-m&egrave;re PegasosPPC pour assembler vous-m&ecirc;me votre Pegasos. Mais dans ce cas, vous &ecirc;tes suffisamment fut&eacute; et habile pour
   demander le CD de MorphOS et une pile TCP/IP au vendeur, ou pour les t&eacute;l&eacute;charger &agrave; l'aide d'un autre ordinateur. </p>
 <p>
 <i></i>
 <i>J'installe MorphOS et le script d'installation exige que je cr&eacute;e et formatte deux partitions: une tr&egrave;s petite partition en FFS pour le fichier de boot.img, et une plus grande, amor&ccedil;able, et de pr&eacute;f&eacute;rence en SFS, pour le syst&egrave;me. Vous aviez dit qu'une seule partition &eacute;tait n&eacute;cessaire.</i><br>
 Cette requ&ecirc;te lors de l'installation de MorphOS est justifi&eacute; par la n&eacute;cessit&eacute; d'&ecirc;tre compatible avec les anciennes versions du firmware HAL/OF (versions qui ne pouvaient lire et d&eacute;marrer que depuis des partitions  <em>FFS)</em>. Le fichier boot.img est donc mis sur une partition  <em>FFS</em> afin de permettre au firmware  d'y avoir acc&egrave;s et de le lancer. La deuxi&egrave;me partition s'explique par le fait qu'il est plus prudent et plus fiable de mettre son syst&egrave;me sur une partition  <em>SFS</em>. Les nouvelles versions du firmware HAL/OF peuvent lire des partitions  <em>SFS</em>, et <em>PFS,</em> ainsi vous pouvez mettre votre boot.img et 
votre syst&egrave;me sur la m&ecirc;me partition. </p>
 <p>
 <i>Vous avez dit que MorphOS est tr&egrave;s pr&egrave;s d'un OS en temps r&eacute;el. Cela ne veux rien dire, puisqu'un OS temps r&eacute;el a des caract&eacute;ristiques techniques pr&eacute;cises. Sinon, n'importe quel OS fonctionnant sur un ordinateur suffisamment rapide pourrait &ecirc;tre temps r&eacute;el.</i><br>
 Ce n'est pas un article d&eacute;di&eacute; des ing&eacute;nieurs ou des scientifiques, autrement il serait beaucoup plus long et ennuyeux. C'est pourquoi l'information est donn&eacute; au lecteur par le biais d'analogies simples. Ici, l'id&eacute;e est de dire que vu le mat&eacute;riel sur lequel tourne MorphOS,
on peut dire et voir que cet OS est extr&ecirc;mement rapide en terme absolu. En outre, en terme relatif, il y a une diff&eacute;rence notable entre la vitesse de 
MorphOS et la vitesse des distributions PowerPC Linux. L'information essentiel &agrave; retenir est que le rapport de vitesse
demeurerait approximativement le m&ecirc;me en faveur de MorphOS, m&ecirc;me si le mat&eacute;riel &eacute;tait beaucoup plus rapide. Par cons&eacute;quent, MorphOS est 
beaucoup plus proche d'un OS temps r&eacute;el que Linux. </p>
 <p>
 <i>Dans les versions pr&eacute;c&eacute;dentes de l'article j'ai lu diff&eacute;rentes valeurs pour la taille de MorphOS dans son ensemble. Quelle est la vraie taille de MorphOS ?</i><br>
 Le nombre qui aurait d&ucirc; &ecirc;tre pr&eacute;sent sur la premi&egrave;re &eacute;dition de l'article &eacute;tait de 15 M&eacute;ga-octets, mais le « 1 » a &eacute;t&eacute; perdu pendant la phase "fr&eacute;n&eacute;tique" de
conception finale de l'article. Ce qui explique les valeurs 5 et 15. Certaines personnes ont aussi sugg&eacute;r&eacute;es  que le fichier   <em>boot.img</em> devait &ecirc;tre comptabilis&eacute; dans 
la taille de MorphOS, tout comme les nouvelles versions  d'<em>ambient</em> et de <em>MUI</em>. Par cons&eacute;quent, pour contenter tout le monde, la valeur num&eacute;rique concernant la taille de MorphOS a &eacute;t&eacute; chang&eacute;e en 
« moins de 20 M&eacute;ga-octets », afin que celle-ci soit le plus juste possible. De toute fa&ccedil;on, quelque soit le nombre, la petite taille qui caract&eacute;rise MorphOS est &eacute;videmment 
toujours l&agrave;.. </p>
 <p>
 <i>Vous avez dit que </i>Quark<i> et tout autre logiciel bas niveau sont compress&eacute;s dans le fichier boot.img. Compress&eacute; ?</i><br>
 Le fichier boot.img est en fait une archive gzip. Le v&eacute;ritable fichier image  (<em>bootpegasos2rom.img</em>) est donc &agrave; l'int&eacute;rieur de cette archive. 
Il est extrait et lanc&eacute; par le firmware HAL/OF.
 </p>
 <p>
 <i>Vous avez dit que</i> Quark<i> propose la m&eacute;moire prot&eacute;g&eacute;e et la m&eacute;moire virtuelle, mais il semble que ces caract&eacute;ristiques ne sont pas activ&eacute;s. </i><br>
 La protection  m&eacute;moire n'a jamais exist&eacute; sur AmigaOS, et n'est pas mise en application dans l'<em>ABox </em>de MorphOS pour des raisons de compatibilit&eacute; (la plupart des applications h&eacute;rit&eacute;s de l'Amiga classique ne se lanceraient pas correctement avec la protection m&eacute;moire). En fait, la protection m&eacute;moire est utilisable dans la  <em>QBox</em> et sera disponible pour de futures applications sp&eacute;cialement con&ccedil;ues pour la  <em>QBox,  </em> lorsque la migration des pilotes mat&eacute;riels de l'<em>ABox</em> vers la <em>QBox</em> aura lieu. La m&eacute;moire virtuelle a &eacute;t&eacute; mise en application dans le commencement du d&eacute;veloppement de MorphOS, mais son d&eacute;veloppement est actuellement arr&ecirc;t&eacute;, en raison d'une priorit&eacute; tr&egrave;s basse. En effet, MorphOS et ses programmes natifs/amiga classique a des besoins en RAM tr&egrave;s faible en comparaison avec la taille des barettes m&eacute;moires
d&eacute;sormais disponible. </p>
 <p>

 <a name="Appendix3">&nbsp;<br></a>

 <b>Notes historiques</b></a> 
 </p><p>
 <i>Histoire ultracondens&eacute;e de l'Amiga classic:</i><br>
 Vous savez probablement que l'Amiga a &eacute;t&eacute; consid&eacute;r&eacute; comme une machine de jeux extraordinaire et que ce dernier avait une grande base
d'utilisateur vers la fin des ann&eacute;es 80 et au d&eacute;but des ann&eacute;es 90. Mais si vous pensez que c'&eacute;tait seulement une console de jeu
ayant l'apparence d'un ordinateur, vous &ecirc;tes compl&egrave;tement dans l'erreur. L'Amiga affichait 4096 couleurs quand les &eacute;crans de PC 
&eacute;taient encore noir et vert,
il restituait des sons et des voix quand les PCs &eacute;taient sourds-muets, il permettait le traitement multit&acirc;che pr&eacute;emptif
quand les PCs ex&eacute;cutaient un seul programme &agrave; la fois. L'Amiga a &eacute;galement rassembl&eacute; une communaut&eacute; d'utilisateurs exp&eacute;riment&eacute;s,
qui l'ont adopt&eacute; pour des usages professionnels. Apr&egrave;s la fermeture de Commodore en 1994, les Amigaïstes se sont lentement 
dispers&eacute;es. Les joueurs ont migr&eacute;s vers les PCs et les consoles; et la plupart des soci&eacute;t&eacute;s qui &eacute;ditaient des logiciels et la plupart
des programmes professionnels ont converti leurs programmes et ont migr&eacute;s vers les plateformes PC et Mac. Cependant beaucoup
d'inconditionnels n'ont pas migr&eacute; vers d'autres syst&egrave;mes. Quelques &eacute;diteurs de logiciels et producteurs de mat&eacute;riels, quelques programmeurs professionnels,
ainsi que beaucoup de programmeurs non-professionnels, amateurs, passionn&eacute;s, et utilisateurs avan&ccedil;&eacute;s se sont retrouv&eacute;s et ont form&eacute;
une communaut&eacute; fortement unifi&eacute; par l'interm&eacute;diaire d'Internet.
 </p><p>
 <i>Histoire d'ultracondens&eacute;e du Pegasos/MorphOS:</i><br>
 Pendant un certain nombre d'ann&eacute;es, la marque d&eacute;pos&eacute;e Amiga a pass&eacute; de main en main sans conna&icirc;tre de v&eacute;ritable &eacute;volution. 
La plupart du temps, on utilisait uniquement son nom pour faire de la publicit&eacute;. Pendant ce temps, quelques brillant membres de la communaut&eacute; Amiga 
ont lentement &eacute;merg&eacute; et ont cr&eacute;&eacute; ce qu'aucune autre communaut&eacute; nostalgique n'a jamais pu faire. Ils ont cr&eacute;&eacute;, &agrave; partir de rien, une nouvelle machine 
PowerPC ainsi qu'un nouveau syst&egrave;me d'exploitation qui rassemblaient l'h&eacute;ritage de l'Amiga et pouvaient r&eacute;unir la communaut&eacute; existante des derniers 
utilisateurs inconditionnels. Ces magiciens de la l'&eacute;lectronique, ce sont les gars de chez bPlan/Genesi. Les manitous du code par qui tout a commenc&eacute; 
sont Ralph Schmidt (cr&eacute;ateur de <i>Quark</i>) et Frank Mariak (cr&eacute;ateur de <i>CGX</i>), les chefs de l'&eacute;quipe de d&eacute;veloppement de MorphOS.
 </p><p>
 <i>Histoire d'ultracondens&eacute;e de l'AmigaOne/AmigaOS 4:</i><br>
 Ce d&eacute;but de si&egrave;cle a aussi vu na&icirc;tre un autre ordinateur PowerPC destin&eacute; &agrave; la communaut&eacute; Amiga. Les derniers propri&eacute;taires de 
la marque d&eacute;pos&eacute;e Amiga, la plupart du temps int&eacute;ress&eacute;s &agrave; fourvoyer la marque sur d'autres march&eacute;s, ont externalis&eacute; la conception mat&eacute;riel/logiciel 
ainsi que la production des ordinateurs de bureau et de l'AmigaOS. Ceci a permis le lancement du couple AmigaOne/AmigaOS 4 PowerPC. Tandis qu'AmigaOS 4 
est toujours en cours de d&eacute;veloppement, les machines sur lesquelles il pouvait fonctionner ne sont plus produites. Ainsi, cette autre moiti&eacute; de la 
communaut&eacute; Amiga est d&eacute;sormais &agrave; la recherche, forc&eacute;ment difficile, d'une nouvelle machine, t&acirc;che qui se voit compliquer par le besoin de trouver un 
accord avec Amiga Inc. pour avoir une licence OS4 pour cette nouvelle future machine.
 </p><p>

 <a name="Contributors">&nbsp;<br></a>

 <b>Contributeurs</b>
 </p><p>
 <i>Fulvio Peruggi "DoctorMorbius_FP"</i> a &eacute;crit la majeure partie du texte anglais original.<br>
 <i>Andrea Maniero "Guruman"</i> a fourni la plupart du contenu pour la section "Les outils du d&eacute;veloppeur"
et a &eacute;crit les sections "Jeux" et "Logiciels exclusif &agrave; MorphOS".
 </p><p>
 <i>Frank Mariak</i> a lu soigneusement le texte et a fait d'importantes suggestions pour le contenu.<br>
 <i>Ed Vishoot</i> a lu soigneusement le texte et a fait des suggestions importantes pour son am&eacute;lioration.<br>
 <i>Martin Heine "Senex"</i> a effectu&eacute; un nombre incalculable de suggestions et de critiques, et les a r&eacute;it&eacute;r&eacute;es tant que le texte n'a pas &eacute;t&eacute; am&eacute;lior&eacute;.
 <i>Stefan Blixth</i> a fourni les images suivantes: MorphOS1.jpg, MorphOS2.jpg, MorphOS0.jpg, Blender.jpg.<br>
 <i>Gunne Steen</i> a fourni les images suivantes: UAE_Workbench.png,
AboutMUI.png, ShowGirls.jpg, MUIPrefs.png,
MPlayer.jpg.<br>
 <i>Fulvio Peruggi "DoctorMorbius_FP"</i> a fourni les images suivantes:
Shell.png, VGP2_001.png, VGP2_007.png, MAME_MorphOS004.jpg, CubicIDE.png.<br>
 <i>Andrea Maniero "Guruman"</i> a fourni les images suivantes:
quake3_003.jpg, freespace2.jpg, robinh_000.jpg, scummvm_000.jpg, fpse_000.jpg,
ANR_003.jpg, showgirls_001.jpg, PTPDigCam_001.jpg, chromium_004.jpg.<br>
 <i>Christian Rosentreter "tokai"</i> a fourni l'image UAE_SuperFrog.png.<br>
<i>Gilles Mathevet "The Bûcheron"</i> a fourni les images suivantes : Wipeout2097.png, MainPrefs.png, AmbientSettings.png
 </p><p>
 <i>Andrea Maniero "Guruman"</i> et <i>Fulvio Peruggi "DoctorMorbius_FP"</i>: Traduction italienne.<br>
 <i>Martin Heine "Senex"</i> et <i>Oliver Hummel "Bladerunner"</i>: Traduction allemande.<br>
 <i> Andrei Shestakov "mobydick"</i> et <i>"AmiF1team"</i>: Traduction russe.<br>
 <i>Jean-Fran&ccedil;ois Richard "Jeffrey"</i> et <i>Gilles Mathevet "The Bûcheron"</i>: Traduction fran&ccedil;aise.<br>
 <i>H&eacute;ctor "Amiades" Juan López</i>: Traduction espagnole.<br><br>
 Ceci est la version 2.02 (2007-01-16) de notre effort collectif.
 </p>
 
</body>
 </html>
