<html>
<body background="../../images/fondtexte2.jpg"  border="0">
<a href="85villesetcodepostaux.html#f"target="description"><font color="brown">Fontenay-le-Comte</font></a> (Altitude : ?)
<pre>
<hr>
D&eacute;partement : <a href="entetevendee.html"Target="description">La Vend&eacute;e</a>      R&eacute;gion : <a href="../entetepaysdeloire.html"Target="description">Pays de Loire</a>

Code Postal : 85 200

  Habitants : 15 419 Fontenaisiens
 Superficie : 

  Situation :

    Plus... : 
<hr>

</pre>
<table>
<tr>
<td>

<a href="fontenaylecomtejpg.html"><img src="images/fontenaylecomte.jpg" target="description" alt="" width="61" height="82" border=0</a>
</td>
<td>
<a href="fontenaylecomte2jpg.html"><img src="images/fontenaylecomte2.jpg" target="description" alt="" width="61" height="82" border=0</a>
</td>
<td>
<a href="fontenaylecomte3jpg.html"><img src="images/fontenaylecomte3.jpg" target="description" alt=""  width="61" height="82" border=0</a>
</td>
<td>
<a href="fontenaylecomte4jpg.html"><img src="images/fontenaylecomte4.jpg" target="description" alt="" width="109" height="81" border=0</a>
</td>
</tr>
<tr>
<td>
<a href="fontenaylecomte5jpg.html"><img src="images/fontenaylecomte5.jpg" target="description" alt="" width="127" height="81" border=0</a>
</td>
<td>
<b>Eglise Fortifi&eacute;e :</b><br>
</tr>
</table>
<br>
<b>La  Fontaine des Quatre-Tias :</b> (1542)<br>
<br>
<b>Le pont des Sardines :</b><br>
<br>
<br><br>
<b>HISTOIRE :</b><br>
<br>
   
- En 840 : les Vikings sur leurs navires remontent les fleuves pour p&eacute;n&eacute;trer &agrave;  l'int&eacute;rieur des terres o&ugrave; ils pillent abbayes, &eacute;glises, 
  maisons... Fontenay n'y &eacute;chappera pas !<br>
 <br>
- En 841 :   Renaud d'Herbange et Lambert, comte de Nantes r&eacute;unissent leurs arm&eacute;es &agrave;  Fonteneum (Fontenay) en vue de se porter au secours des fils de Louis-le-Pieux  (Charles-le-Chauve et Louis) attaqu&eacute;s par leur fr&egrave;re Lothaire.<br>
<br>  

- Entre le 11&egrave;me et le milieu du 13&egrave;me si&egrave;cle : Fontenay passe successivement entre les mains de trois familles seigneuriales. Les vicomtes de Thouars, les sires de Maul&eacute;on et ceux de Lusignan. <br>
<br>
- En 1204 : Philippe Auguste annexe le Poitou qui devient une s&eacute;n&eacute;chauss&eacute;e royale. De ce fait, c'est maintenant l'autorit&eacute; du roi qui s'impose au-dessus 
 des diff&eacute;rentes cours de justice notamment seigneuriales. <br>
<br>
- En 1242 : Saint Louis doit prendre Fontenay &agrave; Geoffroy de Lusignan surnomm&eacute; "La grand'dent". <br>
Le Poitou est donn&eacute;  en apanage &agrave; Alphonse de Poitiers (fr&egrave;re du roi). D&egrave;s lors, Fontenay devient Fontenay-le-Comte (Fontiniacum Comitis). <br>
<br>  
- 11&egrave;me si&egrave;cle : on &eacute;rigea une &eacute;glise dont il reste la crypte !<br>
<br> 
- 13&egrave;me si&egrave;cle : on note la pr&eacute;sence de halles immenses (pr&egrave;s de 140 m&egrave;tres de longueur), de foires tr&egrave;s importantes qui supplantent vite celles 
  de Mailllezais. La route reliant Niort et les Sables d'Olonne et passant par Fontenay-le-Comte devient un axe &eacute;conomique important.<br>
<br>
- En 1232 : Implantation des Jacobins !<br>
<br>
   
- A partir de 1420 : gr&acirc;ce &agrave; la paix retrouv&eacute;e, se manifeste une forte reprise &eacute;conomique dont t&eacute;moigne la construction ou 
  la reconstruction des &eacute;glises Notre-Dame, Saint Jean et Saint Nicolas (aujourd'hui disparue) et la vitalit&eacute; des foires, o&ugrave; y afflue 
  "grand nombre de marchands et de marchandises".<br> 
<br>
- mars 1471 : Louis XI &eacute;rige la ville en commune, cette promotion implique alors la cr&eacute;ation d'un 
  corps de ville avec un maire et une trentaine d'&eacute;chevins g&eacute;n&eacute;ralement 
  choisis parmi la haute bourgeoisie de la cit&eacute;. <br>
<br>

- En 1544 : Fran&ccedil;ois I<sup>er</sup> y installe une s&eacute;n&eacute;chauss&eacute;e consacrant ainsi la cit&eacute; comme capitale du Bas-Poitou. <br>
    <br>

- Vers 1540 : sont construites les chapelles de l'&eacute;glise Notre-Dame<br>
<br>
- En 1542 : est &eacute;rig&eacute;e la fontaine des Quatre-Tias. <br>
La r&eacute;ussite sociale d'une certaine tranche de la population permet la construction de l' h&ocirc;tel de la Peirate, du ch&acirc;teau de Terre-Neuve, de la maison Billaud, de la maison Jean Viset (aujourd'hui disparue) et de l' h&ocirc;tel de la S&eacute;n&eacute;chauss&eacute;e...<br>
<br>
 
    
- 16&egrave;me si&egrave;cle : il est marqu&eacute; par la R&eacute;forme et les guerres de religion.<br>
<br>
- entre 1562 et 1598 : La ville devient l'enjeu des luttes entre catholiques et protestants et sera prise et reprise huit fois par les uns et par les autres...<br> 
<br>
    
    
- 17&egrave;me si&egrave;cle : Fontenay-le-Comte a l'occasion de devenir le si&egrave;ge d'un &eacute;v&ecirc;ch&eacute; (L'&eacute;glise de 
  Maillezais, alors cath&eacute;drale, est ruin&eacute;e depuis les guerres de 
  religion), les &eacute;v&ecirc;ques ont pris l'habitude de r&eacute;sider &agrave; 
  Fontenay, mais malgr&eacute; une bulle du Pape qui officialise le transfert, le projet 
  n'aboutit pas...<br>
<br>
- 1648 : la ville est int&eacute;gr&eacute;e &agrave; l'&eacute;v&ecirc;ch&eacute; nouvellement cr&eacute;&eacute; de la Rochelle. <br>
<br>    
- 1644 : Gr&acirc;ce &agrave; l'action du S&eacute;n&eacute;chal Fran&ccedil;ois Brisson, la ville acc&egrave;de au rang de si&egrave;ge 
  royal et devient un pr&eacute;sidial avec tribunal civil et criminel de premi&egrave;re 
  instance. <br>
<br>

- 1685 : La r&eacute;vocation de l'Edit de Nantes et l'exil des tr&egrave;s nombreux protestants qui s'ensuivit, a eu des r&eacute;percussions tr&egrave;s n&eacute;fastes pour l'&eacute;conomie de la ville...<br> 
<br>
- 1753-1768 : construction de la caserne<br> 
<br>
- 1764 : La place Royale est &eacute;difi&eacute;e trois ans plus tard, on proc&egrave;de &agrave; l'ouverture de la  rue Royale .<br>
<br>
- 1775 : Le Pont Neuf est achev&eacute; !<br>
<br>
    
- Pendant la r&eacute;volution : la ville est rebaptis&eacute; Fontenay-le-Peuple <br>
<br>
- Le 24 f&eacute;vrier 1793 : un d&eacute;cret de la convention, instituant la lev&eacute;e de 300 000 hommes provoque un soul&egrave;vement quasi-g&eacute;n&eacute;ral dans le 
  d&eacute;partement de la Vend&eacute;e, seul Le sud du d&eacute;partement et Fontenay rest&egrave;rent en marge du soul&egrave;vement, mais la ville en raison de 
  son statut de chef-lieu, fut la cible des insurg&eacute;s.<br>
<br>
- Le 25 mai 1793 : Fontenay est prise  par les insurg&eacute;s, puis abandonn&eacute;e trois jours plus tard. <br>

    
- 1790 :  Lors de la cr&eacute;ation des d&eacute;partements, Fontenay-le-Comte h&eacute;rite du rang de chef lieu.<br>  
<br>
- 1800 :  Fontenay-le-Comte devient la pr&eacute;fecture. Mais quatre ans plus tard, 
  le si&egrave;ge est transf&eacute;r&eacute; &agrave; la Roche-sur-Yon, qui profite 
  de sa position centrale, plus propice au contr&ocirc;le du d&eacute;partement.<br> 
    
- 1911: reconstruction du Pont des Sardines<br> 
<br>
- 1924 : installation du Mus&eacute;e Vend&eacute;en dans le presbyt&egrave;re Notre-Dame<br> 
<br>    
- 1966 : fusion de la commune avec celle de Charzais<br>
<br>
- 1972 :  fusion de la commune avec celle de Saint-M&eacute;dard <br>
<br>
</body>
</html>