@DATABASE opium.newmail.ru:666/1_3s.htm
@WORDWRAP

@NODE MAIN
@TITLE " Ave Satanas..."
 
   @{" " link "1_2s.guide/MAIN"}@{"../pau.gif" link "../pau.gif/MAIN"}
Назад    Черная Библия Пролог    @{" " link "2s.guide/MAIN"}@{"../pau0.gif" link "../pau0.gif/MAIN"}
Дальше 



&nbsp;Правоверные боги бранились и тузили друг друга на протяжении всей истории земли. Каждое из этих существ вместе со своими священниками и служителями пыталось найти мудрость в собственной лжи. Но время ледникового периода в великом устройстве человеческого существования ограничено. У богов замаранной мудрости была своя сага и их тысячелетие стало реальностью. Каждый со своим "божественным путем в рай" обвинял других в ереси и духовном неблагоразумии. Кольцо Нибелунгов несет в себе вечное проклятие, но потому лишь, что те, кто ищет его, мыслят в категориях "добра и зла", при этом всегда ставя себя на стороне "добра". Богов прошлого превращают они в чертей, дабы выжить самим. Их немощные служители играют в дьявольскую игру, чтобы заполнить храмы и выкупить закладные церквей. Однако, слишком долго изучали они "правоверность" и какими же бедными и невежественными чертями стали они сами, И они смыкают руки в "братском" союзе в своем отчаянии добраться до Валхаллы на свой последний вселенский собор. "Близятся из мрака сумерки богов". Вороны ночи летят вызвать Локи, который зажигает Валхаллу пылающим трезубцем Ада. И сумерки богов пали. Зарево нового света встает из ночи и Люцифер возносится, дабы провозгласить: "Это - эпоха Сатаны! Сатана правит миром!" Неправедные боги мертвы. Это - утро магии и неоскверненной мудрости. ПЛОТЬ возобладает и великий Храм будет выстроен и освящен во славу ея. Спасение человека не должно более зависеть от его самоотречения. И да будет известно, что мир плоти и жизни будет величайшим приготовлением для любых и всех вечных наслаждений. 

REGE SATANAS!
 AVE SATANAS!
 ДА ЗДРАВСТВУЕТ САТАНА! 
 ---

 ---

 ---

 ---

 ---

@endnode
