@DATABASE opium.newmail.ru:666/20_1s.htm
@WORDWRAP

@NODE MAIN
@TITLE " Ave Satanas..."
 
   @{" " link "20s.guide/MAIN"}@{"../pau.gif" link "../pau.gif/MAIN"}
Назад    Черная Библия Слово к невеждам.    @{" " link "21s.guide/MAIN"}@{"../pau0.gif" link "../pau0.gif/MAIN"}
Дальше 

nbspnbsp Тем, кто не ищет познания, а хочет позабавиться или "поиграть" в Сатанизм или вздумал поглумиться над Злом, тем не пойдут впрок эти знания. 
Невежды не услышат истины, тупые - не поймут ее!
 nbspnbsp И пусть помнит тот самоубийца, рискнувший воспользоваться этими знаниями небудучи Сатанистом, что самая малая беда, которую он навлекает на себя - это его смерть. Что же большая беда - представить нетрудно... 
nbspnbsp И пусть он дважды подумает прежде чем использовать эти знания, если конечно дар мышления не до конца потерян им!
 nbspnbsp Истинную пользу получит только настоящий Сатанист и пусть воздастся по заслугам невеждам и глупцам! 


nbspnbspnbspnbspnbspnbspnbspnbspnbspnbspnbspnbspnbspnbspOpium. 
 ---

 ---

 ---

 ---

 ---

@endnode
