@DATABASE opium.newmail.ru:666/8s.htm
@WORDWRAP

@NODE MAIN
@TITLE " Ave Satanas..."
 
   @{" " link "7s.guide/MAIN"}@{"../pau.gif" link "../pau.gif/MAIN"}
Назад    Черная Библия "Книга Люцифера
 (Воздух)"    @{" " link "9s.guide/MAIN"}@{"../pau0.gif" link "../pau0.gif/MAIN"}
Дальше 

Ад, Дьявол и как продать свою душу. 

&nbsp;Сатана, без сомнения, был лучшим другом церкви за всю ее историю, раз он держал ее при деле все эти годы. Ложным доктринам Ада и Дьявола было дано цвести слишком долго благодаря протестантской и католической церквям. Без Дьявола, в которого можно тыкать пальцем, набожники правого пути не имели бы других дел, кроме угроз своим последователям. "Сатана вводит вас в искушение", "Сатана - принц Зла", "Сатана зол, коварен, жесток", - предупреждают они, -"Если вы поддадитесь искушению Дьявола, то испытаете муки вечного проклятия и будете жариться в аду". 

&nbsp;Семантическое значение слова Сатана -"противник", "враг" или "обвинитель". Само же слово "Дьявол" происходит от индийского "деви", которое означает "бог". Сатана представляет оппозицию всем религиям, которые служат унижению и подавлению человека за его естественные инстинкты. Сатане была отдана роль злого персонажа просто лишь потому, что он олицетворял собой все плотские, земные и телесные аспекты человеческой жизни. Сатана, верховный дьявол западного мира, сначала был ангелом, чьим долгом было сообщать Богу о человеческих провинностях. Лишь с XIV века он стал изображаться злым существом, получеловеком - полуживотным с козлиноподобными рогами и копытами. До того как христианство дало ему имена Сатана, Люцифер и др., плотская сторона человеческой природы была во власти бога, звавшегося Дионисом или Паном и изображавшемся в виде сатира или фавна древними греками. Пан изначально был "добрым малым" и символизировал плодородие и плодовитость. 

&nbsp;Когда нация переходит к новой форме правления, герои прошлого становятся разбойниками настоящего. То же и с религией. Ранние христиане верили, что языческие боги ивляются дьяволами и иметь с ними дело - значит заниматься "черной магией". Чудесные небесные события они именовали "белой магией" и это было единственным различием между двумя "видами" магии. Старые боги не умерли, они провалились в Ад и стали чертями. Домовые, гоблины и буки (англ. - bogey, bugaboo - прим. перев.), которыми пугали детей, произошли от слов: славянского "Бог" и инидийского "Бхага". 

&nbsp;Многие удовольствия, почитаемые до прихода христианства, были запрещены новой религией. Понадобились лишь небольшие изменения, чтобы превратить Пана с его рогами и раздвоенными копытами в самого убедительного черта! Его атрибуты также легко были превращены в наказуемые грехи и метаморфоза стала полной. 

&nbsp;Ассоциирование козла с Дьяволом может быть найдено в христианской Библии. Святейший день года, День Искупления, праздновался принесением в жертву двух козлов "без изьяна", один из которых предназначался господу, другой - Азазелю. Последний козел, заключавший в себе грехи людские, подавался на десерт и был "козлом отпущения". Таково происхождение козла, используемого в церемониях сегодняшнего дня, как, впрочем, и в Египте: раз в год он был приносим в жертву богу. 

&nbsp;Чертей у человечества предостаточно и происхождением своим они, конечно, отличаются. Исполнение Сатанинского ритуала не преследует вызывание демонов, этой практике следуют те, кто боится самих сил, пробуждаемых ими. Предположительно, демоны - это злобные духи, наделенные свойствами благоприятствовать порче людей и событий, коих они касаются. Греческое слово "демон" означает "дух-хранитель" или "источник вдохновения" и, конечно же, теологи, легион за легионом, наизобретали этих предвестников вдохновения - и всех, ко всему прочему, злобных. Доказательство трусости "волшебников" правого пути - практика вызова ими соответствующего демона (который, предположительно, является уменьшенной копией черта) для выполнения им поручения. При этом они исходят из того, что демон, будучи лакеем черта, более легко управляем. Оккультный фольклор повествует о том. что лишь очень "защищенный" или безумно глупый колдун способен додуматься вызвать самого Дьявола, 

&nbsp;Сатанист не вызывает украдкой этих "недоделанных" чертей, а бесстрашно пробуждает тех, кто составляет адскую армию опытных насильников - самих Дьяволов! 

&nbsp;Теологи составили каталог некоторых имен чертей в своих списках демонов, но ниже приведен список имен, наиболее эффективно используемых в Сатанинских ритуалах. Эти имена и краткие сноски на вызываемых богов и богинь, составляющих большую часть существ, населяющих Королевский Адский Дворец: 
 ---
ЧЕТЫРЕ КОРОНОВАННЫХ ПРИНЦА АДА 

@{"b"}САТАНА@{"ub"} - (иврит) противник, враг, обвинитель, Властелин огня, Ада, Юга. 

@{"b"}ЛЮЦИФЕР@{"ub"} - (лаг.) носитель света, просвещения, утренняя звезда, Властелин воздуха и Востока. 

@{"b"}БЕЛИАЛ@{"ub"} - (иврит) без хозяина, основа земли. независимость, Властелин Севера. 

@{"b"}ЛЕВИАФАН@{"ub"} -(иврит) змей из глубин, Властелин моря и Запада 
 ---

 ---

 ---

 ---

 ---

@endnode
