<html>
<body background="../images/fondtexte2.jpg">
<a name="a"></a>

<table>
<tr>
<td>

</td>
<td>
<font color="purple"><font size=5 face="helvetica"><a href="entetelorraine.html"target="description"><b>Pr&eacute;sentation de la r&eacute;gion Lorraine</b></a> </font>
</td>
</tr>
</table>

<HR>

<br><br>



<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">G&eacute;ographie</font><font size=1 face="helvetica"> ( <A HREF="ecolorraine.html">Economie</font></a><font size=1 face="helvetica"> - <A HREF="histoirelorraine.html">Histoire</font></a><font size=1 face="helvetica"> - <A HREF="produitlorraine.html">Produits locaux</font></a><font size=1 face="helvetica"> - <A HREF="enfantslorraine.html">Enfants du pays</a>)</font></a></STRONG><BR>
</font>

<BR>
<font size=3 face="helvetica">
Situ&eacute;e au Nord-Est de la France, la lorraine r&eacute;gion verte, cultiv&eacute;e, tonique et gourmande s'&eacute;tend de l'Est du Bassin parisien 
au versant occidental des Vosges.<br>
<br>
La Lorraine des c&ocirc;tes fait alterner plateaux bois&eacute;s ou c&eacute;r&eacute;aliers, cuestas abrit&eacute;es ou expos&eacute;es et d&eacute;pressions argileuses.<br>
- Au centre : la vall&eacute;e de la Moselle a fix&eacute; les grandes villes et les activit&eacute;s.<br>
- A l'Est : le plateau lorrain et les Vosges portent de belles for&ecirc;ts.<br>
<br>
Seule r&eacute;gion fran&ccedil;aise &agrave; partager ses 
fronti&egrave;res avec 3 pays europ&eacute;ens (la Belgique, le Luxembourg et l'Allemagne)...<br>
<br>
C'est &eacute;galement la seule &agrave; poss&eacute;der trois parcs naturels (ceux de Lorraine, des Vosges du Nord et des Ballons des Vosges).<br>
<br>
Quand &agrave; sa densit&eacute; foresti&egrave;re, c'est la plus importante de France ! <br>
Elle est riche en r&eacute;serves domaniales : Argonne en pays de Meuse, For&ecirc;t de Haye (o&ugrave; chassa Charlemagne), clairi&egrave;res et ch&ecirc;naies de Bitche, grands espaces touffus de Pierre-Perc&eacute;e et de Saint-Quirin, riches r&eacute;serves de l'importante fili&egrave;re-bois vosgienne...<br>
<br>
En plaine, les &eacute;tangs ou plans d'eau abondent : Stock, Mittersheim, Madine, Gondrexange et Lindre.
<br>
la province frontali&egrave;re grouille de serpentins de rivi&egrave;res secondaires, alevin&eacute;es en truites, carpes et brochets.<br>
<br>
Sans oublier la moselle et ses affluent la Meurthe et la Meuse.
<br><br>

<A HREF="#a"<font color="#FF0000">haut de page</font> </A>
<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>
</body>
</html>

