<html>
<body background="../images/fondtexte4.jpg">
<a name="a"></a>
<table>
<tr>
<td>

</td>
<td>
<font color="purple"><font size=5 face="helvetica"><a href="mayotte.html"target="description"><b>Pr&eacute;sentation de Mayotte</a> (976)</font><br>

</td>
</tr>
</table>
<hr>
<br>


<a name="geo"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">G&eacute;ographie</font></font><font size=1 face="helvetica"> ( Economie</font> <font size=1 face="helvetica"> - <a href="histoiremayotte.html" target="description">Histoire</a></font><font size=1 face="helvetica"> - Produits locaux</font><font size=1 face="helvetica"> - Enfants du pays)</font></a></STRONG><BR>
</font>
<br>


<br>
Mayotte possède l'un des plus grands et des plus beaux lagons du monde !<br>
(délimité par une barrière de corail longue de plus de 160 km, elle-même coupée par une dizaine de passes.)<br>
<br>
Mayotte est un petit archipel volcanique situ&eacute;e  entre l'&eacute;quateur et le tropique du Capricorne qui forme la partie orientale de l'archipel des Comores !<br>
Mayotte comprend 2 &icirc;les principales et une trentaine de petits &icirc;lots parsem&eacute;s dans un lagon de plus de 1 500 km&sup2; !<br>
L &icirc;le principale, Grande-Terre, d&eacute;coup&eacute;e et pentue, est form&eacute;e de 6 massifs &eacute;rod&eacute;s dont le point culminant est le Mont B&eacute;nara (660 m). L &icirc;lot de Pamandzi et le rocher de Dzaoudzi, reli&eacute;s par une digue appel&eacute;e le Boulevard des Crabes, constituent Petite-Terre.
Le chef-lieu administratif est situ&eacute; &agrave; Dzaoudzi, mais l activit&eacute; &eacute;conomique est concentr&eacute;e autour de Mamoudzou, en Grande-Terre. Petite-Terre et Mamoudzou sont les zones les plus urbanis&eacute;es.<br>
<br>
Les Comores sont d origine volcanique : Mayotte est la plus ancienne &icirc;le de l archipel (environ 8 millions d ann&eacute;es) et poss&egrave;de un relief moins accentu&eacute; du fait de l &eacute;rosion et de l enfoncement de son plateau.<br>
Les traces du volcanisme ancien sont pr&eacute;sentes sur l &icirc;le : le crat&egrave;re de Dzaoudzi, occup&eacute; par le lac Dziani en Petite-Terre, le cirque de Cavani en Grande Terre. Les c&ocirc;tes, tr&egrave;s d&eacute;coup&eacute;es, forment des caps, des presqu &icirc;les, des baies profondes bord&eacute;es de mangroves. C est la forme particuli&egrave;re de l &icirc;le qui lui a valu le surnom   d &icirc;le hippocampe  .<br>
<br>
</body>
</html>