<html>
<body background="../images/fondtexte4.jpg">
<a name="a"></a>
<table>
<tr>
<td>

</td>
<td>
<font color="purple"><font size=5 face="helvetica"><a href="mayotte.html"target="description"><b>Pr&eacute;sentation de Mayotte</a> (976)</font><br>

</td>
</tr>
</table>
<hr>
<br>


<a name="geo"></a>
<font size=5 face="helvetica" color="darkred">
<strong><font color="#BB0000">Histoire</font></font><font size=1 face="helvetica"> ( <a href="geomayotte.html"target="description">G&eacute;ographie</a></font> <font size=1 face="helvetica"> - Economie</font><font size=1 face="helvetica"> - Produits locaux</font><font size=1 face="helvetica"> - Enfants du pays)</font></a></STRONG><BR>
</font>
<br>


<br>

- entre le 5&egrave;me et le 8&egrave;me si&egrave;cle : Le premier peuplement de Mayotte serait d origine bantoue !<br>
- Jusqu au 13&egrave;me si&egrave;cle : le commerce se d&eacute;veloppe avec les autres &icirc;les du Canal du Mozambique, Madagascar et l'Afrique.<br>
 Les invasions arabes se succ&egrave;dent et am&egrave;nent la culture swahilie et la religion musulmane. Des sultanats rivaux se cr&eacute;ent dans l archipel des Comores.<br>
- vers le 15&egrave;me si&egrave;cle : Les premiers Europ&eacute;ens (Portugais et Fran&ccedil;ais) d&eacute;barquent &agrave; Mayotte et utilisent l'archipel comme point de ravitaillement sur la Route des Indes.<br>
- fin du 18&egrave;me et d&eacute;but 19&egrave;me si&egrave;cle :  Mayotte est le th&eacute;&acirc;tre de troubles violents, razzias d'esclaves par les Malgaches, pillages, guerres de succession, etc...il ne restera que 3 000 personnes sur l'Archipel.<br>&nbsp;
<br>
- Le 25 avril 1841 :  Mayotte devient  colonie fran&ccedil;aise ! Le sultan Andriantsouli, d'origine malgache, c&egrave;de l'&icirc;le de Mayotte &agrave; la France (repr&eacute;sent&eacute;e par le Commandant Passot) afin d'&eacute;viter les attaques venues de l'ext&eacute;rieur, notamment des Comores. Mayotte devient alors colonie fran&ccedil;aise.<br>
- 1846 : L'esclavage y est aboli !<br>
- De 1886 &agrave; 1892 : soit pr&egrave;s d un demi-si&egrave;cle plus tard, la France &eacute;tablit son protectorat sur les trois autres &icirc;les des Comores, l archipel &eacute;tant alors plac&eacute; sous l autorit&eacute; du gouverneur de Mayotte.<br>
<br>
-  25 juillet 1912 : la colonie de Mayotte et D&eacute;pendances est rattach&eacute;e &agrave; la colonie fran&ccedil;aise de Madagascar.<br>
- 1946 : L'archipel des Comores obtient le statut de Territoire d'Outre-mer (son chef-lieu, Dzaoudzi!).<br>
Peu apr&egrave;s l application du statut de TOM pr&eacute;vu par la Constitution de 1958, les Grands Comoriens font subir aux Mahorais brimades, humiliations, restriction de cr&eacute;dits et tranfert du Chef lieu &agrave; Moroni.<br>
<br>
- d&eacute;cembre 1974 : un r&eacute;f&eacute;rendum est organis&eacute; sur l'ind&eacute;pendance des &icirc;les des Comores. Le d&eacute;compte des suffrages &icirc;le par &icirc;le fait appara&icirc;tre que Mayotte souhaite rester dans le giron de la R&eacute;publique fran&ccedil;aise &agrave; 63.8 % des voix.<br>
- 1976 :Nouveau r&eacute;f&eacute;rendum, la population pl&eacute;biscite le maintien de Mayotte au sein de la R&eacute;publique fran&ccedil;aise &agrave; 99.4 %.<br>
- Le 24 d&eacute;cembre 1976 : Mayotte se voit dot&eacute;e d'un statut provisoire de Collectivit&eacute; Territoriale de la R&eacute;publique.<br>


- 11 juillet 2001 : La Loi n&deg;2001-616 dote Mayotte du statut de &laquo;&nbsp;Collectivit&eacute; D&eacute;partementale &raquo;, et r&eacute;affirme dans son article premier que Mayotte fait partie de la R&eacute;publique et ne peut cesser d'y appartenir sans le consentement de sa population.<br>

<br>
</body>
</html>