<html>
<body background="../images/fondtexte4.jpg">
<a name="a"></a>

Collectivit&eacute; territoriale <a href="../enteteoutremer.html"target="description">Outre-Mer</a> : Mayotte (976)<br> 

 <a href="cartemayotte.html"target="description"><img src="images/iconmayotte.jpg" alt="carte de Mayotte" border="0"</a>
<a href="geomayotte.html"target="description">G&eacute;ographie</a> - &eacute;conomie - <a href="histoiremayotte.html"target="description">histoire</a> - produit locaux - enfants du pays
<hr>
<pre>  
             Pr&eacute;fecture : Mamoudzou (plus de 45000 habitants)     
<a href="976villesetcodepostaux.html"Target="description">Villes et Codes Postaux</a> : Koungou, Dzaoudzi, Dembeni 

              Habitants : 160 265 Mahorais (en 2002)
                Densit&eacute; : 428 habitants/km&sup2;

             Superficie : 374 Km2

          Nb de cantons : 19

              Situation : dans l'Oc&eacute;an indien, &agrave; l'entr&eacute;e du Canal du Mozambique,
                          &agrave; mi-chemin entre Madagascar et l Afrique !

                 Climat : tropical humide avec une moyenne annuelle de 25,6 &deg;C
              2 saisons : - la saison des pluies (d'octobre &agrave; mars)
                            températures élevées et taux d humidité très important.
                            C'est la saison des cyclones et des dépressions tropicales
                            (même si Mayotte est peu exposée au risque cyclonique !). 
                          - la saison sèche (d'avril à septembre, pendant l' hiver austral).   

       &Icirc;les principales : Chissioi Bandele, Chissioi Mtsamboro, Grande-Terre,
                          Petite-Terre

               religion : Musulmane
        Langue officiel : Le fran&ccedil;ais (mais + des 2/3 des Mahorais parlent peu ou
                          mal le fran&ccedil;ais), 
    Langues maternelles : Le shimaor&eacute; (d'origine swahilie) ou le shiboushi (d'origine malgache).     
<hr>
</pre>


<br><br>
<b>Population</b><br>
<br>
Une natalit&eacute; forte, avec un indice synth&eacute;tique de f&eacute;condit&eacute; de 5 enfants par femme (1,7 enfants par femme en M&eacute;tropole).<br>
<br>
La population mahoraise est jeune : les moins de 20 ans repr&eacute;sentent 56 % de la population totale, pourcentage le plus &eacute;lev&eacute; de tous les territoires fran&ccedil;ais.<br>
La population mahoraise est issue d un m&eacute;tissage entre les populations d origine bantoue et les diff&eacute;rentes vagues d'immigration, principalement malgache. Parmi les minorit&eacute;s pr&eacute;sentes sur l &icirc;le, la communaut&eacute; indienne occupe une place importante, particuli&egrave;rement dans le secteur du commerce.<br>
<br>

<br>

<br>
<br>
Mayotte, terre d'Islam et de traditions<br>
La religion musulmane, implant&eacute;e &agrave; Mayotte depuis le XV&egrave;me si&egrave;cle, occupe une place majeure dans l organisation de la soci&eacute;t&eacute;. 95% des mahorais sont d ob&eacute;dience musulmane et de rite sunnite.<br>
Les mahorais ont une pratique mod&eacute;r&eacute;e de l islam, m&ecirc;me si les enfants fr&eacute;quentent l &eacute;cole coranique, g&eacute;n&eacute;ralement t&ocirc;t le matin, avant l &eacute;cole la&iuml;que.<br>
Le droit coutumier inspir&eacute; du droit musulman et des coutumes africaines et malgaches s'applique aux Mahorais ayant conserv&eacute; leur statut personnel, comme le permet l article 75 de la Constitution. La loi du 11 juillet 2001 relative &agrave; Mayotte maintient l'existence de ce statut civil de droit local et pr&eacute;cise les possibilit&eacute;s de renoncer &agrave; ce statut au profit du statut civil de droit commun.<br>
<br>
Le statut personnel, statut de droit civil, concerne essentiellement les droits de la personne et de la famille, ainsi que les droits patrimoniaux. Dans ces domaines, les Mahorais ayant conserv&eacute; leur statut personnel sont donc soumis &agrave; des r&egrave;gles particuli&egrave;res :<br> polygamie, possibilit&eacute; de r&eacute;pudiation de la femme par le mari, in&eacute;galit&eacute;s des sexes en mati&egrave;re de droit successoral, etc. Cependant, la grande majorit&eacute; de la population m&eacute;conna&icirc;t son propre statut.<br>
Les litiges n&eacute;s de l'application du droit local sont de la comp&eacute;tence de juridictions sp&eacute;cifiques: le tribunal de cadi (premier degr&eacute;), le grand cadi (juridiction d'appel), la chambre d'annulation musulmane (litiges sup&eacute;rieures &agrave; 305 &not;).<br>
La justice cadiale, de par la loi de 2001, va &eacute;voluer notamment vers un r&ocirc;le de m&eacute;diation ou de conciliation.<br>
<br>
La soci&eacute;t&eacute; mahoraise traditionnelle fonctionne sur les principes de la pr&eacute;&eacute;minence du groupe sur l'individu, de la matrilin&eacute;arit&eacute; (filiation d&eacute;finie dans la lign&eacute;e maternelle) et de la matrilocalit&eacute; (r&eacute;sidence de la famille chez la m&egrave;re). La culture mahoraise s'appuie sur une tradition orale riche.<br>
L islam &agrave; Mayotte n'est ni organis&eacute;, ni repr&eacute;sent&eacute; au sein du Conseil Fran&ccedil;ais du Culte Musulman !<br>&nbsp;
<br>
<br><br>





  



 

</body>
</html>