<html>
<body background="../images/fondtexte2.jpg">

<font color="brown">Europa</font>
<pre>
<hr>
<a href="../lesileseparses/lesileseparses.html"Target="description">Les &icirc;les &eacute;parses</a>      <a href="../lareunion/lareunion.html"target="description">La R&eacute;union</a>
   
         
        Habitants : 

       Superficie : 30 km&sup2; (la plus importante des &icirc;les &eacute;parses)

        Situation : dans le canal du Mozambique, &agrave; 350 km Tul&eacute;ar,
                    &agrave; mi-chemin entre la c&ocirc;te Est de l Afrique et 
                    la c&ocirc;te Ouest de Madagascar.&nbsp;&nbsp;
</pre> 
<hr>
<br>
<br><br><br>


C'est une Ile d&eacute;sertique de forme circulaire, 7 km dans le sens nord-sud, 6 km dans le sens est-ouest. Un lagon couvre le cinqui&egrave;me de l'&icirc;le environ dans la partie nord-ouest (environ 900 ha dont quelques 700 ha couverts de mangrove).<br>
<br><br>
<b>La flore :</b> Elle se compose de pal&eacute;tuviers pr&egrave;s du lagon, d euphorbes sur la majeure partie de l &icirc;le, de filaos et de cocotiers plant&eacute;s par le service m&eacute;t&eacute;orologique.<br>
<br><br>
<b>La faune :</b> est assez vari&eacute;e. On rencontre une colonie importante d oiseaux de mer (fr&eacute;gates, fous, sternes), de grands troupeaux de ch&egrave;vres sauvages. C est aussi le lieu de migration des flamants roses. En certaine p&eacute;riode de l ann&eacute;e, il y a des invasions de myriades de moustiques rendant toute circulation impossible apr&egrave;s le coucher du soleil. Pendant une certaine p&eacute;riode de l ann&eacute;e, les tortues de mer viennent y pondre.<br>
<br><br><br>
L &icirc;le Europa &eacute;tait d&eacute;j&agrave; connue au temps de la Compagnie des Indes et des premiers Fran&ccedil;ais install&eacute;s &agrave; Madagascar. Elle aurait servi de refuge &agrave; des pirates fuyant la Marine Royale.<br>
<br>
entre 1905 et 1910 : Elle fut habit&eacute;e par deux familles r&eacute;unionnaises qui tent&egrave;rent d y exploiter le sisal et l &eacute;caille de tortue.<br>
<br>
Les ressources proviennent essentiellement des produits de la mer. Les cultures sont tr&egrave;s difficiles du fait de la pr&eacute;sence sur l &icirc;le d un grand nombre de rongeurs.<br>
<br>
Depuis 1949 : une station m&eacute;t&eacute;orologique est en fonctionnement. L int&eacute;r&ecirc;t de la station est grand, au point de vue m&eacute;t&eacute;orologique, elle permet la pr&eacute;vision des cyclones du Canal du Mozambique, la protection de la navigation maritime et la protection de la navigation a&eacute;rienne internationale entre l Afrique du Sud et Madagascar.<br>
<br>
L &icirc;le Europa est consid&eacute;r&eacute;e comme une r&eacute;serve naturelle (ZEE&nbsp;: 127 300 km&sup2;).<br>
<br><br>

</body>
</html>