<html>
<body background="../images/fondtexte2.jpg">

<font color="brown">Juan da Nova</font> (anciennement appel&eacute; &icirc;le Saint-Christophe). 

<pre>
<hr>
<a href="../lesileseparses/lesileseparses.html"Target="description">Les &icirc;les &eacute;parses</a>      <a href="../lareunion/lareunion.html"target="description">La R&eacute;union</a>
   
        Habitants : 

       Superficie : 5 Km2

        Situation : dans le Canal du Mozambique, &agrave; 150 km de Madagascar.

           Climat : - Une saison fraîche (d'avril à novembre)
                      peu de pluie avec des températures moyennes de 28° en avril
                      à 24°8 en juillet/août

                    - Une saison des pluies (de décembre à Mars)
                      avec des températures moyennes qui varient peu, 27°7 en février
                      à 28°1 en mars. 

De d&eacute;cembre &agrave; mai : Les moustiques et les insectes envahissent l'&icirc;le, et se manifestent
                    au cr&eacute;puscule et &agrave; l'aube.
</pre> 
<hr>
<br>
<br><br><br>


L &icirc;le Juan da Nova est une &icirc;le en croissant qui mesure 6 km d'une pointe &agrave; l'autre, pour une largeur de 1 600 m&egrave;tres. Cette &icirc;le, connue depuis tr&egrave;s longtemps par les navigateurs, est prot&eacute;g&eacute;e par un vaste lagon et une barri&egrave;re corallienne. Elle est compos&eacute;e de beach-rock et de dunes de sable pouvant atteindre 12 m de hauteur.<br>&nbsp;
Sur son sol, on trouve des filaos et des cocotiers. Seuls les sternes composent la faune de l'&icirc;le.&nbsp;<br>
La seule ressource est le guano exploit&eacute; par les Seychellois d&egrave;s la fin du 19&egrave;me si&egrave;cle pour le compte d'une soci&eacute;t&eacute;.&nbsp;Les installations se composent de b&acirc;timents de la soci&eacute;t&eacute; exploitant le guano et de la station m&eacute;t&eacute;orologique tenue par les agents de la soci&eacute;t&eacute;. Les observations de cette station compl&egrave;tent fort heureusement le r&eacute;seau du Canal du Mozambique et sont particuli&egrave;rement utiles en p&eacute;riode cyclonique (ZEE&nbsp;: 61 050 km&sup2;).<br>

<br><br>



<b>HISTOIRE :</b><br>
<br>

<b>1501 :</b> le Capitaine JUAN DE NOVA, Hidalgo de Galice (au service du Roi du Portugal Manuel 1er Le Grand), d&eacute;couvre l'&icirc;le.<br>
<br>
 En raison de son exigu&iuml;t&eacute;, l'&icirc;le n'int&eacute;ressait pas les puissances coloniales !<br>
 JUAN DE NOVA, a certainement d&ucirc; servir de refuge &agrave; des pirates comme Olivier Le Vasseur, surnomm&eacute; La Buse...<br>
<br>
<b>Le 31 d&eacute;cembre 1897 :</B> La souverainet&eacute; de la France sur JUAN DE NOVA est officiellement reconnu.<br>
<br> 
<b>Vers 1900 :</b> la location de l'&icirc;le est accord&eacute;e &agrave; un Fran&ccedil;ais pour une dur&eacute;e de 20 ans... L'exploitation du guano et du phosphate d&eacute;bute, des installations et une usine de traitement de la roche se d&eacute;veloppe, et en 1923 la quantit&eacute; de produit export&eacute;e &eacute;tait estim&eacute;e &agrave; 53000 tonnes. La cocoteraie produisait 12 tonnes de coprah par an.<br>
<br>

<b>1934 :</b> construction d'une piste d'aviation ! (appel&eacute;e "Terrain GOULETTE")<br>
<br>
<b>1939 :</b> L'activit&eacute; de JUAN DE NOVA cessa, et les installations furent en partie d&eacute;truites afin qu'elles ne puissent &ecirc;tre utilis&eacute;es par les marines ennemies. 
<br>
<b>Le 10 mars 1952 :</B> la soci&eacute;t&eacute; SOFIM, (pr&eacute;sid&eacute;e par Hector PATUREAU, fr&egrave;re de Maurice PATUREAU, compagnon de la lib&eacute;ration) obtient une concession pour une dur&eacute;e de 15 ans...<br>
<br>
  Apr&egrave;s l'ind&eacute;pendance de Madagascar, la concession est de nouveau accord&eacute;e pour 25 ans &agrave; compter du 15 juin 1960. Elle sera sign&eacute;e entre le Pr&eacute;fet de La R&eacute;union et la SOFIM (une indemnisation est pr&eacute;vue au cas o&ugrave; la France d&eacute;ciderait de reprendre la concession).<br>
<br>
<b> 1963 :</b>installation d'un poste m&eacute;t&eacute;orologique auxiliaire !<br>
<bR>


<b>1973 :</b> l'Etat installe une station m&eacute;t&eacute;orologique de base à service permanent <br>
<br>
<b>1974 :</b> le Gouvernement d&eacute;cide la mise en place de d&eacute;tachements militaires sur les trois &icirc;les du Canal.<br>
<br>


</body>
</html>