<html>
<body background="../images/fondtexte2.jpg">

<font color="brown">LES ILES EPARSES</font>
<pre>
<hr>
<a href="../departements.html"target="description">D&eacute;partement</a> outre-mer : <a href="../lareunion/lareunion.html"target="description">La R&eacute;union</a>
   
           Superficie : 44 Km2

               5 &icirc;les : <a href="bassasdaindia.html"target="description">Bassas da India</a>, <a href="europa.html"target="description">Europa</a>, <a href="juandanova.html"target="description">Juan da Nova</a>,
                        <a href="glorieuses.html"target="description">Glorieuses</a> et <a href="tromelin.html"target="description">Tromelin</a>
</pre> 
<hr>
<br>
<br><br><br>



 <br><br><br><br><br><br>






L'appellation d'&icirc;les Eparses recouvre un ensemble de cinq &icirc;les, Bassas da India, atoll en formation submerg&eacute; &agrave; mar&eacute;e haute, Europa, Juan da Nova, Glorieuses dans le canal du Mozambique et Tromelin, isol&eacute;e dans l oc&eacute;an Indien. Elles sont situ&eacute;es dans la zone de formation ou de passage des cyclones tropicaux.<br>
<br>
Plac&eacute;es sous l'autorit&eacute; du ministre charg&eacute; de l'outre-mer depuis le 1er avril 1960, l'administration en est confi&eacute;e au pr&eacute;fet de La R&eacute;union. Les &icirc;les Eparses ne font pas partie du territoire de l Union Europ&eacute;enne. Les &icirc;les Eparses sont class&eacute;es en r&eacute;serves naturelles par les arr&ecirc;t&eacute;s pr&eacute;fectoraux de 1975 et 1981, r&eacute;glementant ainsi la p&ecirc;che et le s&eacute;jour des personnes sur ces &icirc;les.<br>
<br>
Depuis 1950, &agrave; la demande de l'organisation m&eacute;t&eacute;orologique mondiale, la France y a implant&eacute; des stations m&eacute;t&eacute;orologiques qui jouent dans la r&eacute;gion un r&ocirc;le d&eacute;terminant dans la surveillance et la pr&eacute;vision des ph&eacute;nom&egrave;nes cycloniques au b&eacute;n&eacute;fice des territoires fran&ccedil;ais et des pays voisins, membres de la commission de l oc&eacute;an Indien.<br>
<br>
Depuis 1973, les &icirc;les de la Grande Glorieuse, Juan de Nova et Europa sont occup&eacute;es par des d&eacute;tachements militaires des Forces Arm&eacute;es dans la Zone Sud de l Oc&eacute;an Indien (FAZSOI). Toutes (sauf Bassas da India) sont &eacute;galement habit&eacute;es par des m&eacute;t&eacute;orologistes, un gendarme (sauf Tromelin) et occasionnellement par des scientifiques. La quasi-totalit&eacute; du soutien logistique est assur&eacute;e par des avions de l Arm&eacute;e de l Air et des navires de la Marine Nationale, qui assurent &eacute;galement la surveillance des eaux territoriales et de la Zone Economique Exclusive (ZEE).<br>
<br>
<br>

</body>
</html>