<html>
<body background="../images/fondtexte2.jpg">

<font color="brown">Tromelin</font>
<pre>
<hr>
<a href="../lesileseparses/lesileseparses.html"Target="description">Les &icirc;les &eacute;parses</a>      <a href="../lareunion/lareunion.html"target="description">La R&eacute;union</a>
   
        Habitants : 

       Superficie : 1 Km2

        Situation : &agrave; 600 km Tamatave (Madagascar) et &agrave; 535 km La R&eacute;union.
</pre> 
<hr>
<br>
<br><br><br>



L &icirc;le Tromelin est une petite &icirc;le corallienne plate, entour&eacute;e de fonds de 4 000 m&egrave;tres. Ses dimensions sont d environ 1 600 m de long par 700 m de large. Tr&egrave;s isol&eacute;e g&eacute;ographiquement des autres, Tromelin est parfois exclue de l appellation &laquo;&nbsp;Iles Eparses&nbsp;&raquo;. L &icirc;le est recouverte de sable et pr&eacute;sente de nombreux blocs coralliens. (ZEE&nbsp;: 280 000 km&sup2;).<br>
L &icirc;le a &eacute;t&eacute; d&eacute;couverte par le Chevalier de Tromelin. En raison des vents violents, elle &eacute;tait soigneusement &eacute;vit&eacute;e &agrave; l &eacute;poque de la marine &agrave; voile.&nbsp;<br>
L acc&egrave;s est tr&egrave;s difficile par la mer&nbsp;: l &icirc;le ne peut &ecirc;tre atteinte que par des embarcations l&eacute;g&egrave;res aux &eacute;poques d affaiblissement des aliz&eacute;s (avril-mai-octobre-novembre).&nbsp;<br>
Son sol est constitu&eacute; de d&eacute;p&ocirc;ts coralliens sur &eacute;minence d origine probablement volcanique. La flore pauvre se compose principalement d herbes grasses et d arbustes peu denses. La faune est constitu&eacute;e d une colonie tr&egrave;s int&eacute;ressante d oiseaux de mer et de tortues.&nbsp;
Les ressources sont limit&eacute;es aux produits de la p&ecirc;che et notamment des tortues de mer. Aucune culture n est possible par manque d eau et en raison des aliz&eacute;s qui soufflent presque toute l ann&eacute;e.<br>
En 1954, le service m&eacute;t&eacute;orologique de la colonie fran&ccedil;aise de Madagascar y installa une station &agrave; la suite d une r&eacute;solution prise par l Association R&eacute;gionale de l Organisation Mondiale M&eacute;t&eacute;orologique lors de sa premi&egrave;re session tenue &agrave; Tananarive en janvier 1953. On y effectue maintenant des observations de vent par radioth&eacute;odolite. Cette station a &eacute;t&eacute; cr&eacute;&eacute;e.&nbsp;
Depuis sa cr&eacute;ation, elle s est av&eacute;r&eacute;e d un int&eacute;r&ecirc;t capital pour la d&eacute;tection des formations cycloniques dans le sud-ouest de l Oc&eacute;an Indien. En effet, la plupart des perturbations mena&ccedil;ant Madagascar ou les Mascareignes (&icirc;le de La R&eacute;union   Ile Maurice) se forment ou passent au voisinage de cette &icirc;le.&nbsp;<br>
&nbsp;
</body>
</html>