@DATABASE opium.newmail.ru:666/18s.htm
@WORDWRAP

@NODE MAIN
@TITLE " Ave Satanas..."
 
   @{" " link "17s.guide/MAIN"}@{"../pau.gif" link "../pau.gif/MAIN"}
Назад    Черная Библия "Книга Белиала
 (Земля)"    @{" " link "19s.guide/MAIN"}@{"../pau0.gif" link "../pau0.gif/MAIN"}
Дальше 

Три типа Сатанинского Ритуала 

&nbsp;Практика Сатанинской магии включает в себя три типа церемоний. Каждый из них соответствует одной из человеческих эмоций. Первый из них мы назовем сексуальным ритуалом. 

&nbsp;Сексуальный ритуал более широко известен как любовный приворот или чары. Цель исполнения такого ритуала - пробуждение желания у желаемого вами человека, или же побуждение сексуального партнера к исполнению ваших желаний. Если у вас нет на примете особого человека или типа личности, способных вызвать достаточно сильное направленное сексуальное чувство, завершающееся оргазмом, то ваше деяние не увенчается успехом. Все дело в том, что если даже случайно ритуал завершится успешно, то какой в нем будет смысл, если вы не сможете использовать наконец предоставленную вам возможность по причине отсутствия возбуждения или желания? Привораживание, служащее вашим скрытым побуждениям, легко спутать с очаровыванием для удовлетворения своих сексуальных желаний. 

&nbsp;Привораживание с целью самовозвеличивания, сопровождаемое церемониальной магией, относится либо к категории благотворного, либо к категории разрушительного ритуала, а может обернуться и тем и другим сразу. Если вы чего-либо желаете или в чем-то нуждаетесь настолько сильно, что отсутствие этого вызывает печаль либо сильные муки; и вы можете добиться этого, используя чары и приворот, не нанося никому вреда, то благотворный ритуал, включенный составной частью, увеличит вашу силу. Если же вы желаете приворожить или полонить в своих личных целях заслуживающую того жертву, то вам надо использовать разрушительный ритуал. Этих формулировок следует придерживаться, ибо применение неверно выбранного типа ритуала для достижения желаемого результата может привести к неприятным осложнениям. 

&nbsp;Хорошим примером может послужить случай с девушкой, которой досаждает назойливый ухажер. Если с ее стороны немногое сделано для его ободрения, то она должна признать его духовным вампиром, коим он на самом деле и является, и позволить ему играть свою мазохистскую роль. Однако, если она легкомысленно очаровала, всячески его ободряя, а, затем, к великой своей досаде, обнаруживает, что стала объектом его неослабного сексуального вожделения, то ей некого винить, кроме себя самой. Упражнения подобного рода, направленные на саморекламу, порождены внушенным людям самоотрицанием, которое и пробуждает нужду в таких несерьезных "покорениях". Сатанистка обладает достаточно сильными личностными качествами для того, чтобы использовать привораживание для собственного сексуального удовлетворения или для достижения власти, либо успеха особого характера. Второй тип ритуала носит благотворный характер 

&nbsp;. Благотворный или сострадательный ритуал выполняется для оказания помощи другим или самому себе. Здоровье, семейное счастье, преуспевание в бизнесе и достижения на научной стезе - всего лишь некоторые положения, охватываемые благотворным ритуалом. 

&nbsp;Можно сказать, что эта форма церемонии попадает в разряд ИСТИННОЙ благотворительности, если иметь в виду то, что "благотворительность начинается с собственного дома". 

&nbsp;Третья побуждающая сила - разрушение. Эта церемония применяется в гневе, раздражении, презрении, пренебрежении или откровенной злобе. Известна она как заклятие, проклятие или разрушительная сила. Одно из величайших заблуждений, создавшихся вокруг практики ритуальной магии - мнение, что будто бы нужно уверовать в силы магии, прежде, чем они смогут нанести вам вред или даже уничтожить вас. Нет ничего более далекого от истины, ибо самые восприимчивые к проклятиям жертвы всегда были величайшими скептиками. А настоящая причина пугает своей простотой. Нецивилизованный дикарь первейшим делом побежит к ближайшему колдуну или шаману, как только почувствует, что враг наслал на него проклятие. Он осознает угрозу и присутствие зла, и его вера в силу проклятия настолько велика, что он предпримет все меры предосторожности. Так, посредством применения благотворной магии он окажет противодействие любому злу. что может с ним приключиться. И этот человек действует осмотрительно и не идет ни на какой риск. 

&nbsp;С другой стороны, "просвещенный" человек, не придающий значения подобным "суевериям", отправляет свой инстинктивный страх перед проклятием в область собственного подсознания, тем самым взращивая из него феноменальную разрушительную силу, которая будет умножаться с каждой последующей неудачей. Конечно, скептик будет однозначно всякий раз отрицать любую связь между своим новым несчастьем и проклятием, ОСОБЕННО тем, что наслано на него. Это настойчивое сознательное отрицание потенциала проклятия и есть та самая составная часть, что порождает успех его, создавая случайные ситуации, соответствующие потенциалу проклятия. В большинстве случаев жертва будет отрицать какое-либо влияние магических сил на свою судьбу вплоть до своего последнего издыхания - хотя чародей вполне доволен до тех пор, пока все происходит так, как он хотел. Не следует забывать, что ВАС НЕ ДОЛЖНО ВОЛНОВАТЬ ТО ОБСТОЯТЕЛЬСТВО, ЧТО КТО-ТО МОЖЕТ НЕ ПРИЗНАВАТЬ ВСЕРЬЕЗ ВАШЕ ДЕЯНИЕ, ЕСЛИ ДЕЯНИЕ ПРИНОСИТ ЖЕЛАННЫЕ РЕЗУЛЬТАТЫ. Чрезмерно дотошный логик всегда будет объяснять связь между магическим ритуалом и его конечным результатом как "совпадение". 

&nbsp;Вершится ли чародейство в созидательных или в разрушительных целях, успех деяния зависит от восприимчивости человека, которому предстоит получить благословение или проклятие, смотря с каким случаем мы имеем дело. В случае сексуального или благотворного ритуала, доверие того, на кого он направлен и вера его в магию ПОМОГАЮТ совершить ритуал, но человек, получивший проклятие или заклятие, куда более склонен пасть жертвой уничтожения, если он в это не верит. Пока человек знает что представляет собой страх, ему будут требоваться пути и средства защиты от собственных страхов. Никто не знает всего, и, пока существуют чудеса, будет существовать и боязнь неизвестного, в котором таятся потенциально опасные силы. Как раз этот естественный страх неизвестного - ближайший родственник восхищения неизвестным, побуждает человека логического склада ума выискивать те самые объяснения. Очевидно, что ученым, совершающим открытие, движет его ощущение чуда. И все же, как печально, что этот человек, зовущий себя логиком, зачастую последним осознает суть ритуальной магии. 

&nbsp;Религиозная вера и пыл могут вызвать на теле кровоточащие раны, приблизительно похожие на раны, которые, якобы, были нанесены Христу. Такие раны называются стигматами и появляются в результате сострадания, доведенного до степени эмоционально неистовой крайности. Почему же тогда остаются сомнения в разрушительных крайностях, до которых могут довести страх и ужас? Теоретически, так называемые демоны способны к уничтожению и разрыванию плоти в равной степени, как и горстка давно заржавевших гвоздей способна вызвать экстаз кровотечения в человеке, уверовавшим в то, что он распят на Голгофе. 

&nbsp;Посему, никогда не пытайтесь убедить скептика, на которого вы желаете наслать проклятие. Пусть он насмехается. Просвещение его понизило бы ваши шансы на успех. Слушайте со снисходительной уверенностью, как он насмехается над вашей магией, зная, что дни его в то же самое время переполнены неприятностями. Если, к тому же, он в достаточной мере презрен, то, милостию Сатаны, он может даже умереть, смеясь! Слово предостережения для тех, кто намерен практиковать эти исусства. В отношении секса и вожделения: Воспользуйтесь в полной мере возымевшими действие заклинаниями и чарами; если вы - мужчина, погрузите в нее со сладострастным возбуждением свой член; если вы - женщина, широко раскройте свое лоно в сладостном предчувствии. В отношении сострадания: Будьте твердо убеждены в том, что цена той помощи, которую вы предоставили другим, не заставит вас сожалеть, если их новообретенные блага встанут препятствием у вас на пути. Будьте благодарны за все, что вам принесло использование магии. В отношении разрушения: Прежде, чем насылать свое проклятие, убедитесь в том, что вас НЕ ВОЛНУЕТ, останется ли в живых намеченная жертва или же она умрет, и, вызвав ее уничтожение, ликуйте, а не кайтесь. 

Следуйте строго этим правилам - иначе, каждый раз вы будете видеть, как выши желания будут обращаться против вас, что, скорее всего, принесет вам вред, нежели пользу. 
 ---

 ---

 ---

 ---

 ---

@endnode
