@DATABASE opium.newmail.ru:666/9s.htm
@WORDWRAP

@NODE MAIN
@TITLE " Ave Satanas..."
 
   @{" " link "8s.guide/MAIN"}@{"../pau.gif" link "../pau.gif/MAIN"}
Назад    Черная Библия "Книга Люцифера
 (Воздух)"    @{" " link "10s.guide/MAIN"}@{"../pau0.gif" link "../pau0.gif/MAIN"}
Дальше 

Дьявольские имена 

Abaddon (Абаддон, Абаддона) - (иврит) разрушитель
 Adramelech (Адрамелех) - шумерский дьявол
 Apuch (Апух) - дьявол у Майя
 Ahriman (Ариман) - маздакейский дьявол
 Amon (Амон) - египетский бог жизни и воспроизведения с головой барана
 Ароllyon (Аполлион) - греческий синоним Сатаны, архидьявол
 Asmodeus (Асмодей) - иудейский бог чувственности и роскоши, первоначально - "существо судящее"<
 Astaroth (Астарта) - финикийская богиня сладострастия и похоти, эквивалент вавилонской Иштар
 Azazel (Азазель) - {иврит) оружейник, изобретатель косметики
 Baalberith (Баальберит) - канаанский Властелин согласия, позднее превращенный в дьявола
 Balaam (Валаам) - иудейский дьявол жадности и алчности
 Baphomet (Бафомет) - тамплиеры поклонялись ему как воплощению Сатаны
 Bast (Баст) - египетская богиня удовольствия, представляемая в виде кошки
 Beelzebub (Вельзевул) - {иврит) Повелитель Мух, взятый из символизма скарабея
 Behemoth (Бегемот) - иудейская персонификация Сатаны в виде слона
 Beherith (Бегерит) - сирийское имя Сатаны
 Bile (Вил) - кельтский бог Ада
 Chemosh (Чемош) - национальный бог моабитов, позднее - дьявол
 Cimeries (Кимерис) - восседает на черной лошади и правит Африкой
 Coyote (Койот) - дьявол американских индейцев
 Dagon (Дагон) - филистимлянский мстительный бог моря 
Damballa (Дамбалла) - змеиный бог вудуизма
 Demogorgon (Демогоргон) - греческое имя дьявола, не должное быть известным смертным
 Diabolus (Дьявол) - (греч.) "текущий вниз"<
 Dracula (Дракула) - румынское название дьявола
 Emma-O (Эмма-О) - японский правитель Ада
 Euronymous (Евронимус) - греческий принц смерти
 Fenriz (Фенриц) - сын Локи, изображаемый в виде волка
 Gorge (Горгона) - уменьш. от Демогоргон, греческое название дьявола
 Haborym (Хаборим) - ивритский синоним Сатаны
 Hecate (Геката) - греческая богиня подземного царства и колдовства
 Ishtar (Иштар) - вавилонская богиня плодородия
 Kali (Кали) - (хинди) дочь Шивы, верховная жрица туггиев 
Lilith (Лилит) - иудейская дьяволица, первая жена Адама
 Loki (Локи) - тевтонский дьявол
 Mammon (Маммон) - арамейский бог богатства и выгоды
 Mania (Мания) - богиня Ада у этрусков
 Mantus (Манту) - бог Ада у этрусков
 Marduk (Мардук) - бог Града Вавилон
 Mastema (Мастема) - иудейский синоним Сатаны
 Meiek Taus (Мелок Таус) - йезидский дьявол
 Mephistopheies (Мефистофель)-(rpeч.) то, кто избегает света, см. также "Фауст" Гете
 Metztli (Метцтли) - богиня ночи у ацтеков
 Mictian (Миктиан) - ацтекский бог смерти
 Midgard (Мидгард) - сын Локи, изображаемый в виде змеи
 Milcom (Милком) - аммонитский дьявол
 Moloch (Молох) - финикийский и канаанитский дьявол
 Mormo (Мормо)- (греч.) Царь Вампиров, супруг Гекаты
 Naamah (Наама) - иудейская дьяволица соблазнения
 Nergal (Нергал) - вавилонский бог Гадеса
 Nihasa (Нихаза) - дьявол американских индейцев
 Nijа (Нидза) - польский бог подземного мира
 O-Yama (О-Яма) - японское название Сатаны
 Pan (Пан) - греческий бог вожделения, помещенный позднее в дьявольскую свиту
 Pluto (Плутон) - греческий бог подземного царства
 Proserpine (Прозерпина) - греческая королева подземного царства
 Pwcca (Пакка) - уэльсское имя Сатаны
 Rimmon (Риммон) - сирийский дьявол, которому поклонялись в Дамаске
 Sabazios (Шавазий) - фригийского происхождения, идентифицируется с Дионисом, поклонение змее
 Saitan (Сайтан) - енохианский эквивалент Сатаны
 Sammael (Саммаэль) - {иврит) "злоба Бога"<
 Samnu (Самну) - дьявол народов Центральной Азии
 Sedit (Седит) - дьявол американских индейцев
 Sekhmet (Сехмет) - египетская богиня мести
 Set (Сет) - египетский дьявол
 Shaitan (Шайтан) - арабское имя Сатаны
 Shiva (Шива) - (хинди) разрушитель
 Supay (Супай) - индийский бог подземного мира
 T'an-mo (Тянь-мо) - китайский двойник дьявола, бог жадности и страсти
 Tchort (Черт) - русское имя Сатаны, "черный бог"<
 Tezcatlipoca (Тецкатлипока) - ацтекский бог Ада
 Thamuz (Тамуз) - шумерский бог, позднее причисленный к свите Дьявола
 Thoth (Тот) - египетский бог магии
 Tunrida (Тунрида) - скандинавская дьяволица
 Typhon (Тайфун) - греческая персонификация Сатаны
 Yaotzin (Яоцин) - ацтекский бог Ада
 Yen-lo-Wang (Йен-ло-Ванг) - китайский правитель Ада 
 ---


&nbsp;Дьяволы религий прошлого всегда имеют, по крайней мере, отчасти животные свойства - доказательство постоянной нужды человека отрицать, что он такое же животное, ибо признание этого нанесло бы слишком большой урон его истощенному эго. 

&nbsp;Свинья была презираема евреями и египтянами. Она символизировала таких богов, как Фрей, Осирис, Адонис, Персефона, Аттис и Деметра, и приносилась в жертву Осирису и Луне. Однако, со временем, она была превращена в черта. Финикийцы поклонялись мушиному богу Баалю, от которого происходит другой дьявол - Вельзевул. Оба - Бааль и Вельзевул, отождествлялись с навозным жуком или скарабеем, как называли его египтяне, которому приписывалась способность к самовоскрешению, так же как и мифической птице Феникс, восстававшей из собственного пепла. Древние иудеи благодаря своим контактам с персами уверовали, что две самые главные движущие силы в мире есть Ахура-Мазда - бог добра, огня и света; и Ариман - змей, бог тьмы, разрушения, смерти и зла. Эти и другие бесчисленные примеры не только рисуют нам чертей, изобретенных человеком в зверином обличье, но также показывают и необходимость приносить жертвы в угоду новым религиям первоначальных богов-зверей и превращать их в чертей. Во времена реформации, в XVI веке, доктор и алхимик Иоганн Фауст открыл способ вызвать демона Мефистофеля из ада и заключил с ним договор. Он подписал кровью документ, в котором обязался передать Мефистофелю свою душу в обмен на ощущение молодости и в сей же час стал молод. Когда настало время платить по счету, Фауст был разорван в своей комнате на куски, словно в результате взрыва лаборатории. Эта история - протест времен (XVI век) против науки, химии и магии. 

&nbsp;Для того, чтобы стать Сатанистом, вовсе необязательно продавать Дьяволу душу или заключать договор с Сатаной. Эта страшная сказка была придумана христианством для того, чтобы люди не отбивались от паствы. Указующими перстами и дрожащими голосами попы поучали своих прихожан, что если те поддадутся искушениям Сатаны и проживут свои жизни в соответствии со своими естественными наклонностями, то должны будут заплатить за свои грешные удовольствия передачей душ Сатане и вечными муками в Аду. Людей заставляли верить, что незапятнанная душа - пропуск в вечную жизнь. 

&nbsp;Ханжеские пророки научили людей бояться Сатану. Но как же тогда быть с такими терминами, как "богобоязнь"? Если Бог столь милостив, зачем тогда людям бояться его? Неужели можно поверить, что от страха просто некуда деться? Если надо бояться Bora, то почему бы тогда не прекратить быть "Сатанобоязненным" и, по крайней мере, тешиться хотя бы отрицанием своей богобоязни? Вез этого всеобъемлющего страха у набожников нечем было бы поддерживать свое влияние на прихожан. 

&nbsp;Тевтонская богиня смерти и дочь Локи носила имя Хела. языческого бога пытки и наказания, еще одна буква "л" была прибавлена к ее имени во времена написания книг Ветхого Завета. Евангелисты не знали слова "Хелл" (Hell (англ.) - ад) и пользовались еврейским словом "Шеол", греческими "Галес" (могила) и "Тартарос" (нижний мир, подземное жилище падших ангелов), а также ивритским словом "Геена" (название долины неподалеку от Иерусалима, где правил Молох и сжигался мусор - вот откуда христианская церковь развила идею "огня и серы" в Аду). 

&nbsp;Ад в представлении протестантов и католиков - место вечного наказания; однако, католики веруют, что есть "Чистилище", куда после смерти на некоторое время попадают все души, и "Лимб" (преддверие Ада), где оказываются все некрещеные души. Буддийский Ад разделен на восемь частей, первые семь из которых можно избежать путем искупления. Экклезиастское описание Ада представляет его в виде ужасного места огня и мучений; Инферно у Данте и Ад северных народов видится холодной, обледеневшей местностью, гигантским холодильником, (Со своими угрозами вечного проклятия и поджаривания души в Аду христианские миссионеры сталкивались с полным непониманием некоторых народов, которые не желали усваивать их бред. Наслаждение и боль, как и красота, - в глазах смотрящего. Так, например, когда миссионеры, прибывшие на Аляску, стали пугать эскимосов огненными ужасами Ада и пылающими озерами, ожидающих грешников, те нетерпеливо вопросили: "Как же нам поскорее попасть туда?") 

&nbsp;Большинство Сатанистов не принимают Сатану как антропоморфное существо с раздвоенными копытами, хвостом с кисточкой и рогами. Он просто олицетворяет собой силы природы - Силы Тьмы, названные так только потому, что ни одна религия не удосужилась забрать эти силы у тьмы. Наука также была не в состоянии приложить техническую терминологию к этим силам. Они - как сосуд без крана, которым воспользовались очень немногие люди, поскольку не все обладают способностью применить орудие, не разобрав его сначала и не дав названий всем частям, что заставляют его работать. Именно это постоянное желание все анализировать препятствует многим людям воспользоваться преимуществами этого многогранного ключа к неведомому - которому Сатанисты дали имя "Сатана". Сатана как бог, полубог, личный спаситель или в какой бы роли вы бы не хотели видеть его, был изобретаем всеми основателями всех религий с одной единственной целью - властвовать над всеми человеческими, так называемыми нечистыми деяниями и местами на земле. Все, выражающееся в физическом или духовном удовлетворении, было определено как "зло", обеспечив, таким образом, каждого на всю жизнь грехом недозволенности! 

&nbsp;Но коль скоро они назвали нас "злом", зло мы и есть - и что же? Впереди - эпоха Сатаны! Почему же не воспользоваться ее благами и ЖИТЬ?@{"i"} 
(В оригинале: LIVE (жить) значит EVIL (зло) наоборот.)@{"ui"} 
 ---

 ---

 ---

 ---

 ---

@endnode
