/* Example48-2 */

CALL TRACE('R')
DO X = 1 to 5
  SAY 'X Loop =' X
END

CALL TRACE('?')
DO Y = 1 to 5
  SAY 'Y Loop =' Y
END

CALL TRACE('?A')
DO Z = 1 to 5
  SAY 'Z Loop =' Z
END
