/* Example47-12 */

CALL TRACE('R')

Count = 1
SAY 'Trace option is "R" - Count =' Count

CALL TRACE('O')

Count = Count + 1
SAY 'Trace option is "O" - Count =' Count

CALL TRACE('I')

Count = Count + 1
SAY 'Trace option is "I" - Count =' Count

