/* Example47-3 */

/* This program contains an intentional error for SCAN to pick up */

TRACE('S')

DO Count = 1 to 10000
  SAY 'Count =' count
END

END

SAY 'Count is over at last'

