@DATABASE opium.newmail.ru:666/19s.htm
@WORDWRAP

@NODE MAIN
@TITLE " Ave Satanas..."
 
   @{" " link "18s.guide/MAIN"}@{"../pau.gif" link "../pau.gif/MAIN"}
Назад    Черная Библия "Книга Белиала
 (Земля)"    @{" " link "20s.guide/MAIN"}@{"../pau0.gif" link "../pau0.gif/MAIN"}
Дальше 

Ритуальная комната или комната интеллектуального раскрепощения 

&nbsp;Магическую церемонию можно выполнять как в одиночку, так и группой, однако, преимущества и того и другого должны быть разъяснены. 

&nbsp;Конечно, групповой ритуал намного сильнее укрепляет веру и придает силы, нежели индивидуальная церемония. Собрание людей, преданных общей философии, непременно гарантирует обновление веры в силу магии. Зрелищность религии - это то, что всегда ее поддерживало. Всякий раз, когда религию начинают практиковать в одиночку, она доходит до форм самоотречения, уподобленных антиобщественному поведению. 

&nbsp;Вот почему, Сатанист должен попытаться найти других, - тех, с кем он мог бы выполнять эти церемонии. В случае проклятия или разрушительного ритуала, если желания чародея усиливаются другими членами группы, это иногда может помочь ему. В этом типе церемонии нет ничего такого, что могло бы смутить тех, кто выполняет ритуал данного вида, так как гнев и символическое уничтожение намеченной жертвы -необходимые составные части. С другой стороны, благотворный ритуал с его ничем не стесненным пролитием слез, или сексуальный ритуал с его мастурбацнонными и оргазматическими обертонами, скорее всего, пройдет успешнее, если будет выполняться в одиночку. 

&nbsp;В ритуальной комнате нет места застенчивости, если только эта самая застенчивость не является составной частью исполняемой роли и может быть выгодно использована - то есть: стыд, испытываемый благопристойной женщиной, служащей алтарем, которая вследствие своего смущения чувствует сексуальное возбуждение. 

&nbsp;Тем не менее, даже в исключительно индивидуальном ритуале нужно использовать стандартные предварительные заклинания и средства, прежде чем произойдет инсценировка сокровенных фантазий. Формальную часть ритуала можно выполнять в той же самой комнате или помещении, в котором будет производиться индивидуальная часть, либо же, формальную церемонию можно выполнить в одном месте, а индивидуальную - в другом. Церемонию следует начинать и заканчивать в пределах ритуальной комнаты, содержащей символические средства (алтарь, чаша и т, д.) Формальное начало и окончание церемонии служат категоричным анти-интеллектуальным средством, цель которого - отделить деятельность и систему восприятия, существующие во внешнем мире, от той деятельности и восприятия, что присущи ритуальной комнате, где воля должна быть использована целиком. Этот элемент церемонии ВАЖНЕЕ всего для интеллектуала, так как ему ОСОБЕННО необходим эффект "декомпрессионной комнаты" - песнопения, колокольный звон, свечи и другие аксессуары церемонии, прежде чем он сможет заставить свои чистые и волевые желания работать на себя путем проецирования и использования своих образов. 

&nbsp;"Комнату интеллектуального раскрепощения" в Сатанинском храме можно считать школой воспитания временного невежества, так же как и во ВСЕХ религиозных службах! Разница заключается в том, что Сатанист ЗНАЕТ, что он практикует форму умышленного невежества, в то время как приверженец другой веры не знает - или, если все-таки знает, но практикует такую форму самообмана, которая запрещает ему это признать. Его индивидуальность уже настолько ослабла от привитых ему религиозных взглядов, что он не может позволить признаться самому себе в невежестве, которое он сам и поддерживает. 
 ---

 ---

 ---

 ---

 ---

@endnode
