@DATABASE opium.newmail.ru:666/1_2s.htm
@WORDWRAP

@NODE MAIN
@TITLE " Ave Satanas..."
 
   @{" " link "1_1s.guide/MAIN"}@{"../pau.gif" link "../pau.gif/MAIN"}
Назад    Черная Библия Предисловие Антона ЛаВея.    @{" " link "1_3s.guide/MAIN"}@{"../pau0.gif" link "../pau0.gif/MAIN"}
Дальше 



&nbsp;Эта книга написана по той причине, что, за небольшим исключением, все трактаты и книги, все "тайные" гримуары, все "великие труды" по вопросу магии являются не более, чем ханжеским мошенничеством, греховодным бормотанием и эзотерической тарабарщиной хроникеров магических знаний, не способных или не желающих предоставить объективную точку зрения на этот вопрос. Писатель за писателем, пытаясь означить принципы "белой и черной магии", преуспели лишь в таком затуманивании объекта рассмотрения, что человек, самостоятельно изучающий волшебство, проводит свои занятия за глупым стоянием в пентаграмме в ожидании появления демона, тасованием колоды карт для предсказания будущего, теряющего в картах свой смысл, и присутствием на семинарах, гарантирующих лишь расплющивание его эго(а заодно и бумажника); и, в итоге, выставляет себя круглым идиотом в глазах тех, кто познал истину! 

&nbsp;Настоящему магу известно, что оккультные полки ломятся от хрупких мощей запуганных душ и бесплодных тел, метафизических дневников самообмана и вызывающих запор сводов правил восточного мистицизма. Слишком долго вопросы Сатанинской магии и философии освещались правоверными писаками с глазами, широко вытаращенными от обуявшего их страха. 

&nbsp;Старая литература является отходами мозгов, гноящихся от страха и бессилия, излитых бессознательно в помощь тем, кто на самом деле правит миром, злорадно посмеиваясь со своих адских тронов. Пламя Ада горит ярче благодаря топливу, доставленному этими томами седой дезинформации и лжепророчества. 

&nbsp;Здесь же вы найдете правду и фантазию. Каждая необходима для существования другой, но должна приниматься за то, чем она является на самом деле. То, что вы увидите, не всегда может прийтись вам по нраву, но - вы увидите! 

&nbsp;Здесь - Сатанинская мысль с истинно Сатанинской точки зрения. 

Антон Шандор ЛаВей
 Церковь Сатаны
 Сан-Франциско,
 Вальпургиева ночь 1968 г. н.э. 
 ---

 ---

 ---

 ---

 ---

@endnode
