<html>
<head>
<!--     "Wolf Zimmer"     -->
<title>XiPaint.guide</title>
</head>
<body background="xbg.jpg" text="#000000" link="#0000ff" vlink="#000080"
alink="#ffff00" bgcolor="#c0c0c0">
<br><center>
<table border=0 width=90%><tr><td><br>

<h3><b>Sehr geehrter XiPaint-User!</b></h3>

<p>Vielen Dank, da&#223; Sie sich f&#252;r dieses Produkt entschieden haben.
XiPaint 4.0 bietet viele Neuerungen - und es wird immer weiter
entwickelt. Damit Sie zu dem Werkzeug auch die richtige Umgebung
haben, habe ich mich schon bei der Version 3.2 dazu entschlossen,
eine CD herauszubringen. </p>

<p>Viele werden nun meinen, da&#223; ein Malprogramm gerade am Amiga doch
nie eine CD f&#252;llen kann. Richtig. Es ist aber nicht nur ein
Programm, was XiPaint ausmacht. Es sind eine F&#252;lle von Ein- und
Ausgabemodule, Hilfsmittel und zu guter Letzt Bilder, die die
CD f&#252;llen. Und noch etwas: das Handbuch. Um Ihnen das Produkt
kosteng&#252;nstig anbieten zu k&#246;nnen, wurde die CD ohne Handbuch
auf Papier geliefert. </p>

<h3><b>Handbuch</b></h3>

<p>Statt dessen gibt es das Handbuch im AmigaGuide-Format mit Hyperlinks
und als ASCII-File. Weiters sind druckbare Files f&#252;r einen
HP-Laserdrucker, einem Deskjet und einem Postscriptdrucker
vorhanden. So k&#246;nnen Sie diese, wenn Sie es wollen, auch ausdrucken. </p>

<p>Das Handbuch bekommen Sie auch f&#252;r einen Unkostenbeitrag bei
MacroSystem in Witten. Es handelt sich dabei um das Handbuch
zur Version 3.0. Auch die druckbaren Files sind f&#252;r XiPaint 3.0
geschrieben worden. Da sich aber zur Version 3.2 als auch 4.0 nicht
die Bedienung sondern die Vielfalt ge&#228;ndert hat, so glaube ich,
da&#223; dies ein Neudrucken bzw. Neuschreiben eines Handbuches nicht
rechtfertigt. </p>

<p>Zum Ausdrucken brauchen Sie nur die jeweilige Datei zum Drucker
kopieren, das jeweilige Icon erledigt das f&#252;r Sie. </p>

<h3><b>Shareware</b></h3>

<p>Weiters wird zu XiPaint die multipic.library mitgeliefert, die
von MacroSystem zur Verf&#252;gung gestellt wurde und dessen Copyright
hat. Von Helmut Hoffmann habe ich Demotreiber zum Laden von
Bildern in verschiedensten Formaten bekommen. Diese befinden sich,
ebenso wie der Wacom-Treiber von Roland Schwingel in der
Shareware-Schublade. M&#246;chten Sie sich f&#252;r diese Treiber registrieren
lassen, so finden Sie in der Shareware-Schublade n&#228;here Texte, wie
dies zu tun ist. </p>

<p>Ganz etwas besonderes ist ebenfalls im Shareware-Verzeichnis: die
Graffity-Emulation f&#252;r Omnibus, Picasso Domino Graffity und Merlin.
Eine Workbenchemulation, die mit diesen Grafikkarten
hervorragend umgehen kann. Und f&#252;r XiPaint ergibt sich so eine
wesentliche Vereinfachung: es mu&#223; nur ein Treiber f&#252;r mehrere
Grafikkarten geschrieben werden. All den Autoren vielen Dank, da&#223;
ich diese Programme mitliefern darf. Bitte vergessen Sie nicht,
den Autoren  dieser Shareware-Programme - falls sie diese Programme
verwenden - einen Obulus zuzusenden! </p>

<h3><b>Ausgabetreiber</b></h3>

<p>Auf dieser CD sind die Ausgabemodule f&#252;r folgende Grafikadapter
enthalten: <ul>

<li> Amiga 256 Farben  </li>
<li> Amiga HAM6 und HAM8 </li>
<li> Cybergfx </li>
<li> EGS </li>
<li> Framemaster 2 </li>
<li> Graffity </li>
<li> Merlin (mit ProDev Erweiterung, ungetestet) </li>
<li> Picasso </li>
<li> VD2001 </li>
<li> Retina </li></ul>

<p>Merlin-Treiber bei der Firma ProDev zu erhalten. Der
auf der CD beigepackte Treiber kann abst&#252;rzen. Es war mir leider bis
heute nicht m&#246;glich, die Merlin zu b&#228;ndigen (Entschuldigung!). Mittels
der Graffity-Erweiterung ist es jedoch m&#246;glich, XiPaint und eine
Merlin zu kombinieren (:-)). </p>

<h3><b>XiPaint-Modul 4.2</b></h3>

<p>Das Universal-Lademodul fuer XiPaint ist Shareware
(Einzelpreis 20DM; 10DM als Aufpreis bei Bestellung
von CyberShow Professional, dem SlideShow-Programm fuer OS3.x
inkl. CyberGraphX-Unterstuetzung; Demo in der Shareware-Schublade.
Die Demo-Versionen arbeiten nur in Graustufen). </p>

<p>Zusatzfunktionen des Moduls: <ul>

<li> Skaliertes Laden (nuetzlich bei Speichermangel) in 50% und 25%-Groesse </li>
<li> Echtfarb-Animationserzeugung fuer CyberGraphX (oder EGS) </li></ul></p>

<p>Ladeformate des Moduls: <ol>

<li>) IFF-ILBM (all standard formats 1 to 8Bit, EHB, HAM6, HAM8, 24Bit)
<li>) PhotoCD (Base format 768x512 or 512x768 (portrait); linear 24Bit RGB)
<li>) JPeg (color and greyscale)
<li>) PPM/PGM/PBM (P1&P4 b&w, P5 grey, P6 color)
<li>) QRT (also known as dump format by PD raytracers as POV-Ray)
<li>) Targa (RLE compr.&uncompr. 1/8/15/16/24/32Bit; incl. interleaved)
<li>) PCX (compr.&uncompr. EGA1-4Bit, VGA 8Bit grey/Colormap and 24Bit)
<li>) BMP (uncompr. 24Bit RGB,1Bit,4Bit or 8Bit Colormap; RLE compressed 8Bit,1Bit)
<li>) TIF (packbit-compr.&uncompr. 24Bit,1-8Bit grey/Color Motorola&Intel formats)
<li>) EGS7.x window icons
<li>) DEEP (compr.&uncompr. IFF-DEEP 24Bit and 32Bit formats)
<li>) YUV (color 1:1:1, 2:1:1, 4:1:1 and greyscale)
<li>) VLAB raw (color 1:1:1, 2:1:1, 4:1:1 and greyscale)
<li>) RGB (IFF-RGB: RGB8 and RGBN compressed; RGB5 uncompressed)
<li>) HHsYUVSq sequence format (sequential or random access)
<li>) IFF-PBM (DPII) format
<li>) ACBM (IFF-ACBM: 1 to 8Bit, EHB, HAM6, HAM8)
<li>) FBM (8Bit grey/Colormap and 24Bit)
<li>) Sun raster (uncompressed formats for 1Bit, 8Bit grey/ColorMap and 24Bit)
<li>) MacPaint (b&w compressed 1Bit format; datafork only)
<li>) HHsXRL formats (1-8Bit ColorMap incl. HAM6/8, 8Bit grey, 24Bit RGB compressed)
<li>) binary-EPS bitmaps (RGB and CMYK; this function is experimental)
<li>) TBCPlus frames&fields </li></ol></p>
<br>
<table><tr><td valign=top>Bezugsquelle:</td>
 <td> Helmut Hoffmann <br>
      Rubensstrasse 4 <br>
      D-41063 Moenchengladbach <br>
      Deutschland </td></tr></table>

<h3><b>Probleme</b></h3>

<p>Sollte es Probleme mit XiPaint geben (Konnte Library nicht finden etc.),
so befindet sich auf der CD das Programm xpinit. Starten Sie dieses von
der Shell aus, jedoch von der selben Stelle aus, wo sich XiPaint befindet. </p>

<p>Es sagt Ihnen, von wo aus die Libraries gestartet werden und welche
Versionen gefunden wurden. </p>

<p>Sollte sich trotz allem XiPaint nicht starten lassen, so kopieren
Sie alle Xipaint/libs/#? - Libraries nach libs: </p>

<p>Sollte bei Ihnen, obwohl Sie ein VLAB besitzen, in XiPaint das Men&#252;
nicht aufgehen, in dem man digitalisieren kann, so starten Sie bitte
XiPaint von einer Shell aus mit der Option 7. Dieser Fehler wird in
der n&#228;chsten Version behoben sein. </p>

<p>Haben Sie Probleme beim Laden der Bilder? Vielleicht haben Sie im
Systemverzeichnis das Lademodul noch auf Internal-DEEP gestellt.
W&#228;hlen Sie z. B. multipic als Modul aus. Ebenso beim Speichern. </p>

<p>Der folgende Fehler wurde in dieser Version von XiPaint noch behoben:<ul>
<li> Die Funktion Bild zu Pinsel erh&#228;lt nun die Bildgr&#246;&#223;e </li></ul></p>

<p>Der folgende Fehler ist bekannt:<ul>
<li> Der Progress-Anzeiger des Raytracers ist zu langsam </li></ul></p>

<h3><b>Danke</b></h3>

<p>Ein ganz gro&#223;es Dankesch&#246;n m&#246;chte ich noch meinen Betatestern sagen:
<blockquote>
  Tobias Abt  <br>
  Helmut Hoffmann  <br>
  Stevan Rankic <br>
  Hartwig Tauber
</blockquote>

<p>Viel Spa&#223; beim Arbeiten mit XiPaint <br>

w&#252;nscht Thomas Dorn und Herbert Beilschmidt <br>

Wien, M&#228;rz 1996  </p>

<h3><b>Adressen:</b></h3>
<pre>
NoahJi's Inc.
3591 Nyland Way
Lafayette, CO 80026
USA
Fax: ++1 303 4991979
NoahJi's:
3591 Nyland Way
Lafayette, Co 80026
(303) 499-1975  voice
(303) 499-1979  Fax
(303) 969-8967 BBS
draco.com!eric


MacroSystem
Borg&#228;cker 2-6
D-58454 Witten
GERMANY
Phone: ++49-2302-949490
FAX:   ++49-2302-949499


ProDev
Marcel Jantz
Eichendorfstr. 9
Germany
D-53859 Niederkassel
Phone: ++49-6556-7536


Thomas Dorn
A-1210 Vienna
Kerpengasse 69
Fido: 2:310/98.0
Internt: tdorn@xipaint.co.at
Mailbox, Fax: ++43-1-2714549
</pre>

<h3><b>Magazine !</b></h3>

<p>XiPaint ist in der Lage, Screenshots zu machen. Dazu m&#252;ssen Sie XiPaint
nur von einer Shell aus starten mit der Option 7 (xipaint 7). Durch
dr&#252;cken der Taste PrtSc wird im aktuellen Verzeichnis eine Datei
namens Screendump000 ... erzeugt. Dieses ist im DEEP-Format, welches Sie
mit XiPaint bequem umwandeln k&#246;nnen. </p>

<h3><b>&#220;bersetzer!</b></h3>
<p>Fehlen Hilfetexte - oder Sie m&#246;chten die richtige Datei finden und &#228;ndern?
Starten Sie XiPaint mit der Option 7 von einer Shell aus und dr&#252;cken Sie
die Hilfe-Taste. In der Shell wirt die Nummer des Hilfetextes ausgegeben.</p>
<pre>

TTTTTTTT    X     X
   T         X   X
   T          X X
   T           X
   T          X X
   T         X   X
   T        X     X .....

Vielen Dank an Stefan Ossowski f&#252;r diese CD!

Stefan Ossowskis Schatztruhe
Veronikastr. 33
D-45131 Essen
Deutschland
</pre>
</td></tr></table></center>

<hr size=4>
<br>
</body>
</html>
