<HTML>
<HEAD><TITLE>Manuale in linea di Foundation - Sadeness Software &amp; Paul Burkey 1997/1998</TITLE></HEAD>

<BODY BGCOLOR="#000000" LINK="#FF0000" VLINK="#DD0000" text="#FFFFFF" background="gifs/background.gif">

<TABLE CELLSPACING=5 border=0 width=100%>
<td align=center valign=bottom width=300 colspan=2>
<IMG SRC="gifs/pb.gif" width=110 height=75 ALT="Paul Burkey" align=left>
<IMG SRC="gifs/sad-bar-fade.gif" width=300 height=75 ALT="Sadeness" align=left>
</td>

<TD COLSPAN=1 VALIGN=bottom ALIGN=right>
<IMG SRC="gifs/redline.gif" width=274 height=7 alt="--">

<tr>
<TD VALIGN=top align=center ROWSPAN=6 width=130>
</td>

<tr>
<TD VALIGN=top ALIGN=left COLSPAN=2>

<P>

<center>
<img src="gifs/found-logo.gif" width=350 height=104 alt="Foundation Logo">
</center>

<P>

<center>
<img src="gifs/found-line.gif" width=315 height=47 alt="Foundation Line"><p>
</center>


<p align="center"><font size="6">Foundation - Prologo</font><font size="7"><br>
</font><i>Scritto da: Jason Hayman</i></p>

<p><font size="3"></font>&nbsp;</p>

<p><font size="3">
Era una stanza poco interessante, buia e senza pretese, uguale a un qualsiasi
ufficio di avvocato. I libri riempivano gli scaffali che
si allungavano fino al soffitto e rotoli di pergamena, ingialliti
dall'et&agrave;, spuntavano disordinatamente dagli angoli oscuri, ad eccezione
di alcuni scomodamente inseriti in una sorta di portaombrelli a forma
di zampa di elefante.</font></p>

<p><font size="3">
In fondo alla stanza si trovava una scrivania; un legno scuro incrinato
dalle crepe e raggrinzito come il vecchio uomo che vi sedeva dietro.
Una sola lampada elettrica illuminava la sua scrivania, diffondendo il suo
tremulo bagliore elettrico sulle carte che il vecchio dall'aspetto
desolato stava furiosamente scarabocchiando. La forte luce conferiva
un aspetto sacro e spettrale al suo volto attempato. Dietro all'uomo
intento a scrivere, circondata da altri altissimi scaffali che
sembravano pronti a crollare sotto il peso dei libri, si trovava una porta
piuttosto insignificante che avrebbe potuto facilmente condurre a un bagno o,
ancora peggio, all'ufficio di un contabile.</font></p>

<p><font size="3">
Dei passi nel corridoio causarono un momento di incertezza
nella scrittura dell'uomo. Si ferm&ograve; per un istante, diede uno
sguardo alla porta di fronte a lui, quindi torn&ograve; a scrivere
freneticamente.</font></p>

<p><font size="3">
La porta si apr&igrave; bruscamente; un raggio di luce bianca riemp&igrave;
met&agrave; della stanza, illuminando la parte pi&ugrave; lontana dello
studio e facendo ritirare i vecchi libri polverosi ancora di
pi&ugrave; nell'oscurit&agrave; dei loro scaffali, per sentirsi al sicuro.</font></p>

<p><font size="3">&quot;Gibbons, per favore, chiudi la porta alle
tue spalle&quot; disse il vecchio, con una punta di fastidio nella
sua voce cupa.</font></p>

<p><font size="3">
La porta, cigolando, si chiuse. La figura agile di un uomo esile,
scheletrico, arriv&ograve; fino alla scrivania, quasi come scivolando.
&quot;Buone notizie, signore!&quot; disse a stento l'individuo, con una
voce allegra, ma terribilmente seccante. All'uomo seduto dietro la scrivania
questa voce faceva sempre venire in mente un gatto chiuso in una lavatrice
durante la centrifuga.</font></p>

<p><font size="3">
Non ci fu risposta, l'uomo continuava a scrivere freneticamente. Gibbons
si guard&ograve; intorno imbarazzato, il bianco dei suoi occhi era l'unica
caratteristica distinguibile nello scuro, oppressivo bagliore della
stanza. Odiava essere ignorato dal suo padrone, e inizi&ograve; a contorcersi
le mani con fare impacciato.</font></p>

<p><font size="3">&quot;Vai avanti, Gibbons. Stiamo perdendo
tempo.&quot;</font></p>

<p><font size="3">&quot;Signore, credo di aver trovato le ultime
persone che stavate cercando.&quot;</font></p>

<p><font size="3">L'uomo smise di scrivere e mise gentilmente la penna a
riposare sulle carte, quindi alz&ograve; lo sguardo e guard&ograve; Gibbons dritto negli
occhi, inarcando un sopracciglio. &quot;Tutti?&quot; chiese scetticamente,
come se reputasse l'impresa impossibile. La figura alta e ombrosa
annu&igrave; vigorosamente. Era sempre felice di compiacere il suo padrone.
&quot;Ebbene?&quot; chiese impaziente il vecchio dopo un momento
di silenzio.</font></p>

<p><font size="3">
Gibbons guard&ograve; sperduto il suo padrone finch&eacute; non realizz&ograve; cosa voleva
dire. &quot;Ah! Li devo far entrare, vero?&quot;</font></p>

<p><font size="3">&quot;S&igrave; Gibbons. Per favore&quot; fu la risposta
seccata del suo padrone.</font></p>

<p><font size="3">
Inchinandosi abbondantemente, l'alto figuro si spost&ograve; lentamente
all'indietro verso la porta e quindi lasci&ograve; la stanza. Dopo qualche
istante si ud&igrave; un colpo sordo alla porta.</font></p>

<p><font size="3">&quot;Avanti!&quot; disse il vecchio con con un tono
di voce leggermente pi&ugrave; cordiale.</font></p>

<p><font size="3">
La porta si apr&igrave; ed un uomo alto, ben piazzato e con il volto scolpito
nella roccia entr&ograve; nella stanza. Lunghi e ricci capelli rossi che
strusciavano sulle sue spalle, un abito grigio con un ricamo a zig-zag
sugli orli delle maniche e la fattura dell'orlo mostravano una raffinatezza
nel suo vestire che alcuni degli altri &quot;clienti&quot; che avevano
visitato questa stanza in passato non possedevano.</font></p>

<p><font size="3">
&quot;Prego, si sieda.&quot; il vecchio disse al prestante straniero
senza alzarsi dalla sua stessa sedia. L'uomo sembr&ograve; inizialmente
scettico, ma poi tir&ograve; fuori la sedia da sotto la scrivania e si
sedette lentamente, senza che i suoi acuti occhi blu smettessero
di fissare quelli del vecchio per un solo momento.</font></p>

<p><font size="3">
&quot;Mi &egrave; stata offerta una vacanza?&quot; disse l'uomo dai
capelli rossi, con un tono parzialmente interrogativo. Sembrava
ancora sospettoso e a disagio. &quot;Una vacanza <i>speciale</i>?&quot;
</font></p>

<p><font size="3">
&quot;Esatto, signore!&quot; disse il vecchio dietro la scrivania con
una voce allegra e ben impostata. &quot;Una vacanza come non l'avete
mai fatta prima!&quot;</font></p>

<p><font size="3">
Il robusto uomo lo fiss&ograve; a lungo, intensamente, prima di fare
la domanda successiva. &quot;Ed &egrave; gratis?&quot;</font></p>

<p><font size="3">
Il vecchio fece un sorriso vincente. &quot;S&igrave;, signore. Per persone
come lei.&quot; L'uomo ancora non sembrava convinto. &quot;Lo veda come
un gioco. Quando perde, la vacanza finisce e lei viene riportato
nel posto in cui il Sig. Gibbons l'ha incontrata.&quot; Il vecchio
riusciva a vedere che la diffidenza stava lentamente scomparendo
dal volto dello straniero. &quot;Sar&agrave; come vivere un'altra vita,
ricominciando tutto da capo in un mondo dominato dalla magia e dagli
D&egrave;i.&quot;</font></p>

<p><font size="3">
&quot;D&egrave;i! Hah!&quot; tuon&ograve; l'imponente uomo. &quot;Ne ho
abbastanza della Chiesa! Non sono altro che prepotenti e spilorci!&quot;</font></p>

<p><font size="3">
Il vecchio sorrise. &quot;Le assicuro, signore, che nessuno la
comander&agrave; in questo mondo. In questo mondo tutti i suoi sogni
diventeranno realt&agrave;.&quot; La durezza improvvisamente scomparve
dal volto del grosso uomo.</font></p>

<p><font size="3">
&quot;Sogni. S&igrave;! Io ho un sacco di sogni&quot; l'uomo sorrideva
ampiamente. &quot;Sa, ho questa idea di un pallone pieno di
aria calda. Vede, l'aria calda si alza, sollevandovi da terra!&quot;
</font></p>

<p><font size="3">
&quot;Certamente, signore. Le posso garantire che quel sogno
si avverer&agrave; in questa vacanza.&quot; Il vecchio si sporse sulla
sua scrivania. &quot;&Egrave; per questo che vogliamo lei, signore.
Lei &egrave; un inventore, un sognatore, questo &egrave; il tipo di persone
per cui &egrave; fatto questo mondo.&quot; Vedeva che lo straniero aveva
abboccato al proverbiale amo. &quot;Naturalmente, lei potrebbe
rispondere `no' e niente di tutto questo accadrebbe.&quot;</font></p>

<p><font size="3">
Il grande uomo si svegli&ograve; dal suo sogno ad occhi aperti.
&quot;Vorrei accettare la vacanza!&quot; disse con una voce ferma
e determinata.</font></p>

<p><font size="3">
&quot;Eccellente!&quot; disse il vecchio, raggiante. Egli apr&igrave; un cassetto
e tir&ograve; fuori un pezzo di carta. &quot;Ho solo bisogno di prendere
nota di alcuni dettagli, signore.&quot; Il vecchio scrisse qualcosa
sulla pagina e poi, senza alzare lo sguardo, chiese &quot;Il suo nome,
signore, per favore.&quot;</font></p>

<p><font size="3">&quot;Da Vinci.&quot; rispose il grande uomo.
&quot;Leonardo Da Vinci.&quot;</font></p>

<p><font size="3">&quot;Occupazione?&quot;</font></p>

<p><font size="3">&quot;Artista, scultore, inventore.&quot;</font></p>

<p><font size="3">
&quot;Grazie, signore. Solo una firma qui, in fondo a questa dichiarazione,
per favore.&quot; Diede all'artista il foglio di carta sul quale
aveva scritto fino a quel momento. &quot;Qui, signore&quot;, indic&ograve;
il vecchio, &quot;sulla linea tratteggiata.&quot;</font></p>

<p><font size="3">
Con enfasi, Leonardo Da Vinci scrisse il suo nome.</font></p>

<p><font size="3">
&quot;Ora, signore, se vuole venire da questa parte&quot; il vecchio
si alz&ograve; maestosamente dalla sedia facendo cenno all'artista di camminare
verso la semplice porta di legno che era dietro la scrivania.
Afferrandone la maniglia, il vecchio apr&igrave; la porta e invit&ograve; Leonardo
ad entrare. &quot;Se vuole gentilmente entrare, signore, possiamo
passare all'ultima fase del contratto.&quot;</font></p>

<p><font size="3">
La stanza oltre la porta era buia e sospetta. Leonardo guard&ograve; il vecchio,
che sorrideva cordialmente come un gatto che ha appena avuto il suo latte.
&quot;&Egrave; sicuro? Sembra parecchio buio l&igrave; dentro.&quot;</font></p>

<p><font size="3">
&quot;Tutto sar&agrave; presto chiarito, signore.&quot; Il vecchio invit&ograve;
nuovamente l'artista ad entrare. Con cautela, Leonardo fece i primi
passi incerti che lo portarono nell'oscurit&agrave;. Si guard&ograve; intorno
e lanci&ograve; al vecchio uno sguardo preoccupato. &quot;Stia tranquillo,
signore, va tutto bene.&quot; Improvvisamente la stanza inizi&ograve;
a riempirsi di luce. Leonardo si guard&ograve; intorno, spaventato dal
bagliore accecante. &quot;Si metta a suo agio, signore. La sua
vacanza sta per iniziare.&quot;</font></p>

<p><font size="3">
Il vecchio chiuse la porta e torn&ograve; alla scrivania. Raggi di luce
fuoriuscivano dagli spazi tra la porta e il suo stipite. Particolarmente
indifferente, il vecchio continu&ograve; a scrivere sul foglio di carta e poi lo
ripose con cura nella sua scrivania. La sua stanza era ormai piena
di raggi di luce roteanti, mentre i libri fortemente illuminati davano
l'effetto di volti incisi sui loro dorsi e sulle loro copertine.
Sembravano ridere.</font></p>

<p><font size="3">&quot;Wwwwwaaaaaahhhhhhhh&quot; <i>POP!
Fiiizzzzzz!</i> Il lamento di Leonardo fu improvvisamente interrotto
a met&agrave;, e i brillanti raggi di luce che si infiltravano dalla
misteriosa stanza svanirono.</font></p>

<p><font size="3">
Tranquillamente, il vecchio chiuse il cassetto della sua scrivania
e poi si pieg&ograve; verso una scatola piena di pulsanti. Ne premette
uno e la scatola emise un sibilo. &quot;Fai entrare il prossimo,
Gibbons.&quot; disse egli, freddamente.</font></p>

<p><font size="3">Dopo alcuni istanti, si sent&igrave; nuovamente bussare.</font></p>

<p><font size="3">&quot;Avanti!&quot; disse il vecchio.</font></p>

<p><font size="3">
La porta si spalanc&ograve; e la sagoma larga e <i>bassa</i> di un uomo
apparve al suo interno. La luce filtrava lentamente nell'ufficio,
e il vecchio iniziava a distinguerne le caratteristiche. Il piccolo,
tarchiato uomo indossava delle spalline di metallo e una corazza
modellata a immagine del petto di un uomo forte. Sotto l'armatura
indossava una tunica bianca, le maniche terminavano ai suoi gomiti
e l'oro ne ornava gli orli. Un altro uomo ricco, pens&ograve; il vecchio.
Stranamente, il basso individuo sulla porta indossava un gonnellino
e stivali alti fino al ginocchio stretti ai suoi polpacci pelosi.
Una spada era legata alla sua vita, ed egli teneva la mano comodamente
a riposo sull'elsa come un uomo che non ha paura di uccidere.</font></p>

<p><font size="3">
&quot;Si sieda, prego&quot; fu l'invito del vecchio.</font></p>

<p><font size="3">
Il soldato si guard&ograve; intorno, poi tir&ograve; fuori la sedia con forza e si
sedette. &quot;Mi &egrave; stato detto di venire qui!&quot; egli tuon&ograve;. Drizz&ograve;
la testa voltandosi e fiss&ograve; il vecchio con i suoi fieri occhi blu.
&quot;Per un <i>gioco</i>.&quot; Si abbass&ograve; sulla scrivania. &quot;Un
gioco di guerra progettato dagli D&egrave;i&quot;, disse in modo sinistro,
ammiccando</font></p>

<p><font size="3">&quot;Infatti, signore! Ed &egrave; proprio un gioco
grandioso!&quot;</font></p>

<p><font size="3">
Il militare guard&ograve; in giro per la stanza. &quot;Libri!&quot; url&ograve;
con disprezzo. &quot;Dai libri non viene nulla di buono!&quot; Torn&ograve;
a fissare freddamente il vecchio. &quot;Dove sono le tue spade, gli scudi,
le teste conficcate sui pali?&quot;</font></p>

<p><font size="3">
Il vecchio si appoggi&ograve; sulla sedia, sorvolando con indifferenza
sull'accidentale commento dello straniero. &quot;Questo &egrave; un passaggio,
signore. Oltre quella porta&quot;, il vecchio si gir&ograve; leggermente sulla
sedia indicando la insignificante e ora inquietante porta, &quot;vi &egrave;
un mondo pieno di violenza e guerra, pestilenze e carestie. Al di l&agrave;,
signore, sono i suoi sogni.&quot;</font></p>

<p><font size="3">&quot;Donne?&quot; chiese il soldato, guardando il vecchio
di traverso, con sospetto.</font></p>

<p><font size="3">&quot;Certamente, signore. E alcool&quot;, disse
dolcemente.</font></p>

<p><font size="3">
Il soldato sorrise, un ampio sorriso che mostrava i suoi denti bianchi.
Il vecchio non sbagliava mai nell'individuare i punti deboli.</font></p>

<p><font size="3">
&quot;E se muoio, io non muoio?&quot; Lo straniero sembrava confuso
da questa frase, come se la stesse tirando fuori da un ricordo
poco chiaro.</font></p>

<p><font size="3">
&quot;Se lei muore in <i>quel</i> mondo, signore, sar&agrave; riportato in
quest'altro mondo, nel quale il Sig. Gibbons vi ha trovato&quot;, rispose
il vecchio.</font></p>

<p><font size="3">
&quot;L'uomo con la faccia furba e gli occhi lacrimosi che non sembrano
riuscire a concentrarsi in un punto?&quot;</font></p>

<p><font size="3">&quot;Esatto, signore! Vedo che lo conosce molto
bene.&quot;</font></p>

<p><font size="3">
&quot;&Egrave; una maledetta donnicciola, amico! Al primo problema se la fa
addosso!&quot;</font></p>

<p><font size="3">
&quot;Sappiamo che lo fa&quot;, disse il vecchio come per scusarsi.
&quot;Qualcosa a che fare con la sua educazione, credo.&quot;</font></p>

<p><font size="3">
&quot;Allora, amico! Posso andare in questo nuovo mondo o no?
Sento il bisogno di conquistare qualcosa!&quot; abbai&ograve; con una risata
da furfante. &quot;Una bella donna, magari!&quot; disse scherzosamente,
ammiccando.</font></p>

<p><font size="3">
&quot;Certo che pu&ograve;, signore!&quot; Il vecchio lo interruppe
alla svelta. &quot;Lei &egrave; proprio quello che stavamo cercando&quot;,
inizi&ograve; a cercare il cassetto della sua scrivania, &quot;brutale&quot;,
disse a se stesso mentre apriva il piccolo compartimento e
prendeva un altro pezzo di carta. &quot;Il suo nome, per favore.
Burocrazia, capisce.&quot;</font></p>

<p><font size="3">
&quot;Alessandro il Grande!&quot; url&ograve; l'uomo, saltando in piedi e
puntandosi i pugni sui fianchi. &quot;Conquistatore del mondo conosciuto
ed eletto dagli D&egrave;i!&quot;</font></p>

<p><font size="3">
&quot;Proprio cos&igrave;, signore, e non sa quanto hanno bisogno di lei&quot;,
il vecchio si abbass&ograve; sulla scrivania mentre scriveva. &quot;La ameranno
laggi&ugrave;&quot;, aggiunse con una voce pi&ugrave; calma. &quot;Professione,
signore?&quot;</font></p>

<p><font size="3">
&quot;Dio&quot;, disse Alessandro amorevolmente a se stesso. Spazz&ograve;
via alcuni immaginari granelli di polvere dalla sua corazza e poi
si guard&ograve; le unghie ben curate. &quot;Le donne cadono ai miei piedi
e si offrono a me. Tu come mi chiameresti?&quot; chiese l'uomo,
evidentemente confuso dalla sua stessa domanda.</font></p>

<p><font size="3">&quot;Disperato?&quot; sugger&igrave; il vecchio.</font></p>

<p><font size="3">
Alessandro il Grande gli lanci&ograve; uno sguardo acido, poi un sorriso
compar&igrave; lentamente sul suo volto. &quot;Hah! Mi piaci, amico! Hai
le budella forti!&quot;</font></p>

<p><font size="3">
&quot;Gi&agrave;, e non si sposteranno di una virgola!&quot; Alessandro
si lasci&ograve; andare a una fragorosa risata. &quot;Allora, signore.
Devo aggiungere, tra le sue professioni, donnaiolo e pazzo
alcolizzato?&quot; Alessandro rise ancora pi&ugrave; forte.</font></p>

<p><font size="3">
&quot;Mi piaci!&quot; url&ograve;. &quot;Hai pi&ugrave; spina dorsale
di tutti i miei comandanti!&quot;</font></p>

<p><font size="3">
&quot;Grazie, signore, me ne ricorder&ograve;.&quot; Si alz&ograve; dalla
sedia. &quot;Ora, se non le spiace entrare in quella porta,
concluderemo la parte finale del contratto.&quot;</font></p>

<p><font size="3">
Alessandro cercava di sembrare pi&ugrave; alto stando dritto, e ci sarebbe
quasi riuscito se non fosse che egli era novanta centimetri pi&ugrave; basso del
vecchio. Mentre il guerriero camminava verso la porta, questa si apr&igrave;
da sola. Alessandro lanci&ograve; al vecchio un'occhiata preoccupata.</font></p>

<p><font size="3">
&quot;Gli D&egrave;i sono impazienti di farla entrare&quot;, sugger&igrave;
il vecchio. &quot;Il loro regno la aspetta.&quot;</font></p>

<p><font size="3">
Alessandro divenne radioso e entr&ograve; con sicurezza nella stanza
oscura. La porta si chiuse di colpo alle spalle del guerriero.</font></p>

<p><font size="3">
Si sentirono dei colpi dall'altra parte. &quot;Che razza di
scherzo!&quot; url&ograve; Alessandro. &quot;Qui non c'&egrave; nient'altro che
il buio&quot; Improvvisamente la luce filtr&ograve; nell'ufficio attraverso
le fessure della porta. &quot;Stregoneria! Sono stato tradito!&quot;
Altri colpi, stavolta pi&ugrave; forti. &quot;Io vi - !&quot; Improvvisamente
la sua voce si interruppe. &quot;Aarrgghhhhhhh - !&quot; <i>POP!</i>
<i>Fiiizzzzzz!</i></font></p>

<p><font size="3">
La luce svan&igrave; e il vecchio torn&ograve; a sedersi. Schiacci&ograve; il pulsante
sul suo interfono e questo si accese sibilando. &quot;Il prossimo!&quot;
disse con voce arcigna.</font></p>

<p><font size="3">
Poco dopo si sent&igrave; bussare alla porta.</font></p>

<p><font size="3">&quot;Avanti!&quot; disse il vecchio.</font></p>

<p><font size="3">
Una testa fece capolino dal corridoio. Beh, tecnicamente parlando era una
testa, ma sembrava piuttosto come se qualcuno si fosse messo in testa
una spazzola irta e consumata. Anche il vecchio sembrava sorpreso.</font></p>

<p><font size="3">&quot;Prego, entri.&quot;</font></p>

<p><font size="3">
&quot;&Egrave; kuesta la stanza per la fakanza?&quot; chiese una voce con
un evidente accento. Il vecchio rovist&ograve; nella propria memoria cercando
di identificare la provenienza dell'interlocutore. <i>Ebreo, con un che
di americano</i>, pens&ograve; il vecchio.</font></p>

<p><font size="3">
&quot;Prego, prenda una sedia&quot;, disse. Ci&ograve; che gli si present&ograve;
davanti era comico. L'uomo indossava un completo grigio che era
decisamente troppo corto per lui, una cravatta marrone malamente
annodata al collo e una maglietta bianca con un disegno a quadri
formato da linee incrociate. I capelli lunghi e grigio-bianchi che si
sollevavano in qualche modo dalla sua testa, come se il vecchio uomo
avesse subito da poco un elettroshock, erano una caratteristica cos&igrave;
evidente che la vista e il pensiero difficilmente li avrebbero
potuti ignorare. Dei baffi folti, in un certo senso anche ridicoli,
sembravano un bruco in sovrappeso sul suo labbro. Aveva decisamente
l'aspetto dello scienziato pazzo.</font></p>

<p><font size="3">&quot;Ah, bene!&quot; disse lo straniero. Cammin&ograve;
distrattamente fino alla scrivania, la sua attenzione era tutta sulle
numerose file di libri, quando sbatt&eacute; sulla sedia e si mise a sedere.
&quot;Lo ztrano uomo dagli okki umidi dare indikazionen piuttosto
bizzarren.&quot;</font></p>

<p><font size="3">
&quot;Dovr&ograve; scambiare due parole con lui&quot;, rispose il vecchio
da dietro la scrivania, sentendo una affinit&agrave; con il nuovo arrivato.</font></p>

<p><font size="3">
&quot;Z&igrave;, infatti, ma logika indikare che kuesta essere stanza
ciusta.&quot;</font></p>

<p><font size="3">&quot;Davvero?&quot;</font></p>

<p><font size="3">
&quot;Z&igrave;, essere grosso kartellen fuori da fostra porta kon skritto `stanza
vacanze'.&quot; Lo straniero sorrise furbamente, e il vecchio non riusc&igrave;
a trattenersi dal ridacchiare.</font></p>

<p><font size="3">&quot;Ha capito i termini e le condizioni
del contratto?&quot;</font></p>

<p><font size="3">
&quot;Z&igrave;. Sig. Gibbonz ha zpiegato kiaramente.&quot; Lo straniero
si abbass&ograve; sulla scrivania e si guard&ograve; intorno furtivamente.
&quot;Ezzere mondo parallelo?&quot; sussurr&ograve; guardandosi nuovamente
intorno. &quot;Kuesta essere una ti mie teorie ke sto cercando di
provaren. Nostro universen essere difentato kos&igrave; noioso ultimamente,
da kuando io avere skoperto kuesto.&quot; Sorrise verso il vecchio.</font></p>

<p><font size="3">
&quot;I dettagli al momento scarseggiano&quot;, rispose il vecchio.
&quot;Ma comunque potr&agrave; scoprirli da solo. Non &egrave; proprio quello che
vuole?&quot;</font></p>

<p><font size="3">
&quot;Infatti!&quot; rispose l'uomo. &quot;Lei mi konosce bene, eh?&quot;
Si guard&ograve; nuovamente intorno per essere sicuro che non fossero spiati,
e ovviamente non lo erano, a meno che non si contassero gli
sguardi incuriositi dei libri, naturalmente. &quot;Mi essere stato tetto
ke ci essere magia in kuesto nuovo monden. &Egrave; fero? Mi piacerebbe, sa?
Io essere kos&igrave; stanco di timostrare l'ordinario. Io folere difertirmi,
per kambiare! Essere mago defe essere difertenten, fero?&quot;</font></p>

<p><font size="3">&quot;C'&egrave; pi&ugrave; magia in questo mondo di
quanta possiate immaginare!&quot;</font></p>

<p><font size="3">&quot;Fantastiken!&quot; disse lo straniero,
battendo le mani per l'eccitazione. &quot;Dove dofere firmare?&quot;</font></p>

<p><font size="3">
&quot;Proprio qui&quot;, disse il vecchio tirando fuori un pezzo
di carta. &quot;Albert Einstein, giusto?&quot; chiese il vecchio, sebbene
avesse gi&agrave; scritto il nome. Come occupazione scrisse `Genio' e
`Animale da party'. &quot;Se non le spiace firmare qui&quot; Albert
firm&ograve;, con grande eccitazione.</font></p>

<p><font size="3">&quot;Essere kome vendere anima a diafolo,
eh?&quot;</font></p>

<p><font size="3">
&quot;Non proprio&quot;, rispose il vecchio. &quot;Con il diavolo
c'&egrave; pi&ugrave; burocrazia di mezzo. Non sopporta la gente che rompe i suoi
contratti.&quot; Il vecchio si alz&ograve;. &quot;Ora venga da questa parte,
attraversi questa porta.&quot;</font></p>

<p><font size="3">
Mentre Albert Einstein si alzava, il vecchio apr&igrave; la porta.
Albert con molta tranquillit&agrave; e un sorriso sul volto cammin&ograve;
dritto nell'oscurit&agrave;.</font></p>

<p><font size="3">&quot;Ezzere buio qui, z&igrave;?&quot; disse.</font></p>

<p><font size="3">&quot;Presto cambier&agrave;, Albert&quot;, disse il
vecchio, e poi chiuse tranquillamente la porta.</font></p>

<p><font size="3">&quot;Oh!&quot; Albert esclam&ograve; &quot;Una forte
lucen. Kome big bang, z&igrave;?&quot; Ci fu un po' di silenzio.
&quot;Accipikkien! Wwwaaahhhhh - !&quot; <i>POP! Fiiizzzzzz!</i></font></p>

<p><font size="3">Silenzio.</font></p>

<p><font size="3">
Il vecchio si mise a sedere, con un affettuoso sorriso sul volto.
&quot;Il prossimo, Gibbons, per favore&quot;, disse con una voce
serena, sentendosi allegro dopo l'incontro con Albert.</font></p>

<p><font size="3">
Senza che neanche si sentisse bussare, la porta si apr&igrave; e qualcuno
entr&ograve;, nascosto nell'ombra della porta stessa. Il vecchio strinse gli occhi
con rabbia per l'impazienza di vedere il nuovo straniero.</font></p>

<p><font size="3">
&quot;&Egrave; lei Hawkins?&quot; chiese la sagoma, ancora nascosta nell'ombra.
Era una voce giovane, pi&ugrave; giovane dei suoi ultimi tre visitatori.</font></p>

<p><font size="3">&quot;S&igrave;&quot;, il vecchio rispose irritato.</font></p>

<p><font size="3">&quot;Oh. Bene.&quot; rispose la voce, sembrando poi
completamente sperduta sul da farsi.</font></p>

<p><font size="3">
&quot;Chiuda la porta&quot;, disse il vecchio con un cenno della mano,
come infastidito, mentre rivolgeva nuovamente la sua attenzione alle
carte sulla sua scrivania. Con la coda dell'occhio vide lo straniero
esitare un po' e poi chiudere la porta. Quando si accorse che il nuovo
arrivato non si era mosso, alz&ograve; lo sguardo. &quot;Si sieda&quot;,
offr&igrave; con un tono di voce come se fosse un dato di fatto.</font></p>

<p><font size="3">
Lo straniero fece quello che gli era stato detto e, mentre camminava nella
tenue luce che era nella stanza, il vecchio lo scrutava attentamente.
Aveva dei capelli chiari con una riga in mezzo che li faceva penzolare
davanti alla sua faccia come un paio di tende. Indossava una specie di
maglia decorata con colori accesi, un miscuglio confuso che stava facendo
incrociare gli occhi al vecchio mentre fissava l'indumento. Not&ograve; che
il nuovo arrivato indossava jeans scuri, e mentre guardava il ragazzo
sedersi vide un riflesso di verde nel loro colore. Gibbons aveva detto
di aver trovato tutte le persone necessarie a riempire i quattro
posti vacanti. Cosa intendeva fare Gibbons dando l'ultimo posto
a questo <i>ragazzo</i>?</font></p>

<p><font size="3">
Mettendosi a sedere, lo straniero guardava con apprensione il vecchio, il
quale lentamente si appoggiava all'indietro accompagnato dal suono
della pelle scricchiolante mentre fissava il giovane. &quot;Mi dica. Cosa
fa per vivere?&quot;</font></p>

<p><font size="3">
Lo straniero alz&ograve; le spalle. &quot;Niente. Sono disoccupato.&quot;
Sembrava un po' impacciato, seduto l&igrave; con le spalle leggermente strette.
Si guard&ograve; intorno. &quot;Libri. Fico. Un sacco di libri.&quot; Non era
mai stato molto abile nella conversazione.</font></p>

<p><font size="3">
&quot;S&igrave;, infatti&quot;, rispose il vecchio lasciando un imbarazzante
silenzio nella stanza. Lo straniero annuiva distrattamente con il capo,
mordendosi le labbra mentre cercava in tutti i modi di trovare
altre cose da dire.</font></p>

<p><font size="3">
&quot;La vostra segretaria, quella brutta con i denti rotti, il
respiro affannoso e la lingua oscena mi ha trascinato qui dicendomi
che lei stava regalando vacanze gratis.&quot;</font></p>

<p><font size="3">&quot;Il Sig. Gibbons?&quot; chiese il vecchio.</font></p>

<p><font size="3">
&quot;&Egrave; un uomo?&quot; chiese stupito lo straniero. &quot;Allora
perch&eacute; indossa un abito da donna?&quot;</font></p>

<p><font size="3">
Il vecchio cerc&ograve; di schivare l'infelice domanda. &quot;I suoi genitori
hanno fatto confusione quando &egrave; nato, e questo lo ha lasciato
emotivamente ferito. Non si preoccupi, &egrave; decisamente inoffensivo.&quot;</font></p>

<p><font size="3">
Lo straniero annu&igrave; scioccamente e guard&ograve; un'altra volta in giro per
la stanza. Si ferm&ograve; appena in tempo prima di dire un'altra volta
quanto erano &quot;fichi&quot; i libri. Continu&ograve; a muovere la
sua testa come uno scemo.</font></p>

<p><font size="3">&quot;Nessun progetto per il futuro?&quot;
chiese il vecchio unendo le mani in una posizione a punta.</font></p>

<p><font size="3">
Lo straniero alz&ograve; le spalle. &quot;Non mi dispiacerebbe
trovare un lavoro nel campo dell'informatica.&quot; rispose lo
straniero con un tono di voce pi&ugrave; sicuro.</font></p>

<p><font size="3">
&quot;Davvero?&quot; disse il vecchio, un barlume di speranza nella
sua voce. &quot;Ha una qualifica?&quot;</font></p>

<p><font size="3">&quot;Non proprio, beh, non per il campo nel
quale vorrei entrare.&quot;</font></p>

<p><font size="3">
Il vecchio annu&igrave; e la sua mano era gi&agrave; alla ricerca del cassetto della
scrivania. &quot;E qual &egrave; il suo campo?&quot;</font></p>

<p><font size="3">&quot;Programmazione di giochi&quot;, rispose il giovane.</font></p>

<p><font size="3">
&quot;Hhmmm, davvero?&quot; il vecchio aveva aperto il cassetto e stava
gi&agrave; cercando un contratto. &quot;Creativo, vero?&quot;.</font></p>

<p><font size="3">
&quot;S&igrave;, ma al momento mi manca una buona idea. Mi serve un gioco
che faccia impazzire la gente! Qualcosa che glielo faccia comprare
a frotte. Ma non riesco a pensare.&quot;</font></p>

<p><font size="3">
il vecchio tir&ograve; fuori il contratto e lo mise sulla scrivania. &quot;Bene,
abbiamo una vacanza libera. La vuole prendere?&quot;</font></p>

<p><font size="3">&quot;Non sono neanche sicuro del motivo
per cui mi trovo qui.&quot;</font></p>

<p><font size="3">
&quot;Se io le dicessi che potrei portarla in un posto che la potrebbe
ispirare, e forse anche darle un'idea per un gioco... lei andrebbe?&quot;</font></p>

<p><font size="3">&quot;Non saprei. Quante altre persone ci vanno?&quot;</font></p>

<p><font size="3">
&quot;Oh, centinaia. Migliaia.&quot; disse il vecchio dimessamente.
&quot;Tutti come lei, persone creative, sebbene ve ne siano alcune che
non lo sono e preferiscono distruggere le cose o semplicemente
far fare ad altre persone delle cose per loro.&quot;</font></p>

<p><font size="3">&quot;Hhmmm. Non so.&quot;</font></p>

<p><font size="3">
&quot;Non c'&egrave; veramente niente da temere. Le diamo una assicurazione
sulla vita, tutto. Qualsiasi cosa le accada noi la riportiamo al punto
in cui era prima, assolutamente intatto e con nient'altro che un lontano
ricordo della sua esperienza.&quot;</font></p>

<p><font size="3">&quot;Ricordo?&quot;</font></p>

<p><font size="3">
&quot;S&igrave;. Come un sogno. Un sogno che potrebbe ispirarla per la creazione
di quel gioco redditizio di cui mi stava parlando.&quot;</font></p>

<p><font size="3">&quot;Non so.&quot; disse lo straniero.
&quot;Quanto &egrave; lunga la vacanza?&quot;</font></p>

<p><font size="3">&quot;Quanto vuole lei.&quot;</font></p>

<p><font size="3">
&quot;Ero solo uscito a prendere il latte. La mia ragazza si
preoccuper&agrave; se non torno presto.&quot;</font></p>

<p><font size="3">&quot;Non c'&egrave; niente da temere, le assicuro. Pu&ograve;
anche portarla con s&eacute;, se vuole.&quot;</font></p>

<p><font size="3">&quot;Una vacanza gratis? Sembra troppo bello per essere
vero.&quot;</font></p>

<p><font size="3">
&quot;Nessun impegno, le assicuro. Basta che lei mi dica il suo nome
e firmi il contratto, e i rimanenti dettagli saranno sbrigati
dietro quella porta alle mie spalle.&quot;</font></p>

<p><font size="3">&quot;Contratto?&quot; chiese lo straniero
sospettosamente.</font></p>

<p><font size="3">
&quot;S&igrave;. Niente di legalmente vincolante, solo la sua firma per
dire che io sono d'accordo con lei e lei &egrave; d'accordo con me.&quot;</font></p>

<p><font size="3">&quot;Bene&quot;</font></p>

<p><font size="3">
Il vecchio sorrise. &quot;Si fidi di me, signore. Il suo nome,
per favore?&quot;</font></p>

<p><font size="3">&quot;Paul&quot;, rispose lo straniero con esitazione.
&quot;Paul.&quot;</font></p>

<p><font size="3">
&quot;Bene, bene&quot;, disse il vecchio compilando le rimanenti voci.
&quot;firmi qui, prego.&quot;</font></p>

<p><font size="3">
Paul prese la penna lentamente, e guard&ograve; il foglio che aveva
di fronte. Vedeva le parole, tuttavia non riusciva a leggerle.
Era difficile da spiegare. Vedeva chiaramente dove doveva firmare
e vedeva chiaramente il suo nome scritto a grandi lettere
dal vecchio. Impulsivamente, firm&ograve; il contratto alla svelta e
restitu&igrave; la penna.</font></p>

<p><font size="3">
&quot;Ben fatto&quot;, disse il vecchio battendo le mani.
&quot;Lei &egrave; un uomo religioso?&quot;</font></p>

<p><font size="3">&quot;Non direi, perch&eacute;?&quot;</font></p>

<p><font size="3">
&quot;Oh, niente, chiedevo&quot;, rispose distrattamente il vecchio.
Si alz&ograve;. &quot;Ora, se mi vuole seguire&quot;, premette brevemente
il pulsante dell'interfono e disse forte: &quot;Gibbons! Qui!
Subito!&quot;</font></p>

<p><font size="3">
&quot;S-s&igrave;, signore!&quot; la terribile voce torn&ograve; a farfugliare.</font></p>

<p><font size="3">
Il vecchio si alz&ograve; e apr&igrave; la porta che conduceva alla stanza
misteriosa. Proprio in quel momento Gibbons entr&ograve; correndo nella
stanza indossando un abito rosa con dei fronzoli alla fine.
&quot;Arrivo, signore! Non si scordi di me.&quot;</font></p>

<p><font size="3">&quot;Er&quot;, disse Paul. &quot;&egrave; un po'
buio qui dentro, no?&quot;</font></p>

<p><font size="3">&quot;Tutto sar&agrave; presto svelato.&quot; rispose il
vecchio.</font></p>

<p><font size="3">La porta si chiuse.</font></p>

<p><font size="3">
&quot;Uh, e ora?&quot; chiese Paul, sentendosi un po'
intimidito dall'alto vecchio e dal tremendo, osceno travestito che
aveva iniziato a canticchiare una canzoncina infantile che
iniziava a innervosire Paul.</font></p>

<p><font size="3">
&quot;Aspetti un momento soltanto&quot;, rispose la voce del vecchio
proveniente da qualche parte nel buio vicino a Paul.</font></p>

<p><font size="3">&quot;Hehehehehe&quot;, Gibbons ridacchi&ograve;
con voce stridula.</font></p>

<p><font size="3">
&quot;Forse &egrave; meglio che io vada via adesso, grazie&quot;, disse Paul
con decisione, sentendosi a disagio e improvvisamente molto, molto
impaurito.</font></p>

<p><font size="3">
&quot;Un momento, un momento. Non c'&egrave; niente di cui avere paura.&quot;
lo rassicur&ograve; dolcemente il vecchio.</font></p>

<p><font size="3">&quot;Andiamo a casa, padrone!&quot; Gibbons squitt&igrave;
come un bambino.</font></p>

<p><font size="3">&quot;S&igrave;, Gibbons. A casa.&quot;</font></p>

<p><font size="3">
La luce entr&ograve; nella stanza e Paul si ritrov&ograve; al centro di essa.
&quot;Uh!&quot; esclam&ograve; Paul.</font></p>

<p><font size="3">
&quot;Non si preoccupi. Fa tutto parte del contratto&quot;, disse
il vecchio.</font></p>

<p><font size="3">
Paul dovette riparare i suoi occhi dalla luce brillante alzando
il braccio per coprirsi il volto. Quando fu in grado di sbirciare
oltre il braccio not&ograve; un lungo tunnel bianco con una massa confusa
di nubi che ruotavano attorno al suo centro. Improvvisamente si
sent&igrave; risucchiato al suo interno come se tutto il suo corpo stesse
andando gi&ugrave; per uno scarico. &quot;Wwwwwaaaaahhhhh&quot; Il mondo
semplicemente <i>esplose</i> intorno a lui. Gli ronzavano le
orecchie per l'esplosione - o era una implosione? - e quando
apr&igrave; nuovamente gli occhi vide un immenso paesaggio di isole e
isolotti che si estendeva fino a dove la vista poteva arrivare.</font></p>

<p><font size="3">
Mentre in qualche modo sorvolava il paesaggio, dei campi gli
passarono affianco. Delle persone lavoravano quei campi, li
percorrevano arando la terra. Edifici in pietra sfrecciavano
sotto di lui. Super&ograve; una recinzione di legno che usciva dalla sua
visuale. Quando torn&ograve; a guardare nella direzione in cui viaggiava,
vide un mulino a vento; le sue pale ruotavano al vento con un suono
come <i>whop-whop</i> che sembrava andare a tempo con il battito del
suo cuore.</font></p>

<p><font size="3">
Improvvisamente fu risucchiato verso il basso; super&ograve; il mulino a
vento a rotta di collo e il mondo <em>schizz&ograve;</em> fuori dalla
sua mente. Mentre perdeva conoscenza, e il mondo come lo aveva
conosciuto fino ad ora scivolava via dalla sua mente come un
pensiero smarrito, avrebbe potuto giurare di aver visto un cartello
affisso su uno dei lati del mulino che riportava scritto, con una
scrittura quasi infantile, &quot;Benvenuti nella terra di
<i>Foundation!!!!!!!!!</i>&quot; C'erano altri punti esclamativi,
ma a quel punto la sua testa scoppi&ograve; e i suoi occhi si chiusero.</font></p>
<P>

<center>
<img src="gifs/found-line.gif" width=315 height=47 alt="Foundation Line"><p>
</center>

<CENTER>
<font size=+2 color="#FF0000"><a href="main.html">Menu principale</a></FONT>
</CENTER>


<tr>
<TD VALIGN=top>
<img src="gifs/trans-gif-160x4.gif" width=160 height=4>
</TD>

<TD VALIGN=top>

</TD>
</TR>

<P>

<tr>
<td colspan=2>
</td>
</tr>

<p>


<tr>
<TD COLSPAN=2>

<P>

<IMG SRC="gifs/redline2.gif" width=274 height=7 alt="--">

<P>

<CENTER>
<FONT SIZE=3>
Foundation &egrave; &#169;1997/1998 Sadeness Software e Paul Burkey. Tutti i diritti sono riservati.<br>
Pubblicazione - Sadeness Software - <A HREF="mailto:rich@sadeness.demon.co.uk">rich@sadeness.demon.co.uk</A><br>
Supporto di Foundation - Paul Burkey <A HREF="mailto:burkey@bigfoot.com">burkey@bigfoot.com</A>
</FONT>
<P align=center>
<font size=-1>Sadeness Software - 13 Russell Terrace - Mundesley - Norfolk - NR11 8LJ - UK</font><br>
Tel/Fax: +44 (0)1263 722169
</CENTER>
</TABLE>
</BODY>
</HTML>
